[
  {
    "source": "Cointelegraph",
    "date": "2024-01-08T05:04:03.000Z",
    "title": " Bitcoin-accepting vendors increased 174% in 2023: BTC merchant tracker ",
    "url": "https://cointelegraph.com/news/bitcoin-accepting-vendors-increased-174-in-2023-btc-merchant-tracker",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYjVjYWIzZDMtNjA2MS00ZDA4LWJiZWItZTc4ZGI3ODJjZTRhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The crowdsourced mapping data reports a concentration of Bitcoin-accepting merchants in Europe and Latin America.  </p>\n                    <p><p>The number of merchants listed as accepting Bitcoin payments globally went up nearly three-fold in 2023, according to data from Bitcoin merchant mapping provider BTC Map.</p><p>As per the latest data from BTC Map, the number of restaurants, bars, shops, and services listed to <a href=\"https://cointelegraph.com/learn/how-to-accept-bitcoin-a-guide-to-getting-paid-in-btc\">accept the digital asset</a> hit 6,126 by the end of 2023, up from just 2,207 merchants at the start of the year. </p><p>This was a slight decline since the peak of 6,590 merchants in late September. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-accepting-vendors-increased-174-in-2023-btc-merchant-tracker\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-08T04:59:44.000Z",
    "title": " Mysterious Bitcoiner spends $64K to inscribe 9MB of data on Bitcoin ",
    "url": "https://cointelegraph.com/news/mysterious-bitcoiner-spends-64k-inscribe-9mb-of-data-on-bitcoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNTExNGY3ZTYtNjM0My00OWRhLWI2MjUtOTUzMzE1Nzg1ZTU3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The encrypted data was inscribed over 332 transactions with fees ranging from $14 to $2,500 in satoshis, but the motive is still a complete mystery.</p>\n                    <p><p>An unidentified Bitcoiner has just spent approximately $64,000 in fees to inscribe nearly 9 megabytes of raw binary data on the Bitcoin blockchain. </p><p>According to a Jan. 7 post on X (formerly Twitter) from the Ordinals explorer Ord.io, more than 1 Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) was used to create 332 inscriptions at around 11:20 am UTC on Jan. 6 — consisting of \"raw binary data.</p><p>However, no one appears to have an answer for what the data shows, with one user even trying to use OpenAI’s ChatGPT to solve it, without luck.</p><p><a href=\"https://cointelegraph.com/news/mysterious-bitcoiner-spends-64k-inscribe-9mb-of-data-on-bitcoin\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-08T05:03:18.000Z",
    "title": "U.S. SEC Official Cautions Crypto Community: Avoid ‘FOMO’ in Investment Choices",
    "url": "https://www.cryptoglobe.com/latest/2024/01/u-s-sec-official-cautions-crypto-community-avoid-fomo-in-investment-choices/",
    "description": "Lori Schock, the Director of the SEC’s Office of Investor Education and Advocacy, recently published an article titled “Say ‘NO GO to FOMO,’” specifically addressing the cryptocurrency community. In this piece, Schock discusses the phenomenon of FOMO (Fear of Missing Out) and its impact on investment decisions, particularly in the volatile world of cryptocurrencies. Schock […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-08T04:45:05.000Z",
    "title": "Latin America Prepares for the Most Important Event in the Financial Markets and Trading Ecosystem",
    "url": "https://www.cryptopolitan.com/latin-america-prepares-for-the-most-important-event-in-the-financial-markets-and-trading-ecosystem/",
    "description": "Wealth Expo brings financial knowledge and opportunities to everyone in Peru, Mexico, and Colombia. Latin America is preparing to receive the most anticipated event in the world of finance, trading and investments: Wealth Expo 2024, organized by Upcon, the leading company in the development of educational events related to blockchain, cryptocurrencies and trading in the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-08T04:42:21.000Z",
    "title": "Exploring Financial Frontiers: Money Expo Mexico Returns for its Second Edition in 2024",
    "url": "https://www.cryptopolitan.com/exploring-financial-frontiers-money-expo-mexico-returns-for-its-second-edition-in-2024/",
    "description": "Global financial integration takes center stage as Money Expo Mexico announces its second edition scheduled for February 7 and 8, 2024. This eagerly anticipated event is set to bring together financial experts, thought leaders, and innovators from around the world in Mexico City. Offering a two-day immersion into the world of finance and investment, Money [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-08T04:48:48.000Z",
    "title": "Ethereum Price Signals Bearish Rection, Why ETH Could Drop 5%",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-signals-bearish-2200/",
    "description": "Ethereum price is struggling to clear the $2,300 resistance zone. ETH is showing a few bearish signs and might decline toward the $2,080 support. Ethereum is still struggling to clear the $2,280 and $2,300 resistance levels. The price is trading below $2,260 and the 100-hourly Simple Moving Average. There is a connecting bearish trend line forming with resistance near $2,240 on the hourly chart of ETH/USD (data feed via Kraken). The pair could extend its decline if it stays below the $2,300 resistance zone. Ethereum Price Faces Major Hurdle Ethereum price attempted a fresh increase above the $2,200 level, like Bitcoin. ETH climbed above the $2,250 and $2,260 levels. However, the bears were active near $2,300 and the 100-hourly Simple Moving Average. A high was formed near $2,289 and the price recently saw a bearish reaction. There was a move below the $2,250 level. The price traded below the 23.6% Fib retracement level of the upward wave from the $1,860 swing low to the $2,289 high. Ethereum is now trading below $2,260 and the 100-hourly Simple Moving Average. There is also a connecting bearish trend line forming with resistance near $2,240 on the hourly chart of ETH/USD. If there is a fresh increase, the price might face resistance near the $2,250 level and the trend line. The first major resistance is now near $2,280. The next major hurdle sits at $2,300. Source: ETHUSD on TradingView.com A close above the $2,300 resistance could start a decent upward move. The next key resistance is near $2,400. If the bulls push Ethereum above $2,400, there could be a rally toward $2,500. Any more gains might send the price toward the $2,620 zone. More Losses in ETH? If Ethereum fails to clear the $2,250 resistance, it could start a fresh decline. Initial support on the downside is near the $2,120 level. The first key support could be the $2,080 zone or the 50% Fib retracement level of the upward wave from the $1,860 swing low to the $2,289 high. A downside break and a close below $2,080 might spark strong bearish moves. In the stated case, Ether could test the $2,020 support. Any more losses might send the price toward the $1,960 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $2,080 Major Resistance Level – $2,280"
  }
]