[
  {
    "source": "CoinDesk",
    "date": "2023-08-25T09:46:49.000Z",
    "title": "Prime Trust Lost $8M in Doomed Terra Stablecoin Investment, CEO Says",
    "url": "https://www.coindesk.com/policy/2023/08/25/prime-trust-lost-8m-in-doomed-terra-stablecoin-investment-ceo-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A separate 2021 wallet bungle by the crypto custodian, taken into receivership in July, cost it $76 million, the CEO said in a court filing."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-25T09:56:15.000Z",
    "title": "OnlyFans Accounts Take Over Friend.tech as Crypto App Adds Photo Feature",
    "url": "https://decrypt.co/153723/onlyfans-accounts-take-over-friend-tech-crypt-app-adds-photo-feature",
    "description": "The new photo feature on Friend.tech comes amid an uptick in OnlyFans creators making the leap over to the crypto app. "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-25T10:00:08.000Z",
    "title": "Surging US dollar index puts global currencies under pressure ahead of anticipated Powell address",
    "url": "https://cryptoslate.com/insights/surging-us-dollar-index-puts-global-currencies-under-pressure-ahead-of-anticipated-powell-address/",
    "description": "<p>Quick Take The U.S. Dollar Index (DXY) has surged to break past the 104 mark, a level not witnessed in the last eleven weeks, according to Trading Economics, painting a picture of sustained strength in the U.S. dollar. This marks the sixth consecutive week of advances for the DXY index, indicating its robust performance amidst [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/surging-us-dollar-index-puts-global-currencies-under-pressure-ahead-of-anticipated-powell-address/\">Surging US dollar index puts global currencies under pressure ahead of anticipated Powell address</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-25T10:06:11.000Z",
    "title": "Shibarium Relaunch Meets SHIB Burn: The Double Play Introducing Shiba Inu’s New Chapter",
    "url": "https://cryptobriefing.com/shibarium-relaunch-meets-shibs-fire/?utm_source=feed&utm_medium=rss",
    "description": "Examining the Shibarium L2 protocol's reintroduction and SHIB token burn: What these moves signify for the Shiba Inu ecosystem's trajectory."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-25T10:00:18.000Z",
    "title": "\n                        CAIZcoin Revolutionizes Economic Landscape with Blockchain DeCe:Pioneering a New Hybrid Model\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/caizcoin-revolutionizes-economic-landscape-with-blockchain-decepioneering-a-new-hybrid-model",
    "description": "\n                        <p>CAIZcoin, the groundbreaking blockchain-based cryptocurrency, is spearheading the transformation of economies through the power of decentralization. By harnessing the advantages of both planned and market economies, CAIZcoin is revolutionizing the economic landscape and paving the way for a novel hybrid model that enhances efficiency and transparency.</p>\n<p class=\"ql-align-justify\">Decentralization is at the core of blockchain technology, and its impact on the economy is profound. In a market economy, the invisible hand guides economic activities, allowing for self-regulation and optimizing social interest through the pursuit of individual self-interest.&nbsp;</p>\n<p class=\"ql-align-justify\">Similarly, blockchain-based economies operate without direct central intervention, replacing centralized governance and regulations with encoded programs within the blockchain system.</p>\n<p class=\"ql-align-justify\">By leveraging blockchain,&nbsp;CAIZcoin&nbsp;creates an environment where economic activities can flourish in a decentralized manner. The open competition driven by demand and supply dynamics is further enhanced by the transparency and efficiency of blockchain technology.</p>\n<p class=\"ql-align-justify\">Market participants can engage in transactions and exchanges with minimal intervention from the government or regulatory bodies, fostering a free and competitive economic landscape.</p>\n<p class=\"ql-align-justify\">One of the key advantages of blockchain decentralization in the economy is the consolidation of knowledge. Blockchain technology enables the comprehensive and egalitarian sharing of information, making it globally accessible.&nbsp;</p>\n<p class=\"ql-align-justify\">This accessibility enhances the efficiency and effectiveness of economic decision-making, as participants have access to real-time and accurate data. The democratization of information empowers businesses, entrepreneurs, and investors to make informed choices and adapt to market dynamics swiftly.</p>\n<p class=\"ql-align-justify\">Blockchain decentralization allows for seamless updates and improvements to the economic system. The decentralized nature of blockchain ensures that decisions and modifications are made through a consensus mechanism, involving multiple participants across the network. This inclusive approach fosters transparency and reduces the risk of manipulation or bias, creating a more equitable and trustworthy economic environment.</p>\n<p class=\"ql-align-justify\">CAIZcoin&rsquo;s commitment to decentralization in the economy aligns with its mission to empower individuals and businesses. By leveraging blockchain technology, CAIZcoin enables secure and efficient transactions, eliminating the need for intermediaries and reducing transaction costs. This fosters financial inclusion and empowers individuals who have been underserved by traditional financial systems.</p>\n<p class=\"ql-align-justify\">The transformative power of CAIZcoin extends beyond traditional financial transactions. Blockchain decentralization opens up avenues for innovative business models, such as decentralized finance (DeFi), where individuals can participate in lending, borrowing, and investment activities without relying on traditional intermediaries. This democratization of finance allows for greater financial autonomy and fosters economic growth and innovation.</p>\n<p class=\"ql-align-justify\">CAIZcoin&rsquo;s commitment to ethical and responsible practices further enhances the impact of decentralization in the economy. Blockchain technology provides a transparent and immutable record of transactions, making it easier to trace and verify the origins of products and ensure ethical sourcing. This promotes sustainability, responsible production, and ethical consumption, aligning with the growing demand for socially and environmentally conscious practices.</p>\n<p class=\"ql-align-justify\">By embracing blockchain technology, CAIZCOIN enables individuals and businesses to unlock their full potential, creating a more efficient, transparent, and inclusive economic ecosystem.</p>\n<p class=\"ql-align-justify\">About CAIZcoin</p>\n<p class=\"ql-align-justify\">Caizcoin&nbsp;is the World&rsquo;s First Islam Compliant Blockchain Ecosystem, based in the EU. Envisioned to be the bridge between the centralized and decentralized financial world.</p>\n                    "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-25T09:56:23.000Z",
    "title": "\n                        Dropbox hits back at storage-hungry crypto miners\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/dropbox-hits-back-at-storage-hungry-crypto-miners",
    "description": "\n                        <p dir=\"ltr\">Dropbox has moved its unlimited storage plan to a metered one in order to stop crypto miners&rsquo; &ldquo;uneven usage&rdquo;.</p>\n<p dir=\"ltr\">According to online digital storage giant Dropbox, its Dropbox Advanced plan was designed for businesses that would not have to worry about scaling up their storage as they grew. Dropbox also recognised that there would be a certain amount of uneven usage as some businesses ramped up more than others.</p>\n<p dir=\"ltr\">However, it was not prepared for storage space hoggers such as crypto and Chia mining, individuals pooling storage for their own personal use, and even some customers selling on their storage to others.</p>\n<p dir=\"ltr\">A post on the Dropbox blog explained how the company was planning to react:</p>\n\n<p dir=\"ltr\">&ldquo;While we prohibit abusive behavior, maintaining long lists of &ldquo;acceptable&rdquo; and &ldquo;unacceptable&rdquo; use cases for Advanced would not be a sustainable solution, and these kinds of policies would be difficult to enforce at scale. As a result, we&rsquo;re sunsetting the &ldquo;as much space as you need&rdquo; policy and transitioning to a metered model. That said, we&rsquo;re committed to making this transition as seamless as possible for our customers.&rdquo;</p>\n\n<p dir=\"ltr\">The company went on to say that although their &ldquo;as much space as you need&rdquo; model would no longer be operating, the new Dropbox Advanced plan would grant customers with three active licences a storage of 15 TB, which it said would be enough to store 100 million documents, 4 million photos, or 7500 hours of HD video.</p>\n<p dir=\"ltr\">For those who were using the storage for mining crypto and other exploitative activities they will need to find alternatives or close down their ventures. This kind of action was sometimes using thousands of times more storage than was the case with genuine business customers.</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T10:06:12.000Z",
    "title": "Prime Trust unveils $8 million loss from TerraUSD collapse in bankruptcy details",
    "url": "https://www.cryptopolitan.com/prime-trust-8-million-loss-terrausd-collapse-bankruptcy-details/",
    "description": "In a recent bankruptcy filing, Prime Core Technologies, the parent company of crypto custodian Prime Trust, disclosed an $8 million loss through investments in TerraUSD (USTC), shedding light on the financial turmoil that contributed to the company&#8217;s bankruptcy. The loss, which occurred when the algorithmic stablecoin TerraUSD collapsed in May 2022, included $6 million in ... <a title=\"Prime Trust unveils $8 million loss from TerraUSD collapse in bankruptcy details\" class=\"read-more\" href=\"https://www.cryptopolitan.com/prime-trust-8-million-loss-terrausd-collapse-bankruptcy-details/\" aria-label=\"More on Prime Trust unveils $8 million loss from TerraUSD collapse in bankruptcy details\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-25T09:44:24.000Z",
    "title": "US drug regulator mistakenly sent $55k to scammer",
    "url": "https://crypto.news/us-drug-regulator-mistakenly-sent-55k-to-scammer/",
    "description": "US Drug Enforcement Administration (DEA) mistakenly transferred $55,000 to a crypto scammer, exposing vulnerabilities even amidst high-security operations. The scam was uncovered when the US Marshals Service detected the incident. However, the funds were already removed. According to Forbes, the&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T10:00:35.000Z",
    "title": "Why Are Tezos (XTZ) And Filecoin (FIL) Dwindling? Experts Consider Pomerdoge (POMD) As The Most Profitable Option",
    "url": "https://www.crypto-news-flash.com/why-are-tezos-xtz-and-filecoin-fil-dwindling-experts-consider-pomerdoge-pomd-as-the-most-profitable-option/",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-129.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-129.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-129-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-129-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The current market conditions have made survival difficult for projects like Tezos (XTZ) and Filecoin (FIL). However, Pomerdoge has posted an exceptional growth rate during its ongoing presale, which has already raised over $1 million. Experts predict its value to grow by 40x before the end of 2023. Summary The revenue of Tezos (XTZ) has [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T09:49:16.000Z",
    "title": "Stellar’s MoneyGram Investment Targets Ripple’s Cross-Border Transaction Supremacy",
    "url": "https://www.crypto-news-flash.com/stellars-moneygram-investment-targets-ripples-cross-border-transaction-supremacy/",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-2048x1152.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-48x27.jpg 48w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Stellar Lumens is threatening Ripple&#8217;s dominance in cross-border transactions with a new MoneyGram partnership. Stellar has been working with MoneyGram for years but has only recently bought a stake in MoneyGram. Stellar Lumens has been making headwinds after a number of positive developments in recent weeks. One key development is that the blockchain protocol has [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-25T09:52:32.000Z",
    "title": "The Latest Version of the Crypto Calendar",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/the-latest-version-of-the-crypto-calendar/",
    "description": "<p>Amidst all the buzz and excitement surrounding cryptocurrency, it&#8217;s intriguing to realize that this revolutionary concept has existed for almost half a century. In the past decade alone, the world has witnessed seismic transformations in digital assets and crypto investments. To understand the origins and future trajectory of crypto, let&#8217;s dive into a concise history [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/the-latest-version-of-the-crypto-calendar/\">The Latest Version of the Crypto Calendar</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]