[
  {
    "source": "Crypto Briefing",
    "date": "2024-01-26T23:30:27.000Z",
    "title": "Solana meme coin breaks $55 million trading volume in 8 hours",
    "url": "https://cryptobriefing.com/solana-meme-coin-breaks-55-million-trading-volume-8-hours/?utm_source=feed&utm_medium=rss",
    "description": "The token WEN jumped almost 94% in the last four hours, with close to 503,000 trades made across different platforms."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-26T23:17:14.000Z",
    "title": "Bitcoin’s price action sets stage for post-halving rally, data suggests",
    "url": "https://cryptobriefing.com/bitcoins-price-action-post-halving-rally/?utm_source=feed&utm_medium=rss",
    "description": "Despite the recent dip, Bitcoin may reach a new all-time high in 2025 if it follows its historical patterns."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-26T23:11:14.000Z",
    "title": "Ethereum layer-2’s will face an increasingly competitive landscape in 2024: Flipside",
    "url": "https://cryptobriefing.com/ethereum-layer-2s-increasingly-competitive-landscape-2024/?utm_source=feed&utm_medium=rss",
    "description": "A new report from the on-chain data platform points to a fight for lower fees, better user experience, and user attention."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-26T23:30:00.000Z",
    "title": "XRP Ledger Validators Move Closer to Introducing Major Clawback Feature",
    "url": "https://www.cryptoglobe.com/latest/2024/01/xrp-ledger-validators-move-closer-to-introducing-major-clawback-feature/",
    "description": "Validators on the XRP Ledger have moved to approve the controversial clawback feature, which introduces a pivotal functionality for developers allowing the reversal of token transactions under specific circumstances, such as suspected fraud or aiding users in regaining access to their accounts in cases of lost credentials. The Clawback feature has now received 80% approval […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T23:34:37.000Z",
    "title": "Fantom Price Prediction 2024-2033: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T23:29:00.000Z",
    "title": "Bitcoin miners at risk of Profitability Challenges Post-Halving",
    "url": "https://www.cryptopolitan.com/bitcoin-miners-at-risk-of-profitability-challenges-post-halving/",
    "description": "Bitcoin miners could encounter significant profitability challenges following the upcoming halving event if the price of Bitcoin fails to rise substantially, according to a recent report from Cantor Fitzgerald, a financial services firm.&#160; The study highlights potential difficulties for eleven major publicly traded Bitcoin mining companies, including Marathon Digital, Riot Platforms, and Core Scientific. However, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T23:25:13.000Z",
    "title": "Investor optimism spurs crypto stocks alongside Bitcoin rally",
    "url": "https://www.cryptopolitan.com/investor-optimism-crypto-stocks-bitcoin/",
    "description": "The crypto market just pulled a classic move, yo-yoing from despair to elation faster than you can say &#8220;blockchain.&#8221; After a week that felt more like a rollercoaster designed by a sadist, Bitcoin and its band of merry crypto stocks have staged a comeback that&#8217;s got investors buzzing and naysayers eating their words. Bitcoin: The [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T23:15:50.000Z",
    "title": "IMF’s role in transforming the global economy",
    "url": "https://www.cryptopolitan.com/imfs-role-in-transforming-the-global-economy/",
    "description": "Eight decades post the Bretton Woods conference, it&#8217;s about time we strip down the International Monetary Fund (IMF) and its so-called transformative role in the global economy. This isn&#8217;t a tale of unwavering success; it&#8217;s a saga marked by shifts, turns, and a fair share of stumbles—reflecting the rough and tumble of international finance and [&#8230;]"
  }
]