[
  {
    "source": "Decrypt",
    "date": "2023-10-21T12:01:02.000Z",
    "title": "This Week on Crypto Twitter: Fake ETF News Pumps Bitcoin",
    "url": "https://decrypt.co/202616/this-week-crypto-twitter-fake-etf-news-pumps-bitcoin",
    "description": "One mistaken tweet on Monday pumped the price of Bitcoin by 10% in 24 hours—but it's not the only buzz from a busy week on Crypto Twitter."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-21T12:03:02.000Z",
    "title": "xDay 2023 Day 3: Interview With Bogdan-Gruia Ivan, Romanian Minister of Research, Innovation and Digitalization",
    "url": "https://www.newsbtc.com/news/xday-2023-day-3-interview-with-bogdan-gruia-ivan-romanian-minister-of-research-innovation-and-digitalization/",
    "description": "In the next three days, our team at NewsBTC will cover xDay 2023, an event organized by MultiversX in the Palace of Parliament, Romania. Formerly known as Elrond, the project rebranded in 2022 and focused on the Metaverse, scalability, and global adoption by simplifying users’ access to crypto. Related Reading: xDay 2023: Elon Musk’s X Competitor? xPortal Unveils Rival Features xDay 2023: “No Time To Waste In Driving Innovation” On the event&#8217;s third day, we sat down with Bogdan-Gruia Ivan, Romanian Minister of Research, Innovation and Digitalization. The Minister intends to support the crypto community and builders by attracting capital into the country, giving crypto companies tax exceptions, and implementing a new legal framework to provide them with clarity and security. The Minister sees himself as a “true believer” in blockchain, artificial intelligence, and their capacity to drive innovation in the country. “There is no time to waste,” he said, as he promised to turn words into facts. This is what he told us: Q: How do you feel about the event and projects coming out of MultiversX? A: The first time I was in the Romanian Parliament was 20 years ago. For two years, I served as a member of the Chamber of Deputies. I&#8217;m a member of the parliament now, and I feel I have never seen the Romanian Parliament in such a great way, looking so well and having that positive and brilliant vibe about shaping the future. It&#8217;s amazing what Beniamin (Mincu) and Multiverse X are doing here. Q: How is Romania going to support MultiversX and the crypto community? Can implementing Markets in Crypto-Assets (MiCA) help you achieve your goals? A: First of all, right now, we already have a Romanian memorandum, an understanding of how we could improve and we are working on a legal framework about technology and about blockchain. Once we pass all reviews from all public institutions, next week, we&#8217;ll bring it into the government, and we’ll make it the legal framework for blockchain and emerging technologies. So that is one of the strategic points of developing and putting Romania on the map. The second one is the Romanian AI strategy. We want to launch on 26 September with an entire large debate about our AI strategy and we&#8217;ll finish it by the end of the year. And after that, we&#8217;ll pass a legal framework for AI. Third, Romania has huge potential, the most brilliant minds of our young people from the IT sector, and with them, we had to figure out how we could improve and be part of quantum technology (…). And in my opinion, Romania could provide, could be the regional provider, and could be the great hub for entire software and for quantum technologies. So in that way, we&#8217;ll launch the framework and the national debate about quantum strategy in two or three weeks. Q: Do you think cooperation with crypto projects will extend to other members of the European Union? A: I&#8217;m interested in that because we&#8217;re part of the change. We are in the same stage with our partners (…). But at the same time, I want Romania to have its own position in that game. So I would like to put Romania on the map, so it can lead the cryptocurrencies and other emerging technologies because of the ecosystem (in the country), because regulations are friendly, because we have that golden mine in the minds of those bright young people. So that&#8217;s why I want Romania to lead in crypto and not only in crypto. Related Reading: xDay Event Day 2: Google, Amazon, Binance Labs, And A Chat With Sunny Aggarwal As of this writing, the price of Bitcoin approaches $30,000. Cover image from MultiversX, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-21T12:07:39.000Z",
    "title": "Vechain’s Quantum Leap: October 2023 Tech Update Unveils Game-Changing Features",
    "url": "https://www.crypto-news-flash.com/vechains-quantum-leap-october-2023-tech-update-unveils-game-changing-features-2/?utm_source=rss&utm_medium=rss&utm_campaign=vechains-quantum-leap-october-2023-tech-update-unveils-game-changing-features-2",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/AlekseyIvanov-VeChain.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/AlekseyIvanov-VeChain.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/AlekseyIvanov-VeChain-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/AlekseyIvanov-VeChain-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/AlekseyIvanov-VeChain-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-21T11:59:00.000Z",
    "title": "Coinbase Delists Five ‘Non-Compliant’ Coins with $60M Combined Cap",
    "url": "https://coinedition.com/coinbase-delists-five-non-compliant-coins-with-60m-combined-cap/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/Coinbases-just-filed-amicus-brief.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Coinbase Delists Five ‘Non-Compliant’ Coins with $60M Combined Cap\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/Coinbases-just-filed-amicus-brief.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/Coinbases-just-filed-amicus-brief-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/Coinbases-just-filed-amicus-brief-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/Coinbases-just-filed-amicus-brief-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/Coinbases-just-filed-amicus-brief-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Coinbase announces the delisting of five tokens due to non-compliance with listing standards. Affected tokens include CRPT, MXC, QSP, REN, and TONE, with a combined market valuation of $60 million. Coinbase reassures investors that despite delisting, their funds remain safe and accessible for withdrawal. Coinbase Exchange, the largest US-based centralized crypto trading platform, has embarked [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coinbase-delists-five-non-compliant-coins-with-60m-combined-cap/\">Coinbase Delists Five ‘Non-Compliant’ Coins with $60M Combined Cap</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-21T11:45:34.000Z",
    "title": "Crypto Analyst Tone Vays Issues Bitcoin Alert, Warns Traders Not To ‘Go Crazy’ As BTC Soars by 10% This Week",
    "url": "https://dailyhodl.com/2023/10/21/crypto-analyst-tone-vays-issues-bitcoin-alert-warns-traders-not-to-go-crazy-as-btc-soars-by-10-this-week/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/02/tone-exit-positions.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/02/tone-exit-positions.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/02/tone-exit-positions.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/02/tone-exit-positions.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/02/tone-exit-positions.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/02/tone-exit-positions.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/02/tone-exit-positions.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Veteran crypto trader Tone Vays is predicting that Bitcoin’s (BTC) latest rally will end before reaching a key level. In a new strategy session, Vays tells his 122,000 YouTube subscribers that despite BTC&#8217;s 10% surge this week, he does not believe the king crypto will hit the $32,000 level. “Let’s not go crazy here. I [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/21/crypto-analyst-tone-vays-issues-bitcoin-alert-warns-traders-not-to-go-crazy-as-btc-soars-by-10-this-week/\">Crypto Analyst Tone Vays Issues Bitcoin Alert, Warns Traders Not To ‘Go Crazy’ As BTC Soars by 10% This Week</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]