[
  {
    "source": "Decrypt",
    "date": "2023-07-21T12:26:17.000Z",
    "title": "DOJ Accuses SBF of Leaking Caroline Ellison's Diary to 'Discredit a Witness' in FTX Trial",
    "url": "https://decrypt.co/149499/doj-accuses-sbf-of-leaking-caroline-ellisons-diary-to-discredit-a-witness-in-ftx-trial",
    "description": "Sam Bankman-Fried attempted to discredit Caroline Ellison by sharing her personal documents to the media, the DOJ alleges."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-21T12:22:52.000Z",
    "title": "Curve omnipool platform Conic Finance hacked for $3.2 million in ETH",
    "url": "https://cointelegraph.com/news/eth-curve-omnipool-platform-conic-finance-hacked-for-3-2-million-in-eth",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/fda482af-615f-48b3-8c90-fe1ed750d04e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to initial analysis by Peckshield, the root cause for Conic Finance’s hack was the new CurveLPOracleV2 contract.</p>\n                    <p><p>Conic Finance, a liquidity pool balancing platform for the decentralized finance (DeFi) protocol Curve, has suffered an exploit on the Ethereum omnipool.</p><p>Conic Finance has been exploited for $3.26 million in Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), the Web3 risk-alert source Beosin Alert <a href=\"https://twitter.com/BeosinAlert/status/1682348279387025416?s=20\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> on July 21. Nearly the entire amount of stolen cryptocurrency was <a href=\"https://etherscan.io/address/0x3d32C5a2E592c7B17e16bdDc87EAb75f33ae3010\" target=\"_blank\" rel=\"noopener nofollow\">sent</a> to a new Ethereum address in just one transaction, according to data provided by Beosin.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/59b75af3-809f-4d19-bff4-a5c1aae14b57.png\"  /><figcaption style=\"text-align: center;\"><em>Transactions on the address involving a flashloan exploit on Coin ETH Pool. Source: Etherscan</em></figcaption></figure><p>Conic Finance was quick to <a href=\"https://twitter.com/ConicFinance/status/1682346727578255360?s=20\" target=\"_blank\" rel=\"noopener nofollow\">confirm</a> the news on Twitter, stating that the platform is currently investigating the exploit and will share updates as soon as they are available.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/arcadia-finance-hacked-on-ethereum-and-optimism-for-455k\"><strong><em>DeFi protocol Arcadia Finance hacked on Ethereum and Optimism for $455K</em></strong></a></p><p>According to the initial analysis <a href=\"https://twitter.com/peckshield/status/1682354822899712001?s=20\" target=\"_blank\" rel=\"noopener nofollow\">provided</a> by the blockchain security firm Peckshield, the root cause came from the new CurveLPOracleV2 contract.</p><p>“Our audit identifies a similar read-only reentrancy issue. However, the same issue is introduced in the newly introduced CurveLPOracleV2 contract, which was not part of the audit scope,” Peckshield wrote.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/wolf-of-all-streets-world-bitcoin-hits-1m-1-million-hall-of-flame/\"><strong><em>Hall of Flame: Wolf Of All Streets worries about a world where Bitcoin hits</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-21T12:28:19.000Z",
    "title": "Indonesia launches national cryptocurrency exchange amid 69% drop in transaction volume",
    "url": "https://cryptoslate.com/indonesia-launches-national-cryptocurrency-exchange-amid-69-drop-in-transaction-volume/",
    "description": "<p>Indonesia launched a national cryptocurrency exchange that became operational on July 17, according to a July 20 statement from the Commodity Futures Trading Supervisory Agency (Bappebti). The country also announced that its futures clearing house has been operational since July 17. Per the press statement, PT Bursa Komoditi Nusantara got the approval for a crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/indonesia-launches-national-cryptocurrency-exchange-amid-69-drop-in-transaction-volume/\">Indonesia launches national cryptocurrency exchange amid 69% drop in transaction volume</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-21T12:30:50.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Falls Below $30,000 on Friday, a Week After XRP Ruling",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-falls-below-30000-on-friday-a-week-after-xrp-ruling/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1898878267-2-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC Falls Below $30,000 on Friday, a Week After XRP Ruling\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1898878267-2-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1898878267-2-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1898878267-2-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1898878267-2-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1898878267-2-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1898878267-2-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1898878267-2.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin dropped below the $30,000 level on Jul 21, as market sentiment continued to trend lower in today&#x2019;s session. This comes a week after cryptocurrency markets surged following the XRP ruling, however momentum has since faded as a result of profit taking. Ethereum was also down on Friday. Bitcoin Bitcoin (BTC) remained in the red [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T12:20:34.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The U.S. Securities and Exchange Commission (SEC) has begun reviewing applications from six companies, including BlackRock, to establish spot bitcoin exchange-traded funds. This marks the initial phase in the SEC&#8217;s procedure to determine the approval of the most recent set of proposals. The SEC has also officially recognized applications from Bitwise, ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-21T12:29:23.000Z",
    "title": "Crypto media Coindesk might be sold for $125m",
    "url": "https://crypto.news/crypto-media-coindesk-might-be-sold-for-125m/",
    "description": "A group of investors are reportedly nearing a deal to acquire crypto media outlet Coindesk for $125 million.&#160; According to the Wall Street Journal citing &#8220;people familiar with the matter,&#8221; the investor group is led by Matthew Roszak, founder and&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-21T12:20:41.000Z",
    "title": "Crypto investors in Canada face home theft risk, police say",
    "url": "https://crypto.news/crypto-investors-in-canada-face-home-theft-risk-police-say/",
    "description": "Canadian police issued a public warning on July 19 regarding a concerning trend of high-value crypto investors falling victim to home robberies."
  },
  {
    "source": "BTCManager",
    "date": "2023-07-21T12:12:07.000Z",
    "title": "Blockchain Association criticizes new US DeFi regulation bill",
    "url": "https://crypto.news/blockchain-association-criticizes-new-us-defi-regulation-bill/",
    "description": "The Blockchain Association has condemned the proposed US DeFi legislation as an unworkable solution incompatible with the industry. Blockchain Association, a nonprofit organization that promotes a pro-innovation policy environment for the web3 economy, has condemned the recently introduced Crypto-Asset National&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-21T12:36:37.000Z",
    "title": "Is The Chainlink Top In? This Metric May Suggest So",
    "url": "https://www.newsbtc.com/news/chainlink/is-the-chainlink-top-in-this-metric-may-suggest-so/",
    "description": "On-chain data shows that Chainlink&#8217;s social dominance has observed a large spike after its sharp price surge, a possible sign that the top may be here. Chainlink Social Dominance Rises To 3rd Largest In Cryptocurrency Sector According to data from the on-chain analytics firm Santiment, LINK is the third most trending asset in the market right now. The indicator of interest here is the &#8220;social dominance,&#8221; to understand which another metric needs to be looked at first: the social volume. The social volume measures the total amount of social media text documents (that is, text-based posts, threads, messages, etc.) that are making mentions of a given asset (which, in the current case, is Chainlink). This metric basically provides us with information about the degree of discussion that a particular coin is receiving across major social media platforms like Twitter, Reddit, Telegram, and 4chan. Now, the aforementioned social dominance is a metric that compares the social volume of a cryptocurrency, with combined that of the top 100 assets by market cap in the space. Naturally, in the case of LINK, this indicator tells us how much talk related to the top coins in the market is coming from discussions centered on Chainlink alone. Related Reading: Bitcoin Near Crucial Retest: Which Of These Historical Patterns Will Repeat? Here is a chart that shows the trend in the LINK social dominance over the past month: Looks like the value of the metric has been quite high in recent days &#124; Source: Santiment on Twitter As displayed in the above graph, Chainlink&#8217;s social dominance has registered a large spike following the rapid growth in the price of the cryptocurrency during the last couple of days. At the peak of this latest sharp surge, the asset&#8217;s value had climbed above the $8.4 mark, but since then the cryptocurrency has gone down a bit. Nonetheless, the price is still floating above $8.1 and the coin&#8217;s gains stand at an impressive 19%. Historically, rallies like these have attracted a lot of eyes to LINK, so it&#8217;s not particularly surprising that the cryptocurrency&#8217;s share of discussions in the sector has shot up. The scale of this rise, though, may be a slightly worrying sign. Chainlink is the third most talked about asset in the market right now, despite being only the 20th largest in terms of market cap. Related Reading: Market Alert: Bitcoin Hash Ribbons Capitulation Triggers Cautionary Outlook Generally, when an asset is being talked about too much, the price can become more probable to show a move opposite to what this large crowd is expecting. Given that the latest discussions have come just after the rally, it would appear likely that these talks are in fact a sign of hype in the market. Such amount of hype has often proved to be a bearish signal for Chainlink, as tops become more likely to form in this kind of market environment. If a similar pattern follows now as well, then it may mean that the current social dominance spike is a sign that a local top is already in for the cryptocurrency. LINK Price At the time of writing, Chainlink is trading around $8.1, up 15% in the last week. LINK has shot up during the past couple of days &#124; Source: LINKUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T12:29:25.000Z",
    "title": "Can 1inch Network Sustain Its Surge? Arbitrum and VC Spectra Offer Better Long-Term Prospects",
    "url": "https://www.crypto-news-flash.com/can-1inch-network-sustain-its-surge-arbitrum-and-vc-spectra-offer-better-long-term-prospects/?utm_source=rss&utm_medium=rss&utm_campaign=can-1inch-network-sustain-its-surge-arbitrum-and-vc-spectra-offer-better-long-term-prospects",
    "description": "<img width=\"512\" height=\"301\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T124250.397.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T124250.397.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T124250.397-300x176.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />1inch Network (1INCH) experienced significant growth, resulting in a notable price resurgence on July 17, 2023. Will the rise persist? Meanwhile, Arbitrum’s (ARB) highly efficient roll-up technology makes it a great long term prospect for investors.  However, investors can count on VC Spectra (SPCT), which is much better than 1inch Network (1INCH) and Arbitrum (ARB). [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T12:24:30.000Z",
    "title": "The Roadmap Progresses: Polkadot 1.0 Sets the Stage for Community-Driven Polkadot 2.0",
    "url": "https://www.crypto-news-flash.com/the-roadmap-progresses-polkadot-1-0-sets-the-stage-for-community-driven-polkadot-2-0/?utm_source=rss&utm_medium=rss&utm_campaign=the-roadmap-progresses-polkadot-1-0-sets-the-stage-for-community-driven-polkadot-2-0",
    "description": "<img width=\"1920\" height=\"1246\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot-2.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot-2-300x195.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot-2-1024x665.jpg 1024w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Polkadot 1.0 according to the blockchain network has finally been released. The protocol is now charting a transition to a new advanced era. Polkadot 1.0 has officially been released with all the functionalities and pioneering vision listed in the Polkadot whitepaper. This marks a significant milestone in blockchain technology evolution and it is worth noting [...]"
  }
]