[
  {
    "source": "Cointelegraph",
    "date": "2023-07-14T00:19:39.000Z",
    "title": "XRP becomes 4th largest crypto after Ripple's partial win over SEC",
    "url": "https://cointelegraph.com/news/ripple-xrp-price-market-cap-jumps-sec-ruling",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/38ab1d69-1ae0-4d08-80b0-ad401ade7729.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>XRP’s market capitalization surged by more than $21 billion in just three hours.</p>\n                    <p><p>Ripple (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) has now become the fourth largest cryptocurrency by market capitalization after Ripple Labs’ <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">partial victory over the Securities and Exchange Commission (SEC</a>) on July 13. </p><p>Mere hours after the ruling, XRP market cap surged a whopping $21.2 billion to reach a new yearly high of $46.1 billion, pushing it up from the 7th position to beat out Circle’s USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) and Binance’s BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) token in the process. </p><p>At the time of writing, Ripple’s market capitalization has settled down to $42.5 billion. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/1a1dced2-9d1b-41b6-8599-c1c8b2e52445.png\"  /><figcaption style=\"text-align: center;\"><em>Ripple’s market capitalization grew 84% following its partial victory over the SEC. Source: CoinMarketCap</em></figcaption></figure><p>The sudden surge for XRP came immediately after the District Court for the Southern District of New York <a href=\"https://www.courtlistener.com/docket/19857399/874/securities-and-exchange-commission-v-ripple-labs-inc/\" target=\"_blank\" rel=\"noopener nofollow\">declared</a> that the “offer and sale of XRP on digital asset exchanges did not amount to offers and sales of investment contracts” in a case involving Ripple Labs and the SEC.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/678471bf-d36c-4a56-bb09-11ff080a0d09.png\"  /><figcaption style=\"text-align: center;\"><em>XRP is now ranked as the 4th largest cryptocurrency. Source: CoinMarketCap</em></figcaption></figure><p>Similarly, the price of XRP surged as much as 98% in the hours following the decision, reaching as high as $0.93 according to <a href=\"https://www.tradingview.com/symbols/XRPUSD/\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from TradingView. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/why-is-xrp-price-up-today\"><strong><em>Why is XRP price up today?</em></strong></a></p><p>The apparent rush to buy up XRP even briefly caused U.S. crypto exchange Uphold to go down due to a “simply unprecedented” spike in volume. </p><blockquote>“Yes, we went down but no platform could cope with the 50x spike in volume we saw today.”</blockquote><p>Uphold is understood to have been one of the few larger U.S.-based cryptocurrency exchanges that had continued to offer sales of XRP, while <a href=\"https://cointelegraph.com/news/us-exchanges-are-suspending-or-delisting-xrp-left-and-right\">others chose to delist</a>. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Uphold is back up!<br><br>Yes, we went down but no platform could cope with the 50x spike in volume we saw today.<br><br>Uphold feels proud and vindicated to have been THE ONLY platform to stick with XRP through thick and thin over the past few years.<br><br>We’d love to give props to our law firm…</p>&mdash; Uphold (@UpholdInc) <a href=\"https://twitter.com/UpholdInc/status/1679625758703067140?ref_src=twsrc%5Etfw\">July 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The new ruling has also sparked a fresh wave of re-listing activity from mainstay U.S. exchanges, with <a href=\"https://cointelegraph.com/news/us-crypto-exchanges-second-chance-xrp-listings-after-court-ruling\">Coinbase, Kraken and iTrustCapital</a> making the token available for trading on their respective platforms. </p><p>The Winklevoss-owned crypto exchange Gemini has hinted that it too will look to re-list XRP sometime in the near future. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\"><strong><em>How smart people invest in dumb memecoins — 3-point plan for success</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-14T00:30:23.000Z",
    "title": "Ripple’s Chief Legal Officer Breaks Down Ruling in SEC Lawsuit — Says ‘As a Matter of Law, XRP Is Not a Security’",
    "url": "https://news.bitcoin.com/ripples-chief-legal-officer-breaks-down-ruling-in-sec-lawsuit-says-as-a-matter-of-law-xrp-is-not-a-security/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/ripple-chief-legal-officer-sec-case-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Ripple&#039;s Chief Legal Officer Breaks Down SEC v Ripple Case Ruling — &#039;As a Matter of Law, XRP Is Not a Security&#039;\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/ripple-chief-legal-officer-sec-case-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ripple-chief-legal-officer-sec-case-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ripple-chief-legal-officer-sec-case-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ripple-chief-legal-officer-sec-case-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ripple-chief-legal-officer-sec-case-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ripple-chief-legal-officer-sec-case-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ripple-chief-legal-officer-sec-case.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Ripple Labs&#x2019; chief legal officer has broken down Thursday&#x2019;s ruling on the U.S. Securities and Exchange Commission (SEC) v. Ripple case. Emphasizing that the landmark ruling is &#x201C;a huge win&#x201D; for the crypto firm, he stressed that &#x201C;as a matter of law &#x2013; XRP is not a security.&#x201D; In addition, he noted that crypto sales [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-14T00:12:06.000Z",
    "title": "Perfect Storm: Why Bitcoin & Crypto Are Poised For A Dramatic Recovery",
    "url": "https://www.newsbtc.com/bitcoin-news/perfect-storm-why-bitcoin-crypto-dramatic-recovery/",
    "description": "Bitcoin is flirting with $32,000 per coin, XRP just posted a 100% intraday rally, and suddenly cryptocurrency prices are green again. The sudden change is all part of a possible perfect storm brewing — one that leads to a dramatic recovery and new all-time highs sooner than most would expect. “Not A Security” XRP Victory Signals Relief In Crypto The idea that cryptocurrencies could recover at all in the recent macro environment has been scoffed at throughout 2023. Layer in the impact of the SEC putting pressure on the industry by labeling certain altcoins as securities, and few wanted to risk their money on digital coins. Related Reading: Bitcoin Reaches Longest Stretch Ever Without A Bull Run But that label was just removed from XRP, and that’s all it took to double in price in just one day. XRP has since given back some of that upside, but it’s a shocking enough move to get people to start paying attention to crypto again — especially altcoins. A rising tide also tends to lift all boats. And with Bitcoin staying buoyant above $30,000 per coin, Ethereum holding above $1,800, and the “ripple effect” happening in BTC dominance as a result of the XRP move, altcoins have already started to participate. The dollar diving could help crypto climb &#124; DXY on TradingView.com The DXY And The Perfect Storm For Bitcoin So how is this set up to be a perfect storm? Cryptocurrencies have been in oversold conditions for an extended period, and order books are thinner today than they were in 2021. It won’t take much money coming in to begin to make prices move, per XRP’s example. Today alone, hundreds of other altcoins posted substantial gains, simply because XRP is no longer labeled a security. It caused an immediate rush into other altcoins which are at bear market lows and priced at a great value compared to 2021 ATHs. Related Reading: The One Ingredient Missing From A Full-Bore Bitcoin Bull Run Given the previously mentioned macro landscape, many traders remain short Bitcoin and other coins, and could soon find themselves helping to push prices higher as they’re squeezed out of positions. Others aren’t short, but are sidelined and remains reluctant to buy in. This situation could result in chasing prices higher and higher. Finally, this perfect storm is capped off by inflation cooling, the stock market approaching ATHs, and the US Dollar weakening according to the DXY. The DXY just lost the 100-point level, which potentially sent a risk-on signal to financial markets. Interesting timing for the $DXY to take a dive coinciding with the $XRP case outcome Really seems like a perfect storm for crypto is upon us pic.twitter.com/rjfGp9TE4O &#8212; Tony &#34;The Bull&#34; (@tonythebullBTC) July 13, 2023 With all cryptocurrencies prices in USD as their base trading pair, a perfect storm is here that could cause prices to surge unstoppably higher. Tony is the author of the CoinChartist (VIP) newsletter. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  }
]