[
  {
    "source": "Decrypt",
    "date": "2023-06-13T19:43:01.000Z",
    "title": "North Korean Hackers Pocketed More Than $100M in Atomic Wallet Hack",
    "url": "https://decrypt.co/144444/north-korean-hackers-pocket-over-100-m-in-atomic-wallet-heist",
    "description": "Lazarus Groupe hacked crypto wallet service Atomic Wallet earlier this month, Elliptic said. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-13T19:59:57.000Z",
    "title": "US lawmaker invokes SEC lawsuits in considering crypto regulatory framework",
    "url": "https://cointelegraph.com/news/us-lawmaker-invokes-sec-lawsuits-in-considering-crypto-regulatory-framework",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/56088cc2-1549-4075-ab7a-c31d0cabfd09.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to Rep. Maxine Waters, granting crypto firms provisional registration under a proposed framework \"could reward bad actors with a ‘get out of jail free’ card\".</p>\n                    <p><p>Members of the United States House Financial Services Committees met to discuss clarity for the digital asset ecosystem, with some invoking recent legal action from the Securities and Exchange Commission (SEC) against crypto firms.</p><p>In a June 13 hearing of the committee, ranking member Maxine Waters <a href=\"https://financialservices.house.gov/calendar/eventsingle.aspx?EventID=408851\" target=\"_blank\" rel=\"noopener nofollow\">said</a> Democrats were taking a “serious and thoughtful look” at a proposed framework <a href=\"https://cointelegraph.com/news/us-lawmakers-aim-for-crypto-regulatory-clarity-with-proposed-bill-putting-the-screws-to-sec\">introduced by Republicans</a> on the regulation of digital assets. Committee chair Patrick McHenry said he expected bipartisan input on a draft bill, with markups following a congressional recess in July.</p><p>Waters suggested that without extensive analyses and collaboration between the two political parties, the digital asset legislation could leave the door open for potential fraud and misuse of customer funds. The California Representative cited the collapse of FTX, former CEO Sam Bankman-Fried’s criminal charges, and the SEC’s <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">recent actions against Binance</a> and Coinbase.</p><p>“I’m particularly worried that the Republican bill would allow crypto firms that are currently being sued for violating our securities laws to continue doing business through provisional registration,” said Waters. “The bill appears to halt any enforcement actions by the SEC against crypto firms even when they have committed fraud. This provisional registration could reward bad actors with a ‘get out of jail free’ card and allow them to continue harming consumers and investors.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/TODAY?src=hash&amp;ref_src=twsrc%5Etfw\">#TODAY</a> @ 10 AM - RM <a href=\"https://twitter.com/RepMaxineWaters?ref_src=twsrc%5Etfw\">@RepMaxineWaters</a> leads Democrats as the full Cmte holds a hearing entitled “The Annual Testimony of the Secretary of the <a href=\"https://twitter.com/USTreasury?ref_src=twsrc%5Etfw\">@USTreasury</a> on the State of the International Financial System.”<br><br>: <a href=\"https://t.co/4RoxMIa04b\">https://t.co/4RoxMIa04b</a><br>: <a href=\"https://t.co/x1uLfTjtuI\">https://t.co/x1uLfTjtuI</a></p>&mdash; U.S. House Committee on Financial Services (@FSCDems) <a href=\"https://twitter.com/FSCDems/status/1668607761792356355?ref_src=twsrc%5Etfw\">June 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The draft bill introduced on June 2 would prohibit the SEC from denying digital asset trading platforms from registering as a regulated alternative trading system and allow such firms to offer “digital commodities and payment stablecoins.” It would also restructure the roles the SEC and Commodity Futures Trading Commission (CFTC) playe in regulating digital assets in the United States.</p><p>“The American public was the one left holding the bag when it came to FTX and when it came to the violations, or the alleged violations when it comes to Binance and Coinbase,” said Prometheum founder and co-CEO Aaron Kaplan at the hearing. “The best way forward is pretty clear and logical, is the application of federal securities laws [through the SEC].”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/u-s-senator-lummis-revamps-efforts-for-crypto-regulations-amid-sec-lawsuits\"><strong><em>US senator revamps efforts for crypto regulations amid SEC lawsuits</em></strong></a></p><p>Other lawmakers have responded differently to the seeming regulation-by-enforcement approach by the SEC. On June 12, Ohio Rep. Warren Davidson — a Republican also on the House Financial Services Committee — <a href=\"https://cointelegraph.com/news/breaking-us-lawmakers-file-sec-stabilization-act-to-fire-gary-gensler\">proposed firing SEC chair</a> Gary Gensler through legislation that would also restructure power at the commission. The legality of this move is unclear. </p><p>Amid the SEC lawsuits, Binance.US has pushed back against the commission’s efforts to freeze its funds. At the time of publication, a District of Columbia federal judge was <a href=\"https://cointelegraph.com/news/binance-us-fights-sec-motion-to-freeze-funds-restraining-order\">considering competing motions from the SEC</a>, Binance, and Binance.US on how to handle the assets, and other pending legal actions.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T20:01:06.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 While the crypto market navigated the fallout from the&#160;collapse&#160;of FTX in late 2022, Ava Labs says it dodged the bullet. Ava Labs founder and CEO Emin Gün Sirer assure its stakeholders that FTX impacts very little the companies and projects operating in the Avalanche ecosystem. The company had an account on ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T19:47:26.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and the platform they need to build blockchain solutions. At this time, we can only make educated guesses ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T19:44:21.000Z",
    "title": "SEC founder shares interesting insights about Binance-SEC debacle",
    "url": "https://www.cryptopolitan.com/sec-founder-insights-about-binance-sec/",
    "description": "The legal dispute between the U.S. Securities and Exchange Commission (SEC) and Binance, the top cryptocurrency company in the world, has reached new heights. The case&#8217;s recent development has drawn the attention of John Reed Stark, a renowned figure in the field of internet enforcement and the founding Chief of the SEC&#8217;s Office of Internet ... <a title=\"SEC founder shares interesting insights about Binance-SEC debacle\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-founder-insights-about-binance-sec/\" aria-label=\"More on SEC founder shares interesting insights about Binance-SEC debacle\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-13T20:00:57.000Z",
    "title": "XRP, BTC, and ETH Investors Doubling Down on DigiToads Presale! Over $4.77 Million Raised",
    "url": "https://nulltx.com/xrp-btc-and-eth-investors-doubling-down-on-digitoads-presale-over-4-77-million-raised/",
    "description": "As we witness the cryptocurrency landscape&#8217;s ebbs and flows, an unexpected phenomenon is capturing the attention of savvy investors. DigiToads, a unique blockchain project with a community-centric approach and a promising blend of utility and social impact is making significant waves. Fueled by a successful presale, which raised over $4.77 million from the sale of [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-13T19:53:33.000Z",
    "title": "Ava Labs CEO to testify before US House",
    "url": "https://crypto.news/ava-labs-ceo-to-testify-before-us-house/",
    "description": "Dr. Emin Gün Sirer, who leads the development of the Avalanche protocol, is set to testify before the U.S. House Financial Services Committee."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-13T20:00:02.000Z",
    "title": "Bitcoin Market At Decision Point: Will This On-Chain Retest Be Successful?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-market-decision-point-on-chain-retest-successful/",
    "description": "On-chain data shows a Bitcoin metric is approaching a crucial retest that can make or break a rally. Will the bulls come out on top? Bitcoin Short-Term Holder Realized Profit/Loss Ratio Is Nearing 1 Level According to data from the on-chain analytics firm Glassnode, a successful retest here would be constructive for the price of the asset. The indicator of interest here is the &#8220;realized profit/loss ratio,&#8221; which measures the ratio between the profits and losses that Bitcoin investors throughout the network are realizing right now. The metric works by going through the on-chain history of each coin being sold to see what price it was last acquired at. If this previous price for any coin was less than the BTC value that it&#8217;s now being sold/moved at, then the coin&#8217;s sale is said to be realizing some amount of profit. Naturally, the opposite case would imply that loss realization is occurring with the coin&#8217;s movement. The metric takes the sum of all such profits and losses being harvested in the market and finds the ratio between them. When the value of this ratio is greater than 1, it means that the market as a whole is realizing some amount of profit currently. On the other hand, values under this threshold imply losses are more dominant in the sector right now. In the context of the current discussion, the realized profit/loss ratio for the entire market is actually not the metric of focus, but the version specifically for the &#8220;short-term holders&#8221; (STHs) is. The STHs are one of the two major groups in the Bitcoin market and include all the investors who have been holding onto their coins since less than 155 days ago. Related Reading: Bitcoin Stuck In Historically Tight Range, Calm Before The Storm? Here is a chart that shows the trend in the 7-day exponential moving average (EMA) BTC STH realized profit/loss ratio over the last couple of years: The value of the metric seems to have been going down in recent days &#124; Source: Glassnode on Twitter As displayed in the above graph, the 7-day EMA Bitcoin STH realized profit/loss ratio has been above 1 during the past few months, suggesting that profit realization has been the dominant force. This naturally makes sense, as the rally occurred during this period, which would have made it so that these investors would be in plenty of profits. Recently, however, the metric has been going down as the price has observed a decline. From the chart, it&#8217;s visible that the indicator is now closing in toward the 1 mark. The 1 line has historically held immense significance for the market, as it serves as the point where the STHs are just breaking even on their selling. During bearish periods, this line has usually provided resistance to the price of Bitcoin, while it has switched to being a support point during bullish regimes. The reason behind this interesting pattern lies in the fact that investors look at their break-even mark very differently between the two types of markets. Related Reading: Chainlink (LINK) Whale Transfers Spike, Bearish Sign? In a bearish environment, investors see the break-even mark as an ideal exiting point, as that way, they can at least avoid getting into losses. Thus, a lot of selling takes place at the level, leading to the price feeling resistance. Similarly, the investors look at the level as a profitable buying opportunity during rallies, so they participate in some buying at it. Obviously, if the current rally has to have any chance at going, this retest of the 1 level would have to be successful. If a breakdown happens here, however, then a bearish regime might return for Bitcoin. BTC Price At the time of writing, Bitcoin is trading around $26,000, up 1% in the last week. BTC has been moving sideways &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-13T20:00:27.000Z",
    "title": "Bitcoin Bull Market Still On As BTC Continues To Climb Wall of Worry, Says Crypto Strategist",
    "url": "https://dailyhodl.com/2023/06/13/bitcoin-bull-market-still-on-as-btc-continues-to-climb-wall-of-worry-says-crypto-strategist/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/To-Climb-Wall-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/To-Climb-Wall-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/To-Climb-Wall-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/To-Climb-Wall-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/To-Climb-Wall-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/To-Climb-Wall-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/To-Climb-Wall-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist says that Bitcoin&#8217;s (BTC) long-term trend remains up despite its bearish price action after briefly surging above $30,000. In a new video, analyst Jason Pizzino tells his 285,000 YouTube subscribers that Bitcoin is still in a bull market. According to the analyst, his bullish stance will not change as long [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/13/bitcoin-bull-market-still-on-as-btc-continues-to-climb-wall-of-worry-says-crypto-strategist/\">Bitcoin Bull Market Still On As BTC Continues To Climb Wall of Worry, Says Crypto Strategist</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-13T19:55:46.000Z",
    "title": "Ripple’s Legal Counsel Calls for Investigation into Former SEC Official William Hinman After Release of Emails",
    "url": "https://dailyhodl.com/2023/06/13/ripples-legal-counsel-calls-for-investigation-into-former-sec-official-william-hinman-after-release-of-emails/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/ripple-ceo-calls-lawsuit.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/ripple-ceo-calls-lawsuit.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/ripple-ceo-calls-lawsuit.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/ripple-ceo-calls-lawsuit.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/ripple-ceo-calls-lawsuit.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/ripple-ceo-calls-lawsuit.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/ripple-ceo-calls-lawsuit.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Ripple Labs&#8217; head legal counsel says there should be an investigation into the U.S. Securities and Exchange Commission&#8217;s (SEC) former Director of Corporation Finance following the reveal of internal emails. In 2018, William Hinman made a speech declaring Ethereum (ETH) as not a security, which caused confusion when the SEC later sued Ripple Labs for [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/13/ripples-legal-counsel-calls-for-investigation-into-former-sec-official-william-hinman-after-release-of-emails/\">Ripple’s Legal Counsel Calls for Investigation into Former SEC Official William Hinman After Release of Emails</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]