[
  {
    "source": "Bitcoin.com",
    "date": "2023-10-28T03:00:34.000Z",
    "title": "US Lawmakers Ask DOJ to Consider Criminal Charges Against Binance and Tether",
    "url": "https://news.bitcoin.com/us-lawmakers-ask-doj-to-consider-criminal-charges-against-binance-and-tether/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/binance-lummis-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"US Lawmakers Urge DOJ to Consider Criminal Charges Against Binance and Tether\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/binance-lummis-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/binance-lummis-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/binance-lummis-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/binance-lummis-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/binance-lummis-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/binance-lummis-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/binance-lummis.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Two U.S. lawmakers have asked the U.S. Department of Justice (DOJ) to consider criminal charges against Binance and Tether, alleging that the two crypto platforms were used to fund Hamas. “We urge the Department of Justice to carefully evaluate the extent to which Binance and Tether are providing material support and resources to support terrorism [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-28T03:00:14.000Z",
    "title": "Bitcoin Season: Leading The Charge In The Crypto Market",
    "url": "https://www.newsbtc.com/altcoin/bitcoin-season-leading-the-charge-in-the-crypto-market/",
    "description": "Over the last month, Bitcoin&#8217;s price has seen a significant surge. Its price has increased by 30%, reaching a new yearly high of $35,000, 10% above its previous peak this year. Interestingly, while the growth of Bitcoin is clear to see, the broader cryptocurrency market hasn&#8217;t quite managed to keep up. Related Reading: Bitcoin Price To Reach $170,000 in 2025 – Mathematical Model Predicts Altcoin Market Cap The Altcoin market cap, which is the total cryptocurrency market cap excluding Bitcoin, has been trading within a descending triangle. This pattern, characterized by its lower highs and equal lows, often indicates a bearish trend in the market. This pattern suggests sellers are gradually overtaking buyers. A breakout from such a pattern is typically seen as a bullish indicator, with the target being the first peak. In this case, the Altcoin market cap would potentially see another 15% increase, matching the yearly highs in April. Crypto total market cap excluding BTC. Source: TOTAL2 on TradingView A similar pattern was seen in the previous cycle, where the Altcoin market cap was trading within a descending wedge. After the breakout, the Altcoin market cap saw an increase of 90%. Such historical trends show the importance of closely monitoring these patterns as potential indicators of market shifts. Contrastingly, as the Altcoin market cap is forming lower highs, Bitcoin&#8217;s price is forming new yearly highs. This dynamic suggests that Bitcoin is gaining market share from the rest of the crypto market. This is often referred to as &#8216;Bitcoin Season&#8217;. Bitcoin Season Bitcoin&#8217;s market share is at 54%, which is the highest it has been in over two years. The last time Bitcoin&#8217;s market share was at this level was during the bull market in 2021. As that year progressed, the asset began losing market share, as investors turned their attention to coins with lower capitalization, enticed by the prospect of higher returns. Now the trend seems to be reversing. Investors are gravitating back towards Bitcoin, lured by its higher returns than the rest of the crypto market. Bitcoin dominance (market share % in the cryptocurrency market). Source: BTC.D from TradingView The next resistance is at 58%, so if Bitcoin breaches this mark, it stands to gain an additional 5% in market share. Historical trends have shown that in the initial phases of bull markets, Bitcoin often takes charge, as it pushes on to create new all-time highs. This is typically driven through Bitcoin-centric narratives such as the halving which reduces the new supply of Bitcoin being mined. This year, heightened anticipation surrounds the potential approval of a Bitcoin ETF. If approved, it could pave the way for a wider range of investors to engage with the asset. Related Reading: Next Bitcoin Peak: Why It Could Still Be 2 Years Away Standout Altcoins Performers Even during the dominant &#8216;Bitcoin Season&#8217;, certain Altcoins have still managed to show even more impressive returns. Some notable ones are the following: Injective: +74% Solana: +68% PEPE: +67% RENDER: +45% Chainlink: +45% Investment Disclaimer: The content provided in this article is for informational and educational purposes only. It should not be considered investment advice. Please consult a financial advisor before making any investment decisions. Trading and investing involve substantial financial risk. Past performance is not indicative of future results. No content on this site is a recommendation or solicitation to buy or sell securities or cryptocurrencies. Featured image from ShutterStock, Charts from TradingView.com Predycto is the author of a cryptocurrency newsletter. Sign up for free. Follow @Predycto on Twitter."
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-28T03:08:53.000Z",
    "title": "$100,000,000,000 in Deposits Exit US Banking System in Three Weeks As Fed Survey Says Banks Face Financial Stability Risks",
    "url": "https://dailyhodl.com/2023/10/27/100000000000-in-deposits-exit-us-banking-system-in-three-weeks-as-fed-survey-says-banks-face-financial-stability-risks/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/bank-deposits-withdrawals.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/bank-deposits-withdrawals.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/bank-deposits-withdrawals.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/bank-deposits-withdrawals.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/bank-deposits-withdrawals.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/bank-deposits-withdrawals.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/bank-deposits-withdrawals.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>People and businesses are withdrawing billions of dollars in deposits from US banks as a new survey details concern on the state of the financial sector. The latest numbers from the Federal Reserve Economic Data (FRED) system show that deposits in all US commercial banks suffered a $100 billion decline in three weeks – from [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/27/100000000000-in-deposits-exit-us-banking-system-in-three-weeks-as-fed-survey-says-banks-face-financial-stability-risks/\">$100,000,000,000 in Deposits Exit US Banking System in Three Weeks As Fed Survey Says Banks Face Financial Stability Risks</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]