[
  {
    "source": "Crypto Briefing",
    "date": "2023-08-11T11:48:39.000Z",
    "title": "Canada Pursues a Secure Digital Asset Repository as Crypto Crime Surges",
    "url": "https://cryptobriefing.com/canada-pursues-secure-digital-asset-repository/?utm_source=feed&utm_medium=rss",
    "description": "Canada's RCMP and SSC release a tender for a high-security digital vault for crypto and NFTs, a response to increasing digital asset crimes."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-11T11:50:00.000Z",
    "title": "Bitsonic CEO Arrested On Alleged Fraud Charges",
    "url": "https://cryptodaily.co.uk/2023/08/bitsonic-ceo-arrested-on-alleged-fraud-charges",
    "description": "<p>South Korean authorities have arrested the CEO of the Bitsonic crypto exchange, Jinwook Shin, for allegedly stealing $7.5 million dollars of user funds.&nbsp;</p>\nEmbezzlement Allegations\n<p>Jinwook Shin was taken into custody by South Korean authorities on August 7th after an investigation uncovered that the CEO had been allegedly embezzling investments and deposits belonging to the exchange's users during the time period between January 2019 and May 2021.&nbsp;</p>\n<p>According to the initial report, Shin allegedly engaged in fraudulent activities that manipulated cryptocurrency prices and trading volume on Bitsonic, which led to the misappropriation of approximately $7.5 million (10 billion won) from user funds.&nbsp;</p>\nLiquidity Issues Leads To Shutdown\n<p>Despite facing liquidity problems and suspension of withdrawals on the crypto platform, Shin continued to provide cryptocurrencies to new customers. This persistence drew the attention of the Seoul cyber crime department, which alleged that Shin failed to purchase cryptocurrencies during this period, raising suspicions about the legitimacy of the exchange's operations.</p>\n<p>In August 2021, the platform finally announced the closure of its operations, attributing the decision to \"internal and external issues.\"&nbsp;</p>\n<p>This announcement was followed by the shutdown of 11 domestic cryptocurrency platforms by South Korean authorities, who were investigating alleged fraudulent activities.</p>\nVice President Also Complicit\n<p>The investigation further implicated the vice president of Bitsonic, who is believed to have played a role in devising a scheme to acquire the cryptocurrencies held by the CEO within the exchange system. The VP, who is referred to as Mr. A, was allegedly working hand-in-hand with Shin to buy the cryptocurrency held by the latter on the exchange platform. A shell company established in Singapore was allegedly used in the process of manipulation.</p>\nGovernment's Stance Against Fraud And Cybercrime\n<p>South Korean authorities have recently taken a tough stance against fraudulent activities within the digital asset industry. Last month, the Korea Securities Depository partnered with Code, a firm specializing in Travel Rules, to address the rise in unlawful activities within the virtual asset market. This partnership aims to promote the issuance and utilization of Legal Entity Identifiers (LEI) to enhance investor protection.</p>\n<p>Additionally, the government has also been working on a crypto-tracking system, including an interagency investigation team, to counter cybercrime as a part of its commitment to ensuring the security and legitimacy of the cryptocurrency market.</p>\n<p>As the investigation into the alleged embezzlement unfolds, South Korea's proactive approach against fraudulent activities in the cryptocurrency sector continues to underscore the nation's commitment to fostering a secure and trustworthy digital asset environment.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-11T11:51:19.000Z",
    "title": "Binance partners with Japanese KYC provider despite privacy concerns",
    "url": "https://crypto.news/binance-partners-with-japanese-kyc-provider-despite-privacy-concerns/",
    "description": "Binance has partnered with the KYC provider known as Liquid to reenter the Japanese market. Liquid offers a facial authentication tool for KYC purposes. It uses an AI-based image processing capability. It enables identity verifications that comply with the local&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-11T12:00:05.000Z",
    "title": "Solana Cuts Saga Price By 40%, But Case For New SOL Yearly High Increases",
    "url": "https://www.newsbtc.com/news/solana/solana-cuts-saga-price-40-sol-ytd-high/",
    "description": "Solana Mobile, a subsidiary of Solana Labs, announced a significant 40% price reduction for its Saga smartphone, slashing the price from its initial $1,000 to a more affordable $599. This move comes just four months after the phone&#8217;s launch, sparking a flurry of reactions from the crypto community. The official statement from the company suggests that the price cut is a strategic move to foster wider adoption of mobile web3 and to enhance the user experience for the Solana mobile community. However, on-chain data paints a slightly different picture. According to data compiled by Flipside Crypto, sales of the Solana Saga have seen a sharp decline since their peak in April and May. This is evidenced by the number of Saga Genesis NFT mints, which are generated when a user sets up their Solana Saga smartphone and accesses the Solana app store. The chart below shows a clear downward trend of sales. Since June sales volume has been extremely flat after a successful May 2023. The price reduction has elicited mixed reactions on Twitter / X. While some early adopters expressed their frustration at purchasing the device at its original price, others defended the move, pointing out the benefits of being an early bird. Notably, early owners had the exclusive opportunity to mint Claynosaurz NFTs, which currently have a floor price of around 33 SOL on Magic Eden, translating to over $800. Related Reading: Solana (SOL) Leads Gains Among Top Coins, Is $30 Milestone Possible? Solana (SOL) Price Analysis On the flip side, the Solana (SOL) token is in bullish territory. At the time of writing, SOL was trading at $24.38. A look at the daily chart shows that SOL was able to confirm the breakout from its downtrend channel on Monday after the price found support at both the channel&#8217;s trend line and the 200-day Exponential Moving Average (EMA). As a result of this bullish confirmation, SOL broke above the 50% Fibonacci retracement level at $23.94. For now, it looks like SOL can defend the level and make a new run towards the 61.8% Fibonacci retracement level at $27.42. Related Reading: Solana Beats Out Ethereum To Emerge As Best Performer In Terms Of TVL Remarkably, on July 14, SOL reached its year-to-date peak of $32.36 and recoiled from the 78.6% Fibonacci retracement level. Subsequently, SOL dipped below the 61.8% Fibonacci level and couldn&#8217;t sustain a daily close above it. Given this context, the $27.42 price point emerges as the most pivotal resistance currently. Should a breakout occur, a clear path to the year&#8217;s high would be established. In this case, a bullish breakout seems imminent. However, strong profit taking can be expected around $32.36. If the yearly high falls, though, the bulls could target the 1.618 Fibonacci extension level at $56.86. Featured image from Disruption Banking, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-11T12:06:49.000Z",
    "title": "There Are Several Reasons to be Bullish on Ethereum: Analyst",
    "url": "https://coinedition.com/there-are-several-reasons-to-be-bullish-on-ethereum-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Its-hard-not-to-be-ridiculously-bullish-on-Ethereum.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Its-hard-not-to-be-ridiculously-bullish-on-Ethereum.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Its-hard-not-to-be-ridiculously-bullish-on-Ethereum-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Its-hard-not-to-be-ridiculously-bullish-on-Ethereum-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Its-hard-not-to-be-ridiculously-bullish-on-Ethereum-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Its-hard-not-to-be-ridiculously-bullish-on-Ethereum-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Its-hard-not-to-be-ridiculously-bullish-on-Ethereum-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Its-hard-not-to-be-ridiculously-bullish-on-Ethereum-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Its-hard-not-to-be-ridiculously-bullish-on-Ethereum-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Its-hard-not-to-be-ridiculously-bullish-on-Ethereum-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Its-hard-not-to-be-ridiculously-bullish-on-Ethereum-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Its-hard-not-to-be-ridiculously-bullish-on-Ethereum-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Its-hard-not-to-be-ridiculously-bullish-on-Ethereum-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Its-hard-not-to-be-ridiculously-bullish-on-Ethereum-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Its-hard-not-to-be-ridiculously-bullish-on-Ethereum-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Its-hard-not-to-be-ridiculously-bullish-on-Ethereum-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Its-hard-not-to-be-ridiculously-bullish-on-Ethereum-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>It is hard not to be ridiculously bullish on Ethereum, says Mike Deutscher, a self-proclaimed crypto analyst and DeFi addict. Deutscher gave reasons for his position on the pioneer altcoin&#8217;s long-term leadership. According to Deutscher, one of the major reasons Ethereum will continue to grow is because it is the choice of the biggest new [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/there-are-several-reasons-to-be-bullish-on-ethereum-analyst/\">There Are Several Reasons to be Bullish on Ethereum: Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-11T11:50:27.000Z",
    "title": "XRP Price Prediction: What to Expect in the Next 48 Hours",
    "url": "https://coinedition.com/xrp-price-prediction-what-to-expect-in-the-next-48-hours/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The value of XRP experienced a brief and notable increase to $50 on the well-known trading platform, Gemini. This surge occurred shortly after the exchange publicly declared its endorsement of XRP. According to posts by users on social media, the sudden rise in price is thought to have resulted from a glitch within the infrastructure [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrp-price-prediction-what-to-expect-in-the-next-48-hours/\">XRP Price Prediction: What to Expect in the Next 48 Hours</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-11T11:45:54.000Z",
    "title": "PayPal’s US Dollar Stablecoin Will Have Massive Impact on Ethereum, Says Bloomberg Crypto Strategist",
    "url": "https://dailyhodl.com/2023/08/11/paypals-us-dollar-stablecoin-will-have-massive-impact-on-ethereum-says-bloomberg-crypto-strategist/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Massive-Impact-on-Ethereum.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Massive-Impact-on-Ethereum.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Massive-Impact-on-Ethereum.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Massive-Impact-on-Ethereum.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Massive-Impact-on-Ethereum.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Massive-Impact-on-Ethereum.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Massive-Impact-on-Ethereum.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Bloomberg Intelligence crypto market analyst Jamie Coutts predicts PayPal’s new PayPalUSD (PYUSD) stablecoin will have a huge impact on Ethereum (ETH). Coutts says that there is massive growth potential for Ethereum even if just a small percentage of PayPal’s existing customer base adopts the stablecoin, which aims to keep a 1:1 peg to the US [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/11/paypals-us-dollar-stablecoin-will-have-massive-impact-on-ethereum-says-bloomberg-crypto-strategist/\">PayPal’s US Dollar Stablecoin Will Have Massive Impact on Ethereum, Says Bloomberg Crypto Strategist</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]