[
  {
    "source": "CoinDesk",
    "date": "2023-05-31T14:19:51.000Z",
    "title": "Binance Says 'Reevaluating' Roles After Report of Layoffs",
    "url": "https://www.coindesk.com/business/2023/05/31/binance-says-reevaluating-roles-after-report-of-layoffs/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The firm will \"focus on talent densite\" ahead of the next bull market, a spokersperson told CoinDesk."
  },
  {
    "source": "CoinDesk",
    "date": "2023-05-31T14:18:58.000Z",
    "title": "EU’s Banking Regulator Highlights AML Risks in Privacy Coins, Self-Hosted Wallets",
    "url": "https://www.coindesk.com/policy/2023/05/31/eus-banking-regulator-highlights-aml-risks-in-privacy-coins-self-hosted-wallets/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The European Banking Authority wants to extend money laundering guidance to crypto firms and banks that trade with them"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-31T14:16:30.000Z",
    "title": "EU, US should push for AI code of conduct: EU tech chief",
    "url": "https://cointelegraph.com/news/eu-tech-chief-calls-for-ai-code-of-conduct",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/a44727fe-98e4-4de7-9f4d-7fa236129025.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The EU tech chief spoke to members of the EU-U.S. Trade and Technology Council about the need for a voluntary code of conduct prior to the forthcoming laws.</p>\n                    <p><p>Lawmakers in the European Union are seeking to implement a code of conduct for the development and implementation of artificial intelligence (AI) prior to their forthcoming EU AI Act. </p><p>In a joint <a href=\"https://www.reuters.com/technology/eu-tech-chief-calls-voluntary-ai-code-conduct-within-months-2023-05-31/\" target=\"_blank\" rel=\"noopener nofollow\">meeting</a> of the EU-U.S Trade and Technology Council in Sweden on May 31, the EU tech chief Margrethe Vestager said officials in the United States and EU should push the AI industry to adopt a voluntary code of conduct within months.</p><p>According to Vestager, this would create safeguards while the new laws are still under development. She stressed that the new laws will take effect in two and a half to three years time in the “best of cases,” which is “obviously way too late.” </p><blockquote>\"We need to act now.\"</blockquote><p>Vestager is in charge of coordinating an EU strategy for data and approach to AI. She said if the EU and U.S. take the lead, they can create a code of conduct that would make everyone “more comfortable” with the trajectory of AI development.  </p><blockquote>\"That is the kind of speed you need to discuss in the coming weeks, a few months, and of course also involve industry ... in order for society to trust what is ongoing.”</blockquote><p>The tech chief said lawmakers need to agree on specifics, rather than sweeping general statements. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/what-is-fair-use-us-supreme-court-weighs-in-on-ai-s-copyright-dilemma\"><strong><em>What is fair use? US Supreme Court weighs in on AI’s copyright dilemma</em></strong></a></p><p>Meanwhile, the EU's AI Act, which will introduce <a href=\"https://cointelegraph.com/news/chatgpt-midjourney-ai-tools-make-it-into-european-agenda\">comprehensive regulations</a> for the technology, is still undergoing finalization by members of the European Parliament. </p><p>The most<a href=\"https://cointelegraph.com/news/eu-ai-act-updated-with-public-facial-recognition-ban\"> recent draft</a> of the legislation included a ban on the public use of biometric surveillance and predictive policing tools. This is in addition to AI tools needing to be classified according to their perceived risk level, ranging from low to unacceptable.</p><p>On May 25, Sam Altman, the CEO of OpenAI, the company responsible for the AI chatbot ChatGPT,<a href=\"https://cointelegraph.com/news/open-ai-warns-european-officials-over-regulations\"> addressed EU lawmakers</a> on over-regulation of the AI industry. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-blockchain-control-robots-incentivise-humans/\"><strong><em>How to control the AIs and incentivize the humans with crypto</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-31T14:15:00.000Z",
    "title": "Will Shiba inu coin price go up, experts are bullish on hybrid exchange Tradecurve.io",
    "url": "https://cryptodaily.co.uk/2023/05/will-shiba-inu-coin-price-go-up-experts-are-bullish-on-hybrid-exchange-tradecurveio",
    "description": "<p>Germany has officially entered a recession after growth contracted in the first quarter. With Germany leading the European Union&rsquo;s economy, many expect that Germany could pressure the European Central Bank to cut rates to stimulate the economy. Low-interest rates act as rocket fuel for altcoins, and analysts predict it would cause Shiba Inu (SHIB) to rally and add more fuel to Tradecurve (TCRV), a hybrid exchange that has already posted impressive growth in the past weeks.&nbsp;</p>\n<p>&gt;&gt;BUY TCRV TOKENS NOW&lt;&lt;</p>\n<p>Tradecurve (TCRV) On-Track to Raise $20 Million in PresaleTradecurve (TCRV) remains on track to raise a staggering $20 million in its presale as demand spikes. It seems the market has begun to process the value proposition of this exciting new platform that has already announced its plans to onboard 100,000 traders within three months of launch. Tradecurve will provide high leverage, anonymity, and unfettered access to global markets, including forex, stocks, crypto, and commodities. This nascent challenger in the trading industry features transparent on-chain pricing, intuitional level liquidity powering excellent fills for traders, and, most excitingly, has integrated artificial intelligence trading algorithms accessible only to $TCRV holders. Tradecurve is a derivatives platform where users stay anonymous. It provides a haven for millions of retail clients worldwide who cannot access leveraged trading products due to shortsighted government regulations.&nbsp;</p>\n<p>Analysts predict explosive growth for $TCRV expecting a 5,000% leap before the presale closes. They cited the protocol&rsquo;s AI speciality and its plans to introduce Proof of Reserves to validate these claims. Some analysts even compared it to the famous Binance Coin (BNB) ICO in 2017 that began at a price of $0.15.&nbsp;</p>\n<p></p>\n<p>Shiba Inu (SHIB) Price PredictionShiba Inu (SHIB) benefitted from the memecoin mania that descended on Crypto Twitter recently. Still, the real hype has come from the impressive metrics posted by Shibarium, a layer two scaling solution built by the developers of Shiba Inu (SHIB). Shibaroium has executed more than twelve million transactions, and it will allow Shiba Inu (SHIB) holders to swap between the native ecosystem tokens $BONE and $LEASH with lower fees. Additionally, the chain will utilize $BONE for gas fees, and rumor is gas fees will be swapped for Shiba Inu (SHIB) and burnt. Analysts have forecast a range between $0.00001473 and $0.00001762 for Shiba Inu (SHIB), which appears slightly conservative given the amount of development currently taking place on the network. The release of Shibarium perfectly encapsulates the Shiba Inu (SHIB) philosophy of being a memecoin but also delivering utility.&nbsp;</p>\n<p>&nbsp;</p>\n<p>Find out more about the Tradecurve presale here:</p>\n<p>Website: https://tradecurve.io/&nbsp;</p>\n<p>Presale:https://app.tradecurve.io/sign-up&nbsp;</p>\n<p>Telegram: https://t.me/tradecurve_official&nbsp;</p>\n<p>Twitter: https://twitter.com/Tradecurveapp&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-31T14:15:00.000Z",
    "title": "This New AI Altcoin Is On Track To Have A Bigger Growth Than Ethereum (ETH) In 2023",
    "url": "https://cryptodaily.co.uk/2023/05/this-new-ai-altcoin-is-on-track-to-have-a-bigger-growth-than-ethereum-eth-in-2023",
    "description": "<p class=\"s7\">The crypto market constantly evolves, allowing for crypto projects with better utilities and features. Some new altcoins have properties that make them stand out amongst established cryptocurrencies. Consequently, those with unique profit-making capabilities enjoy more success in the crypto market.</p>\n<p class=\"s7\">For new cryptocurrencies hoping to gain investors' trust, it is important to be backed up by properties that contribute to the token's value. One of the ways of doing this is by creating systems that can keep up with the technological evolution of the 21st century. InQubeta (QUBE) is here to usher AI technology into the crypto market this season.</p>\n<p class=\"s7\">By ensuring that crypto investors can now invest in AI start-ups, InQubeta is one of the unique altcoins that has created a new playing field for itself, and analysts suspect that it may soar higher than crypto giants like Ethereum (ETH).</p>\n<p class=\"s10\">InQubeta (QUBE) Merges AI Investment with the Crypto Market</p>\n<p class=\"s7\">InQubeta is certainly on the right path to becoming one of the biggest cryptocurrencies. With an impressive presale, InQubeta is already making the right moves to ensure that it remains relevant long after it has been launched. The presale is in its early stages and has already raised over $200,000, with more than 50% of the Beta Stage tokens sold.</p>\n<p class=\"s7\">The increased demand for QUBE tokens will only increase its value. The InQubeta platform will make significant contributions to the growth of AI technology. The way it works is that AI start-ups needing investors can create trending NFTs with inherent utilities and list them on the InQubeta platform, allowing investors to choose what kinds they want.</p>\n<p class=\"s7\">By leveraging the properties and popularity of trending NFTs, InQubeta has positioned itself as a crypto project worth long-term investment purposes. The QUBE token also offers an avenue for governance on the platform. This means that QUBE holders can use their ERC20 tokens to participate in important decisions on the platform.</p>\n<p class=\"s7\">InQubeta ensures that investors can keep in touch with innovations in the AI market. Its ERC20 tokens are an added advantage as the Ethereum blockchain successfully allows the platform to host its NFT marketplace. What makes it all the more impressive is that InQubeta is projected to grow more than Ethereum in 2023.</p>\n<p>Visit InQubeta Presale </p>\n<p class=\"s10\">Ethereum (ETH) Opens the Door to a New Generation of Crypto Tokens</p>\n<p class=\"s7\">Ethereum (ETH) was one of the cryptocurrencies created to serve as an alternative to Bitcoin. It is now one of the largest cryptocurrencies in the world. A large portion of Ethereum's popularity is because it allows other cryptocurrencies to grow.</p>\n<p class=\"s7\">Several projects rely on the Ethereum blockchain, and numerous tokens rely on the Ethereum standard, making it a valuable addition to the crypto market. Many of these tokens are in the top 100 list on the DeFi market.</p>\n<p class=\"s7\">ETH was the first project to introduce the idea of smart contracts, making it possible for different parties to carry out transactions with each other. Overall, Ethereum has reduced transaction costs and increased the number of operations on its blockchain. By introducing periodic updates, Ethereum can stay ahead of the demands of the crypto market. It also allows for a cryptocurrency, such as InQubeta, to potentially experience bigger growth.</p>\n<p class=\"s7\">Conclusion</p>\n<p class=\"s7\">What better way to make money from the DeFi market than to invest in new crypto projects like InQubeta? This AI cryptocurrency is already on the way to making a name for itself worldwide. Every indication indicates that InQubeta could grow bigger than Ethereum in 2023.</p>\n<p class=\"s7\">Buying QUBE tokens from the InQubeta presale presents an opportunity to make more profit. The token's value increases further as time passes, ensuring that early investors can make more money. Be a part of InQubeta now to benefit from the evolution of the AI market.</p>\n<p>Join InQubeta Communities</p>\n<p class=\"s13\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-31T14:15:00.000Z",
    "title": "New Huo Technology and LD Capital US Launch 100% Virtual Asset Fund",
    "url": "https://cryptodaily.co.uk/2023/05/new-huo-technology-and-ld-capital-us-launch-100-virtual-asset-fund",
    "description": "<p class=\"s8\">Hong Kong - New Huo Technology Holdings Limited (stock code: 1611.HK, &ldquo;New Huo Tech&rdquo;) has announced a partnership with LD Capital US to launch a fund that will provide eligible professional investors with a unique opportunity to invest 100% in virtual assets. The fund will adopt an active investment strategy by New Huo Asset Management (Hong Kong) Limited (&ldquo;NH Asset&rdquo;), a subsidiary of New Huo Tech.</p>\n<p class=\"s8\">NH Asset will be the fund manager of this actively managed fund launched in partnership with LD CapitalUS. The fund will focus on virtual assets and will target professional investors who have undergone rigorous risk and virtual asset knowledge assessments.</p>\n<p class=\"s8\">Leveraging NH Asset&rsquo;s investment management experiences and LD Capital US&rsquo;s investment research team, this collaboration will offer investors greater access to the virtual asset market and generate returns with risk mitigated.</p>\n<p class=\"s8\">About NH Asset</p>\n<p class=\"s8\">NH Asset is a subsidiary of New Huo Tech. It is a leading provider of institutional-level virtual asset management services, which holds a Type 4 (Advising on Securities) and Type 9 (Asset Management) license issued by the Hong Kong Securities and Futures Commission (&ldquo;HKSFC&rdquo;) and was approved tomanage investment portfolios which invest 100% in virtual assets. It is the first HKSFC-licensed virtual asset fund manager to actively manage virtual asset funds and can accept subscriptions in both fiat and virtual assets. NH Asset currently manages seven funds, including a Bitcoin tracker fund, an Ethereum tracker fund, two multi-strategy virtual asset funds, a blockchain venture capital fund, and two private equity funds related to blockchain mining operations. NH Asset's services are only available to professional investors as defined by the Securities and Futures Ordinance and its subsidiary legislation.</p>\n<p class=\"s8\">About LD Capital US</p>\n<p class=\"s8\">LD Capital US (&ldquo;LD&rdquo;) is a virtual asset investment-themed fund that specializes in investing in virtual assets in the secondary market. Its sub-funds consist of beta-enhanced funds such as POS-enhanced, ETH-enhanced, and BITO-enhanced portfolios. LD aims to create a positive impact and sustainable value on a global scale by effectively capturing market investment opportunities, actively participating in ecological infrastructure, and adopting effective wealth management strategies to adhere to bull and bear market cycles.</p>\n<p class=\"s8\">Twitter:</p>\n<p class=\"s8\">LD Capital: https://twitter.com/ld_capital</p>\n<p class=\"s8\">New Huo Tech: https://twitter.com/New_Huo_Tech</p>\n<p class=\"s8\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-31T14:30:43.000Z",
    "title": "Stablecoin Economy Reaches 20-Month Low as BUSD Redemptions Surpass 10 Billion Tokens in 3 Months",
    "url": "https://news.bitcoin.com/stablecoin-economy-reaches-20-month-low-as-busd-redemptions-surpass-10-billion-tokens-in-3-months/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/bud-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Stablecoin Economy Reaches 20-Month Low as BUSD Redemptions Surpass 10 Billion Tokens in 3 Months\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/bud-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/bud-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/bud-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/bud-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/bud-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/bud-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/bud.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Three months have passed since Paxos made the decision to cease the production of new BUSD tokens, complying with the directive issued by the New York Department of Financial Services (NYDFS). Since February 13, 2023, 10.62 billion BUSD tokens have been redeemed thus far. Within the span of the last 30 days, slightly more than [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T14:09:42.000Z",
    "title": "Indian banks to embrace AI and blockchain revolution",
    "url": "https://www.cryptopolitan.com/indian-banks-to-embrace-ai-and-blockchain/",
    "description": "Mahesh Kumar Jain, the Deputy Governor of the Reserve Bank of India (RBI), has urged the country&#8217;s banking sector to embrace the transformative potential of artificial intelligence (AI) and blockchain technologies. This advice, underpinning the vital role of innovation in fostering sustainable growth and stability, came during a recent conference organized by the RBI for ... <a title=\"Indian banks to embrace AI and blockchain revolution\" class=\"read-more\" href=\"https://www.cryptopolitan.com/indian-banks-to-embrace-ai-and-blockchain/\" aria-label=\"More on Indian banks to embrace AI and blockchain revolution\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-31T14:37:32.000Z",
    "title": "Former Coinbase employees settle insider trading case with SEC",
    "url": "https://crypto.news/former-coinbase-employees-settle-insider-trading-case-with-sec/",
    "description": "Ishan Wahi, a former product manager at Coinbase crypto exchange, and his brother Nikhil Wahi have reportedly settled their insider trading case with the United States Securities and Exchange Commission (SEC). "
  },
  {
    "source": "BTCManager",
    "date": "2023-05-31T14:11:13.000Z",
    "title": "Deutsche Telekom joins Polygon’s validator ecosystem ",
    "url": "https://crypto.news/deutsche-telekom-joins-polygons-validator-ecosystem/",
    "description": "Deutsche Telecom has announced that it’s now part of the Polygon (MATIC) validator ecosystem, and offering users staking services."
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-31T14:20:00.000Z",
    "title": "ETH Price Slide Halts as Bulls Step In: Is Positive Momentum Ahead?",
    "url": "https://coinedition.com/eth-price-slide-halts-as-bulls-step-in-is-positive-momentum-ahead/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/ETHs-Mean-Block-Size-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"ETH’s Mean Block Size\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/ETHs-Mean-Block-Size-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/ETHs-Mean-Block-Size-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/ETHs-Mean-Block-Size-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/ETHs-Mean-Block-Size-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/ETHs-Mean-Block-Size-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/ETHs-Mean-Block-Size.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In the previous 24 hours, negative momentum has dominated the Ethereum (ETH) market, with the price sliding from a 24-hour high of $1,916.57 to an intraday low of $1,860.37.&#160; As of press time, the ETH price was still falling, valued at $1,867.77, a 2.48% drop from its previous closing. During the bear reign, ETH&#8217;s market [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/eth-price-slide-halts-as-bulls-step-in-is-positive-momentum-ahead/\">ETH Price Slide Halts as Bulls Step In: Is Positive Momentum Ahead?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-31T14:30:20.000Z",
    "title": "There’s Nothing More Bullish for Bitcoin and Gold Than This Pivotal Moment: Investment Strategist Luke Gromen",
    "url": "https://dailyhodl.com/2023/05/31/theres-nothing-more-bullish-for-bitcoin-and-gold-than-this-pivotal-moment-investment-strategist-luke-gromen/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/This-Pivotal-Moment-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/This-Pivotal-Moment-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/This-Pivotal-Moment-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/This-Pivotal-Moment-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/This-Pivotal-Moment-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/This-Pivotal-Moment-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/This-Pivotal-Moment-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Macro investor Luke Gromen is naming one pivotal moment that could send both gold and Bitcoin (BTC) flying. In a recent interview on Blockworks Macro, Gromen says that he believes Bitcoin and gold will win &#8220;either way in the end.&#8221; According to the investment strategist, Bitcoin and gold will likely turn bullish the moment the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/31/theres-nothing-more-bullish-for-bitcoin-and-gold-than-this-pivotal-moment-investment-strategist-luke-gromen/\">There’s Nothing More Bullish for Bitcoin and Gold Than This Pivotal Moment: Investment Strategist Luke Gromen</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]