[
  {
    "source": "Decrypt",
    "date": "2023-10-21T15:01:02.000Z",
    "title": "NASA Prepares Deep Space Mission—Why AI Will Play Important Role",
    "url": "https://decrypt.co/202611/nasa-prepares-deep-space-mission-why-ai-play-important-role",
    "description": "NASA's Nancy Grace Roman Telescope, launching May 2027, aims to unravel dark matter mysteries and honor Roman's legacy in astronomy."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-21T14:40:12.000Z",
    "title": "Hong Kong to crack down on crypto money launderers in the aftermath of $193M JPEX scandal",
    "url": "https://cryptoslate.com/hong-kong-to-crack-down-on-crypto-money-launderers-in-the-aftermath-of-193m-jpex-scandal/",
    "description": "<p>Hong Kong&#8217;s Customs and Excise Department is looking to tighten regulatory measures to address the money-laundering risks associated with cash-for-crypto shops, South China Morning Post reported on Oct. 21. The decision comes after police arrested some of these store owners in connection with the alleged $192.7 million fraud perpetrated JPEX crypto exchange. In Hong Kong, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/hong-kong-to-crack-down-on-crypto-money-launderers-in-the-aftermath-of-193m-jpex-scandal/\">Hong Kong to crack down on crypto money launderers in the aftermath of $193M JPEX scandal</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-21T15:00:11.000Z",
    "title": "Ethereum ICO Participant Wakes Up After 8 Years, Moves $3 Million In ETH",
    "url": "https://www.newsbtc.com/ethereum-news/ethereum-ico-participant-wakes-up-after-8-years-moves-3-million-in-eth/",
    "description": "The Ethereum initial coin offering (ICO), which took place in 2014, represents one of the most significant events in the history of cryptocurrency. As the network had not begun generating tokens autonomously, the ICO event allowed early investors and enthusiasts to accumulate ETH, currently the second-largest cryptocurrency by market cap. Latest on-chain data shows that one of the ICO participants has become active for the first time in more than eight years, transferring their pre-mined stash of Ether tokens to different addresses on Saturday, October 21.  💤 A dormant pre-mine address containing 2,000 #ETH (3,198,920 USD) has just been activated after 8.2 years!https://t.co/0Mpx77N5fs — Whale Alert (@whale_alert) October 21, 2023 Ethereum ICO Participant Awakens From Dormancy According to blockchain data tracker Lookonchain, the address, which was part of the Ethereum Genesis, initially received 2,000 ETH over eight years ago. At the time, the Ether tokens were purchased for $620 at an ICO price of $0.31 per token. On Saturday, the ETH tokens in question changed wallets for the first time.  The wallet holding the pre-mined stash of ETH had been dormant for exactly 8.2 years (July 2015). Thanks to the exponential growth of Ethereum and the entire crypto market, the value of these holdings has grown to nearly $3.2 million at the current price.  Related Reading: Ethereum Price Defies Gravity, Here’s What Could Spark Bullish Moves In the X (formerly Twitter) post, Lookonchain highlighted that the ICO participant transferred the Ethereum tokens to four different addresses. About 500 Ether tokens were sent to each address, with minutes separating the transactions. It remains to be seen whether the wallet owner is preparing to sell the tokens, stake on the network, or carry out other transactions. In the event of a sell-off, though, the price of ETH may experience momentary downward pressure. Large transfers from early ICO participants are not exactly common occurrences, but there have already been a couple of similar transactions in 2023. Notably, an ICO participant moved $116 million worth of pre-mined ETH to a Kraken exchange address in July. ETH Price Overview As of this writing, Ethereum’s price stands at $1,605, reflecting a 0.7% decline in the past day. This comes on the back of a week where the value of ETH showed signs of recovery, registering a 3.8% price increase in the past seven days. Related Reading: Coinbase Bullish: Bitcoin ETF Approval Expected After SEC’s Defeat The past week was dominated mainly by the optimistic performance of Bitcoin and the false news of a spot ETF approval. This positive run of BTC, however, eventually rubbed on the broader cryptocurrency market, including the price of Ethereum. Ethereum price hovers around the $1,600 mark on the daily timeframe &#124; Source: ETHUSDT chart on TradingView Featured image from The Economic Times, chart from TradingView"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-21T14:39:45.000Z",
    "title": "xDay 2023 Day 3: Runtime And MultiversX Launch ZK Rolloups Backed With NASA Tech",
    "url": "https://www.newsbtc.com/news/xday-2023-day-3-runtime-and-multiversx-launch-zk-rolloups-backed-with-nasa-tech/",
    "description": "In the next three days, our team at NewsBTC will cover xDay 2023, an event organized by MultiversX in the Palace of Parliament, Romania. Formerly known as Elrond, the project rebranded in 2022 and focused on the Metaverse, scalability, and global adoption by simplifying users’ access to crypto. Related Reading: xDay 2023 Day 3: Interview With Bogdan-Gruia Ivan, Romanian Minister of Research, Innovation and Digitalization During the event&#8217;s final day, security audit firm Runtime Verification announced the launch of PI Squared, a universal ZK Rollup that will run on the MultiversX blockchain. The scaling solution is backed by technology developed by the U.S. National Aeronautics and Space Administration (NASA). Grigore Rosu, CEO and President at Runtime Verification presented this solution on the event&#8217;s main stage. PI Squared aims to make the MultiversX ecosystem more efficient and attract new developers to ship products on this network by reducing verifying computational claims to verifying mathematical proofs. According to a press release shared with our team, the scalability solution will use a universal proof check implemented via a custom ZK circuit. PI Squared was developed as a programming language and Virtual Machine (VM) agnostic. In other words, developers can work on products with any programming language and bring their app to MultiversX more efficiently while maintaining the underlying security and scalability of the MultiversX blockchain. xDay 2023: Interview With Grigore Rosu, CEO Of Runtime Verification After the presentation at xDay 2023, our team got to speak with Grigore Rosu about his impression of xDay, the sentiment, and what PI Squared represents for MultiversX and the entire space, as the solution can be implemented and leveraged by any developer in any programming language. This is what he told us. Q: How do you feel here? What do you think about the atmosphere and the people? A: This is a wonderful conference. It&#8217;s unbelievable how many people are here. More than 2000 people. I didn&#8217;t expect that. I&#8217;ve been at several recent crypto conferences and it was hard to fill the room or even fill the first few rows of seats in the room. But this is just packed with two big amphitheaters and everything is just packed and people are amazing. Discussions are amazing. The MultiversX team is amazing. It&#8217;s just wonderful to be here. Q: What makes the MultiversX ecosystem, and their team, unique and why did you decided to work on this network? A: I knew them from day zero. I&#8217;m an advisor for Multiverses X and I met Beniamin Mincu (Co-founder of MultiversX) before, right after they had a white paper written (…). I really liked them from the beginning and in one word I think is passion. Indeed, they are very passionate about what they do. They believe in it, and when you believe in something, it happens. Self prophecy, they have one of the fastest, most reliable blockchains out there, the lowest fees. And it has never stalled. Like other blockchains, it works as specified, fast, cheap, and also programming language efficient. I think it was a good idea not to use EVM (Ethereum Virtual Machine) as an execution infrastructure because EVM is a pretty ad hoc language that was invented quickly to serve a specific purpose to launch Ethereum. But everybody who writes programs or audits them knows that EVM has many limitations. So I think it was a smart that they didn&#8217;t use EVM. I would say passion and good decisions along the way. That&#8217;s what I like the most about. Q: What does the launch of the PI Square protocol mean for the users? A: So we had this idea for a while now, it took shape. We have a prototype and we needed a destination chain to launch it as a universal ZK roll-up. Speaker 2 (05:09): in PI Square, there is no predetermined language, but we need a destination chain because we do not want to have to implement a decentralized network and consensus algorithms right away. We&#8217;d like to stage it. You ultimately, we may do that, but we&#8217;d like to stage it. So we&#8217;d like to first deploy by squared as a universal scale up on a destination chain. And to be honest, I cannot think of any better destination chain than MultiversX for the same reasons I told you before. It&#8217;s cheap. If we do it on Ethereum, for example, we&#8217;ll have to pay very high fees to do transactions as we prototype. There is a lot of word prototyping development before you launch and all those translate into transactions, big transactions, very expensive transactions on the destination chain. So think about it this way in one sentence. So PI squared will bring all the programming languages and virtual machines to multiverse X, but without the errors that usually come with compilers or interpreters. Developers will develop programs better faster, and that is expected to increase the number of applications that we&#8217;ll see on multiple sec and ultimately more users, happier users. Related Reading: xDay Event Day 2: Google, Amazon, Binance Labs, And A Chat With Sunny Aggarwal As of this writing, Bitcoin trades at $29,800 with sideways movement in the last 24 hours. Cover image from MultiversX, chart from Tradingview"
  }
]