[
  {
    "source": "Cointelegraph",
    "date": "2023-10-07T16:05:00.000Z",
    "title": "What is finality in blockchain, and why does it matter?",
    "url": "https://cointelegraph.com/explained/what-is-finality-in-blockchain-and-why-does-it-matter",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/42f3681baee171ad51b17f4ff69bfbf6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Finality ensures irreversible transactions — crucial for trust and security — prevents double-spending and fraud, and keeps blockchain records immutable. </p>\n                    <p><div data-ct-widget=\"explained-block\" id=\"explained-block-117911-4\">            <h2 data-ct-widget=\"explained-block-title\">                Understanding finality in blockchain            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Finality in blockchain refers to the unchangeable confirmation of a transaction or a block of transactions.</em></p><p>In conventional financial systems, once a transaction is confirmed, it cannot be undone. Similarly, attaining finality on a <a href=\"https://cointelegraph.com/learn/how-does-blockchain-work-everything-there-is-to-know\">blockchain network</a> ensures that a transaction is permanent and cannot be modified after it has been added to the blockchain. For the blockchain to be secure and authentic, this concept is crucial.</p><p>Finality is attained by the blockchain network’s use of consensus. Different blockchain networks employ various consensus algorithms, each with a unique method of validating transactions and ensuring finality, such as<a href=\"https://cointelegraph.com/learn/proof-of-stake-vs-proof-of-work:-differences-explained\"> proof-of-work (PoW), proof-of-stake (PoS)</a> or practical Byzantine fault tolerance.</p><h3>Types of finality in blockchain</h3><p>Finality in blockchain can be probabilistic, economic, instant, unconditional or related to the entire state of the blockchain.</p><p>On the blockchain, there are various types of finality, each of which describes a distinct degree of certainty and irreversibility with regard to transactions and blocks. The main finality types on blockchain are as follows:</p><h4>Probabilistic finality</h4><p>Finality is probabilistic in the majority of blockchain systems, especially those that employ<a href=\"https://cointelegraph.com/learn/what-is-bitcoin-a-beginners-guide-to-the-worlds-first-cryptocurrency\"> PoW consensus, like Bitcoin</a>. The likelihood of reversing a transaction diminishes exponentially when blocks are put on top of a confirmed transaction after it has been included in a block.</p><h4>Economic finality</h4><p>The economic finality concept is often associated with PoS systems. A transaction is considered final in terms of economic finality if going back on it would be financially unviable. In PoS, validators or nodes are required to provide a stake as collateral, a specific quantity of<a href=\"https://cointelegraph.com/learn/what-is-a-cryptocurrency-a-beginners-guide-to-digital-money\"> cryptocurrency</a>. If they approve fake transactions, they run the risk of losing their stake, making it economically irrational to act maliciously.</p><h4>Instant finality</h4><p>The Ripple network offers near-instant finality, ensuring that once a transaction is recorded on the ledger, it is immediately confirmed and irreversible. Transactions are validated by 150  validators. These validators may potentially earn a spot in <a href=\"https://cointelegraph.com/learn/what-is-ripple-a-beginners-guide-for-understanding-ripple\">Ripple’s Unique Node List</a>, which comprises 35 validators.</p><h4>Unconditional finality</h4><p>When a transaction is confirmed, it is deemed to be fully and unconditionally final. Under no circumstances is the transaction susceptible to being undone. It can be difficult to achieve unconditional finality and frequently calls for a strong degree of centralization or a unique consensus method.</p><h4>State finality</h4><p>In some blockchain systems, finality refers to the complete state of the blockchain, not just transactions. A state transition (a change in the blockchain’s state, such as a transaction or the execution of a smart contract) cannot be modified or reversed once it has been finished. For applications like smart contracts, where the accuracy of the entire application state is vital, achieving state finality is essential.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-117911-3\">            <h2 data-ct-widget=\"explained-block-title\">                Why finality matters in blockchain            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Finality in blockchain provides the necessary assurance of transaction validity and permanence, making it a foundational concept for the technology’s reliability and functionality.</em></p><p>Finality provides a high level of security and trust in the system, which makes sure that once a transaction is confirmed, it cannot be changed or reversed. By verifying that the transaction is legitimate and logged on the blockchain, finality prevents the<a href=\"https://cointelegraph.com/explained/how-to-mitigate-the-security-risks-associated-with-crypto-payments\"> issue of double spending</a>, which is where the same digital asset can be used more than once. </p><p>Double spending might occur, for instance, if someone had one Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and attempted to transmit it in two separate transactions to two different receivers. By guaranteeing finality, blockchain technology prevents this from happening. Once a transaction is confirmed and recorded on the blockchain, the digital asset is deemed spent and cannot be used in any further transactions.</p><p>Finality is crucial in the context of smart contracts. The details of the agreement between the buyer and seller are directly embedded in smart contracts, which are self-executing code. Finality guarantees that these contracts’ outcomes are deterministic and unalterable.</p><p>Additionally, finality is how<a href=\"https://cointelegraph.com/learn/what-are-dapps-everything-there-is-to-know-about-decentralized-applications\"> decentralized applications (DApps)</a> make sure their activities are safe and trustworthy. Finality ensures that decisions and transactions made within<a href=\"https://cointelegraph.com/news/difference-between-dapps-and-protocols\"> these applications are unchangeable and irreversible</a>. Moreover, the blockchain develops trust among the network’s users and members by making transactions final. Users’ trust in the system is increased by knowing that transactions are irreversible.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-117911-2\">            <h2 data-ct-widget=\"explained-block-title\">                Challenges to achieving finality in blockchain            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Issues such as forking, network latency, smart contract vulnerabilities and<a href=\"https://cointelegraph.com/news/what-is-a-51-attack-and-how-to-detect-it\"> 51% attacks</a> prevent blockchain transactions from achieving finality.</em></p><p>When the blockchain splits into several paths, forking happens, producing different versions of the transaction history. The consensus method is put to the test by this divergence, which makes it challenging to establish which version is the legitimate one and delays finality.</p><p>For instance, <a href=\"https://cointelegraph.com/learn/soft-fork-vs-hard-fork-differences-explained\">hard forks</a> can result from disagreements among the community or developers on protocol updates. Until the issue is settled, different factions might continue supporting PoW blockchains, resulting in a lack of finality.</p><p><a href=\"https://cointelegraph.com/explained/why-low-latency-is-important-for-cryptocurrency-exchanges-explained\">Network latency</a>, or the delay in data communication between nodes, further complicates matters. Slow network connections can cause errors in transaction order and validation by delaying the propagation of transaction information across the blockchain network.</p><p>Additionally, a<a href=\"https://cointelegraph.com/news/5-smart-contract-vulnerabilities\"> smart contract’s vulnerability</a> could result in unexpected behavior, allowing bad actors to take advantage of it and reverse transactions. Similarly, an entity that has more than 50% of the network’s mining power in a PoW blockchain may be able to change the history of the blockchain and reverse transactions. This undermines finality and security.</p><p>Due to these concerns, the blockchain’s integrity is jeopardized, necessitating the implementation of strong consensus algorithms and effective network protocols by developers in order to reduce forking and latency problems and guarantee the timely and secure finality of transactions.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-117911-1\">            <h2 data-ct-widget=\"explained-block-title\">                Techniques and consensus algorithms to enhance finality            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Longer confirmation periods, multiple validations and cutting-edge security algorithms, such as Algorand’s Pure PoS, delegated PoS (DPoS) and HoneyBadgerBFT, may help enhance blockchain finality.</em></p><p>One approach involves longer confirmation times, allowing for a greater number of validations before a transaction is considered final. The probability of a transaction’s validity being confirmed and becoming irreversible is considerably increased by lengthening the time it takes to reach consensus.</p><p>Furthermore, using the multiple confirmations technique, where transactions are checked by many nodes or validators, offers an additional layer of security, ensuring a wider consensus and lowering the possibility of mistakes or malicious attacks.</p><p>In addition, innovative consensus algorithms such as <a href=\"https://cointelegraph.com/news/what-is-the-algorand-blockchain-and-how-does-it-work\">Algorand’s Pure PoS</a>, DPoS and HoneyBadgerBFT have transformed the industry.<a href=\"https://cointelegraph.com/news/what-is-avalanche-network-avax-and-how-does-it-work\"> </a>Algorand uses a PoS method in conjunction with a Byzantine agreement protocol to ensure quick and irreversible finality for transactions. </p><p>By implementing a <a href=\"https://cointelegraph.com/explained/how-to-stake-cryptocurrencies-in-2022-explained\">reputation-based system</a> where a small group of trusted delegates validate transactions, DPoS increases the network’s effectiveness and finality. Similarly, the HoneyBadgerBFT algorithm improves finality and security even in the presence of malevolent nodes or network delays by achieving asynchronous Byzantine consensus.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-117911-0\">            <h2 data-ct-widget=\"explained-block-title\">                Future trends and developments in achieving faster and more reliable finality            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>In essence, a multidisciplinary strategy that incorporates diverse consensus techniques, cutting-edge encryption and improved interoperability is necessary to achieve speedier and more reliable finality in the future.</em></p><p>The exposure of hybrid consensus models is one such trend. These hybrid consensus algorithms strive to increase scalability and performance while retaining strong security by combining the advantages of various consensus algorithms. Projects have been experimenting with incorporating PoS methods since they consume substantially less energy than PoW techniques and speed up confirmation times.</p><p>Additionally, there is a growing interest in advanced cryptographic methods like <a href=\"https://cointelegraph.com/explained/zero-knowledge-proofs-explained\">zero-knowledge (ZK) proofs</a> and innovative technologies, such as sharding. Zero-knowledge proofs improve efficiency and privacy by enabling parties to validate transactions without disclosing private information. Sharding, a method for<a href=\"https://cointelegraph.com/explained/sharding-explained\"> dividing the blockchain</a> into smaller, more manageable parts, lessens the computational burden on nodes and speeds up the processing of transactions.</p><p>The<a href=\"https://cointelegraph.com/learn/cryptocurrency-vs-quantum-computing-a-deep-dive-into-the-future-of-cryptocurrencies\"> development of quantum computing</a> may render existing encryption techniques obsolete, necessitating the creation of quantum-resistant algorithms. To maintain the security and finality of transactions in the face of quantum threats, blockchain networks are actively investigating quantum-resistant cryptographic solutions.</p><p>Another area of focus is how different blockchains interact with one another. Through the use of protocols like<a href=\"https://cointelegraph.com/learn/what-is-polkadot-dot-a-beginners-guide-to-the-decentralized-web-3-0-blockchain\"> Polkadot</a> and Cosmos, transactions between networks can be completed quickly and seamlessly. This interoperability improves the overall effectiveness of blockchain systems, resulting in quicker and more trustworthy finality.</p>            </p>        </div>    </p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-10-07T15:50:13.000Z",
    "title": "What to expect when FTX founder Sam Bankman-Fried’s trial resumes for day 5",
    "url": "https://crypto.news/what-to-expect-when-ftx-founder-trial-resumes-day-5/",
    "description": "Caroline Ellison, along with former FTX CTO Gary Wang, pleaded guilty in December. Since then, they have been working with the U.S. attorney’s office in Manhattan. "
  }
]