[
  {
    "source": "CoinDesk",
    "date": "2023-06-27T11:37:29.000Z",
    "title": "Dubai: Launching a Crypto Regulatory Arm to Become a Global Financial Power",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/27/dubai-launching-a-crypto-regulatory-arm-to-become-a-global-financial-power/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The center of the crypto universe has been shifting toward the UAE since March 2022, when Dubai announced the world’s first independent crypto regulator, the Virtual Asset Regulatory Authority. With its state intention to provide legal clarity for crypto, the No. 5 spot in CoinDesk’s Crypto Hubs 2023 has attracted jurisdiction shoppers such as Binance CEO Changpeng Zhao and crypto exchange WazirX."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-27T11:36:36.000Z",
    "title": "Abu Dhabi: A Wealthy Middle-East Capital Creating a Bridge From TradFi to Crypto",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/27/abu-dhabi-a-wealthy-middle-east-capital-creating-a-bridge-from-tradfi-to-crypto/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The heart of crypto in the capital of the United Arab Emirates is actually just offshore in the Abu Dhabi Global Markets, an economic free zone. With a mandate to encourage fintech, the No. 6 spot in CoinDesk’s Crypto Hubs 2023 keeps the lines of communications open between regulators and crypto institutions."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-27T11:33:11.000Z",
    "title": "Wyoming: Regulatory Clarity and Crypto-Friendly Banks Fuel Blockchain Revolution",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/27/wyoming-regulatory-clarity-and-crypto-friendly-banks-fuel-blockchain-revolution/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "America’s least populous state has passed three dozen laws regulating crypto. That has helped attract crypto, blockchain and Web3 employers and made the No. 7 spot in CoinDesk’s Crypto Hubs 2023 the most crypto-friendly state in an otherwise uncertain U.S. regulatory environment."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-27T11:31:55.000Z",
    "title": "Silicon Valley: The Mecca for Venture Capital May Be Cooling on Crypto",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/27/silicon-valley-the-mecca-for-venture-capital-may-be-cooling-on-crypto/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The storied birthplace of the U.S. tech industry is dripping with talent and money. But crypto founders who live in the No. 8 spot on CoinDesk’s Crypto Hubs 2023 list say that Web3 is losing ground to artificial intelligence in the race to capture the Valley's wallets and minds."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-27T11:31:01.000Z",
    "title": "Austin: Where Remote-Work Crypto Developers Actually Choose to Live",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/27/austin-where-remote-work-crypto-developers-actually-choose-to-live/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A critical mass of the world’s top Bitcoin developers and mining companies call the No. 9 spot in CoinDesk’s Crypto Hubs 2023 their home, lured by the city’s attractive weather, live music and food scene, as well as the lack of state income taxes."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-27T11:30:10.000Z",
    "title": "Berlin: The Center for Decentralized Finance – and Techno Music",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/27/berlin-the-center-for-decentralized-finance-and-techno-music/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "When the tech hub of Europe meets a society that prizes financial autonomy, the result is a crypto community that practices the very decentralization it preaches. Case in point: Blockchain Week Berlin, the flagship annual conference of the No. 10 spot in CoinDesk’s Crypto Hubs 2023, is a self-organized, crypto-agnostic community initiative."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-27T11:28:20.000Z",
    "title": "Los Angeles: Where Hollywood Magic and Creativity Meet Web3",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/27/los-angeles-where-hollywood-magic-and-creativity-meet-web3/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The City of Angels is a global influencer in art, fashion and, especially, entertainment. Less known are its significant contributions in technology innovation. Together, the No. 11 spot on CoinDesk’s Crypto Hubs 2023 is a Web3 power. Plus it has the best movie stars."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-27T11:20:21.000Z",
    "title": "New York City: A Crypto Sandbox in a Big Business Playground",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/27/new-york-city-a-crypto-sandbox-in-a-big-business-playground/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Big Apple is big everything. The world’s financial center, it also has a huge population not only of talented developers to hire, but consumers to sell to. In such a huge and bustling ecosystem, crypto may not rate as the city’s highest priority. But like it or not, the No. 12 spot in CoinDesk’s Crypto Hubs 2023 is a place crypto companies must be."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-27T11:16:50.000Z",
    "title": "How We Ranked CoinDesk’s Crypto Hubs 2023: Our Methodology",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/27/how-we-ranked-coindesks-crypto-hubs-2023-our-methodology/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "As veterans of past city lists we aimed to produce a meaningful ranking of the best places in the world to live and work in crypto, blockchain and Web3. Here’s how we did it."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-27T11:15:32.000Z",
    "title": "Vancouver: A Boutique Hub for Crypto Early Adopters",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/27/vancouver-a-boutique-hub-for-crypto-early-adopters/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "This small and picturesque coastal city has plenty of crypto jobs, companies and events. But the No. 13 spot in CoinDesk’s Crypto Hubs 2023 is handcuffed by regulatory uncertainty in Canada, generally, that recently has led to national exits of major crypto exchanges Binance, Bybit and OKX."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-27T11:25:28.000Z",
    "title": "Binance Motion on SEC’s ‘Misleading’ Public Language Denied",
    "url": "https://decrypt.co/146378/binance-motion-on-secs-misleading-public-language-denied",
    "description": "The presiding judge denied Binance's motion in the case without the U.S. regulator having to defend against it."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-27T11:30:21.000Z",
    "title": "Bitcoin Mining ‘the Highest User of Sustainable Energy’ New Data Reveals",
    "url": "https://news.bitcoin.com/bitcoin-mining-the-highest-user-of-sustainable-energy-new-data-reveals/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/minerssdd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Mining &#039;the Highest User of Sustainable Energy&#039; New Data Reveals\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/minerssdd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/minerssdd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/minerssdd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/minerssdd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/minerssdd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/minerssdd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/minerssdd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin mining is the highest user of sustainable energy and has similarly achieved the highest increase in sustainable energy mix between July 2019 and June 2023, new data has shown. The data also shows that bitcoin mining’s emission intensity has declined from more than 500 g/kWh seen in July 2021 to the June 2023 figure [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T11:25:56.000Z",
    "title": "U.S. court rejects Binance’s request to restrain SEC’s press releases",
    "url": "https://www.cryptopolitan.com/u-s-court-rejects-binances-request-to-restrain-secs-press-releases/",
    "description": "U.S. District Court Judge Amy Berman Jackson dismissed a motion from Binance.US, Binance Holdings Limited, and CEO Changpeng &#8220;CZ&#8221; Zhao, seeking to curtail the Securities and Exchange Commission&#8217;s (SEC) language use in its press releases about the ongoing case against the crypto exchange giant​. Binance&#8217;s legal team argued that the SEC&#8217;s public pronouncements about the ... <a title=\"U.S. court rejects Binance&#8217;s request to restrain SEC&#8217;s press releases\" class=\"read-more\" href=\"https://www.cryptopolitan.com/u-s-court-rejects-binances-request-to-restrain-secs-press-releases/\" aria-label=\"More on U.S. court rejects Binance&#8217;s request to restrain SEC&#8217;s press releases\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-27T11:37:00.000Z",
    "title": "Crypto users baffled by missing funds on Bitbns",
    "url": "https://crypto.news/crypto-users-baffled-by-missing-funds-on-bitbns/",
    "description": "Bitbns customers woke up to find their digital wallets cleaned out. This unfolding saga is a testament to the new-age challenges the burgeoning crypto market continues to face. The unthinkable happened on July 27 morning in the fleeting digital universe&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-27T11:27:14.000Z",
    "title": "FTX recovers $7b, making strides in creditor repayment",
    "url": "https://crypto.news/ftx-recovers-7b-making-strides-in-creditor-repayment/",
    "description": "FTX, the cryptocurrency conglomerate formerly helmed by Sam Bankman-Fried, has successfully retrieved a substantial portion of the outstanding funds owed to its creditors, per information from a report. According to a recent Bloomberg article, the current management of FTX, led&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-27T11:16:29.000Z",
    "title": "Monopoly darknet market admin indicted in US",
    "url": "https://crypto.news/monopoly-darknet-market-admin-indicted-in-us/",
    "description": "A citizen of Croatia and Serbia, suspected of establishing and managing the now-inoperative darknet marketplace Monopoly Market, has been indicted by a grand jury in the District of Columbia. 33-year-old Milomir Desnica is alleged to have operated Monopoly Market since&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-27T11:34:07.000Z",
    "title": "ETHBTC Just Hit A 300-Day Low. What To Expect Next",
    "url": "https://www.newsbtc.com/analysis/eth/ethbtc-just-hit-a-300-day-low-what-to-expect-next/",
    "description": "While crypto traders have been emboldened by Bitcoin’s impressive rally, especially in light of the SEC’s recent lawsuits against major crypto exchanges Binance and Coinbase, one key trading pair has nevertheless suffered as a result. Ethereum/Bitcoin (ETHBTC), the widely watched trading pair which combines the crypto market’s number two coin with its number one coin by market cap, just closed at a 300-day low. Why is this happening and what’s happened in the past after similarly weak periods for ETHBTC? Let’s take a closer look at the price history to find out. Bitcoin’s Dominance Explodes Higher Just a few weeks ago, ETHBTC closed at a multi-week high and looked poised to move higher, but the recent surge in Bitcoin Dominance caused ETHBTC to hit a 300-day low, just shy of a new 52-week low. The popular Dominance metric can be calculated for any crypto market asset and is simply a measure of any coin or token’s share of the total cryptocurrency market’s capitalization, expressed as a percentage. Bitcoin Dominance now sits at just over 51% after climbing from below 42% at the start of the year. Why the surge in Bitcoin’s Dominance? A variety of factors appear to have contributed to the sudden jump in Bitcoin’s Dominance chart, with Blackrock’s recent filing for a new spot Bitcoin ETF arguably being the key driver. &#160; ETHBTC and Bitcoin Dominance Comparison &#124; SOURCE: TradingView.com While both Bitcoin (BTC) and Ethereum (ETH) have moved sharply higher in recent sessions, Bitcoin’s recent relative strength to Ether has pushed ETHBTC to a multi-month low. Let’s take a look at what past 300-day lows for ETHBTC have meant for this key crypto market ratio. Related Reading: Bitcoin Just Gained Over 18% In Seven Days: What’s Happened When This Has Occurred In The Past? As always, because the number of occurrences will vary depending on holding time, we’ll start by listing the number of times that ETHBTC has closed at a 300-day low next to our hypothetical hold times of 7 days, 15 days, 30 days, 60 days, 90 days, 180 days, and 365 days. Holding time is defined as the amount of time one held an asset before exiting. For example, if one had hypothetically purchased ETHBTC following the trigger event (i.e., the close at a 300-day low) and sold it 90 days later, this would be a holding time of 90 days. ETHBTC Occurrences of 300-Day Lows by Holding Time (Inception &#8211; Present) 13 occurrences using a 7-day hold time 10 occurrences using a 15-day hold time 7 occurrences using a 30-day hold time 5 occurrences using a 60-day hold time 5 occurrences using a 90-day hold time 4 occurrences using a 180-day hold time 3 occurrences using a 365-day hold time As we can see, there have been relatively few closes at 300-day lows for ETHBTC, especially with longer holding times. Ethereum Relative Strength May Be Poised To Climb While 300-day lows may sound bearish, the data suggests that ETHBTC may now be poised for a bounce, particularly with a longer holding period. Hypothetical short-term holding times from 7 days to 60 days show a modest average result, and historically positive across the board. In other words, past instances when ETHBTC has hit a 300-day low have seen a modest bounce higher, coming in at just over 5% on average when using a 15-day, 30-day, or 60-day hold time. &#160; ETHBTC Average Trade Result with Various Hold Times &#124; SOURCE: Tableau Related Reading: Ethereum Poised To Break $2,000 As $12 Million Short Seller Nears Liquidation From an intermediate-term perspective, however, history shows that ETHBTC gains far more significantly, from +24.1% with a 90-day hold, to an astounding +223.2% with a 180-day hold, to an impressive 108.1% with a one-year hold. While many Bitcoin maximalists may be calling for significantly higher Bitcoin Dominance readings and lower ETHBTC levels as a result, the data says otherwise. While the past does not predict the future, ETHBTC may eventually be poised for higher levels, though patience might be required in the short-term. DB the Quant is the author of the REKTelligence Report newsletter on Substack. Follow @REKTelligence on Twitter for evidence-based crypto market research and analysis. Important Note: This content is strictly educational in nature and should not be considered investment advice. Featured images created with Tableau. Charts from TradingView.com."
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-27T11:18:02.000Z",
    "title": "Last Chance to Buy Bitcoin?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/last-chance-to-buy-bitcoin/",
    "description": "<p>Many argue that this is the last chance to buy Bitcoin at a lower price, as it is highly unlikely to touch the $20,000 mark again. Several compelling factors contribute to this prediction, including the growing interest of prominent U.S. investment groups such as BlackRock and Fidelity. Also, the recent launch of a Bitcoin ETF [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/last-chance-to-buy-bitcoin/\">Last Chance to Buy Bitcoin?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-27T11:36:00.000Z",
    "title": "ADA’s Defi Growth Will Make It a Leading Layer-1 Chain: Analyst",
    "url": "https://coinedition.com/adas-defi-growth-will-make-it-a-leading-layer-1-chain-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/CARDANO-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"ADA’s Defi Growth Will Make It a Leading Layer-1 Chain: Analyst\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/CARDANO-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The crypto analyst and Cardano (ADA) enthusiast Dan Gambardello predicted that ADA may outperform Bitcoin (BTC), Ethereum (ETH), Polygon (MATIC) and Avalanche (AVAX) in the next bull market. To support his claim, Gambardello included an article published over a week ago which stated that the Indonesian Government included ADA in a list of tradable assets. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/adas-defi-growth-will-make-it-a-leading-layer-1-chain-analyst/\">ADA’s Defi Growth Will Make It a Leading Layer-1 Chain: Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]