[
  {
    "source": "Decrypt",
    "date": "2023-06-24T15:27:16.000Z",
    "title": "FTX Sues to Reclaim $700M Bankman-Fried Allegedly Spent on Celebrity Connections",
    "url": "https://decrypt.co/146026/alameda-sues-reclaim-700-million-sam-bankman-fried-celebrity-influence",
    "description": "A new lawsuit alleges that Bankman-Fried threw cash “super-networker” Michael Kives, a Hollywood agent turned investor and ex-aide to Hillary Clinton."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-24T15:14:54.000Z",
    "title": "This Week in Coins: Bitcoin and Ethereum Rally Hard Post-Black Rock",
    "url": "https://decrypt.co/146060/this-week-in-coins-bitcoin-and-ethereum-rally-hard-post-black-rock",
    "description": "Also, the British parliament is now very nearly in accord over a bill of proposed crypto regulation."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-24T15:30:58.000Z",
    "title": "Potential consequences of implementing universal basic income",
    "url": "https://cryptoslate.com/potential-consequences-of-implementing-universal-basic-income/",
    "description": "<p>Universal Basic Income (UBI) is often touted as the panacea for freedom and happiness &#8211; more so in modern times since advancements in Artificial Intelligence (AI) demonstrate a credible threat to jobs. U.K. anti-poverty charity the Joesph Rowntree Foundation stated that regular cash payment, regardless of income, existing wealth, or other conditions, could help reduce [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/potential-consequences-of-implementing-universal-basic-income/\">Potential consequences of implementing universal basic income</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-24T15:15:00.000Z",
    "title": "Bitcoin Price Analysis:  Orbiting 30716 Technicals - 25 June 2023",
    "url": "https://cryptodaily.co.uk/2023/06/bitcoin-price-analysis-orbiting-30716-technicals-25-june-2023",
    "description": "<p>BTC/USD Orbiting 30716 Technicals:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 25 June 2023</p>\n<p>Bitcoin (BTC/USD) continued to trade sideways early in the Asian session as the pair orbited the 30716.30 area, representing the 38.2% retracement of the appreciating range from 29539.57 to 31443.67.&nbsp; &nbsp;The recent rapid appreciation to the 31443.67 area was its strongest level in twelve months and represented a test of the 31488.23 area, an upside price objective associated with buying pressure that strengthened around the 26637.41 area.&nbsp; &nbsp;Stops were also recently elected above the 30127.80 area during the ongoing appreciation, an upside price objective associated with historical buying pressure that emerged around the 15460 and 19568.52 areas.&nbsp; Stops were also triggered above additional upside price objectives around the 29068, 29159, 29458, 30088, 30200, 30292, and 30477 levels.&nbsp; Additional upside price objectives include the 31737, 32125, and 33569 areas.&nbsp;</p>\n<p>Stops are cited above additional upside price objectives around the 31674, 32043, 34531, and 34658 areas.&nbsp; Following recent upside price activity, areas of technical support and potential buying pressure include the 30192, 29863, 29423, 28886, 28179, 28096, and 27293 areas.&nbsp; Technicians are closely watching to see how much technical support develops around the 28095.44 area, representing the 23.6% retracement of the historical depreciating range from 69000 to 15460.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bullishly indicating above the 100-bar MA (4-hourly)&nbsp;and&nbsp;above the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bullishly indicating above the 100-bar MA (hourly) and above the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 28023.17 and the&nbsp;50-bar MA&nbsp;(Hourly) at 30387.87.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is Bearishly below MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-24T15:15:00.000Z",
    "title": "Meme Coins on the Prowl: Shiba Inu, Floki, and Caged Beasts — Top Meme Coins to Buy",
    "url": "https://cryptodaily.co.uk/2023/06/meme-coins-on-the-prowl-shiba-inu-floki-and-caged-beasts-top-meme-coins-to-buy",
    "description": "<p>Get ready to unleash your wild side with the top meme coins to buy in town! Shiba Inu (SHIB), Floki Inu (FLOKI), and Caged Beasts (BEASTS) are prowling the crypto jungle, ready to make a meme-tastic impact. Join the frenzy as these adorable yet fierce tokens take the market by storm &mdash; keep reading!</p>\n<p class=\"s11\">Floki Inu Embraces 8% Rise &mdash; Despite Altcoin Wounds</p>\n<p>FLOKI, also known as \"Floki Inu,\" is making waves in the crypto world, and it's anything but ordinary! Born from the fierce SHIBArmy, this Ethereum-powered gem is capturing the hearts of crypto enthusiasts and gamers alike with its Valhalla's Open World launch in the US.</p>\n<p>Not stopping there, FLOKI is conquering the Chinese gaming market with its local alternative to Valhalla called Btok. Beyond that, FLOKI brags about its decentralized finance (DeFi) ecosystem, non-fungible tokens (NFTs), and Metaverse venture. Recently, FLOKI surged a jaw-dropping 8%, stealing the spotlight from its rival, Shiba Inu.</p>\n<p class=\"s13\">What&rsquo;s Fueling This Growth?</p>\n<p>FLOKI is making bold moves as it announced its plans to launch a crypto education platform called the University Of Floki. With the crypto user base expected to hit one billion by 2025, FLOKI is dedicated to empowering and educating the masses.</p>\n<p>But FLOKI is anything but a complacent meme token. As such, FLOKI is spreading its wings by introducing new trading pairs on the Crypto.com app. Now you can trade FLOKI alongside popular cryptocurrencies like RDNT, ACH, DAR, and ZRX. With increased accessibility and liquidity, more investors and traders are flocking to the FLOKI ecosystem.</p>\n<p></p>\n<p class=\"s11\">Shiba Inu: From Meme to Market Domination</p>\n<p>Shiba Inu, the beloved meme coin, has been making waves with its ambitious goals and decentralized ecosystem. Shiba Inu is wagging its tail with excitement as it creates its own layer 2 blockchain called \"Shibarium\" and boasts Shibaswap, its very own decentralized exchange. It has taken a big bite out of the market, sitting proudly in the top 18 with a market capitalization of over $4 billion.</p>\n<p>The competition between Floki Inu and Shiba Inu is an epic tug-of-war, where the ultimate winner will be determined by various factors, including a strong ecosystem and flourishing market conditions. At the moment, Shiba Inu is winning the game. It hosts several other tokens besides the $SHIB token, including $BONE and $LEASH, which powers its very own SHIBOSHIs NFTs. These are some of the reasons why Shiba Inu made it out of Binance&rsquo;s infamous Innovation Zone.</p>\n<p></p>\n<p class=\"s11\">Caged Beasts and Its Searing Goals</p>\n<p>Caged Beasts is not your run-of-the-mill meme token. It's a thrilling crypto emblem of strength, commitment, creativity, and the pursuit of financial freedom. It captivates the market with its fascinating storyline centered around Rabbit 4001, a once-tortured rabbit turned mad scientist.</p>\n<p class=\"s13\">Quick Cash: Earn a 20% Bonus via Caged Beasts&rsquo; Referral System</p>\n<p>BEASTS is taking its game to a whole new level with an exciting referral program that'll make your wallets roar with delight.</p>\n<p>Here's how it works: When you join the BEASTS community and create a unique referral code, you'll receive an instant 20% deposit of USDT straight into your wallet the minute a connection uses it. In return, your friends or family will also earn an extra 20% in BEASTS tokens.</p>\n<p>With each successful referral, your crypto treasure grows, and your network expands. Whether you're a seasoned investor or a crypto enthusiast looking to dive into the exciting world of meme coins, the BEASTS' referral game is your ticket to extra USDT rewards and an opportunity to be part of a thriving community.</p>\n<p>&nbsp;</p>\n<p></p>\n<p>&nbsp;</p>\n<p class=\"s15\">The Meme Coin Mania Is Here!</p>\n<p>Meme coins are more than just a trend &mdash; they have the potential to fetch remarkable returns. Whether it's Shiba Inu's moonshot potential, Floki's innovative approach, or Caged Beasts' captivating narrative, these meme coins offer a thrilling investment journey. Grab your virtual leash and let these meme-powered tokens lead you to a world of exciting possibilities!</p>\n<p>&nbsp;</p>\n<p class=\"s18\">Unleash The Beasts Within With Caged BeastsWebsite: https://cagedbeasts.com</p>\n<p class=\"s18\">Twitter: https://twitter.com/CAGED_BEASTS</p>\n<p class=\"s18\">Telegram: https://t.me/CAGEDBEASTS</p>\n<p>&nbsp;</p>\n<p class=\"s20\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n<p>&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-24T15:30:36.000Z",
    "title": "$30K to $50K — 6 AI-Powered Chatbots Attempt to Predict Bitcoin’s Price by the Year’s End ",
    "url": "https://news.bitcoin.com/30k-to-50k-6-ai-powered-chatbots-attempt-to-predict-bitcoins-price-by-the-years-end/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/6bosdd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"$30K to $50K — 6 AI-Powered Chatbots Attempt to Predict Bitcoin&#039;s Price by the Year&#039;s End \" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/6bosdd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/6bosdd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/6bosdd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/6bosdd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/6bosdd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/6bosdd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/6bosdd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />With bitcoin price up more than 15% against the U.S. dollar, people are more bullish about the leading crypto asset&#x2019;s market performance. Two weeks ago, Bitcoin.com News asked several AI-powered chatbots whether they believe bitcoin will become a reserve currency. This time, we posed a different question to the most popular AI chatbots to determine [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-24T15:16:30.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  }
]