[
  {
    "source": "Decrypt",
    "date": "2023-06-07T18:43:55.000Z",
    "title": "Will MiCA Jumpstart Crypto in EU? It's ‘Too Early To Tell’, Says Circle",
    "url": "https://decrypt.co/143717/unclear-whether-mica-will-jumpstart-crypto-in-eu-circle-europe-policy-head",
    "description": "\"It does give us that legal certainty that we needed, but it’s just really a part of the story,\" Kraken's EU policy head said."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-07T18:55:13.000Z",
    "title": "Bitcoin (BTC) Price Watch: Daily Technical Analysis Report for 7 June 2023",
    "url": "https://www.cryptoglobe.com/latest/2023/06/bitcoin-price-watch-daily-technical-analysis-report-for-7-june-2023/",
    "description": "Introduction Bitcoin (BTC) is the leading cryptocurrency in terms of market capitalization and holds significant importance in the crypto market. In this daily technical analysis report, we will examine key indicators and interpret their values to provide insights into Bitcoin’s potential price targets. Current Price: $26,475.48 (as of 6:48 p.m. UTC on 7 June 2023) […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T18:58:17.000Z",
    "title": "Here are the points missed in U.S. debt ceiling debate",
    "url": "https://www.cryptopolitan.com/the-points-missed-in-us-debt-ceiling-debate/",
    "description": "Debt—public and private alike—has always played a central role in economic growth, but when it reaches overwhelming levels, it can hamper the economy, dilute real incomes, and lead to a chasm in wealth distribution. Capital owners usually fare better as debt often inflates asset values, albeit temporarily until the bubble pops. The U.S. Debt Ceiling ... <a title=\"Here are the points missed in U.S. debt ceiling debate\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-points-missed-in-us-debt-ceiling-debate/\" aria-label=\"More on Here are the points missed in U.S. debt ceiling debate\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T18:49:24.000Z",
    "title": "U.S. Treasury’s massive borrowing drive puts banks on edge",
    "url": "https://www.cryptopolitan.com/us-treasury-huge-borrowing-drive-hurts-banks/",
    "description": "As the U.S. Treasury prepares to launch a colossal $1 trillion borrowing initiative, anxiety levels are rising among banking institutions. The flurry of borrowing activity, scheduled in the aftermath of the recently concluded debt ceiling standoff, is predicted to heap more pressure on an already strained banking system, according to traders and market analysts. Enormous ... <a title=\"U.S. Treasury&#8217;s massive borrowing drive puts banks on edge\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-treasury-huge-borrowing-drive-hurts-banks/\" aria-label=\"More on U.S. Treasury&#8217;s massive borrowing drive puts banks on edge\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T18:41:21.000Z",
    "title": "Crypto industry unites as SEC targets Binance and Coinbase",
    "url": "https://www.cryptopolitan.com/crypto-industry-unites-sec-binance-coinbase/",
    "description": "Turbulence has engulfed the crypto world, as the U.S. Securities and Exchange Commission (SEC) has taken the surprising action of launching lawsuits against Binance and Coinbase, two of the largest cryptocurrency exchanges globally. This sudden move has sparked widespread reaction from industry insiders, raising concerns about the impact these actions may have on crypto innovation ... <a title=\"Crypto industry unites as SEC targets Binance and Coinbase\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-industry-unites-sec-binance-coinbase/\" aria-label=\"More on Crypto industry unites as SEC targets Binance and Coinbase\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-07T19:00:58.000Z",
    "title": "Can InQubeta (QUBE) Outgrow Fetch (FET)? Exploring the Influential Potential of QUBE in the AI Crypto Community",
    "url": "https://nulltx.com/can-inqubeta-qube-outgrow-fetch-fet-exploring-the-influential-potential-of-qube-in-the-ai-crypto-community/",
    "description": "The intersection of AI and crypto has the potential to bring about significant advancements and opportunities in various sectors. As a result, we are witnessing an influx of AI-focused projects in the crypto landscape. InQubeta is one such emerging platform positioned as a strong competitor in the market, alongside established players like Fetch. As these [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-07T18:58:13.000Z",
    "title": "Binance.US pauses OTC trading, removes numerous trading pairs",
    "url": "https://crypto.news/binance-us-pauses-otc-trading-removes-numerous-trading-pairs/",
    "description": "In a move to streamline its buy, sell &#038; convert service, Binance.US has announced a reduction in the number of supported convert trading pairs, bringing the total to 226. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-07T19:00:47.000Z",
    "title": "Bitcoin 24-Hour Volatility Soars, Why Bulls Could Win Fight In Short-Term",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-24-hour-volatility-soars-why-bulls-could-win-fight-in-short-term/",
    "description": "Bitcoin keeps moving sideways in a tight range as regulatory pressure in the U.S. mounts with two lawsuits against major crypto exchanges. The number one crypto by market cap could yet see crab-like price action, but the bulls could catch a break in the short term, according to an analyst. Related Reading: LDO Leads Top Coins, Registers 6% Gains In One Day As of this writing, Bitcoin (BTC) trades at $26,500 with a 2% profit in the last 24 hours. In the previous week, BTC recorded a 2% loss. In contrast, other cryptocurrencies in the top 10 by market cap recorded similar price action except for Binance Coin (BNB), which recorded a 14% loss over the same period. Positive Outlook For Bitcoin Price? According to analyst Ali Martinez, the price of Bitcoin could see further appreciation. Over the week, the cryptocurrency has retraced but stayed above critical resistance. Despite the unfavorable and uncertain macro conditions and regulatory environment, crypto market investors continue to battle to determine a clear direction. In this context, Martinez stated the following for BTC’s price using the TD Sequential Indicator, as seen in the chart below: The TD Sequential presents a buy signal on the hourly chart, which could see $BTC rebound to $27,000 &#8211; $27,300. Still, #BTC must avoid an hourly close below $26,360 because it could lead to a downswing to $25,800. Despite the forecast, uncertainty could be the most critical factor, rendering the buy sequence ineffective. A break above the $27,000 to $27,300 levels could hint at a positive outlook for BTC traders in the short term. Conversely, $26,000 and $26,300 are still critical support levels, as the 200-weekly moving average (WMA) sits around that area. Bulls must defend this average to prevent the price from declining further, possibly into the low $20,000. As a positive sidenote, the spike in volatility in the previous trading sessions contributed to a cleanse in Open Interest (OI). Per a separate analysis, over $800 million in OI was wiped out as BTC took liquidity in both directions. Related Reading: SEC Files Emergency Action Application To Freeze Binance.US Assets Often, when OI is taken out and overleveraged positions are closed, the market is less incumbent to trend in a single direction. A pseudonym analyst stated: We&#8217;ve seen quite the volatility over the past 48 hours. In total, we&#8217;ve seen over $800M+ in Open Interest being wiped out during this time. High leverage has been flushed out towards both sides. Liquidity taken. Up to spot to take determine the direction from here. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-07T18:45:58.000Z",
    "title": "Former NFL Team Owner Sentenced to Six Years in Prison for Providing ‘Shadow Bank’ Services to Crypto Exchanges",
    "url": "https://dailyhodl.com/2023/06/07/former-nfl-team-owner-sentenced-to-six-years-in-prison-for-providing-shadow-bank-services-to-crypto-exchanges/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/former-nfl-owner-six.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/former-nfl-owner-six.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/former-nfl-owner-six.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/former-nfl-owner-six.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/former-nfl-owner-six.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/former-nfl-owner-six.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/former-nfl-owner-six.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The former owner of a National Football League (NFL) team has been sentenced to more than six years in prison for acting as a &#8220;shadow bank&#8221; and illegally processing more than $700 million worth of transactions for crypto exchanges. Reginald Fowler, who previously co-owned the Minnesota Vikings, established a company called Global Trading Solutions LLC [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/07/former-nfl-team-owner-sentenced-to-six-years-in-prison-for-providing-shadow-bank-services-to-crypto-exchanges/\">Former NFL Team Owner Sentenced to Six Years in Prison for Providing ‘Shadow Bank’ Services to Crypto Exchanges</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-07T18:41:14.000Z",
    "title": "Cathie Wood’s Ark Invest Aggressively Buys Coinbase Stock After SEC Lawsuit Hits Price",
    "url": "https://dailyhodl.com/2023/06/07/cathie-woods-ark-invest-aggressively-buys-coinbase-stock-after-sec-lawsuit-hits-price/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/armstrong-explains-why-coinbase.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/armstrong-explains-why-coinbase.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/armstrong-explains-why-coinbase.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/armstrong-explains-why-coinbase.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/armstrong-explains-why-coinbase.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/armstrong-explains-why-coinbase.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/armstrong-explains-why-coinbase.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Cathie Wood’s ARK Invest is aggressively scooping up discounted Coinbase stock after the U.S. Securities and Exchange Commission (SEC) lawsuit against the firm sent shares tumbling. New data from Cathie&#8217;s Ark, which tracks the hedge fund&#8217;s trades, reveals three separate Coinbase (COIN) purchases on June 6th, totaling to about 419,000 shares worth more than $21 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/07/cathie-woods-ark-invest-aggressively-buys-coinbase-stock-after-sec-lawsuit-hits-price/\">Cathie Wood’s Ark Invest Aggressively Buys Coinbase Stock After SEC Lawsuit Hits Price</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]