[
  {
    "source": "CoinDesk",
    "date": "2023-10-31T21:20:04.000Z",
    "title": "As Sam Bankman-Fried Fraud Trial Nears Close, a Terse Judge Sets Jury Instructions",
    "url": "https://www.coindesk.com/policy/2023/10/31/as-sam-bankman-fried-fraud-trial-nears-close-a-terse-judge-sets-jury-instructions/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bankman-Fried completed his testimony Tuesday, concluding the presentation of evidence from both sides in the Justice Department's case against the FTX founder."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-31T21:17:07.000Z",
    "title": "Bitcoin Could Hit $150,000 by 2025, Says Formerly Bearish Wall Street Firm",
    "url": "https://decrypt.co/203919/bitcoin-150000-by-2025-bernstein-wall-street",
    "description": "Bernstein's prediction hinges on the SEC approving a Bitcoin ETF, which it says is likely to happen in early 2024."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-31T21:15:08.000Z",
    "title": "A ChatGPT Update Could Wreck a Bunch of AI Startups",
    "url": "https://decrypt.co/203920/openai-pdf-chatbot-ai-startups-sherlocked",
    "description": "The nascent AI-powered PDF reader industry could be rendered extinct if the leading firm swallows up their market."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-31T21:29:56.000Z",
    "title": "GAO finds controversial SEC guidance is subject to congressional oversight",
    "url": "http://cointelegraph.com/news/gao-finds-controversial-sec-guidance-subject-congressional-oversight",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/2ca2b3d7-8239-45df-8bb0-aa2038df2f8e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The SEC’s Staff Accounting Bulletin 121 has been the target of much criticism in the crypto community. </p>\n                    <p><p>United States Senator Cynthia Lummis has scored another one for crypto with a Government Accountability Office (GAO) decision issued on Oct. 31. The GAO found that Securities and Exchange Commission (SEC) Staff Accounting Bulletin 121 should be subject to congressional review. That bulletin, issued in March 2022, has been a source of ire for many pro-crypto lawmakers.</p><p>The GAO was acting on a letter sent by Lummis to the U.S. Comptroller General in August 2022. It <a href=\"https://www.gao.gov/assets/870/862501.pdf\" target=\"_blank\" rel=\"noopener nofollow\">considered</a> whether the bulletin was a rule subject to the Congressional Review Act (CRA). Under the CRA, a report on an agency rule must be submitted to the comptroller general and both chambers of Congress, with a procedure for Congress to disapprove the rule. Using the definition of a rule found in the Administrative Procedures Act (APA), the GAO found the SEC bulletin to be subject to the CRA. The GAO said:</p><blockquote>“It is reasonable to believe that companies may change their behavior to comply with the staff interpretations found in the Bulletin […] The Bulletin is also of future effect and was designed to interpret and prescribe policy. Accordingly, we conclude that the Bulletin meets the definition of rule under APA.” </blockquote><p>The bulletin “expresses the views of the staff regarding the accounting for obligations to safeguard crypto-assets an entity holds for platform users,” according to the SEC. It <a href=\"https://www.sec.gov/oca/staff-accounting-bulletin-121\" target=\"_blank\" rel=\"noopener nofollow\">said</a>, “The statements in staff accounting bulletins are not rules or interpretations of the Commission, nor are they published as bearing the Commission’s official approval. They represent staff interpretations and practices.” </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This is huge.<br><br>The GAO reviewed SAB 121, an illogical anti-crypto accounting bulletin issued by the SEC last March, and found that it&#39;s a &quot;rule&quot; under the CRA and APA.<br><br>The SEC didn&#39;t comply with either.<br><br>This is a clear statement from a federal agency that the SEC broke the law. <a href=\"https://t.co/brglK3sm8S\">https://t.co/brglK3sm8S</a></p>&mdash; Jake Chervinsky (@jchervinsky) <a href=\"https://twitter.com/jchervinsky/status/1719408896006123820?ref_src=twsrc%5Etfw\">October 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The bulletin used hypothetical situations to describe what the SEC considered best practices to safeguard crypto-assets held by platforms for their users. Coinbase and PayPal are examples of such platforms. It advises platforms to list their users’ assets on their books as liabilities and assets at their fair value at initial recognition. This represented a sharp turn in accounting practice as custodied assets were not previously recorded on balance sheets.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/us-house-financial-committee-tells-sec-they-don-t-like-custody-proposal\">US House Financial Services Committee tells SEC it doesn’t like custody proposal</a></em></strong></p><p>The bulletin was quickly met with objections from several sides. SEC commissioner Hester Peirce <a href=\"https://cointelegraph.com/news/new-sec-guidance-on-accounting-and-disclosures-rankles-commissioner-peirce\">released a critical response</a> within days. Peirce stated that the accounting procedure described in the bulletin was a response to risk that the SEC itself was partially the source of. </p><p>Five Republican senators, including Lummis, <a href=\"https://cointelegraph.com/news/senators-join-chorus-of-disapproval-of-backdoor-regulation-in-sec-staff-accounting-bulletin\">wrote to SEC chairman Gary Gensler</a> in June 2022 to express their disapproval of the bulletin’s “backdoor regulation.” Gensler <a href=\"https://cointelegraph.com/news/sec-gensler-crypto-custody-guidance-house-hearing\">was further lectured on the bulletin</a> by Representative Mike Flood when he appeared before the House Financial Services Committee this September. </p><p>GAO findings are recommendations only. However, the agency <a href=\"https://www.gao.gov/blog/2014/05/09/why-do-gao-recommendations-get-implemented\" target=\"_blank\" rel=\"noopener nofollow\">notes</a>, “Clearly, agencies are taking our recommendations.”</p><p><strong><em>Magazine<a href=\"https://cointelegraph.com/magazine/gary-genslers-job-at-risk-blackrocks-first-spot-bitcoin-etf-hodlers-digest-june-11-17/\">: Gary Gensler’s job at risk, BlackRock’s first spot Bitcoin ETF and other news: Hodler’s Digest, June 11-17</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-31T21:24:54.000Z",
    "title": "Bitget, Floki teams accuse each other of manipulation after token listing",
    "url": "http://cointelegraph.com/news/bitget-floki-teams-accuse-each-other-manipulation-after-token-listing",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/97483031-f738-44f8-9992-057b8d09f7f1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The teams for crypto exchange Bitget and Web3 protocol Floki blamed each other for allegedly misleading investors.</p>\n                    <p><p>The teams behind the Floki protocol and Bitget crypto exchange have <a href=\"https://twitter.com/RealFlokiInu/status/1719337299786240344\" target=\"_blank\" rel=\"noopener nofollow\">accused</a> each other of market manipulation after the protocol’s token, TokenFi (TOKEN), <a href=\"https://www.bitget.com/support/articles/12560603799638\" target=\"_blank\" rel=\"noopener nofollow\">was</a> listed and delisted by Bitget. This is according to an October 31 social media post from the Floki team and a blog post from Bitget. </p><p>The Floki team claimed that Bitget listed the token before it was launched, referring to the Bitget listing as a “fake token,” while Bitget claimed that the Floki team was “suspected of market manipulation by maliciously controlling the initial liquidity.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/8536585d-a782-41d3-a55e-6de4b3e60e64.png\"  /><figcaption style=\"text-align: center;\"><em>Bitget statement on TokenFi delisting. Source: Bitget.</em></figcaption></figure><p>The Floki team said it submitted a proposal on October 18 to the Floki decentralized autonomous organization (DAO) to launch a staking program with a reward token that would “target a trillion-dollar industry with strong potential.” Meanwhile, the team was talking with centralized exchanges to list TokenFi. The name of the token was not released in the DAO proposal, and the team did not state what the purpose of the “reward token” would be. However, they claim that this information had been revealed to multiple centralized exchanges.</p><p>According to the team, they told centralized exchanges not to list the token until at least seven days after it had been launched because doing so would violate governance rules established by the DAO. All exchanges agreed to this stipulation, the Floki team claimed in its post. However, they claimed that Bitget violated this agreement. Instead of waiting seven days to list TOKEN, they listed it before it was launched. This meant that the token was not available for sale at the time it was listed on Bitget, the team stated.</p><p>On October 26, Floki <a href=\"https://twitter.com/RealFlokiInu/status/1717613041905279151\" target=\"_blank\" rel=\"noopener nofollow\">sent</a> out a warning to investors that any current TOKEN listings on centralized exchanges were unauthorized, although they did not mention Bitget by name.</p><p>The TokenFi token was <a href=\"https://twitter.com/RealFlokiInu/status/1717519649426850012\" target=\"_blank\" rel=\"noopener nofollow\">scheduled</a> to launch at 3 p.m. UTC on October 27, according to a social media post from the team. Coincodex data <a href=\"https://coincodex.com/crypto/tokenfi/\" target=\"_blank\" rel=\"noopener nofollow\">shows</a> that it was listed at an initial price of $0.00005011 and was launched on October 28, although time zone differences may have caused the discrepancy in date. The price rose almost immediately to $0.005850, a gain of 11,574%. At the time of publication, its price has gone even higher, to $0.006053 per coin.</p><p>According to the Floki team, Bitget listed TOKEN without having any of it to sell to its customers. As a result, it was unable to process withdrawals. They claim that Bitget ended up with a $20 million liability to customers and no TOKEN assets to hedge this liability.</p><p>Floki claims that Bitget then attempted to buy tokens from the TokenFi treasury at a 90% discount to its current market price, which the team refused. Bitget allegedly released its “delisting” statement in response to this refusal.</p><p>According to Bitget’s post, TOKEN was listed on October 27, 2023. After the listing, the Bitget team noticed that TOKEN had “significant price fluctuations.” Because of the large fluctuations, the exchange suspected the development team of “market manipulation by maliciously controlling the initial liquidity.” Bitget claims that only $2,000 worth of initial liquidity was added to the token’s pool. They also claim that they discovered “an opaque token economy and an unclear vesting schedule,” which made continuing to offer TOKEN untenable.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/floki-price-soars-140-memecoins-doge-pepe\"><strong>FLOKI price soars 140% in a week — Are memecoins finally waking up?</strong></a></em></p><p>In its statement, Bitget offered to buy back all the TOKEN it has sold to its customers. The token’s peak price before delisting will be paid out to customers, which is $0.00605002 per token or about 121 times its initial price. This implies that any losses that may have occurred before the delisting will be covered by the exchange. However, investors who bought from Bitget will not benefit from any token appreciation after delisting.</p><p>The Floki team rejected Bitget's claim that Floki only provided $2,000 worth of tokens in its initial liquidity pool. They claimed nearly $2 million of liquidity in each of the two TOKEN pools. They posted an alleged screenshot from DEXTswap showing the amount available.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/a88db242-e761-4788-8ff3-a85585ac26ee.jpg\"  /><figcaption style=\"text-align: center;\"><em>TOKEN liquidity in Uniswap and Pancakeswap. Source: Floki, DEXTswap.</em></figcaption></figure><p>The screenshot shows current liquidity, not the initial liquidity that Bitget referred to. The contract addresses are abbreviated in the image, making it difficult to look up the pools in a block explorer. Cointelegraph could not determine the TOKEN's initial liquidity by the time of publication.</p><p>TOKEN isn’t the only token-launch snafu to result in millions of dollars in losses. BALD token on Base <a href=\"https://cointelegraph.com/news/bald-token-developer-denies-rug-pull-price-falls-post-launch\">fell 85% after its developer pulled liquidity</a> from the pool, though they claimed they weren't responsible for the price drop. Investors also <a href=\"https://cointelegraph.com/news/pond0x-token-launch-snafu-leads-millions-dollars-losses\">lost over $2.2 million in the launch</a> of Pond0X, which allegedly contained a faulty transfer function.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-31T21:31:39.000Z",
    "title": "Sam Bankman-Fried claims to have overlooked $8B ‘bug’ in last day of testimony",
    "url": "https://cryptoslate.com/sam-bankman-fried-testifies-to-overlooking-8b-software-bug-in-last-day-of-testimony/",
    "description": "<p>Former FTX CEO Sam Bankman-Fried has concluded the testimony and cross-examination portion of his ongoing criminal case, Bloomberg reported on Oct. 31. Bankman-Fried acknowledged the existence of an $8 billion hidden debt within Alameda Research, which came to light after a bug was fixed in an account known as fiat@. Despite his claims of discovering [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sam-bankman-fried-testifies-to-overlooking-8b-software-bug-in-last-day-of-testimony/\">Sam Bankman-Fried claims to have overlooked $8B &#8216;bug&#8217; in last day of testimony</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-31T21:30:09.000Z",
    "title": "Terraform Labs and Do Kwon Challenge SEC, Seeking Dismissal of Multi-Billion Dollar Fraud Charges",
    "url": "https://news.bitcoin.com/terraform-labs-and-do-kwon-challenge-sec-seeking-dismissal-of-multi-billion-dollar-fraud-charges/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/terra-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/terra-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/terra-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/terra-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/terra-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/terra-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/terra-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/terra.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In the latest legal maneuver, Terraform Labs and its former CEO Do Hyeong Kwon (Do Kwon) have submitted a comprehensive Motion for Summary Judgment, seeking an immediate dismissal of the fraud charges levied against them by the U.S. Securities and Exchange Commission (SEC). Terraform Labs and Do Kwon Push Back Against SEC Accusations Lawyers for [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-31T21:34:31.000Z",
    "title": "Asset manager Bernstein sees Bitcoin hitting $150k soon",
    "url": "https://www.cryptopolitan.com/bernstein-sees-bitcoin-hitting-150k-soon/",
    "description": "The crypto sphere is buzzing with audacious predictions, and the latest one from Bernstein’s quarters is nothing short of a bombshell. They&#8217;ve thrown their weight behind Bitcoin, predicting a skyrocketing trajectory to a staggering $150,000 by the year 2025. Now, before you dismiss this as another overly optimistic crypto babble, let’s dissect this bold prognosis, ... <a title=\"Asset manager Bernstein sees Bitcoin hitting $150k soon\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bernstein-sees-bitcoin-hitting-150k-soon/\" aria-label=\"More on Asset manager Bernstein sees Bitcoin hitting $150k soon\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-31T21:28:32.000Z",
    "title": "SBF’s defense argument wraps up – Now what?",
    "url": "https://www.cryptopolitan.com/sbfs-defense-argument-wraps-up-now-what/",
    "description": "The courtroom drama surrounding SBF, the fallen crypto kingpin and founder of FTX, has reached a fever pitch as the defense rests its case, leaving the jury with a colossal task ahead. Over the last four weeks, the courtroom in lower Manhattan has been a battleground, with Bankman-Fried’s future hanging in the balance. Bankman-Fried, a ... <a title=\"SBF&#8217;s defense argument wraps up &#8211; Now what?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sbfs-defense-argument-wraps-up-now-what/\" aria-label=\"More on SBF&#8217;s defense argument wraps up &#8211; Now what?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-31T21:21:56.000Z",
    "title": "Bitcoin ETF mania outshines SBF’s infamous trial",
    "url": "https://www.cryptopolitan.com/bitcoin-etf-mania-outshines-sbf-trial/",
    "description": "As the drama surrounding Sam Bankman-Fried (SBF) and the FTX fiasco continues to unravel, it’s the Bitcoin ETF frenzy that&#8217;s stealing the spotlight, redefining the crypto narrative. Interestingly, despite the torrent of negative press stemming from SBF’s legal troubles, Bitcoin’s value has soared, doubling in the past year. This resilience demonstrates the market’s ability to ... <a title=\"Bitcoin ETF mania outshines SBF&#8217;s infamous trial\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-etf-mania-outshines-sbf-trial/\" aria-label=\"More on Bitcoin ETF mania outshines SBF&#8217;s infamous trial\">Read more</a>"
  }
]