[
  {
    "source": "CoinDesk",
    "date": "2023-05-29T04:46:52.000Z",
    "title": "Arbitrum Based Jimbos Protocol Scurries for Revival After $7M Exploit",
    "url": "https://www.coindesk.com/tech/2023/05/29/arbitrum-based-jimbos-protocol-scurries-for-revival-after-7m-exploit/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Version 2 of Jimbos protocol was attacked over the weekend for $7.3 million, just days after going live."
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-29T04:50:40.000Z",
    "title": "Ethereum Correction: Key Level Break Can Shift Price Course",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-correction-key-level-break-can-shift-price-course/",
    "description": "The Ethereum price has shown attempts at recovery during recent trading sessions. Over the past 24 hours, the price of this altcoin has experienced a modest increase of nearly 2%. However, when observing the weekly chart, the price has only managed to appreciate by 3%. In terms of technical analysis, the outlook has favored the bulls, with buying strength exhibiting an uptick. Additionally, both demand and accumulation have displayed positive changes. As the price began to rise, ETH successfully surpassed a significant resistance level, crossing the $1,790 mark. Related Reading: XRP Revisits $0.47 – What Can Be Expected For Short-Term Price Movement? This breakthrough has enabled the bulls to gain control of the price action. Nevertheless, an important hurdle still remains to be overcome for ETH to witness a substantial rally. Notably, with the Bitcoin price demonstrating uncertain price action, several major altcoins have struggled to surpass their key price resistance levels. As BTC surpassed $27,000, the broader market&#8217;s increased strength might also contribute to the Ethereum upward price movement on its chart. The market capitalization of Ethereum witnessed an increase in the last trading session, indicating a return of buyers to the market. Ethereum Price Analysis: One-Day Chart At the time of writing, ETH was priced at $1,840. The altcoin has exhibited gradual appreciation following its breakthrough of the $1,790 resistance level. However, ETH has experienced intermittent corrections, and in order to halt this pattern, it needs to surpass the overhead price ceiling of $1,870. Surmounting this level would pave the way for ETH to trade near $1,900. Conversely, a drop from this level would bring ETH to $1,790 and subsequently to $1,740. The volume of ETH traded in the last session appeared positive, indicating reduced selling pressure on the chart. Technical Analysis Following ETH&#8217;s breakthrough of the $1,840 price level, buyers made further attempts to reenter the market. This resulted in a shift in demand into the positive zone. Additionally, the Relative Strength Index (RSI) surged past the half-line, signaling that buyers outnumbered sellers in the market. In line with this, the ETH price also moved above the 20-Simple Moving Average (SMA) line, indicating that buyers were steering the price momentum in the market. In addition to the aforementioned technical indicators, ETH displayed further buy signals. The Moving Average Convergence Divergence (MACD) indicated the price momentum and reversals through the formation of green histograms, which were growing in size. Related Reading: Bullish Case For Litecoin Grows Stronger As LTC Halving Draws Close These expanding histograms aligned with buy signals for Ethereum. Furthermore, the Chaikin Money Flow (CMF) indicator was positive, as it remained above the half-line. This indicated that capital inflows outweighed capital outflows at the time of observation, emphasizing positive market sentiment for ETH. -Featured Image From UnSplash, Charts From TradingView.com"
  }
]