[
  {
    "source": "CoinDesk",
    "date": "2023-05-31T20:24:20.000Z",
    "title": "Welcome, Crypto, to the Fiery Cauldron of U.S. Presidential Politics",
    "url": "https://www.coindesk.com/policy/2023/05/31/welcome-crypto-to-the-fiery-cauldron-of-us-presidential-politics/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Whether the crypto industry wants the spotlight or not, digital assets are among the earliest talking points in the 2024 U.S. presidential election, with the most prominent of the new candidates even invoking bitcoins in his campaign opener as evidence of President Joe Biden’s missteps."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-31T20:25:02.000Z",
    "title": "Multichain unable to contact CEO, has no access to project servers",
    "url": "https://cryptoslate.com/multichain-unable-to-contact-ceo-has-no-access-to-project-servers/",
    "description": "<p>The team behind cross-chain protocol Multichain said May 31 that they are unable to contact their CEO, who is known only as Zhaojun. As a result of the executive&#8217;s absence, the team said it is unable to access project servers. CEO is AWOL Zhaojun&#8217;s Twitter account has not displayed any activity since May 24, and there [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/multichain-unable-to-contact-ceo-has-no-access-to-project-servers/\">Multichain unable to contact CEO, has no access to project servers</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-31T20:14:01.000Z",
    "title": "Bitcoin outshines oil on increase in value since 2010",
    "url": "https://cryptoslate.com/insights/bitcoin-outshines-oil-on-increase-in-value-since-2010/",
    "description": "<p>In a world of increasing inflation, is denominating Bitcoin in USD still the best approach? Exploring an alternative method, this paywalled article delves into a unique comparison between Bitcoin and a well-known commodity, revealing a fascinating trend. As the value of one Bitcoin reaches an equivalence to 306 barrels of oil, a remarkable insight emerges, showing Bitcoin's true value skyrocketing by...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-outshines-oil-on-increase-in-value-since-2010/\">Bitcoin outshines oil on increase in value since 2010</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-05-31T20:31:35.000Z",
    "title": "Revolutionary Crowdfunding Platform For AI Startups, InQubeta Launches QUBE Presale",
    "url": "https://www.cryptoglobe.com/latest/2023/05/revolutionary-crowdfunding-platform-for-ai-startups-inqubeta-launches-qube-presale/",
    "description": "Mahe Island, Beau Vallon, Seychelles, May 31st, 2023, Chainwire InQubeta, a pioneering platform in the crypto crowdfunding space, is thrilled to announce the launch of its innovative ecosystem powered by the QUBE token. Designed to revolutionize the investment landscape for AI startups, InQubeta offers users the opportunity to participate in crowdfunding campaigns in its NFT marketplace. InQubeta […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-05-31T20:26:13.000Z",
    "title": "Decentralized Finance (DeFi) in Decline: A Comprehensive Analysis",
    "url": "https://www.cryptoglobe.com/latest/2023/05/decentralized-finance-defi-in-decline-a-comprehensive-analysis/",
    "description": "Blockchain analytics firm Glassnode has published an extensive report scrutinizing the current condition of the Decentralized Finance (DeFi) sector. The report thoroughly analyzes the sector’s performance, liquidity, and usage, offering valuable insights into the challenges and opportunities facing DeFi. The report begins by acknowledging the Ethereum application layer’s significant role as a platform for innovation. […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-31T20:18:27.000Z",
    "title": "Revolutionary Crowdfunding Platform For AI Startups, InQubeta launches QUBE Presale",
    "url": "https://cryptodaily.co.uk/2023/05/revolutionary-crowdfunding-platform-for-ai-startups-inqubeta-launches-qube-presale",
    "description": "<p>Mahe Island, Beau Vallon, Seychelles, May 31st, 2023, Chainwire</p><p class=\"ql-align-justify\">InQubeta, a pioneering platform in the crypto crowdfunding space, is thrilled to announce the launch of its innovative ecosystem powered by the QUBE token. Designed to revolutionize the investment landscape for AI startups, InQubeta offers users the opportunity to participate in crowdfunding campaigns in it's NFT marketplace.</p><p class=\"ql-align-justify\">InQubeta stands out in the blockchain industry by providing a dynamic environment for users to back and invest in AI startups using QUBE tokens. Through the platform, each listed startup is transformed into an NFT and fractionalized, allowing investors of all sizes to participate. Upon successful funding, investors can share in the startup's profits through returns paid in QUBE tokens. The entire process is transparent, secure, and backed by the power of blockchain technology.</p><p class=\"ql-align-justify\">To ensure the utmost quality and value for investors, InQubeta employs rigorous vetting procedures for startups seeking listing on their NFT marketplace. Additionally, the platform equips investors with valuable resources, including insights from experienced stakeholders and AI technology experts, enabling informed decision-making through comprehensive research and analysis.</p><p class=\"ql-align-justify\">At the core of InQubeta's ecosystem lies the QUBE token, an ERC-20 utility and governance token. QUBE grants holders access to invest in AI startup projects listed on the platform's NFT marketplace. With deflationary properties, QUBE tokens provide long-term potential benefits to investors through a 2% buy-and-sell tax allocated to a burn wallet and a 5% sell tax directed to a reward pool. Moreover, QUBE token holders actively participate in governance, shaping the future of InQubeta by contributing to key proposals.</p><p class=\"ql-align-justify\">Security is a paramount concern, and InQubeta takes it seriously. The QUBE token has undergone  an extensive security audits by leading firm Hacken and KYC verification by Block Audit, providing peace of mind to investors and ensuring users' funds are protected from potential breaches.</p><p class=\"ql-align-justify\">Currently, the QUBE token is available in its presale phase, offering investors the opportunity to purchase tokens at the current lowest possible price directly from the official InQubeta website. The presale is designed to be investor-friendly, with a minimum investment amount of $50, making QUBE tokens accessible to everyone. Supported payment options include but are not limited to ETH, USDT, BNB, BUSD, and BTC. Following the presale, QUBE token holders can stake their assets via InQubeta's staking dapp, to earn potential rewards from the buy and sell taxes allocated to the reward pool.</p><p class=\"ql-align-justify\">InQubeta's cutting-edge crowdfunding ecosystem, impressive tokenomics, and commitment to security position it for success in the evolving landscape of AI investments.</p><p class=\"ql-align-justify\">To join the InQubeta presale, please visit inqubeta.ai</p><p class=\"ql-align-justify\">About InQubeta</p><p>InQubeta is a crypto crowdfunding NFT marketplace that enables users to invest in AI startup projects using the QUBE token. Through its innovative platform, InQubeta aims to revolutionize the investment landscape for AI startups, providing investors a transparent and rewarding experience.</p>ContactInQubeta TeamInQubetainfo@inqubeta.ai"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T20:18:36.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-31T20:30:59.000Z",
    "title": "Avalanche Bridge To Ethereum Records A 70% Drop In Value Transfer, Concern For AVAX Price?",
    "url": "https://www.newsbtc.com/avalanche/avalanche-bridge-to-ethereum-70-drop-concern-for-avax-price/",
    "description": "The amount of funds flowing through the Avalanche Bridge is down 70% in the last 24 hours, DeFiLlama data on May 31 shows. 70% Drop In Activity In The Avalanche Bridge To Ethereum Over the past day, the bridge has facilitated $2,634,828 worth of transactions and processed $22.4 million in transfers in the last week. The bridge has processed 278 transactions in the past day, totaling around $2.6 million. It shows a sharp decrease in activity between Ethereum and Avalanche, among the world&#8217;s largest smart contract platforms. Related Reading: Trader Joe Goes All-In On Auto-Pools: Game-Changer For DeFi Investors? The Avalanche Bridge connects the Avalanche’s C-Chain, one of the three interoperable blockchains defining the low-finality platform, with Ethereum.  Since C-Chain is compatible with the Ethereum Virtual Machine (EVM), assets can be smoothly transferred from Avalanche to Ethereum and vice versa.  The compatibility with the EVM coupled with the decentralization of the bridge means users can move funds between the two blockchains securely.  Avalanche, unlike Ethereum, is explicitly designed for decentralized finance (DeFi) dApps. It boasts high processing speeds, relatively low fees, and is decentralized. However, it lags Ethereum in activity, judging from the total value locked (TVL).  According to DeFiLlama data, over $26.5 billion of the approximately $48 billion of all DeFi TVL is managed by dapps on Ethereum. More Assets Moved Between Avalanche And Bitcoin Notably, while there is a worrying contraction in the number of transactions and value between Avalanche and Ethereum, the Avalanche Core Bitcoin Bridge is booming.  On May 31, there was a significant increase in transfers and value, with a spike of 2,726%. Within 24 hours, assets worth over $6.5 million were transferred through the bridge. This is roughly half the average weekly transfers which stand at $13.81.  Bitcoin transferred to the Avalanche C-Chain from the Bitcoin network is tokenized and is compliant with the ERC-20 standard. In that case, it can be moved to Ethereum and used to participate in DeFi. Related Reading: Coinbase CEO Drops Bombshell Prediction – Is China Set To Dominate Crypto? Scanning the activities stemming from Avalanche to Bitcoin and Ethereum, the disparity could suggest that more users are moving their assets to and from Bitcoin.  However, no direct fundamental event could explain why more users are bridging tokens from Bitcoin and cutting down engagement with Ethereum. In the last 24 hours, Bitcoin, Ethereum, and Avalanche prices have been under pressure, falling from recent highs. To illustrate, AVAX is down 6% from May 28 highs, extending losses from mid-April. AVAX is down 35% in the last six weeks and retesting March 2023 lows.  AVAX may slip below a critical multi-week support level if sellers double down. In that case, it could drop to December 2022 lows at around $10. Feature Image From Canva, Chart From TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-31T20:17:16.000Z",
    "title": "Revolutionary Crowdfunding Platform For AI Startups, InQubeta launches QUBE Presale",
    "url": "https://www.crypto-news-flash.com/revolutionary-crowdfunding-platform-for-ai-startups-inqubeta-launches-qube-presale/?utm_source=rss&utm_medium=rss&utm_campaign=revolutionary-crowdfunding-platform-for-ai-startups-inqubeta-launches-qube-presale",
    "description": "<p>Mahe Island, Beau Vallon, Seychelles, May 31st, 2023, Chainwire InQubeta, a pioneering platform in the crypto crowdfunding space, is thrilled to announce the launch of its innovative ecosystem powered by the QUBE token. Designed to revolutionize the investment landscape for AI startups, InQubeta offers users the opportunity to participate in crowdfunding campaigns in it&#8217;s NFT [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/revolutionary-crowdfunding-platform-for-ai-startups-inqubeta-launches-qube-presale/\">Revolutionary Crowdfunding Platform For AI Startups, InQubeta launches QUBE Presale</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]