[
  {
    "source": "CoinDesk",
    "date": "2023-06-06T18:26:44.000Z",
    "title": "One-Two Punch Finally Registers SEC View on Binance, Coinbase, Rest of Crypto",
    "url": "https://www.coindesk.com/policy/2023/06/06/one-two-punch-finally-registers-sec-view-on-binance-coinbase-rest-of-crypto/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Securities and Exchange Commission (SEC) tore off crypto’s bandage this week, with its back-to-back enforcement actions against two of the most prominent digital assets platforms, Binance and Coinbase (COIN), finally establishing its legal argument against the industry and setting up the future court fights that could decide everything."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-06T18:22:43.000Z",
    "title": "Coinbase Traders Withdraw $600M in a Day Amid SEC Lawsuits",
    "url": "https://www.coindesk.com/markets/2023/06/06/coinbase-traders-withdraw-600m-in-a-day-amid-sec-lawsuits/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Securities and Exchange Commission sued Coinbase for violating federal securities laws on Tuesday, a day after filing a lawsuit against rival exchange Binance."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T18:21:24.000Z",
    "title": "FBI raises alarm over AI deepfake extortion scams",
    "url": "https://www.cryptopolitan.com/fbi-raises-alarm-ai-deepfake-extortion-scams/",
    "description": "Deepfake technology, which utilizes generative AI platforms such as Midjourney 5.1 and OpenAI’s DALL-E 2, has demonstrated remarkable capabilities in producing lifelike images and videos. However, the U.S. Federal Bureau of Investigation (FBI) has recently issued a warning, stating that criminals are exploiting deepfakes to target victims for extortion. FBI warns the public about the ... <a title=\"FBI raises alarm over AI deepfake extortion scams\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fbi-raises-alarm-ai-deepfake-extortion-scams/\" aria-label=\"More on FBI raises alarm over AI deepfake extortion scams\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-06T18:10:55.000Z",
    "title": "US House Agriculture Committee holds hearing on crypto regulation amid SEC lawsuits",
    "url": "https://crypto.news/us-house-agriculture-committee-holds-hearing-on-crypto-regulation-amid-sec-lawsuits/",
    "description": "Amid recent lawsuits by the Securities and Exchange Commission (SEC) against cryptocurrency exchanges Binance and Coinbase, the House Agriculture Committee convened a hearing to discuss the regulation of cryptocurrency spot markets."
  }
]