[
  {
    "source": "Decrypt",
    "date": "2023-06-23T20:46:16.000Z",
    "title": "Cloud9, G2 Among Esports Giants to Showcase 'Sparkball' in Tournament",
    "url": "https://decrypt.co/146015/cloud9-g2-esports-giants-sparkball-tournament",
    "description": "Worldspark Studios will hold a Sparkball competition Saturday with major esports teams ahead of the early access launch."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-23T21:00:00.000Z",
    "title": "Wirex may suffer card outage in EEA due to UAB PayrNet licensing issue",
    "url": "https://cointelegraph.com/news/wirex-may-suffer-card-outage-eea-uab-payrnet-licensing-issue",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/b30128df-a689-4746-9bb6-63109f428b7d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Wirex cards may stop working in the European Economic Area but funds held in the account are safe, the company said.</p>\n                    <p><p>Debit cards offered through crypto payment service Wirex may stop functioning in the European Economic Area (EEA), according to a June 23 email the company sent to some of its customers. The threat of stoppage was triggered by Lithuania’s central bank revoking the license of UAB PayrNet, Wirex’s card provider.</p><p>This news comes after Wirex’s competitor, Cryptopay, also announced that its <a href=\"https://cointelegraph.com/news/cryptopay-eu-card-provider-loses-license-company-says-card-funds-are-safe\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cryptopay-eu-card-provider-loses-license-company-says-card-funds-are-safe/amp\">cards may stop working</a> in the region due to the same issue.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/805fbdb6-990c-4d03-800a-732552c2a243.png\"><figcaption style=\"text-align: center;\"><em>June 22 email sent to Wirex customers. Source: Wirex</em></figcaption></figure><p>Wirex is a multi-currency crypto payment app that features fiat on-ramps and off-ramps, as well as debit cards. It claimed in 2020 to <a href=\"https://cointelegraph.com/news/wirex-payments-platform-hits-3-million-users-becomes-profitable\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/wirex-payments-platform-hits-3-million-users-becomes-profitable/amp\">have over 3 million users</a> throughout Europe and Asia.</p><p>The email sent to customers stated that “our current card partner has experienced problems and this is causing an interruption in the debit card service for EEA customers.” This disruption “has no impact on your ability to access your funds through any other Wirex means, such as our IBAN service, or via transfer and purchase of cryptocurrency on the Wirex app.” Customers do not need to take any action as a result of this information, since funds are held in the app and unaffected by the card services issue.</p><p>Wirex stated that the cause of the problem was UAB PayrNet, not any issues within Wirex’s system.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/robinhood-buys-credit-card-fintech-x1-for-95m\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/robinhood-buys-credit-card-fintech-x1-for-95m/amp\"><strong>Robinhood buys credit card fintech X1 for $95M</strong></a></em></p><p>On June 22, the Bank of Lithuania announced it was <a href=\"https://www.lb.lt/en/news/licence-of-uab-payrnet-revoked-for-serious-violations-bankruptcy-proceedings-to-be-initiated\" target=\"_blank\" rel=\"noopener nofollow\">revoking</a> UAB PayrNet’s electronic money institution (EMI) license “for serious, systematic and multiple violations of legal acts.” Among other accusations, the central bank claimed that PayrNet failed to properly administer Anti-Money laundering (AML) provisions to prevent its services from being used for illicit financing.</p><p>In its announcement, the Bank of Lithuania claimed that client funds are safe, saying that they are “safeguarded in separate dedicated accounts.”</p><p>Cointelegraph has attempted to contact UAB Payrnet through email, but has not received a response by the time of publication. Payrnet’s director, Stephenas Couttie, <a href=\"https://www.vz.lt/inovacijos/2023/06/22/uz-itin-siurkscius-pazeidimus-naikinama-payrnet-licencija-lb-kreipsis-del-imones-bankroto\" target=\"_blank\" rel=\"noopener nofollow\">reportedly</a> claimed that the central bank’s actions are “not adequate for the violations committed,\" according to a Google translation of text from Lithuanian news site Verslo Žinios. This seems to imply that the director feels PayrNet is undergoing excessive punishment, disproportionate to the violations committed. </p><p>In its email to customers, Wirex said it is switching to Transact Payments Malta Limited to handle its debit card services. This plan was already in the works, but is being accelerated due to the current problems. It is “working hard” with both PayrNet and Transact to get its debit card system up and running again as soon as possible.</p><p>In the meantime, customers in the EEA region may not be able to use their cards.</p><p>Wirex has been expanding its service offerings over the past two years. In August 2022, it partnered with 1Inch to <a href=\"https://cointelegraph.com/news/wirex-partners-with-1inch-to-enable-wallet-based-token-swaps\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/wirex-partners-with-1inch-to-enable-wallet-based-token-swaps/amp\">provide wallet-based token swaps</a> to its customers. In February 2022, it integrated with the Avalanche (AVAX) network, allowing users to <a href=\"https://cointelegraph.com/news/avalanche-blockchain-now-accessible-to-4-5m-users-across-wirex-payment-ecosystem\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/avalanche-blockchain-now-accessible-to-4-5m-users-across-wirex-payment-ecosystem/amp\">deposit AVAX and spend it</a> through a debit card.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-23T20:55:03.000Z",
    "title": "JP Morgan starts offering euro transfers with JPM Coin payment system",
    "url": "https://cryptoslate.com/jp-morgan-starts-offering-euro-transfers-with-jpm-coin-payment-system/",
    "description": "<p>JP Morgan Chase has begun to allow clients to use its blockchain-based payment system for EU payments, Bloomberg reported June 23. That report indicates that JP Morgan began to offer JPM Coin for transactions denominated in euros for the first time on June 21. Siemens uses JPM Coin for transfer The German multinational conglomerate Siemens [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/jp-morgan-starts-offering-euro-transfers-with-jpm-coin-payment-system/\">JP Morgan starts offering euro transfers with JPM Coin payment system</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T21:01:10.000Z",
    "title": "Rug pull goes wrong as the perpetrator is overrun by a MEV bot, On-chain karma?",
    "url": "https://www.cryptopolitan.com/rug-pull-goes-wrong-overrun-by-a-mev-bot/",
    "description": "A crypto rug pull scammer has come on the receiving end of his own creation. According to a report by Arkham Intelligence, this week, a developer tried to rug pull a token that he had created only an hour before. However, the rug pull did not go according to plan. So what happened? In an ... <a title=\"Rug pull goes wrong as the perpetrator is overrun by a MEV bot, On-chain karma?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/rug-pull-goes-wrong-overrun-by-a-mev-bot/\" aria-label=\"More on Rug pull goes wrong as the perpetrator is overrun by a MEV bot, On-chain karma?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-23T21:00:51.000Z",
    "title": "Bitcoin Future Hangs In The Balance: What To Expect In The Coming Weeks",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-future-hangs-in-the-balance-what-to-expect-in-the-coming-weeks/",
    "description": "Bitcoin, the leading cryptocurrency by market capitalization, seems to have entered a phase of consolidation above the $30,000 mark following a notable surge of over 10% on Tuesday.  While the price movement has generated a lot of interest among investors, it remains uncertain whether Bitcoin will maintain its upward momentum or experience a pullback in the coming days. Bitcoin Uncertain Trajectory Ben Lilly, a well-known cryptocurrency analyst, and economist, recently shared his thoughts on the current state of Bitcoin&#8217;s price action and its potential future trajectory.  In a recent analysis, Lilly dubbed the current price movement the &#8220;Larry Fink Pump,&#8221; referencing the recent announcement by BlackRock&#8217;s CEO Larry Fink regarding the company&#8217;s increased interest and application for a  Bitcoin spot ETF. While the pump has caused some excitement among investors, Lilly notes that several factors could cause the rally to falter.  Related Reading: Bitcoin Investor Sentiment Suggests BTC Rally Is Far From Over For one, Bitcoin has already wiped out the remaining high-leverage liquidity to the upside, and the Cumulative Volume Delta (CVD) spot seems to have lost its short-lived trend already.  Additionally, the fuel meter discussed in a recent Alpha Bites episode by Benjamin Skew of Jarvis Labs LLC has dropped significantly from its pre-pump levels, which could indicate a bearish case for Bitcoin in the short term. Despite these potential bearish factors, Lilly remains optimistic about Bitcoin&#8217;s future. He notes that the $24,000 level is still sitting there and could be had if the price breaks the 200-day moving average, which is currently creeping above it. If this happens, he predicts that Bitcoin could drop to $21,000-$22,000. However, Lilly also sees the possibility of an upside scenario for BTC. He notes that low-leverage liquidity sits at $32,000, and he would &#8220;love to see it taken out.&#8221;  Looking at the returns by trading session, he points out that the New York session seems to be leading the way. He notes that when the trend of the New York session ends, there&#8217;s a bit of a lag before the price responds to the downside, suggesting that the June options max pain of $25,000 may not happen. Lilly also highlights the recent increase in the whale holding chart, as seen in the chart below, which indicates that large Bitcoin holders, commonly referred to as whales, are once again accumulating the cryptocurrency.  This is the first time a trend like this has been observed since mid-January, suggesting that there may have been significant accumulation happening before the recent surge in BTC’s price. Related Reading: Is Chainlink The Most Undervalued Altcoin? It’s Do Or Die For LINK Overall, Lilly concludes that investors should not be quick to fade this Bitcoin rally. While there are potential bearish factors at play, there are also several bullish indicators. Investors should track the data to see if the trend continues and be prepared for potential volatility events in the future. At the time of writing, Bitcoin has maintained a stable price for several days. The cryptocurrency is currently trading at $30,100 and has managed to stay in positive territory, with a slight increase of 0.6% over the past 24 hours. Featured image from Unsplash, chart from TradingView.com "
  }
]