[
  {
    "source": "CryptoSlate",
    "date": "2023-09-29T22:50:33.000Z",
    "title": "OpenAI in early talks to collaborate with Jony Ive on AI rival to the iPhone",
    "url": "https://cryptoslate.com/openai-in-early-talks-to-build-iphone-rival-with-jony-ive/",
    "description": "<p>OpenAI intends to produce an artificial intelligence-focused equivalent to the iPhone, according to a report from the Financial Times on Sept. 28. That report indicates that OpenAI is working with LoveFrom, a design company founded by British designer Jony Ive. Ive was formerly responsible for various Apple designs but ended his contract with Cupertino firm [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/openai-in-early-talks-to-build-iphone-rival-with-jony-ive/\">OpenAI in early talks to collaborate with Jony Ive on AI rival to the iPhone</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-29T22:42:00.000Z",
    "title": "Crypto Analysts’ $XRP Price Prediction Suggests Potential Over 1,000% Surge to $6.7",
    "url": "https://www.cryptoglobe.com/latest/2023/09/crypto-analysts-xrp-price-prediction-suggests-potential-over-1000-surge-to-6-7/",
    "description": "The native token of the XRP Ledger, $XRP, has a new price prediction pointing to an impressive price surge of over 1,000% for the cryptocurrency to trade at the $6.7 mark in the future, as it’s been holding above a 10-year trendline support on its monthly chart. According to popular cryptocurrency analyst Egrag Crypto, who […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-29T23:00:25.000Z",
    "title": "LINK Price Primed For Meteoric Rise: Analyst Predicts 130% Rally To $18",
    "url": "https://www.newsbtc.com/analysis/link/link-price-130-rally-to-18/",
    "description": "The LINK price is no stranger to bullish rallies, and in September alone, the token has gone from a low of $5.8 to a peak of $7.9. Even now, bullish momentum among enthusiasts has not waned, especially with a 130% price increase prediction from a crypto analyst. LINK Price Prediction Ahead Of October In the analysis posted to TradingView, pseudonymous analyst Babenski explains the reasoning behind the $18 surge presented in their chart. First, it points to the $5.8 low that was recorded back in mid-September which is identified as the accumulation range. Related Reading: What Is Behind The 16% PEPE Price Recovery And Will It Continue? This is not out of the ordinary given the massive buying that took place when the LINK price fell to $5.8. This accumulation was the reason behind the support that was generated shortly after, which served as the lift-off point for the rally toward $8. Despite already seeing a nice 35% jump from its September lows, the analyst sees further upside. Putting the peak of the rally at $18 means that the LINK price could rise another 130% if it plays out as expected. LINK rally to $18 &#124; Source: Tradingview.com The first roadblock is a retracement that was placed just above the $8 level, and LINK is already seeing a similar retracement after almost touching $8. Going by the analyst’s chart, the price could decline a bit further before picking up once more and then shooting straight to $18. There is no timeframe added for when the LINK price would reach this price. But with September drawing to a close, October-November is more likely. LINK Whales Take Initiative The accumulation trend pointed out above has been mainly mounted by the LINK whales. Crypto analyst @ali_charts shared a chart on X (formerly Twitter) that showed that whales holding between 10,000 and 1,000 coins have been the main buyers. According to Ali, these whales bought up more than 7.5 million tokens in a matter of weeks which translated to about $53 million spent buying LINK. As the LINK price has risen, these holders are seeing profit on their purchase, which could explain the downward correction in the LINK price in the last day. #Chainlink whales have purchased over 7.5 million $LINK in the last two weeks, worth around $53 million! pic.twitter.com/jlu8stIB0r — Ali (@ali_charts) September 28, 2023 Related Reading: Factors That Suggest A Recovery For The ADA Price Nevertheless, the digital asset remains bullish, especially with the whales still holding more than 206 million coins. This suggests that they are not tempted to sell into the present rally and could be holding on for higher prices. LINK has been an impressive performer so far this week. It is up 15% on the 7-day chart, making it the best performer of the top 20 cryptocurrencies by market cap. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from BlockWorks, chart from TradingView.com"
  }
]