[
  {
    "source": "Cointelegraph",
    "date": "2024-01-26T02:41:10.000Z",
    "title": " JPMorgan says GBTC sell-off ‘behind us’ as ETFs post record net outflow ",
    "url": "https://cointelegraph.com/news/gbtc-sell-off-to-stem-jpmorgan-bitcoin-etfs-record-net-outflows",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMzcyZjVjMTMtMDMxYy00YTIzLWI5NjQtYjY1YWQzZDczMGNlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Analysts from JPMorgan believe the majority of “profit taking” from Grayscale’s Bitcoin Trust is now likely over, while U.S. Bitcoin funds have just recorded their biggest day of net outflows.</p>\n                    <p><p>Investors are likely done with the bulk of profit-taking from the Grayscale Bitcoin Trust (GBTC), which could ease pressure on the price of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), according to JPMorgan analysts.</p><p>It comes as daily net outflows from United States spot Bitcoin exchange-traded funds (ETFs) hit a record high on its ninth day of trading. </p><p>“GBTC profit taking has largely happened already,” said the analysts headed by market strategy managing director Nikolaos Panigirtzoglou in a Jan. 25 market report. “This would imply that most of the downward pressure on Bitcoin from that channel should be largely behind us.”</p><p><a href=\"https://cointelegraph.com/news/gbtc-sell-off-to-stem-jpmorgan-bitcoin-etfs-record-net-outflows\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-26T03:00:00.000Z",
    "title": "Bitcoin Whales and Sharks Actively Selling as Price Dips, On-Chain Analysis Shows",
    "url": "https://www.cryptoglobe.com/latest/2024/01/bitcoin-whales-and-sharks-actively-selling-as-price-dips-on-chain-analysis-shows/",
    "description": "As the price of the flagship cryptocurrency dips below the $40,000 mark amid a wide cryptocurrency market sell-off, new data has shown that Bitcoin inflows into centralized cryptocurrency exchanges show large investors are selling off their holdings. According to analysis by on-chain analytics firm CryptoQuant, these inflows have shown there are “signs of active selling […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-26T03:01:20.000Z",
    "title": "Bitcoin Price Eyes Recovery But Can BTC Bulls Regain Strength?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-eyes-recovery-40250/",
    "description": "Bitcoin price is aiming for an upside break above the $40,500 resistance. BTC bulls could face heavy resistance near $40,850 and $41,350. Bitcoin price is attempting a recovery wave from the $38,500 support zone. The price is trading just above $40,000 and the 100 hourly Simple moving average. There is a crucial bearish trend line forming with resistance near $40,250 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could struggle to settle above the $40,400 and $40,500 resistance levels. Bitcoin Price Eyes Upside Break Bitcoin price remained well-bid above the $38,500 support zone. BTC formed a base and recently started a consolidation phase above the $39,000 level. The price was able to recover above the 23.6% Fib retracement level of the downward move from the $42,261 swing high to the $38,518 low. The bulls seem to be active above the $39,200 and $39,350 levels. Bitcoin is now trading just above $40,000 and the 100 hourly Simple moving average. However, there are many hurdles near $40,400. Immediate resistance is near the $40,250 level. There is also a crucial bearish trend line forming with resistance near $40,250 on the hourly chart of the BTC/USD pair. The next key resistance could be $40,380 or the 50% Fib retracement level of the downward move from the $42,261 swing high to the $38,518 low, above which the price could rise and test $40,850. A clear move above the $40,850 resistance could send the price toward the $41,250 resistance. Source: BTCUSD on TradingView.com The next resistance is now forming near the $42,000 level. A close above the $42,000 level could push the price further higher. The next major resistance sits at $42,500. Another Failure In BTC? If Bitcoin fails to rise above the $40,380 resistance zone, it could start another decline. Immediate support on the downside is near the $39,420 level. The next major support is $38,500. If there is a close below $38,500, the price could gain bearish momentum. In the stated case, the price could dive toward the $37,000 support in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $39,420, followed by $38,500. Major Resistance Levels – $40,250, $40,400, and $40,850."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-26T03:00:34.000Z",
    "title": "Why Cardano Could Be The Next Big Crypto Winner: An Influencer’s Perspective",
    "url": "https://www.newsbtc.com/news/cardano/why-cardano-could-be-the-next-big-crypto-winner-an-influencers-perspective/",
    "description": "In a recent video from the crypto-based YouTube channel Cheeky Crypto, the host underscores Cardano&#8217;s (ADA) approach, which separates it from its contenders, particularly its reliance on &#8220;academic rigor&#8221; and &#8220;research-driven development.&#8221; Dropping out his reasons for being bullish on Cardano, the host highlighted the blockchain&#8217;s core use cases; starting in the video, the host defined Cardano as a proof-of-stake (PoS) blockchain platform developed using a &#8220;methodical, evidence-driven approach,&#8221; firmly anchored in the principles of &#8220;scientific research and academic thought.&#8221; According to the host, the Cardano development team aims to &#8220;restore trust in the global economic system.&#8221; This involves creating technologies that &#8220;foster secure, transparent, and sustainable international business practices.&#8221; Related Reading: Whales Go Wild: Cardano Transactions Surge 11% – Price Hike Incoming? Cardano To Become A Frontrunner Diving deeper into the video, the Cheeky Crypto host disclosed that aside from advanced technology, the platform is also about making a &#8220;real-world impact,&#8221; especially in developing regions. According to the host, the platform has initiated projects to provide financial services to the world’s &#8220;unbanked population,&#8221; which is estimated to be about $1.7 billion people. Cardano&#8217;s partnership with World Mobile in Africa is an example of such highlighting. The host noted: They (Cardano) are working with projects like World mobile to connect more people to the world as well as in my opinion create new economies and change many people&#8217;s lives. The Cheeky Crypto host also points out Cardano’s contribution to the decentralized applications (DApps) sector. With a keen &#8220;focus on security and scalability,&#8221; Cardano is creating a more stable environment for DApps., the host stated. Discussing the blockchain&#8217;s functionality, the host identifies it as a &#8220;third-generation cryptocurrency,&#8221; addressing common challenges faced by &#8220;layer one blockchain adoption.&#8221; Pointing out these challenges, the host disclosed: This issue covers a number of blockchain concerns including topics like scalability, interoperability, sustainability and security. So Cardano seeks to basically solve these issues through the development of design principles and engineering best practices. Concluding the use cases the host highlighted that make him bullish on Cardano, he mentioned that initially, the blockchain could process only a limited number of transactions per second. The team developed Hydra, a layer-two scaling solution employing state channels for off-chain transaction processing to overcome this. Hydra’s introduction marks a notable leap, enabling Cardano to theoretically handle over a million transactions per second, enhancing the network’s capacity dramatically. According to the host, these use cases are why Cardano could be one of the &#8220;front runners&#8221; in the crypto sector in the future. Related Reading: Cardano To $7? Analyst Predicts When ADA Will Resume Uptrend Cardano&#8217;s ADA Navigates Bearish Waters Meanwhile, despite these technological strides, ADA, Cardano’s native token, has been experiencing a bearish price action. Currently trading at $0.460, ADA has lost nearly 10% of its value over the past week. Analyst Ali has recently drawn parallels between ADA’s current consolidation phase and its pattern in late 2020. According to Ali&#8217;s analysis, should Cardano follow its late 2020 trajectory, ADA could witness a substantial upswing, potentially reaching new highs. #Cardano&#8216;s current consolidation phase mirrors its late 2020 behavior. If history repeats itself, we might see $ADA resuming its upward trend around April. This pattern continuation could potentially lead to an upswing toward $0.80, a brief correction to $0.60, then $7! pic.twitter.com/RuRA2EDMNP — Ali (@ali_charts) January 19, 2024 Featured image from Unsplash, Chart from TradingView"
  }
]