[
  {
    "source": "Decrypt",
    "date": "2023-10-06T19:35:40.000Z",
    "title": "Avalanche Pumps as Friend.tech Fork Stars Arena Catches Fire",
    "url": "https://decrypt.co/200457/avalanche-avax-pumps-friend-tech-fork-stars-arena",
    "description": "Despite a now patched exploit that attempted to drain funds, Stars Arena continues to draw users to its platform. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-06T19:19:38.000Z",
    "title": "Latest update — Former FTX CEO Sam Bankman-Fried trial [Day 4]",
    "url": "https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-updates",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/8c987bc0-629b-4bdf-bdc1-a38e679df2f9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The former FTX CEO faces seven counts of conspiracy and fraud. A New York court will decide his fate.</p>\n                    <p><p>Cointelegraph reporters are on the ground in New York for the trial of former FTX CEO Sam “SBF” Bankman-Fried. As the saga unfolds, check below for the latest updates.</p><h3>Oct. 5: Gary Wang details relationship between FTX and Alameda Research</h3><p>In over 4 hours of testimony, Gary Wang, co-founder of Alameda Research and FTX alongside Sam Bankman-Fried, provided in-depth details about the relationship between the companies and how the crypto empire ended up with an $8 billion hole in customer assets. </p><p>According to Wang, a few months after FTX's inception, in 2019, Alameda received special privileges from FTX. Prosecutors used screenshots of FTX’s database and code available on GitHub to show that Alameda was allowed to have an unlimited negative balance at FTX, a special line of credit of $65 billion in 2022, and an exemption from the liquidation engine. </p><p>The commingling of funds and problems between companies evolved over time. In 2020, Bankman-Fried instructed Wang that Alameda's negative balance should not exceed FTX’s revenue — a rule that changed over the years, according to Wang's testimony. In late 2021, for example, Alameda’s liability to FTX stood at $3 billion, up from $300 million in 2020. </p><p>\"I trusted his judgment,\" Wang said when asked why he agreed to Alameda's privileges. </p><p>However, these alleged privileges were part of Alameda’s role as a primary market maker for FTX, the defense argued later during Wang’s testimony. The defense counsel also noted that other market makers had similar privileges at FTX, and being able to go negative was a key feature of any market maker. </p><p>Another point emphasized by prosecutors was the MobileCoin (MOB) exploit in 2021. Bankman-Fried allegedly told Wang and Caroline Ellison to add the multimillion-dollar deficit to Alameda's balance sheet instead of keeping it on FTX to hide the loss from FTX investors.</p><p>Months before FTX’s collapse, Bankman-Fried, Wang, and Nishad Singh — former director of engineering — discussed shutting down Alameda and replacing its role with other market makers. The company's liabilities, however, were too high at the time, sitting at $14 billion. Alameda remained in operations until November 2022. </p><p>Wang's testimony will continue on Oct. 10 — the same day Ellison will also be heard.</p><h3>Oct. 5: Yedidia cross-examination, witness testimonies in focus</h3><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Day 3 of the <a href=\"https://twitter.com/hashtag/SBF?src=hash&amp;ref_src=twsrc%5Etfw\">#SBF</a> trial, we’re here bright and early! ☀️ <a href=\"https://t.co/PQ1rQV38Px\">pic.twitter.com/PQ1rQV38Px</a></p>&mdash; Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1709907602056892822?ref_src=twsrc%5Etfw\">October 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>A liability of $8 billion from Alameda to FTX was at the center of prosecutors’ cross-examination of Adam Yedidia on Oct. 5. Yedidia is a close friend of Sam Bankman-Fried and was a developer at FTX. He was also one of ten people to live in Bankman-Fried’s $35 million luxury resort in the Bahamas.</p><p>According to Yedidia’s testimony, since early 2021, FTX used an Alameda account labeled North Dimension to deposit users' funds while facing difficulties opening its own bank account. Funds would be considered Alameda's liability toward FTX, which reached $8 billion in June 2022.</p><p>While Yedidia was aware of the funds sent to Alameda's account, he didn't see it as a concern when he first heard about it in 2021. However, after learning about the liability amount in 2022, he voiced his concerns to Bankman-Fried during a tennis game. According to Yedidia, Bankman-Fried said the debt should be settled between the companies within six months to three years.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/84814733-30c3-475b-a6c5-6330993246a1.jpg\"  /><figcaption style=\"text-align: center;\"><em>Scenes from outside Sam Bankman-Fried’s trial location in New York. Source: Ana Paula Pereira/Cointelegraph</em></figcaption></figure><p>\"I trusted Sam, Caroline, and others in Alameda to handle the situation,\" he said, answering questions from prosecutors. Upon learning that Alameda was not only holding the funds, but using them to pay its debtors, Yedidia resigned in November 2022.</p><p>While prosecutors used the case to illustrate how the companies were commingling funds, Bankman-Fried's defense counsel sought to share a broader picture of FTX and Alameda's relationship with the jury.</p><p>The defense highlighted that FTX was growing fast, with its leadership working over 10 hours a day during the 2021 bull market, including Bankman-Fried, who oversaw several parts of the company at the time.</p><p>The defense counsel also pointed out that Yedidia had been under several inquiries from prosecutors under an immunity order, meaning cooperation with prosecutors would protect him from facing any charges regarding his role at FTX. </p><p>Also, according to Bankman-Fried's defense, FTX's difficulties opening a bank account and its reliance on Alameda's North Dimension to deposit funds were well known. Yedidia's cross-examination will resume this afternoon in the federal courtroom in lower Manhattan.</p><p>Two witnesses testified during the second part of the Sam Bankman-Fried trial on Oct. 5: Matthew Huang, co-founder of Paradigm, and Gary Wang, co-founder of FTX and Alameda Research.</p><p>Paradigm invested a total of $278 million in FTX in two funding rounds between 2021 and 2022. According to Huang, the venture capital firm was not aware of the commingling of funds between FTX and Alameda, nor of the privileges that Alameda had with the crypto exchange.</p><p>Such privileges included Alameda's exemption from FTX’s liquidation engine (a tool that closes positions at risk of liquidation). With the exemption, Alameda was able to leverage its position and maintain a negative balance with FTX.</p><p>The Paradigm co-founder also acknowledged that the firm did not conduct deeper due diligence on FTX, instead relying on information provided by Bankman-Fried.</p><p>Another concern for Paradigm was FTX not having a board of directors. According to Huang, Bankman-Fried was \"very resistant\" to the idea of having investors on FTX's board of directors but promised to build one and appoint experienced executives to serve on it.</p><p><a href=\"https://cointelegraph.com/news/alameda-research-withdraw-unlimited-funds-gary-wang\">During his brief testimony</a>, Wang acknowledged that he, along with Bankman-fried and Caroline Ellison, had committed wire fraud, securities fraud, and commodities fraud.</p><p>Wang also noted that Alameda had special privileges with FTX, such as the ability to withdraw unlimited funds from the exchange, as well as a line of credit of $65 billion. To illustrate these privileges, Wang pointed out that any other market maker would have a credit line in the millions, while Alameda had a credit line in the billions. </p><p>A loan of approximately $200 million to $300 million from Alameda was also mentioned by Wang, allegedly as part of the purchase of other crypto firms. However, the loans were never credited to his account. His testimony will continue on Oct. 6.</p><h3>Oct. 4: DOJ and Bankman-Fried’s defense state their arguments</h3><p>The first hours of SBF’s trial have offered a glimpse of the arguments the United States Department of Justice (DOJ) and the former FTX CEO’s defense will bring to court in the coming weeks.</p><p>After a jury selection in the morning, both parties gave opening statements to the 12-person jury present in the court.</p><p>The DOJ took a tough stance against Bankman-Fried in its first statement, portraying the FTX founder as someone who deliberately lied to investors to enrich himself and expand his crypto empire.</p><p>According to the DOJ, Bankman-Fried lied to FTX customers and investors, using Alameda as a key partner to “steal customers’ funds,” a phrase that was frequently used during the opening statements.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/1004794e-c2f7-4865-9c1b-39a97e4c06f2.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>A sign outside Sam Bankman-Fried’s trial location in New York. Source: Ana Paula Pereira/Cointelegraph</em></figcaption></figure><p>As per the trial preview, the DOJ will focus its arguments on allegations that Bankman-Fried misled customers, investors and lenders regarding the safety of their funds while using Alameda to steal their money and influence politicians in Washington.</p><p>The defense, meanwhile, brought arguments about Bankman-Fried being a young entrepreneur who made business decisions that “didn’t work out.” The defense denied the existence of secret transactions between Alameda and FTX or a backdoor used to steal customer funds. According to the previous arguments presented, all transactions were legitimate or made in good faith by Bankman-Fried during the crypto market downturn and the subsequent collapse of FTX in November 2022.</p><p>The defense also highlighted the role of Binance in the bank run that led to FTX’s collapse. Testimonies will continue throughout the day.</p><p>According to the defense, Bankman-Fried assumed FTX was allowed to loan funds to Alameda as part of a business relationship with the market maker, and there was no secret door for transactions between the companies.</p><p>Prosecutors also noted that Caroline Ellison, Gary Wang and Nishad Singh will offer the jury insider details about Bankman-Fried’s role in FTX’s operations and alleged crimes. However, the defense pointed out that as part of the cooperation agreement with the government, they were supposed to give testimony against Bankman-Fried, raising doubts about their credibility.</p><p>The defense also downplayed the accusations against the nature of the relationship between FTX and Alameda, arguing that FTX margin traders were aware of the risks associated with transactions.</p><p>“There was no theft,” the defense claimed. “It’s not a crime to be the CEO of a company that files for bankruptcy.”</p><p>In the second half of the first day of the trial, the jury heard from two witnesses: Mark Julliard, a French trader and former client of FTX, and Adam Yedidia, a friend of Sam Bankman-Fried and former employee at Alameda Research and FTX.</p><p>In his testimony, Julliard said he had four Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) held at FTX at the time of the exchange’s collapse, worth nearly $100,000. He admitted that FTX and Bankman-Fried’s marketing efforts, as well as the notable venture capital companies backing FTX, gave him the confidence to use the exchange for crypto trading. He assumed that venture capital firms had done due diligence on FTX and its leadership.</p><p>During the questioning, prosecutors emphasized that the trader used FTX exclusively for spot trading and was unaware that the exchange used client funds for crypto trading with Alameda Research.</p><p>Questions for Yedidia were focused on his educational background at the Massachusetts Institute of Technology, where he first met Bankman-Fried and had two professional experiences with the FTX founder. Yedidia worked at Alameda briefly in 2017 as a trader and then returned to work for FTX in 2021 as a developer. He was among 10 people living in the Bahamas on FTX’s $30 million real estate.</p><p>In Yedidia’s testimony, prosecutors used former FTX ads as evidence that the company was always positioning itself as a safe, trusted and easy way to invest in cryptocurrency, including marketing campaigns with NFL player Tom Brady and comedian Larry David. The trial will resume Oct. 5.</p><h3>Oct. 3: SBF trial begins</h3><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/2a41313e-7417-40e7-99d5-fb2eee7cb785.jpg\"  /><figcaption style=\"text-align: center;\"><em>Bankman-Fried’s trial will take place in a Manhattan federal court. Source: Ana Paula Pereira/Cointelegraph</em></figcaption></figure><p>The trial of Sam Bankman-Fried began on Oct. 3 with jury selection. Bankman-Fried is charged with seven counts of conspiracy and fraud in connection with the collapse of FTX, the cryptocurrency exchange he co-founded. He <a href=\"https://cointelegraph.com/news/ftx-s-sam-bankman-fried-pleads-not-guilty-to-fraud-charges-report\">has pleaded not guilty</a> to all charges. The case is being heard by Judge Lewis Kaplan, who has presided over a long list of other high-profile cases, including ones involving detainees at Guantanamo Bay, the Gambino crime family, Prince Andrew and Donald Trump.</p><p>Bankman-Fried <a href=\"https://cointelegraph.com/news/judge-orders-sam-bankman-fried-bail-revoked-following-allegations-witness-intimidation\">was ordered to be jailed</a> on Aug. 11 after Kaplan found that his sharing of former Alameda Research CEO Caroline Ellison’s personal papers amounted to witness intimidation. Alameda Research was a trading house also founded by Bankman-Fried. Previously, he had <a href=\"https://cointelegraph.com/news/sbf-sent-home-after-his-parents-put-up-their-house-to-cover-his-astronomical-bail-bond\">been under house arrest</a> in his parents’ home in Stanford, California, on a $250-million bond.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/gB1zBrqHPLw\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><h3>December: SBF arrested</h3><p>Bankman-Fried was arrested in the United States on his arrival from the Bahamas on Dec. 21, 2022. He had <a href=\"https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-arrested-and-in-custody-attorney-general\">been arrested in the Bahamas</a> on Dec. 12 after the U.S. government formally notified the country of charges the U.S. was filing against him. He declared his intention to fight extradition from the Caribbean nation but changed his mind after a week in Bahaman jail and <a href=\"https://cointelegraph.com/news/sam-bankman-fried-seeks-to-reverse-decision-on-contesting-extradition-report\">consented to extradition</a>.</p><p>Meanwhile, FTX co-founder Gary Wang and Alameda Research CEO (and reportedly sometime SBF girlfriend) Ellison <a href=\"https://cointelegraph.com/news/caroline-ellison-gary-wang-plead-guilty-to-fraud-charges\">agreed to plead guilty</a> in the burgeoning case.</p><h3>November: FTX collapses</h3><p>Bankman-Fried’s troubles began when reports emerged on Nov. 2 that Alameda Research had a large holding of FTX Token (<a href=\"https://cointelegraph.com/ftx-token-ftt-price-index\">FTT</a>), FTX’s utility token. That revelation led to questions about the relationship between the two entities. On Nov. 6, Changpeng Zhao, CEO of rival exchange Binance, announced that his exchange <a href=\"https://cointelegraph.com/news/binance-to-liquidate-its-entire-ftx-token-holdings-after-recent-revelations\">would liquidate its FTT</a> holdings, which were estimated to be worth $2.1 billion. Zhao turned down an offer tweeted by Ellison to buy Binance’s FTT.</p><p>A run <a href=\"https://cointelegraph.com/news/ftx-addresses-user-withdrawal-complaints-amid-major-token-movement\">began on FTX</a>. Bankman-Fried gave reassurances on Twitter (now X) that the exchange’s “assets are fine” and accused “a competitor” of spreading rumors. By Nov. 8, the price of FTT had <a href=\"https://cointelegraph.com/news/ftx-token-price-risks-30-plunge-as-a-23m-ftt-part-moves-to-binance\">fallen from $22</a> to $15.40.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">It’s only been one week since SBF’s notorious “FTX is fine. Assets are fine.” <a href=\"https://t.co/zKoILqquHF\">pic.twitter.com/zKoILqquHF</a></p>&mdash; Robert Smith (@BondHack) <a href=\"https://twitter.com/BondHack/status/1592250606747799552?ref_src=twsrc%5Etfw\">November 14, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Also on Nov. 8, Bankman-Fried announced on Twitter that he had <a href=\"https://cointelegraph.com/news/binance-ceo-announces-intent-to-acquire-ftx-to-help-cover-the-liquidity-crunch\">come to an agreement</a> with Zhao “on a strategic transaction.” He wrote, “Our teams are working on clearing out the withdrawal backlog as is. This will clear out liquidity crunches; all assets will be covered 1:1.”</p><p>On Nov. 9, Zhao announced that Binance <a href=\"https://cointelegraph.com/news/ftx-s-binance-rescue-deal-falls-apart-in-less-than-48-hours\">would not pursue the acquisition of FTX</a> after due diligence and more reports of mishandled funds. The price of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) <a href=\"https://cointelegraph.com/news/bitcoin-price-hits-multi-year-low-at-15-6k-analysts-expect-further-downside\">plummeted to $15,600</a>. The FTX and Alameda Research <a href=\"https://cointelegraph.com/news/alameda-s-research-and-ftx-ventures-websites-taken-down\">websites went dark</a> for a few hours. When the FTX website came back, it bore a warning against making deposits and was unable to process withdrawals.</p><p>On Nov. 10, Bankman-Fried <a href=\"https://cointelegraph.com/news/sam-bankman-fried-apologizes-over-ftx-liquidity-crisis-i-fucked-up-twice\">posted a 22-part Twitter thread</a> that began with “I’m sorry.” It was the first of a long string of public statements he made about the exchange’s fall. The following day, the entire staff of Alameda Research quit, and FTX, FTX US and Alameda Research <a href=\"https://cointelegraph.com/news/ftx-ftx-us-and-alameda-file-for-chapter-11-bankruptcy-in-us-sbf-resigns\">filed for bankruptcy in the United States</a>. Bankman-Fried resigned as FTX CEO and was replaced by John J. Ray III, who was best known for his role in the Enron bankruptcy.</p><h3>SBF and FTX before the fall</h3><p>At the beginning of 2022, FTX <a href=\"https://cointelegraph.com/news/ftx-exchange-breaks-32b-valuation-despite-crypto-winter-fears\">had a $32-billion valuation</a> and <a href=\"https://cointelegraph.com/news/ftx-revenue-reportedly-grew-1000-in-one-year-leaked-documents-reveal\">was thought to be in enviable financial condition</a>. Bankman-Fried was seen as a respected business leader by much of the crypto community and the world at large. He was photographed with political leaders and <a href=\"https://www.agriculture.senate.gov/imo/media/doc/Testimony_Bankman-Fried_0209202211.pdf\" target=\"_blank\" rel=\"noopener nofollow\">spoke</a> at congressional <a href=\"https://docs.house.gov/meetings/AG/AG00/20220512/114729/HHRG-117-AG00-Wstate-Bankman-FriedS-20220512.pdf\" target=\"_blank\" rel=\"noopener nofollow\">hearings</a>. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Maxine Waters is chairing the investigation into FTX <a href=\"https://t.co/oFMctH4rRh\">https://t.co/oFMctH4rRh</a> <a href=\"https://t.co/Ox6O5w4nOl\">pic.twitter.com/Ox6O5w4nOl</a></p>&mdash; Jordan Schachtel @ dossier.today (@JordanSchachtel) <a href=\"https://twitter.com/JordanSchachtel/status/1593289220755525632?ref_src=twsrc%5Etfw\">November 17, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>He had <a href=\"https://cointelegraph.com/magazine/sam-bankman-fried-the-crypto-whale-who-wants-to-give-billions-away/\">gained a reputation as a philanthropist</a>, pursuing a philosophy popular among academics known as “effective altruism.” Part of his implementation of that philosophy <a href=\"https://cointelegraph.com/news/sam-bankman-fried-could-spend-up-to-1b-in-2024-to-thwart-trump-comeback\">was political activism</a> in the form of financial support for candidates.</p><p>As the crypto winter set in, Bankman-Fried <a href=\"https://cointelegraph.com/news/sbf-and-alameda-step-in-to-prevent-crypto-collapse-contagion\">spoke of FTX and Alameda Research’s</a> “responsibility to seriously consider stepping in, even if it is at a loss to ourselves, to stem contagion.” The companies made a bid for Voyager Digital <a href=\"https://cointelegraph.com/news/voyager-rejects-alameda-buyout-offer-as-it-harms-customers\">that was rebuffed</a>.</p><p>FTX <a href=\"https://cointelegraph.com/news/ftx-and-visa-partner-to-permit-crypto-payments-in-40-countries\">made a deal with Visa</a> to introduce its own debit card in 40 countries.</p><p>Bankman-Fried, Ellison and other alumni of Jane Street Capital founded Alameda Research in 2017. Bankman-Fried went on to found FTX with Wang in 2019. Zhao was an early investor in the exchange.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  }
]