[
  {
    "source": "Cointelegraph",
    "date": "2023-06-07T16:41:00.000Z",
    "title": "Cointelegraph Pitch Room launched, bridging promising projects to quality investors",
    "url": "https://cointelegraph.com/news/cointelegraph-pitch-room-launched-bridging-promising-projects-to-quality-investors",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/1f2f73be263d19a3c4112b59bbb04514.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cointelegraph presents Pitch Room, where innovation meets opportunity.</p>\n                    <p><p><a href=\"https://research.cointelegraph.com\"><img alt=\"Presented by Cointelegraph Research\" src=\"https://s3.cointelegraph.com/storage/uploads/view/81f5d60d5a584971c5ab38087f10d2ea.jpg\" title=\"Presented by Cointelegraph Research\"></a></p><p>Cointelegraph presents <a href=\"https://research.cointelegraph.com/pitch-room/lists\">Pitch Room</a>, a new stage in the effort to boost innovation in the crypto space, dedicated to investors interested in deal flow. Pitch Room opens doors for promising startups in the Web3 space, exploring new markets and building solutions with the potential to disrupt the industry. Investors can view a one-page summary of each company, a two-minute elevator pitch and an in-depth presentation. The goal of Pitch Room is to bridge venture capitalists and private equity managers with innovative firms at the cutting edge of the crypto space.</p><p>As Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) matures and delivers a beta return in the industry, investors are now looking for disruptive innovation to generate alpha returns. By actively seeking out startups and projects that push the boundaries of what is possible in the Web3 space, investors aim to capitalize on the next wave of innovation that can drive alpha returns, leading to exciting opportunities for both investors and the industry as a whole.</p><p><a href=\"https://research.cointelegraph.com/pitch-room/lists\">Join Pitch Room now and be the first to see the future of crypto</a>.</p><h2>Challenges for investors</h2><p>Despite the large number of companies emerging in the crypto and Web3 space, it is often difficult for investors to assess the true potential of many projects. This is especially true for investors who may not have a strong technical background or a deep understanding of the underlying technology.</p><p>Another challenge for investors is the sheer number of projects out there. According to data from <a href=\"https://coinmarketcap.com/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">CoinMarketCap</a>, there are currently over 9,600 cryptocurrencies in circulation, with new projects being launched all the time. Similarly, there are countless <a data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/what-is-web-3-0-a-beginners-guide-to-the-decentralized-internet-of-the-future/amp\" href=\"https://cointelegraph.com/learn/what-is-web-3-0-a-beginners-guide-to-the-decentralized-internet-of-the-future\">Web3 projects</a> in development, ranging from <a data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance/amp\" href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> protocols to <a data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world/amp\" href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">non-fungible token (NFT)</a> marketplaces and beyond.</p><p>With so many options available, it can be overwhelming for investors to determine which projects are worth their time and money. Startups often <a href=\"https://professionalprograms.mit.edu/blog/design/why-95-of-new-products-miss-the-mark-and-how-yours-can-avoid-the-same-fate/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">struggle</a> to articulate their key idea and the practical benefits of their product, and investors can struggle to distinguish between two similar projects, making it hard to determine which one is more likely to succeed.</p><p>In addition, the crypto and Web3 industry is still subject to some risks and uncertainties, like regulatory changes, technical glitches and market volatility, which can all affect a project’s success. Consequently, investors need to evaluate these risks and assess whether the potential rewards a project can bring outweigh the potential downsides.</p><h2>Pitching innovation</h2><p>To help institutional and retail investors overcome these challenges, Cointelegraph launched <a href=\"https://research.cointelegraph.com/pitch-room/lists\">Pitch Room</a>. With this new initiative, Cointelegraph’s team hosts pitch desks and helps investors navigate the complexities of these emerging industries. From on-chain scoring and capital-efficient lending protocol <a href=\"https://research.cointelegraph.com/pitch-room/detail/rocifi-investor-pitch-room\">RociFi</a> to a one-stop gaming ecosystem <a href=\"https://research.cointelegraph.com/pitch-room/detail/gameswift-investor-pitch-room\">GameSwift</a>, Cointelegraph introduces the companies’ products, elaborates on their competitive advantages, market size perspectives and team background, and much more.</p><p>Pitch Room allows Web3 entrepreneurs to present ideas, solutions and long-term visions for their projects as well as discuss their experience, market conditions, expansion plans and more. For example, in a two-minute pitch accompanied by an interview, Bernardo Corti, CEO of decentralized derivatives exchange EMDX, <a href=\"https://research.cointelegraph.com/pitch-room/detail/emdx-investor-pitch-room\">provides insights</a> into the company’s mission and addresses market issues and challenges. Corti also presents the company’s financial derivatives products and discusses the benefits of the Avalanche blockchain and strategic partnerships. In such a short and easy-to-understand format, investors can quickly get brief information about the project, and then contact the entrepreneurs if interested.</p><p>Pitch Room is always on the lookout for both innovative startups and qualified investors interested in staying updated on promising companies and emerging market trends. Feel free to <a href=\"mailto:pitchroom@cointelegraph.com\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">contact us</a> for more information or to submit your application.</p>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-07T16:50:24.000Z",
    "title": "Nansen data shows nearly $600M in outflows at Binance, Coinbase",
    "url": "https://cryptoslate.com/nansen-data-shows-nearly-600m-in-outflows-at-binance-coinbase/",
    "description": "<p>Binance and Coinbase have cumulatively seen net outflows of $597.2 million across all protocols during the last 24 hours, according to data from blockchain analytical firm Nansen. A breakdown of the data showed that Binance and its U.S. subsidiary, Binance US, recorded a negative netflow of $491.9 million, while Coinbase saw $105.3 million. &#8220;Netflow is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/nansen-data-shows-nearly-600m-in-outflows-at-binance-coinbase/\">Nansen data shows nearly $600M in outflows at Binance, Coinbase</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-06-07T17:08:12.000Z",
    "title": "SEC Accuses Binance.US, CZ of Billion-Dollar Investor Fund Risk",
    "url": "https://cryptobriefing.com/sec-accuses-billion-dollar-investor-fund-risk/?utm_source=feed&utm_medium=rss",
    "description": "The U.S. Securities and Exchange Commission (SEC) has extended its legal proceedings against Binance.US after its initial suit against the exchange, claiming that the industrys largest exchange put investors&#8217; funds..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-07T16:48:27.000Z",
    "title": "Robinhood Mulls Delisting Tokens SEC Deems Securities",
    "url": "https://cryptodaily.co.uk/2023/06/robinhood-mulls-delisting-tokens-sec-deems-securities",
    "description": "<p>Trading platform Robinhood is reportedly reviewing its cryptocurrency offerings following the SEC crackdown on Binance and Coinbase. </p>\n<p>Robinhood Markets Inc. is reportedly reassessing the cryptocurrencies it offers on its platform after the US Securities and Exchange Commission (SEC) sued crypto exchanges Coinbase and Binance. On Tuesday, the company&rsquo;s chief legal officer, Dan Gallagher, told Congress that it is &ldquo;actively reviewing&rdquo; the SEC&rsquo;s analysis &ldquo;to determine what, if any, action to take.&rdquo;</p>\n<p>A former SEC commissioner, Gallagher, testified before the House Agriculture Committee during a meeting on digital assets.</p>\nSEC Believes Several Popular Cryptocurrencies are Unregistered Securities\n<p>In its lawsuit against Binance and its CEO Changpeng Zhao, the SEC alleged that popular cryptocurrencies such as Cardano (ADA), Polygon (MATIC), and Solana (SOL) are unregistered securities.</p>\n<p>Robinhood currently offers its clients 18 different tokens to trade with compared to hundreds available on Coinbase&rsquo;s platform, Bloomberg reports.</p>\n<p>Some of the 18 tokens that Robinhood offers, however, the SEC have deemed to be unregistered securities. These tokens include Cardano, Solana, and Polygon.</p>\nThe Lawsuits Against Binance and Coinbase\n<p>The SEC ramped up its efforts to target unregistered securities and filed lawsuits against Binance, its CEO Changpeng Zhao, and crypto exchange Coinbase.</p>\n<p>The agency accused Binance of mishandling customer funds and lying to investors and regulators about its operations. The SEC also alleges that the company&rsquo;s CEO failed to restrict US customers from its platform and mislead investors about its market surveillance controls.</p>\n<p>Less than a day after lodging a complaint against Binance, the agency sued Coinbase in a New York federal court.</p>\n<p>In a press release, the SEC said Coinbase acted as an unregistered securities exchange, broker, and clearing agency and charged it for &ldquo;the unregistered offer and sale of securities in connection with its staking-as-a-service program.&rdquo;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T16:53:36.000Z",
    "title": "Pepe price analysis: PEPE turns bearish as selling pressure prevails",
    "url": "https://www.cryptopolitan.com/pepe-price-analysis-2023-06-07/",
    "description": "The most recent Pepe price analysis shows a decline in PEPE&#8217;s market position. The sharp decline in price has been caused by the recent selling pressure from the sellers. PEPE started today&#8217;s trading session with bulls ruling the market, but the sellers started to push the price lower as declines in volume were also noted. ... <a title=\"Pepe price analysis: PEPE turns bearish as selling pressure prevails\" class=\"read-more\" href=\"https://www.cryptopolitan.com/pepe-price-analysis-2023-06-07/\" aria-label=\"More on Pepe price analysis: PEPE turns bearish as selling pressure prevails\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T16:48:36.000Z",
    "title": "Uwerx (WERX) Presale Rewards Investors While Fetch.ai (FET) Awaits Revival",
    "url": "https://www.cryptopolitan.com/uwerx-werx-presale-rewards-investors-while-fetch-ai-fet-awaits-revival/",
    "description": "Uwerx (WERX) Presale Rewards Investors While Fetch.ai (FET) Awaits Revival The world of cryptocurrency investments is filled with both opportunities and challenges. Uwerx stands out with its presale in this ever-evolving landscape, rewarding investors with promising prospects.&#160; Meanwhile, Fetch.ai (FET) navigates a different journey, awaiting a potential revival. Join us as we delve into the ... <a title=\"Uwerx (WERX) Presale Rewards Investors While Fetch.ai (FET) Awaits Revival\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uwerx-werx-presale-rewards-investors-while-fetch-ai-fet-awaits-revival/\" aria-label=\"More on Uwerx (WERX) Presale Rewards Investors While Fetch.ai (FET) Awaits Revival\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-07T17:00:43.000Z",
    "title": "Late Evidence In Criminal Trial Irks SBF, FTX Explores Options For AI Stock Sale",
    "url": "https://www.newsbtc.com/crypto/late-evidence-in-criminal-trial-irks-sbf-ftx-explores-options-for-ai-stock-sale/",
    "description": "Former FTX CEO Sam Bankman-Fried (SBF) is still entwined in his legal battle over the FTX crisis. In a letter, SBF’s legal team stated that prosecutors are behind on deadlines for vital evidence to build their defense on numerous fraud charges.  SBF has faced multiple charges since the collapse of FTX, which authorities insist was not an accident but a deliberate and fraudulent act. Since the crash, investigators have worked tirelessly on the case to unravel the true extent of damage to investors. SBF’s Lawyers Send Letter To District Judge Sam Bankman-Fried’s lawyers sent a letter to United States District Judge Lewis A. Kaplan. In the letter, they stated that the government failed to release the entire contents of five electronic devices vital to the case. Related Reading: Bitcoin Slips Below $26,000, Triggers Over $300 Million In Liquidations According to this letter, a laptop and iPhone belonging to former Alameda Research CEO Caroline Ellison and a laptop belonging to FTX Co-founder Gary Wang were part of the devices. SBF&#8217;s legal team noted that since the trial date was less than four months away, the late presentation of these documents would affect their preparation for the defense.  Additionally, the letter stated that the government had failed to produce any information on FTX debtors. The lawyers revealed that over 3.6 million documents were missing, which is a cause for concern for the defendants.  These documents include 2 million Google Search Warrant Documents and approximately 500,000 documents received in response to subpoenas and voluntary production requests. Also, there are documents containing the content of Caroline Elisson’s laptop and two other laptops provided by two FTX software developers.  Additional documents containing correspondence on Telegram and Slack also make up these figures and are essential bits of evidence. Related Reading: Bitcoin Crash To $25,800 Sends 6.5% Of Supply Into Loss Sam Bankman-Fried is set to appear in court on October 2, 2023, to face fraud charges and additional claims bordering on bribing the Chinese government and illegal donations. So, his lawyers are pushing for these documents to prepare a strong defense.  FTX Bankers Seek To Cash Out On AI Shares FTX bankers tasked with reviving the company&#8217;s fortunes allegedly seek to cash in on shares in the Artificial Intelligence (AI) sector. According to a report by Semanfor on June 6, FTX holds a stake in an AI startup Anthropic, currently worth billions of dollars. A bank and part of FTX&#8217;s revival team, Perella Weinberg, hinted at the sale of shares in Anthropic to investors. Anthropic created a rival to the ChatGPT, the Claude Chatbot, thus gaining massive share value. Related Reading: LDO Leads Top Coins, Registers 6% Gains In One Day FTX allegedly owned $500 million worth of Anthropic stock before its bankruptcy. Now, the stake is expected to have increased to nine figures and will go to repaying former customers. Currently, the bankers are deliberating on a total or partial sale since they believe that AI value will keep rising as it is now a lucrative niche, and Anthropic created two years ago, has an estimated value of $4.6 billion. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-07T17:02:29.000Z",
    "title": "The Importance of Crypto Payments in 2023",
    "url": "https://dailyhodl.com/2023/06/07/the-importance-of-crypto-payments-in-2023/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2021/06/coinspaid-crypto-livewire-featured-image-template-1.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/06/coinspaid-crypto-livewire-featured-image-template-1.jpg 500w, https://dailyhodl.com/wp-content/uploads/2021/06/coinspaid-crypto-livewire-featured-image-template-1.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2021/06/coinspaid-crypto-livewire-featured-image-template-1.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2021/06/coinspaid-crypto-livewire-featured-image-template-1.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2021/06/coinspaid-crypto-livewire-featured-image-template-1.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>By now you have probably realized that cryptocurrency can no longer be ignored. As each new day passes, cryptocurrencies and digital payments with crypto are continuing to gain traction in the global economy. One of the key elements driving this trend is the adoption of crypto payment gateways by businesses from all kinds of industries. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/07/the-importance-of-crypto-payments-in-2023/\">The Importance of Crypto Payments in 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-07T17:01:17.000Z",
    "title": "The Progress of Web 3.0 and Controlling Our Data",
    "url": "https://dailyhodl.com/2023/06/07/the-progress-of-web-3-0-and-controlling-our-data/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/Data-Will-Be-Collected-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/Data-Will-Be-Collected-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/Data-Will-Be-Collected-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/Data-Will-Be-Collected-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/Data-Will-Be-Collected-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/Data-Will-Be-Collected-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/Data-Will-Be-Collected-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>In the past, surrendering our personal information has been the hidden cost of entry into the digital world. We&#8217;ve been conditioned to believe that this is the only way – that relinquishing control over our digital identities is the price we pay for convenience and connectivity. This misconception has been perpetuated and normalized over the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/07/the-progress-of-web-3-0-and-controlling-our-data/\">The Progress of Web 3.0 and Controlling Our Data</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-07T16:55:25.000Z",
    "title": "United Kingdom Has Finite Window of Opportunity To Ensure Leadership in Crypto: UK Parliamentary Group",
    "url": "https://dailyhodl.com/2023/06/07/united-kingdom-has-finite-window-of-opportunity-to-ensure-leadership-in-crypto-uk-parliamentary-group/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/united-has-finite-window.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/united-has-finite-window.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/united-has-finite-window.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/united-has-finite-window.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/united-has-finite-window.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/united-has-finite-window.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/united-has-finite-window.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A parliamentary group in the United Kingdom (UK) says that the country can emerge as a leader in the digital asset space if it moves quickly. The bipartisan parliamentary group known as Crypto and Digital Assets All Party Parliamentary Group (APPG) says in a new report that the UK has between a year and a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/07/united-kingdom-has-finite-window-of-opportunity-to-ensure-leadership-in-crypto-uk-parliamentary-group/\">United Kingdom Has Finite Window of Opportunity To Ensure Leadership in Crypto: UK Parliamentary Group</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-07T16:48:41.000Z",
    "title": "Proof of Talk 2023 – Two Days To Restore Trust in Web 3.0 and Design the Future of the Industry",
    "url": "https://dailyhodl.com/2023/06/07/proof-of-talk-2023-two-days-to-restore-trust-in-web-3-0-and-design-the-future-of-the-industry/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Proof-of-Talk-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Proof-of-Talk-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/06/Proof-of-Talk-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/06/Proof-of-Talk-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Proof-of-Talk-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/06/Proof-of-Talk-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>June 6, 2023 – Paris, France On June 14 and 15, 2023, Web 3.0 industry leaders will gather in Paris to set a roadmap for the future of the ecosystem. An ambitious program to address all sides of the conversation, from VC in crypto and adapting to a bear market to institutional adoption to get [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/07/proof-of-talk-2023-two-days-to-restore-trust-in-web-3-0-and-design-the-future-of-the-industry/\">Proof of Talk 2023 – Two Days To Restore Trust in Web 3.0 and Design the Future of the Industry</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]