[
  {
    "source": "CoinDesk",
    "date": "2023-10-17T02:58:28.000Z",
    "title": "Protocol Village: ARPA Network's Random Number Generator 'Randcast' Live on Optimism",
    "url": "https://www.coindesk.com/tech/2023/10/16/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the week of Oct. 16-22, with live updates throughout."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T03:03:13.000Z",
    "title": "3billion Sets a New Standard in AI-Powered Genetic Diagnostics for Rare Diseases with NovaSeq X",
    "url": "https://www.cryptopolitan.com/3billion-ai-powered-genetic-diagnostics/",
    "description": "In a groundbreaking development for the field of rare disease diagnostics, 3billion, the forefront player in AI-powered genetic diagnostics, has seamlessly integrated Illumina&#8217;s NovaSeq X into its technological arsenal. The NovaSeq X, succeeding the NovaSeq 6000, promises a remarkable leap in DNA sequencing capacity. This enhancement positions 3billion at the forefront of the dynamic and ... <a title=\"3billion Sets a New Standard in AI-Powered Genetic Diagnostics for Rare Diseases with NovaSeq X\" class=\"read-more\" href=\"https://www.cryptopolitan.com/3billion-ai-powered-genetic-diagnostics/\" aria-label=\"More on 3billion Sets a New Standard in AI-Powered Genetic Diagnostics for Rare Diseases with NovaSeq X\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T03:00:14.000Z",
    "title": "Photoshop vs Canva Comparison, Which Has Better AI Expansion Tool?",
    "url": "https://www.cryptopolitan.com/photoshop-vs-canva-ai-expansion-tool/",
    "description": "Photoshop and Canva are among the best design software programs for creatives. Recently, the two platforms made changes to incorporate AI technology into their software, enabling designers or photographers to edit or tune their images to the desired perfection.&#160; One of the many AI tools enabling Photoshop and Canva users to make these changes is ... <a title=\"Photoshop vs Canva Comparison, Which Has Better AI Expansion Tool?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/photoshop-vs-canva-ai-expansion-tool/\" aria-label=\"More on Photoshop vs Canva Comparison, Which Has Better AI Expansion Tool?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-17T03:09:10.000Z",
    "title": "Bitcoin Price Key Indicators Suggest Fresh Rally Toward $30K",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-rally-toward-30k/",
    "description": "Bitcoin price spiked toward $30,000 after fake news about spot ETF hit the market. BTC is now consolidating above $28,200 and could rise toward $29,200. Bitcoin is holding gains above the $28,000 and $28,200 levels. The price is trading above $28,200 and the 100 hourly Simple moving average. There is a key bullish trend line forming with support near $28,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh increase if there is a clear move above the $28,800 resistance. Bitcoin Price Aims Higher Bitcoin price started a strong increase above the $27,500 resistance zone. BTC saw a wild increase after fake news about the spot ETF approval hit the market. There was a nasty increase above the $28,500 resistance. The price even spiked toward $30,000 before trimming gains. There was a drop below the $29,200 and $28,800 support levels. The price even declined below the 50% Fib retracement level of the upward move from the $26,820 swing low to the $30,000 high. Bitcoin price is now trading above $28,200 and the 100 hourly Simple moving average. There is also a key bullish trend line forming with support near $28,000 on the hourly chart of the BTC/USD pair. The trend line is near the 61.8% Fib retracement level of the upward move from the $26,820 swing low to the $30,000 high. On the upside, immediate resistance is near the $28,600 level. The next key resistance could be near $28,800. A clear move above the $28,600 and $28,800 resistance levels could set the pace for a larger increase. The next key resistance could be $29,200. Source: BTCUSD on TradingView.com A close above the $29,200 resistance might start a steady increase toward the $29,500 level. Any more gains might send BTC toward the $30,000 level. Another Decline In BTC? If Bitcoin fails to rise above the $28,800 resistance zone, it could slide further. Immediate support on the downside is near the $28,000 level and the trend line zone. The next major support is near the $27,800 level. A downside break and close below the $27,800 support might send the price further lower. The next support sits at $27,200 and the 100 hourly Simple moving average. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $28,000, followed by $27,800. Major Resistance Levels – $28,600, $28,800, and $29,200."
  }
]