[
  {
    "source": "Cointelegraph",
    "date": "2024-03-21T17:49:42.000Z",
    "title": " Nvidia CEO’s simple solution to AI hallucination could upend crypto — but only if it works ",
    "url": "https://cointelegraph.com/news/nvidia-ceo-simple-solution-artificial-intelligence-ai-hallucination-upend-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvOWRhNmEzZGMtNGM0Yi00OTliLTgxNzEtZjk3YjgwZDc0OTMyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The only problem: Jensen Huang’s solution is already out there, and AI systems still hallucinate.</p>\n                    <p><p>Nvidia CEO Jensen Huang recently went on the record to say that it was his belief that human-level artificial intelligence (AI) will probably be realized within the next five years and that hallucinations, one of the field’s biggest challenges, will be simple to solve. </p><p>Huang’s comments came during a speech at the Nvidia GTC developers conference in San Jose, California, on March 20. </p><p>During the event’s keynote speech, Huang addressed the idea of artificial general intelligence (AGI). According to a report from TechCrunch, the CEO <a href=\"https://techcrunch.com/2024/03/19/agi-and-hallucinations/\" target=\"_blank\" rel=\"noopener nofollow\">told</a> reporters that the arrival of AGI was an issue of benchmarking:</p><p><a href=\"https://cointelegraph.com/news/nvidia-ceo-simple-solution-artificial-intelligence-ai-hallucination-upend-crypto\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-21T18:01:33.000Z",
    "title": "Core Foundation Ignites Global Blockchain Innovation with $15 Million Funding Initiative",
    "url": "https://www.cryptopolitan.com/core-foundation-global-blockchain-funding/",
    "description": "In a significant move poised to catalyze the growth of blockchain technology across emerging markets, the Core Foundation has successfully galvanized a robust network of investors and venture capitalists to kickstart the Core Venture Network (CVN).&#160; The ambitious initiative aims to bolster the development of the Core Chain, a pioneering blockchain that marries the security [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-21T17:59:44.000Z",
    "title": "Solana Meme Coin Slerf Offers NFT Compensation Following $10 Million Loss",
    "url": "https://www.cryptopolitan.com/solana-meme-coin-slerf-nft-compensation-loss/",
    "description": "In a dramatic turn of events, the Solana-based meme coin project, Slerf, has found itself at the center of a financial debacle, resulting in a staggering loss of over $10 million for its presale investors.&#160; The mishap, attributed to a critical error by the project&#8217;s developer, has led to the accidental burning of a significant [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-21T17:57:58.000Z",
    "title": "Unleashing Innovation: dApp Launchpad by Polygon Labs",
    "url": "https://www.cryptopolitan.com/innovation-dapp-launchpad-by-polygon-labs/",
    "description": "In the dynamic realm of blockchain technology, the quest for tools that streamline the development process of decentralized applications (dApps) is relentless. As the industry grows, so does the necessity for platforms that not only simplify development workflows but also enhance scalability and user experience. Stepping into the space with a groundbreaking solution is Polygon [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-21T17:57:04.000Z",
    "title": "Vitalik Buterin unveils plan to secure Ethereum with Rainbow Staking",
    "url": "https://www.cryptopolitan.com/vitalik-plan-ethereum-with-rainbow-staking/",
    "description": "Ethtaipei 2024, Ethereum co-founder Vitalik Buterin revealed two significant developments aimed at fortifying Ethereum&#8216;s infrastructure and combating centralization risks. The introduction of &#8220;Rainbow Staking&#8221; and the proposal of a &#8220;Recovery Hard Fork&#8221; underscore Ethereum&#8217;s commitment to innovation and security in the ever-evolving blockchain landscape. Empowering Ethereum against Centralization Risks with Rainbow Staking At Ethtaipei, Buterin [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-21T17:55:59.000Z",
    "title": "Floki (FLOKI) Investors Add New Meme Rival To Holdings, FLOKI Price Analysis",
    "url": "https://nulltx.com/floki-floki-investors-add-new-meme-rival-to-holdings-floki-price-analysis/",
    "description": "In the vast expanse of the cryptocurrency market, meme coins have carved out their niche, captivating investors with their unique blend of culture, humor, and potential for significant returns. Among these, Floki (FLOKI) has stood out as a favored choice for many, drawing inspiration from the wider world of internet [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-21T18:04:46.000Z",
    "title": "Borroe Finance seen as potential mooner as Celestia and SATS underperform",
    "url": "https://crypto.news/borroe-finance-seen-as-potential-mooner-as-celestia-and-sats-underperform/",
    "description": "In recent forecasts, analysts tout Borroe Finance ($ROE) as a top contender for substantial gains, while Celestia (TIA) and SATS face challenges amid market fluctuations. #partnercontent"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-21T17:52:27.000Z",
    "title": "Arthur Hayes predicts $10 surge for dogwifhat as memecoin mania heats up",
    "url": "https://crypto.news/arthur-hayes-predicts-10-surge-for-dogwifhat-as-memecoin-mania-heats-up/",
    "description": "Former BitMEX CEO Arthur Hayes stirs excitement in the crypto sphere by endorsing Dogwifhat, forecasting a $10 milestone amidst surging memecoin fervor. As Hayes backs WIF, Galaxy Fox emerges as the next potential. #partnercontent"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-21T18:00:50.000Z",
    "title": "US Spot Bitcoin ETFs Experience Record Outflows, Losing $740 Million In Three Days",
    "url": "https://www.newsbtc.com/bitcoin-news/us-spot-bitcoin-etfs-experience-record-outflows-losing-740-million-in-three-days/",
    "description": "The 10 spot Bitcoin ETFs experienced their biggest three-day outflow since their debut in January, as reported by Bloomberg. This shift in investor sentiment comes after heightened interest that propelled the largest cryptocurrency in the market to a record high of $73,700. Bitcoin ETFs See Record Outflows Between Monday and Wednesday, a net total of $742 million exited the Bitcoin ETFs, reflecting outflows from the Grayscale Bitcoin Trust (GBTC) and a moderation in subscriptions for similar offerings from prominent firms like BlackRock (IBIT) and Fidelity Investments (FBTC). Related Reading: Cardano (ADA) Eyes Explosive 2000% Bull Run, Targeting $12 And Quadrupling ATH According to Bloomberg ETF expert Eric Balchunas, the Grayscale Bitcoin Trust has experienced a notable outflow surge. This recent development indicates a &#8220;second wind&#8221; of investor withdrawals, with a substantial $1.4 billion leaving the trust just this week.  Notably, these withdrawals have surpassed all other ETFs in year-to-date outflows and set a new record for cumulative outflows in ETF history, as shown in the chart above. Nevertheless, GBTC continues to hold a prominent position in terms of revenue generation. It currently ranks third out of the 3,400 ETFs available, demonstrating its continued financial success. Despite the recent outflows, the overall performance of these funds remains noteworthy, with net inflows of $11.4 billion recorded since their launch, according to data compiled by Bloomberg. This signifies one of the most successful debuts for an ETF category. Crypto Analyst Predicts &#8220;Massive Bounce&#8221; For BTC Bitcoin experienced a significant surge of over 5% in the United States on Wednesday, propelled by signals from the Federal Reserve (Fed) hinting at potential interest-rate cuts.  However, the Asian market painted a different picture on Thursday, with Bitcoin losing momentum compared to continued gains in global stocks and gold. According to Bloomberg, the news of outflows from Bitcoin ETFs permeated markets, contributing to the contrasting performance. Related Reading: Dogecoin Price Holds Crucial Support But Can DOGE Clear This Hurdle? Nonetheless, renowned crypto analyst Michael van de Poppe shared a bold prediction on social media platform X (formerly Twitter). In his post, he expressed optimism about a &#8220;massive bounce&#8221; for Bitcoin, suggesting the potential for a continuation of its upward trajectory.  Van de Poppe also predicted that Bitcoin could consolidate in the near term before embarking on another rally towards the all-time high it reached before the halving event, which is expected to begin sometime in April. Currently, BTC is trading at $66,200, reflecting a 4% increase in the past 24 hours despite ongoing outflows in the ETF market. Over longer time frames, Bitcoin has shown consistent gains, with a 27% increase over the past thirty days and an impressive 136% gain year-to-date. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-21T17:59:30.000Z",
    "title": "Grayscale $12B+ Bleeding Now Sinking Bitcoin ETF Net Flows",
    "url": "https://coinedition.com/grayscale-12b-bleeding-now-sinking-bitcoin-etf-net-flows/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Hedge-Fund-Sues-Grayscale-for-Data-on-Battered-Bitcoin-Trust.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Grayscale Registers Bitcoin Trust Ads With SEC; Is an Approval Close?\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Hedge-Fund-Sues-Grayscale-for-Data-on-Battered-Bitcoin-Trust.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Hedge-Fund-Sues-Grayscale-for-Data-on-Battered-Bitcoin-Trust-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Hedge-Fund-Sues-Grayscale-for-Data-on-Battered-Bitcoin-Trust-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Hedge-Fund-Sues-Grayscale-for-Data-on-Battered-Bitcoin-Trust-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Hedge-Fund-Sues-Grayscale-for-Data-on-Battered-Bitcoin-Trust-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Hedge-Fund-Sues-Grayscale-for-Data-on-Battered-Bitcoin-Trust-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Data from European asset manager CoinShares has highlighted that the unyielding outflows from Grayscale Investment’s Bitcoin exchange-traded fund (ETF), GBTC, are now impacting the net flow of funds to the U.S. ETFs. In a recent post on X, James Butterfill, the Head of Research at CoinShares, disclosed that Grayscale&#8217;s GBTC negative flows now surpass the [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/grayscale-12b-bleeding-now-sinking-bitcoin-etf-net-flows/\">Grayscale $12B+ Bleeding Now Sinking Bitcoin ETF Net Flows</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-21T18:05:48.000Z",
    "title": "Trader Says He’s Still Incredibly Bullish on Top Ethereum Rival, Updates Outlook on Bitcoin and Three Altcoins",
    "url": "https://dailyhodl.com/2024/03/21/trader-says-hes-still-incredibly-bullish-on-top-ethereum-rival-updates-outlook-on-bitcoin-and-three-altcoins/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Three-Other-Crypto.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Three-Other-Crypto.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Three-Other-Crypto.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Three-Other-Crypto.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Three-Other-Crypto.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Three-Other-Crypto.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Three-Other-Crypto.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist remains bullish on a top Ethereum (ETH) competitor despite a sudden correction. Pseudonymous analyst Altcoin Sherpa tells his 212,100 followers on the social media platform X that Solana (SOL) is showing strength after retesting the $165 Fibonacci retracement level. “SOL: good first reaction to that $165 level. To be determined [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/21/trader-says-hes-still-incredibly-bullish-on-top-ethereum-rival-updates-outlook-on-bitcoin-and-three-altcoins/\">Trader Says He’s Still Incredibly Bullish on Top Ethereum Rival, Updates Outlook on Bitcoin and Three Altcoins</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]