[
  {
    "source": "CryptoSlate",
    "date": "2023-08-28T22:00:51.000Z",
    "title": "China combats struggling financial markets with tax cuts",
    "url": "https://cryptoslate.com/insights/china-combats-struggling-financial-markets-with-tax-cuts/",
    "description": "<p>Quick Take In a determined bid to reanimate its ailing financial markets, China has slashed stock trading taxes by half, as reported by market analyst Ayesha Tariq. Alongside this, the government has directed state-owned banks and funds to invest in stocks, adding a new layer of complexity to the nation&#8217;s economic landscape. Highly noticeable is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/china-combats-struggling-financial-markets-with-tax-cuts/\">China combats struggling financial markets with tax cuts</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T21:41:28.000Z",
    "title": "Hong Kong has some big dreams for web3",
    "url": "https://www.cryptopolitan.com/hong-kong-has-some-big-dreams-for-web3/",
    "description": "Bold ambitions are pulsing through Hong Kong&#8217;s tech hubs. Hong Kong&#8217;s financial compass, Paul Chan Mo-po, isn&#8217;t one to let sleeping dogs lie, especially when the future of the digital realm is unfolding right before our eyes. At the forefront of the digital revolution, Hong Kong stands tall, yearning for what the Web3 era has ... <a title=\"Hong Kong has some big dreams for web3\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hong-kong-has-some-big-dreams-for-web3/\" aria-label=\"More on Hong Kong has some big dreams for web3\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-28T22:00:32.000Z",
    "title": "XRPL Labs Reveals Smart Contract Sidechain For XRP Ledger, What This Means For The Altcoin",
    "url": "https://www.newsbtc.com/analysis/xrp/xrpl-labs-reveals-smart-contract-sidechain-for-xrp/",
    "description": "Earlier today, XRPL Labs divulged its latest development: Xahau Ledger, a smart contract sidechain integrated into the XRP Ledger (XRPL) ecosystem. This is said to enhance the capabilities of the XRP Ledger, pushing it a step closer to widespread retail adoption. The announcement by XRPL Labs, the brain behind the XRP Ledger&#8217;s self-custody wallet named Xumm, has reignited excitement within the community, pointing toward significant advancements for this altcoin. However, so far, the altcoin remains in red down by 1% in the past 24 hours. Related Reading: Pantera CEO Calls Ripple Victory A Black Swan, But Is It Bad? An Introduction To Xahau Ledger On August 28, XRPL Labs conveyed its integration with the Xahau Ledger, characterizing it as an &#8220;ambitious move&#8221; to introduce multifaceted features to the XRP Ledger. This integration is seen as a catalyst, propelling the adoption of the altcoin and its foundational ledger. We are proud to be part of the Xahau network (@XahauNetwork) as a launch participant. As stated earlier, we will support multiple chains that use the XRPL protocol and our commitment to the main XRPL remains steadfast. https://t.co/olzsK3veCx — XRPL Labs 🪝 (@XRPLLabs) August 28, 2023 Such progress firmly positions the XRP Ledger protocol to break new ground in the retail sector. Furthermore, XRPL Labs is in the phase of rolling out a comprehensive whitepaper for the Xahau Ledger. As emphasized by the developers, this sidechain&#8217;s primary purpose is to infuse the XRPL ecosystem with smart contract capabilities. The Vision For The Smart Contract Sidechain For XRP Ledger Wietse Wind, the founder of XRPL Labs, in a recent update on X (formerly recognized as Twitter), disclosed the collaboration with prominent names, including GateHub, Alloy Networks, and EvernodeXRPL. For ~two years @XRPLLabs has collaborated with other entities with a track record of building on and supporting the XRPL ecosystem. Today, together we publish the Whitepaper for &#8220;Xahau&#8221;, an XRP Ledger protocol chain. We&#8217;re proud to publish the Xahau Whitepaper alongside of… https://t.co/q75V1djsSp — WietseWind (🛠+🪝 Xumm @ XRPL Labs) (@WietseWind) August 28, 2023 According to Wind, their joint efforts have led to the Xahau whitepaper&#8217;s publication, underscoring the potential of the Ledger-powered smart contracts. Wind envisions these contracts as pivotal in crafting solutions for daily life challenges. The XRPL founder further disclosed his commitment to the XRP Ledger ecosystem. In his words: We will continue to build for the entire XRP Ledger ecosystem, and everything we build will be open for the entire ecosystem to benefit from. He further expressed his optimism for a multi-chain XRPL Protocol ecosystem, emphasizing the combination of XRPL Mainnet&#8217;s proven resilience with the limitless potential of Hooks. Furthermore, Wind dropped hints about future updates to the Xumm wallet, indicating support for multiple XRPL Protocol networks, notably XRPL Mainnet and Xahau. Related Reading: Experts Explain Why SEC’s Interlocutory Appeal In Ripple Case Was A Mistake According to the founder, this is a move aimed at achieving the overarching vision of XRP retail adoption. To add to the anticipation, Wind hinted that Xahau might become operational before the year concludes. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-28T22:01:50.000Z",
    "title": "SEC Says NFTs Are Securities in Lawsuit Against Los Angeles Entertainment Company Impact Theory",
    "url": "https://dailyhodl.com/2023/08/28/sec-says-nfts-are-securities-in-lawsuit-against-los-angeles-entertainment-company-impact-theory/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/Unveils-Roadmap-for-NFTs.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/Unveils-Roadmap-for-NFTs.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/Unveils-Roadmap-for-NFTs.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/Unveils-Roadmap-for-NFTs.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/Unveils-Roadmap-for-NFTs.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/Unveils-Roadmap-for-NFTs.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/Unveils-Roadmap-for-NFTs.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. Securities and Exchange Commission (SEC) is charging a widely followed media company with securities violations in relation to the sale of non-fungible tokens (NFTs). The SEC is announcing formal charges against the Los Angeles-based entertainer Impact Theory for allegedly offering NFTs as an &#8220;unregistered offering of crypto asset securities.&#8221; &#8220;[The SEC] today charged Impact [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/28/sec-says-nfts-are-securities-in-lawsuit-against-los-angeles-entertainment-company-impact-theory/\">SEC Says NFTs Are Securities in Lawsuit Against Los Angeles Entertainment Company Impact Theory</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]