[
  {
    "source": "Decrypt",
    "date": "2023-12-13T01:49:37.000Z",
    "title": "Trump Goes Phygital, Borrowing From Digital Fashion Playbook",
    "url": "https://decrypt.co/209569/trump-goes-phygital-borrowing-digital-fashion-playbook",
    "description": "Former U.S. President Donald Trump has embraced a popular digital fashion trend in his latest NFT collection. What's next?"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-13T02:03:18.000Z",
    "title": "Coinbase to list Solana’s BONK, meme coin jumps over 8%",
    "url": "https://cryptobriefing.com/coinbase-list-solanas-meme-coin-bonk-token-jumps-8/?utm_source=feed&utm_medium=rss",
    "description": "Coinbase announced plans to list popular meme token Bonk (BONK)."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-13T02:00:42.000Z",
    "title": "Senate Coalition Grows to Crack Down on Crypto’s Use in Illicit Finance",
    "url": "https://news.bitcoin.com/senate-coalition-grows-to-crack-down-on-cryptos-use-in-illicit-finance/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/elizabeth-warren-crypto-crackdown-bill-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Senate Coalition Grows to Crack Down on Crypto&#039;s Use in Illicit Finance\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/elizabeth-warren-crypto-crackdown-bill-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/elizabeth-warren-crypto-crackdown-bill-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/elizabeth-warren-crypto-crackdown-bill-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/elizabeth-warren-crypto-crackdown-bill-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/elizabeth-warren-crypto-crackdown-bill-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/elizabeth-warren-crypto-crackdown-bill-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/elizabeth-warren-crypto-crackdown-bill.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />U.S. Senator Elizabeth Warren&#8217;s bill to crack down on crypto&#8217;s use in illicit finance has gained more support among lawmakers. &#8220;The Treasury Department is making clear that we need new laws to crack down on crypto’s use in enabling terrorist groups, rogue nations, drug lords, ransomware gangs, and fraudsters to launder billions in stolen funds, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-13T02:00:08.000Z",
    "title": "Bitcoin’s Unshakable Bottom: Analyst Reveals The Price BTC Won’t Drop Below",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-analyst-reveals-the-price-btc-wont-drop-below/",
    "description": "The crypto market, especially Bitcoin (BTC), has recently declined. Amid these fluctuations, the flagship cryptocurrency has been intensely scrutinized. Despite its decline from the recent peak of $44,000, a crypto analyst urged the community not to &#8220;succumb to panic.&#8221; The current market situation reflects a typical correction phase rather than a long-term bearish trend. According to Ali Charts, a prominent crypto analyst, Bitcoin has established a &#8220;robust&#8221; support zone between $37,150 and $38,360. This critical range is bolstered by the activity of approximately 1.52 million addresses that collectively purchased roughly 534,000 BTC at that price point, as indicated by Ali. Related Reading: Market Jolt: Bitcoin Falls Below $42,000 As Short Term Holders Rush To Cash In The analyst suggests that the significant accumulation forms a &#8220;strong&#8221; foundation, potentially preventing further declines in Bitcoin’s value. Bitcoin&#8217;s Resistance And The Road Ahead Despite the recent market downturn, Bitcoin&#8217;s potential for recovery and continued growth remains a subject of interest. Ali has also identified two key resistance levels at $43,850 and $46,400 that could challenge Bitcoin’s upward momentum. These points represent significant thresholds where selling pressure may intensify, potentially hindering Bitcoin&#8217;s ability to reclaim its recent highs. In case of a deeper correction, #Bitcoin finds solid support between $37,150 and $38,360. This zone is backed by 1.52 million addresses holding 534,000 $BTC. Also, watch out for two resistance walls that could keep the #BTC uptrend at bay: one at $43,850 and another at $46,400. pic.twitter.com/NGm1XpMOLf — Ali (@ali_charts) December 11, 2023 Meanwhile, the past 24 hours have seen Bitcoin’s price dip by 0.3% with a price below $42,000, continuing its retreat from the $44,000 mark. This reduction in value is mirrored in the crypto&#8217;s trading volume, which has fallen from $37 billion to $21 billion. This decline indicates a decreased trading activity, suggesting a cooling-off period following the recent market rally. The Positive Side Of The Bitcoin Pullback Amid concerns over Bitcoin&#8217;s price fluctuations, experts like William Clemente, co-founder of Reflexivity Research, offer a different perspective. Clemente emphasizes that the current pullback, potentially bringing Bitcoin’s price to around $40,000, is not necessarily a negative development. Clemente argues that this correction is essential for &#8220;shaking out weak hands&#8221; and reducing leverage in the market, ultimately laying a more solid foundation for future growth. Related Reading: The Bitcoin Spot ETF Boom: VanEck Forecasts $2.4 Billion Inflows In Q1 2024 The Co-founder of Reflexivity Research further noted that &#8220;Bitcoin’s volatility is a feature, not a bug.&#8221; BTC just ~doubled in 2 months with no pull backs, a correction is not that surprising. Corrections shake out “weak hands” and leverage, allowing for a stronger foundation for eventual moves higher. Bitcoin’s volatility is a feature, not a bug. Chill with the leverage 🫡 https://t.co/BdvvS8KDZU — Will (@WClementeIII) December 11, 2023 Featured image from iStock, Chart from TradingView"
  }
]