[
  {
    "source": "CoinDesk",
    "date": "2023-12-15T21:27:29.000Z",
    "title": "Polygon Stops Work on 'Edge,' Used to Build Dogechain, as Focus Turns to ZK",
    "url": "https://www.coindesk.com/tech/2023/12/15/polygon-stops-work-on-edge-used-to-build-dogechain-as-focus-turns-to-zk/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Polygon Labs, a developer of scaling networks for Ethereum, has shifted toward \"Polygon CDK,\" a blockchain-development kit powered by zero-knowledge cryptography. The older \"Polygon Edge\" was used by Dogechain, in an unofficial effort to build a Dogecoin-oriented smart-contracts network."
  },
  {
    "source": "Decrypt",
    "date": "2023-12-15T21:51:49.000Z",
    "title": "Solana Weighs Demand for Saga Phones After Sellout Amid BONK Boom",
    "url": "https://decrypt.co/210036/solana-weighs-demand-saga-phones-after-sellout-amid-bonk-boom",
    "description": "The Saga is sold out in the U.S. and EU supplies are nearly tapped out. Solana Labs told Decrypt how it’s assessing next moves."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-15T21:47:20.000Z",
    "title": " Why is Ethereum (ETH) price down today?  ",
    "url": "https://cointelegraph.com/news/why-is-ethereum-eth-price-down-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTIvNzY1MTY5ZjktYTBmMC00MTdlLTgwYTctZTQ2YzYyZDU4ZjI2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ether price is down today as a handful of negative news and network-related incidents impact investor confidence.</p>\n                    <p><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) price is down on Dec. 15 after failing to break above the $2,320 resistance level. The recent price correction can be attributed to negative remarks from regulators, a hack that affected nearly the entire Web3 ecosystem, reduced activity in the Ethereum network, and criticism from a former Ethereum Foundation developer.</p><p>A broader analysis of the time frame provides a different perspective on the relatively narrow 7.6% daily close fluctuations over the past 11 days. Ether saw a 40% rally before entering the current $2,190 to $2,360 range. Consequently, the lack of a clear direction could simply indicate an accumulation period.</p><p>The price of Ether has also been influenced by the hype surrounding spot exchange-traded funds (ETFs), especially after the $9-trillion global asset manager, BlackRock, confirmed its <a href=\"https://cointelegraph.com/news/blackrock-enters-race-spot-ethereum-etf-nasdaq-filing\">plans to launch a spot Ether ETF</a> on Nov. 9. Momentum continued to build on Nov. 21 when Bloomberg ETF <a href=\"https://cointelegraph.com/news/grayscale-meets-sec-to-discuss-bitcoin-trust\">analysts reiterated a 90% probability</a> of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) ETF approval by Jan. 10.</p><p><a href=\"https://cointelegraph.com/news/why-is-ethereum-eth-price-down-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-15T21:35:58.000Z",
    "title": " Kazakhstan central bank reviews digital tenge pilot successes, next steps ",
    "url": "https://cointelegraph.com/news/kazakhstan-central-bank-reviews-digital-tenge-pilot-successes-next-steps",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNmVjMjZiZmItOTI4My00OWRiLTgxZDAtNmQxZmRmYjYyMTdjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The digital tenge has been used for everything from free school lunches to tokenizing gold, and there’s more to come.</p>\n                    <p><p>The digital tenge, Kazakhstan’s central bank digital currency (CBDC), has been declared a success <a href=\"https://cointelegraph.com/news/kazakhstan-officially-launches-digital-tenge\">after a month-long pilot project</a>. A host of business, regulatory and technical improvements are lined up for it in 2024.</p><p>During its pilot run, the digital tenge was used to provide schoolchildren with free lunches in Almaty through the local Onay! card, which was originally designed for use in the transit system. The Kazpost postal system operator served as the intermediary for those transactions. </p><p>Plastic cards were issued to members of focus groups by four local banks in conjunction with Visa and Mastercard. The cards allowed users to make purchases in person or online and to withdraw cash from ATMs. The participating merchant had the option of accepting digital tenge or converting them to “non-cash” tenge. </p><p><a href=\"https://cointelegraph.com/news/kazakhstan-central-bank-reviews-digital-tenge-pilot-successes-next-steps\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-15T21:40:18.000Z",
    "title": "BlackRock previews AI co-pilot; attends high-level SEC meeting on spot Bitcoin ETF",
    "url": "https://cryptoslate.com/blackrock-previews-ai-co-pilot-attends-high-level-sec-meeting-on-spot-bitcoin-etf/",
    "description": "<p>This week, BlackRock, the world&#8217;s largest asset manager, made significant strides in its artificial intelligence and Bitcoin ETF efforts as it heads into the year&#8217;s end. Pensions &#38; Investments reported on Dec. 14 that BlackRock has launched an AI tool or &#8220;copilot&#8221; in a private preview aimed at BlackRock&#8217;s eFront users. The eFront copilot, described [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/blackrock-previews-ai-co-pilot-attends-high-level-sec-meeting-on-spot-bitcoin-etf/\">BlackRock previews AI co-pilot; attends high-level SEC meeting on spot Bitcoin ETF</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-15T22:00:13.000Z",
    "title": "Bitcoin Miner Hive Diversifies Into AI, Acquires 96 Nvidia GPUs to Boost High-Performance Computing Operations",
    "url": "https://news.bitcoin.com/bitcoin-miner-hive-diversifies-into-ai-acquires-96-nvidia-gpus-to-boost-high-performance-computing-operations/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/hiver-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Miner Hive Diversifies Into AI, Acquires 96 Nvidia GPUs to Boost High-Performance Computing Operations\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/hiver-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hiver-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hiver-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hiver-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hiver-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hiver-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hiver.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Friday, Hive Digital, based in Vancouver and specializing in bitcoin mining and high-performance computing (HPC), announced its foray into artificial intelligence (AI) and HPC technologies. This strategic move involves acquiring 96 Nvidia H100 graphics processing units (GPUs). From Bitcoin Mining to AI Expansion: Hive Digital Acquires Nvidia GPUs for HPC Enhancement Hive Digital (Nasdaq: [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-15T22:05:15.000Z",
    "title": "Breaking: Coinbase sues SEC for rejecting its petition",
    "url": "https://www.cryptopolitan.com/coinbase-sues-sec-for-rejecting-its-petition/",
    "description": "Coinbase, a leading player in the cryptocurrency exchange market, has initiated legal action against the U.S. Securities and Exchange Commission (SEC). This lawsuit comes in response to the SEC&#8217;s rejection of Coinbase&#8217;s petition for clearer cryptocurrency regulations. This legal battle marks a significant escalation in the ongoing tension between the crypto industry and regulatory authorities, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-15T21:56:45.000Z",
    "title": "U.S. banks finally start to regain momentum after collapses",
    "url": "https://www.cryptopolitan.com/us-banks-regain-momentum-after-collapses/",
    "description": "In a remarkable turnaround, U.S. banks are witnessing a resurgence, fueled by the Federal Reserve&#8217;s recent indications of potential rate cuts. This shift marks a significant rebound for a sector that has been beleaguered by market volatility and banking crises throughout the year. The resurgence in bank stocks reflects a growing optimism in the financial [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-15T21:52:49.000Z",
    "title": "Casio launches second batch of exclusive NFTs featuring virtual G-Shock designs",
    "url": "https://www.cryptopolitan.com/casio-launches-second-batch-of-exclusive-nft/",
    "description": "Casio, the well-known Japanese electronics company, has unveiled its second collection of exclusive digital art collectibles. This new batch of NFTs showcases the iconic G-Shock brand of watches, adding a unique digital dimension to the renowned timepieces. Virtual G-Shock NFTs: A futuristic collection Casio&#8217;s latest NFT release comprises 2,000 digital art pieces featuring futuristic &#8220;Virtual [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-15T21:21:21.000Z",
    "title": "Europe’s defense dilemma: Time to take action?",
    "url": "https://www.cryptopolitan.com/europes-defense-dilemma-time-to-take-action/",
    "description": "In the realm of global defense and security, Europe stands at a crossroads, faced with a dilemma that could define its future stance in the world. Amidst rising geopolitical tensions and evolving threats, the continent&#8217;s approach to defense has come under scrutiny, prompting a critical question: is it time for Europe to take decisive action [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-15T21:10:07.000Z",
    "title": "Polygon Labs shifts development focus to Chain Development Kit (CDK), ending contributions to Edge framework",
    "url": "https://www.cryptopolitan.com/polygon-labs-focus-chain-development-kit-cdk/",
    "description": "Polygon Labs has announced the cessation of contributions to its Edge framework, commonly referred to as Supernets, to concentrate its resources on the development of the Chain Development Kit (CDK).&#160; Emerging trends in blockchain development The initial purpose of Polygon Edge, an open-source tool under the Apache License 2.0, was to aid in creating custom [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-15T22:00:20.000Z",
    "title": "Solana’s BONK Token Rockets To New Heights, Surging 121% On Binance Listing News",
    "url": "https://www.newsbtc.com/news/solanas-bonk-token-rockets-to-new-heights-surging-121-on-binance-listing-news/",
    "description": "In an unexpected turn of events, the Solana-based memecoin Bonk (BONK) has experienced an extraordinary 1,000% monthly surge following its recent listings on major cryptocurrency exchanges.  The momentum began with Coinbase&#8217;s listing, followed closely by Binance&#8217;s surprise announcement, propelling BONK to new heights and generating enthusiasm within the crypto community. Astounding 1,000% Surge On Binance And Coinbase Listings The listing on Binance proved to be a game-changer for BONK, as its price skyrocketed above $0.00003, marking an astounding increase of over 1,000% in just one month. The frenzy surrounding the memecoin became evident when a trader sold 52.3 billion BONK tokens, equivalent to approximately $927,000, and realized a staggering profit of around $784,000.  According to Lookonchain, this trader had purchased 69 billion BONK at a price of approximately $0.0000021 and staked them from October 30 to November 29, reaping substantial returns from the meteoric rise of BONK. Related Reading: Crypto Analyst Who Predicted Bitcoin 2023 Bull Run Releases New Target Beyond the price surge, another noteworthy development has captured the attention of investors. The Solana community has witnessed a surge in the sales of Solana phones, driven by the recent price hike of Solana&#8217;s memecoin.  Raj Gokal, the co-founder of Solana, shared in a December 15 post on X that Solana phone sales have increased by over 10 times within the past 48 hours and are now projected to sell out before the new year. Gokal stated: Just so everyone is aware, Solana mobile saga sales have &#62;10x&#8217;d in the past 48 hours, and are now on track to sell out before the new year. Moreover, Richard Wu, co-founder of Tensor, Solana&#8217;s non-fungible token marketplace, expressed his astonishment, stating: “This is crazy. BONK saved Solana on Christmas 2022. BONK is saving the Solana Saga Phone on Christmas 2023.&#8221;  Wu emphasized that, unlike other dog coins, Bonk has emerged as the savior of Solana, a battle-tested high-throughput Layer 1 blockchain. He further added, &#8220;It&#8217;s not just a meme anymore. This is religion.&#8221; BONK Memecoin&#8217;s Impressive Surge Paired With Solana&#8217;s Growth Based on the 1-hour chart for BONK, the memecoin has consistently reached new highs since the start of the current bull run on November 8.  Notably, the token has surpassed significant moving averages, including the 200-day and 50-day MA. This is a positive indicator of the token&#8217;s potential, as there are currently no visible resistance levels unless a correction occurs. Related Reading: Crypto Expert Says Cardano Will Rise To $32 As Most Valuable Altcoin In The Bull Run, Here’s Why It is worth noting that SOL has experienced a remarkable 443% uptrend year-to-date, along with significant ecosystem growth in recent months. This, combined with the ongoing memecoin frenzy, suggests that there may be no limits or boundaries for BONK&#8217;s upward trajectory. Following the announcement of Binance&#8217;s listing, the token experienced a surge of 121%, which has been further complemented by gains observed in the past 24 hours. However, BONK&#8217;s current price stands at $0.00002888, representing a shortfall of over 30% from its recent highs. The extent of BONK&#8217;s potential and the future patterns it will exhibit in its various time frames remain to be seen. These developments will provide further insights into the token&#8217;s future growth potential or possible corrections. However, the overall outlook for BONK appears promising for investors. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-15T21:27:00.000Z",
    "title": "Every Investor Should Have Crypto in Their Portfolio: Expert",
    "url": "https://coinedition.com/every-investor-should-have-crypto-in-their-portfolio-expert/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Every Investor Should Have Crypto in Their Portfolio: Expert\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Ali Dibadj says cryptocurrency is an investment asset every investor should have in their portfolio. Dibadj thinks the existing volatility is short-term. According to Dibadj, Janus Henderson is thinking long-term on clients’ behalf. According to Ali Dibadj, CEO of Janus Henderson Investors, cryptocurrency is an investment asset every investor should have in their portfolio as [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/every-investor-should-have-crypto-in-their-portfolio-expert/\">Every Investor Should Have Crypto in Their Portfolio: Expert</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]