[
  {
    "source": "Decrypt",
    "date": "2023-06-20T23:33:01.000Z",
    "title": "Bored Ape Creator's 'HV-MTL Forge' Mech Game Revealed",
    "url": "https://decrypt.co/145538/bored-ape-creators-hv-mtl-forge-mech-game-revealed",
    "description": "The workshop-building game will launch on June 29 and use HV-MTL robot NFTs that previous Sewer Pass holders claimed."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-20T23:20:31.000Z",
    "title": "Ava Labs is the Latest Crypto Network to Launch an AI Chatbot",
    "url": "https://decrypt.co/145533/ava-labs-ai-chatbot-avagpt-crypto-network",
    "description": "AvaGPT uses ChatGPT's API to quickly answer Avalanche network queries with immediate access to the source material."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-20T23:33:21.000Z",
    "title": "WisdomTree submits new filing for spot Bitcoin ETF",
    "url": "https://cryptoslate.com/wisdomtree-submits-new-filing-for-bitcoin-etf/",
    "description": "<p>WisdomTree has submitted a filing through which it intends to gain approval from the U.S. Securities and Exchange Commission for a spot Bitcoin exchange-traded fund (ETF). WisdomTree describes its proposed investment vehicle, named WisdomTree Bitcoin Trust, as an ETF that would be listed on the Cboe BZX exchange under the ticker label BTCW, according to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/wisdomtree-submits-new-filing-for-bitcoin-etf/\">WisdomTree submits new filing for spot Bitcoin ETF</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-20T23:30:00.000Z",
    "title": "Deciphering the Cryptic: Ripple, $XRP, and a Million Dollar Hypothetical Exchange Listing",
    "url": "https://www.cryptoglobe.com/latest/2023/06/deciphering-the-cryptic-ripple-xrp-and-a-million-dollar-hypothetical-exchange-listing/",
    "description": "Ripple’s Chief Technology Officer (CTO) David Schwartz has recently added some clarity around the ongoing litigation against the fintech firm, laying out two hypothetical scenarios in response to allegations from the U.S. Securities and Exchange Commission (SEC) that Ripple paid between $1 million and $5 million for $XRP to be listed on exchanges. Schwartz’s first […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-20T23:30:21.000Z",
    "title": "Crypto Exchange Backed by Fidelity, Schwab, Citadel Launches With Trading of 4 Cryptocurrencies",
    "url": "https://news.bitcoin.com/crypto-exchange-backed-by-fidelity-schwab-citadel-launches-with-trading-of-4-cryptocurrencies/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/edx-markets-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Crypto Exchange Backed by Fidelity, Schwab, Citadel Launches With Trading of 4 Cryptocurrencies\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/edx-markets-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/edx-markets-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/edx-markets-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/edx-markets-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/edx-markets-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/edx-markets-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/edx-markets.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The cryptocurrency exchange backed by Charles Schwab, Citadel Securities, Fidelity Digital Assets, Paradigm, Sequoia Capital, and Virtu Financial has launched and completed a new funding round. The platform offers the trading of four cryptocurrencies. EDX Crypto Exchange Launches EDX Markets announced Tuesday &#x201C;the successful launch of its digital asset market and the completion of an [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-20T23:30:25.000Z",
    "title": "Bitcoin On The brink Of Historic Golden Cross As Experts Predict Bull Run",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-on-the-brink-of-historic-golden-cross-as-experts-predict-bull-run/",
    "description": "Bitcoin, the largest cryptocurrency in the market appeared to have regained its bullish momentum after taking a liquidity hit of $25,000 in long positions last week. As of June 20th, Bitcoin is trading at $27,800, reflecting a 4% surge in just 24 hours. This recent development has led many experts to believe that the newly formed bull run is in its early stages, with institutional investors eagerly seeking to capitalize on the trend. Related Reading: Why The Ripple General Counsel Demands Impartiality From SEC Staff BTC&#8217;s MA20/200 Set To Make Never-Before-Seen Golden Cross Crypto trader under the pseudonym Moustache recently made a bold prediction about BTC’s future price action, stating that the cryptocurrency will make the first golden cross of the Moving Average (MA) 20/200, which has never happened before.  This unprecedented event has led many to speculate that a major bullish trend is on the horizon, with the potential for a big green candle shortly. For those unfamiliar with the terminology, a golden cross occurs when the 50-day moving average (MA50) crosses above the 200-day moving average (MA200), indicating a bullish trend in the market. Conversely, a death cross occurs when the MA50 crosses below the MA200, indicating a bearish trend. Moustache&#8217;s prediction is significant because it suggests that Bitcoin is about to enter a major bullish trend that has never been seen before. This starkly contrasts with the death cross in September 2022, which preceded the FTX crash.  However, This time, the market appears to be poised for a major rally, with institutional investors and retail traders eagerly seeking to capitalize on the trend. Bitcoin Breaks Multi-Month Downtrend, But Can It Sustain The Momentum? Crypto analyst Rekt Capital has recently observed the current state of Bitcoin&#8217;s price action. While Bitcoin has broken out beyond the multi-month downtrend, there is still uncertainty about the sustainability of this momentum. Rekt Capital has noted that it is difficult to look for daily breakout confirmation for Bitcoin in the context of the blue lower high diagonal resistance, seen in the chart below, as Bitcoin has failed many post-breakout retests on the daily timeframe. Bitcoin&#8217;s recent breakout is undoubtedly a positive sign for the cryptocurrency market, suggesting that the previous bearish trend may end. However, as Rekt Capital notes, there is still a significant amount of resistance to overcome before the breakout can be fully confirmed.  Rekt Capital suggests it may be better to look for confirmation on the weekly timeframe, as this would provide a more reliable indication of the sustainability of Bitcoin&#8217;s breakout. A weekly close beyond the downtrend would strongly confirm the breakout, indicating that the bullish momentum is likely to continue. Related Reading: Cardano Poised For Consolidation In This Price Zone Before Attempting Reversal Bitcoin&#8217;s short-term bullish trend is contingent on the cryptocurrency consolidating above the resistance level of $27,500. Failure to do so may result in consolidation for the largest cryptocurrency in the market. To achieve higher levels, bulls must maintain consolidation above this resistance mark. Featured image from Unsplash, chart from TradingView.com "
  }
]