[
  {
    "source": "Decrypt",
    "date": "2024-01-30T23:54:22.000Z",
    "title": "Solana Network Activity Surges as Crypto Traders Turn Bullish on SOL",
    "url": "https://decrypt.co/214902/solana-network-activity-surges-crypto-traders-turn-bullish-sol",
    "description": "SOL is back above $100 as various Solana network metrics spike ahead of Wednesday’s Jupiter (JUP) token launch."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-31T00:03:59.000Z",
    "title": " Terraform Labs says bankruptcy will aid appeal of SEC suit ",
    "url": "https://cointelegraph.com/news/terraform-labs-bankruptcy-will-aid-sec-suit-appeal",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOGE5ZjIxNmUtM2JiMC00MzE4LWI5NTEtYTVmMGY0YTM1NDQ1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The firm’s CEO Chris Amani says bankruptcy protections could help appeal the suit brought against it by the SEC, effectively eliminating “the single largest claim against it.”</p>\n                    <p><p>Terraform Labs says its decision to file for bankruptcy will aid it in pursuing an appeal of the lawsuit it faces from the United States Securities and Exchange Commission. </p><p>In a Jan. 30 filing to a Delaware Bankruptcy Court, Terraform Labs CEO Chris Amani wrote its Chapter 11 bankruptcy was critical to successfully appealing its case with the SEC. The firm — which created the now-defunct stablecoin TerraClassicUSD (USTC) — <a href=\"https://cointelegraph.com/news/do-kwon-terraform-labs-files-chapter-11-bankruptcy-protection\">filed for bankruptcy on Jan. 21</a>. </p><p>An appeal against the SEC would typically require Terraform Labs to front up a “supersedeas bond” of 110% of the total judgment before it could proceed. However, Chapter 11 bankruptcy protections could allow the firm to lodge an appeal without needing to post the bond. </p><p><a href=\"https://cointelegraph.com/news/terraform-labs-bankruptcy-will-aid-sec-suit-appeal\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-30T23:51:52.000Z",
    "title": " SEC asks to toss Debt Box suit after court threatens sanctions ",
    "url": "https://cointelegraph.com/news/sec-to-dismiss-debt-box-case-amid-sanctions-threat",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYmNlZWNiMWQtOTk2Zi00NDJiLWJmZWUtOTBhYjZhMDE1ZThmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The SEC admitted its attorneys “should have been more forthcoming” with the court but argued a sanction wasn’t appropriate.</p>\n                    <p><p data-ct-non-breakable=\"true\">The United States securities regulator is seeking to dismiss a lawsuit it launched against a crypto company after a federal court issued an order mandating the agency provide reasons why it should not incur penalties for lying.</p><p>In a Jan. 30 court <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.utd.141167/gov.uscourts.utd.141167.259.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> to a Utah District Court in its case <a href=\"https://cointelegraph.com/news/debt-box-wants-badly-wrong-sec-suit-tossed\">against Debt Box,</a> the Securities and Exchange Commission said it “has determined that the best way to proceed is to dismiss this action without prejudice.”</p><p>The SEC initially claimed Debt Box perpetrated a $50 million fraudulent crypto scheme amid its operations as a software mining license provider.</p><p><a href=\"https://cointelegraph.com/news/sec-to-dismiss-debt-box-case-amid-sanctions-threat\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-30T23:51:00.000Z",
    "title": "Skybridge Capital Founder Predicts Bitcoin Price Could Hit $170,000 After the Halving",
    "url": "https://www.cryptoglobe.com/latest/2024/01/skybridge-capital-founder-predicts-bitcoin-price-could-hit-170000-after-the-halving/",
    "description": "Skybridge Capital founder and managing partner Anthony Scaramucci has recently made a bolt Bitcoin price prediction, revealing he believes that BTC’s upcoming halving event is going to be a major catalyst for its growth, and pointed to a $170,000 price target per coin. Scaramucci’s prediction is based off of historical Bitcoin halving cycles and the […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-31T00:05:39.000Z",
    "title": "OpenAI Enters a New Partnership to Promote Safe AI Usage Among Teens",
    "url": "https://www.cryptopolitan.com/openai-enters-a-new-partnership/",
    "description": "Unlock the partnership between OpenAI and Common Sense Media, discovering their mission to educate teenagers on responsible AI use."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-31T00:00:55.000Z",
    "title": "dYdX to Unlock Over 33 Million Tokens: Will Price Crash?",
    "url": "https://www.newsbtc.com/news/defi/dydx-to-unlock-over-33-million-tokens-will-price-crash/",
    "description": "dYdX, a decentralized exchange (DEX), will unlock over 33 million DYDX worth approximately $90 million on February 1. This significant token unlock is the second event in the last week, following a previous unlocking on January 23. dYdX To Unlock $90 Million Of Token: What Happens Next? According to Token Unlocks on January 30, the release will see the protocol distribute $49 million of tokens to investors. At the same time, the team and future employees will each receive approximately $27 million and $12.5 million, respectively.  The upcoming token unlock event is part of dYdX&#8217;s ongoing cliff unlock schedule, which will continue for the next five months. During this period, more DYDX will be unlocked. Related Reading: Bitcoin Rally Still Has Some Legs Left, Santiment Explains Why For token holders, the frequency and size of these token unlocks raise concerns about the potential impact on DYDX prices. While some experts believe that the gradual unlock schedule will help mitigate any adverse effects, others fear that a deluge of DYDX into the secondary market could lower prices.  So far, the token remains in a general uptrend, looking at the price action from a top-down preview. Presently, DYDX is changing hands at around $2.8. Though it is down 35% from the December 2023 peaks, bulls are optimistic. The token has support at about $2.3, and the uptrend formation remains valid, provided bulls reject any attempt lower below this reaction level. The protocol still has over 60% of tokens locked up. Of this, 233.86 million have not been allocated a release timing. Additionally, Token Unlocks notes that in H2 2023, the protocol will decrease the amount of tokens it unlocks. For this reason, prices might stabilize and even rally should the market recover from the year&#8217;s rough start. V3 Deployed, Adds New Features To Trading Platform On January 29, dYdX Chain successfully deployed v3 at block height 7147832. The update introduced improvements impacting efficiency, trading performance, and general user experience.  A big addition is the introduction of the Interchain Accounts Host Module, which enhances interoperability, reducing the time taken for users to switch between blockchains and manage assets.  Related Reading: Shiba Inu Burn Rate Surges Over 1,400%, As Price Recovers Moreover, the DYDX v3 sees the introduction of liquidation daemons. This system will make it easier for traders to manage their margin positions and execute liquidations. The protocol reduced their requirements to simplify margin management and onboard more users. As of January 30, the protocol has generated over $545 million in trading volumes. More than $37 million in open interest and over 411,000 unique trades are posted on the platform. Feature image from Canva, chart from TradingView"
  }
]