[
  {
    "source": "Crypto Daily",
    "date": "2023-08-09T14:41:41.000Z",
    "title": "Venom Foundation Partners with the UAE Government to Launch National Carbon Credit System",
    "url": "https://cryptodaily.co.uk/2023/08/venom-foundation-partners-with-the-uae-government-to-launch-national-carbon-credit-system",
    "description": "<p>Abu Dhabi, UAE, August 9th, 2023, Chainwire</p><p>Venom Foundation, a leader in blockchain technology adoption in regulated markets, is thrilled to announce the signing of a momentous Memorandum of Understanding (MOU) with the UAE Government to develop and implement the National Carbon Credit System. This landmark partnership represents a significant step towards leveraging blockchain technology to address environmental challenges and promote sustainability on a national scale.</p><p>This revolutionary collaboration underscores the UAE's unwavering commitment to bolstering transparency, reliability, and efficiency in carbon emission management, while using the next generation blockchain technology of Venom and in doing so, propelling the nation towards its ambitious climate targets of 40% reduction in carbon emissions by 2030. The Venom blockchain itself is carbon neutral.</p><p>The Memorandum of Understanding (MoU) signed between the Ministry of Climate Change and Environment (MCCE), the Industrial Innovation Group, and Venom Foundation outlines four strategic objectives: reducing emissions, promoting sustainable agriculture, enhancing environmental health, and conserving biodiversity. As part of this partnership, Venom will be actively participating in realizing a greener future.\t</p><p>Taryam Matar Taryam, CEO of Industrial Innovation Group, affirmed their dedication to sustainable development, \"For Industrial Innovation Group, it is a great honor to contribute to the creation of the United Arab Emirates' first National Carbon Credit Registry System together with Venom. Industrial Innovation Group steadfastly adheres to sustainable development goals and endeavors to reduce environmental impact, including through decarbonization, as global climate change is closely linked to the increasing concentration of CO2 in the atmosphere. With over 30 years of experience, Industrial Innovation Group has a long history of creating large-scale national registries related to identification processes and excels in developing sustainable pathways for various business sectors, conceptualizing carbon removal initiatives, generating project documentation for different carbon credit registries, and effectively managing, monitoring, and reporting on carbon utilization projects.\"</p><p>Peter Knez, Chair of the Foundation Council at Venom Foundation, commented, \"We are honored and excited to join hands with the UAE Government to build the National Carbon Credit System. At Venom, we believe that blockchain technology has the potential to drive real-world impact, and this initiative perfectly embodies that vision. Together, we are committed to creating a sustainable future and pioneering solutions that positively influence the global climate.\"</p><p>Venom&rsquo;s success is driven by its groundbreaking technology, strict regulatory compliance, and a scalable and secure platform that serves a wide range of use cases.</p><p>As the MOU between Venom and the UAE Government comes into effect, both entities eagerly anticipate the successful launch and implementation of the National Carbon Credit System. This historic partnership exemplifies the potential of blockchain technology in advancing environmental initiatives and reinforces the commitment to building a more sustainable and eco-friendly future.</p>About Venom Foundation:<p>Venom Foundation, operating as a decentralized network licensed by the Abu Dhabi Global Market (ADGM), is at the forefront of driving the advancement of global Web3 projects. As the world's first compliant blockchain, Venom provides a secure environment for investors and financial services firms, offering the freedom to build, innovate, and expand. Under the jurisdiction of the ADGM, Venom serves as a trusted platform for authorities and enterprises, ensuring compliance with regulatory requirements.</p><p>To enhance its capabilities, Venom has developed a range of in-house decentralized applications (dApps) and protocols on its blockchain. With features such as dynamic sharding, low fees, high-speed transactions, and scalability, Venom has the potential to serve as the foundational infrastructure for a thriving global ecosystem of Web3 applications. Its exceptional transaction speeds and limitless scalability enable it to meet the evolving needs of a rapidly growing user base.</p><p>Disclaimer: This is not a financial promotion.</p>ContactJonathanpr@venomtech.io"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-09T15:06:09.000Z",
    "title": "IMX Price Prediction 2023-2032: How high will Immutable X rise?",
    "url": "https://www.cryptopolitan.com/imx-price-prediction/",
    "description": "IMX Price Predictions 2023-2031 The crypto space is ever-changing, and from time to time, we have witnessed the entrants of several blockchain protocols and digital currencies looking to exceed the functional limitation of existing protocols. If you’re serious about cryptocurrencies, our IMX price prediction will help you develop a clearer perspective. ImmutableX (IMX) scales Ethereum’s ... <a title=\"IMX Price Prediction 2023-2032: How high will Immutable X rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/imx-price-prediction/\" aria-label=\"More on IMX Price Prediction 2023-2032: How high will Immutable X rise?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-09T14:56:36.000Z",
    "title": "Elon Musk’s legal counsel wants Dogecoin class-action lawsuit dismissed",
    "url": "https://www.cryptopolitan.com/elon-musks-legal-dogecoin-lawsuit-dismissed/",
    "description": "Tesla CEO Elon Musk’s ongoing legal dispute with a group of disgruntled Dogecoin investors has taken another turn as his attorneys argue that the lawsuit has been dragging on for too long. In a recent filing submitted to a New York federal court, Musk’s legal team requested the dismissal of the plaintiff’s revised complaint, claiming ... <a title=\"Elon Musk’s legal counsel wants Dogecoin class-action lawsuit dismissed\" class=\"read-more\" href=\"https://www.cryptopolitan.com/elon-musks-legal-dogecoin-lawsuit-dismissed/\" aria-label=\"More on Elon Musk’s legal counsel wants Dogecoin class-action lawsuit dismissed\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-09T14:54:03.000Z",
    "title": "The impact of US-Russia nuclear war on Americans",
    "url": "https://www.cryptopolitan.com/impact-of-us-russia-nuclear-war-on-americans/",
    "description": "The shadow of a devastating nuclear confrontation between the US-Russia looms large over the horizon. It&#8217;s a grim picture painted by U.S. presidential candidate Robert F. Kennedy Jr. (RFK Jr.), one that warns of catastrophic consequences reaching far beyond the borders of the two superpowers. With a chilling potential for over five billion casualties, including ... <a title=\"The impact of US-Russia nuclear war on Americans\" class=\"read-more\" href=\"https://www.cryptopolitan.com/impact-of-us-russia-nuclear-war-on-americans/\" aria-label=\"More on The impact of US-Russia nuclear war on Americans\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-09T14:46:59.000Z",
    "title": "PayPal’s stablecoin: potential impact and user reactions",
    "url": "https://crypto.news/paypals-stablecoin-potential-impact-and-user-reactions/",
    "description": "PayPal&#8217;s stablecoin, PYUSD, made its debut on August 7. Explore PYUSD, what it means for crypto, and how the community reacted. The financial landscape, long accustomed to gradual evolution, witnessed a seismic shift on August 7 when PayPal, a vanguard&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-09T15:00:45.000Z",
    "title": "A Long Con: CoinsPaid Says Systems Were Under Attack For Six Months",
    "url": "https://www.newsbtc.com/crypto/coinspaid-systems-under-attack-for-six-months/",
    "description": "In a new report, Estonia’s preeminent crypto payment and personal wallet provider, CoinsPaid, has revealed the intricate workings of a hacking incident that led to a colossal loss of $37 million. This audacious breach was reportedly the culmination of a six-month saga marked by calculated maneuvers and sophisticated tactics, orchestrated by none other than the notorious Lazarus Group.  Collaborating with Match Systems, CoinsPaid embarked on a comprehensive inquiry, unearthing the modus operandi of the hacking group and exposing the subsequent laundering of pilfered assets in a post. Elaborate 6-Month Operation By Lazarus Group The ploy, characterized by an extraordinary level of meticulousness, spanned half a year, revealing the calculated and relentless nature of the hack. Employing a blend of social engineering and technical strategies, the hackers engaged in a series of Distributed Denial-of-Service and brute-force attacks.  Related Reading: Pro-XRP Lawyer John Deaton Says He Is Willing To Bet That Ripple Will Win SEC Appeal Their calculated approach culminated in a July 22 breach with the manipulation of a CoinsPaid employee, ensnaring them through a falsified job proposition. The ordeal began innocently enough, as a CoinsPaid employee embarked on a video interview for what appeared to be an enticing career prospect, facilitated via LinkedIn.  Little did they know that the seemingly innocuous task of downloading a technical assessment was part of an elaborate ruse orchestrated by the hackers. This single act granted the hackers access to CoinsPaid&#8217;s systems, allowing them to exploit software vulnerabilities and authorize unauthorized withdrawals from the company&#8217;s hot wallets. The hacker executed a swift sequence of unauthorized withdrawals, swiftly depleting the company&#8217;s coffers in less than an hour of operation. In total, CoinsPaid lost $37.3 million in the attack. Total market cap jumps to $1.147 trillion &#124; Source: Crypto Total Market Cap on Tradingview.com CoinsPaid Moving Forward From The Incident CoinsPaid&#8217;s exhaustive post-mortem report reveals invaluable lessons extracted from the breach. The report highlights the importance of training employees to identify social engineering tactics, including job offers that might be a ploy to gain access to internal systems.  The report also explains the adoption of principles like the Separation of Duties and Least Privilege, advocating for the implementation of robust monitoring and alert systems to detect suspicious activities.  Following the report, CoinsPaid will be hosting a roundtable discussion involving blockchain-based entities, aiming to collectively address the escalating threat posed by hacking incidents. Related Reading: Valkyrie Unveils Double-Barreled Approach To Launch An Ethereum ETF Alongside A Bitcoin ETF In the wake of the exploit, the payments platform assured customers that none of their funds were affected. The company also resumed all activities less than a week after the hack took place. The Lazarus Group is believed to have stolen over $3.8 billion in digital assets from crypto exchanges and decentralized finance (DeFi) services since it became active. Featured image from TechBullion, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-09T15:07:09.000Z",
    "title": "Ethereum Faces Its Worst Surge in Illicit Flows: How Will it Impact ETH?",
    "url": "https://www.crypto-news-flash.com/ethereum-faces-its-worst-surge-in-illicit-flows-how-will-it-impact-eth/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-faces-its-worst-surge-in-illicit-flows-how-will-it-impact-eth",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/ethereum-7107978-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/ethereum-7107978-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/ethereum-7107978-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/ethereum-7107978-1024x576.jpg 1024w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Illicit flows on the Ethereum network have surged according to recent data shared by Chainalysis.  The new development coincides with the recent Curve Finance hack that saw attackers steal $73 million. Illicit inflows on the Ethereum network have surged in recent times. The new development is especially concerning, as it marks the highest inflow of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-09T15:06:01.000Z",
    "title": "US Federal Reserve Expands Oversight on Banks Engaging with Crypto: Is the Crypto Industry at Risk Again?",
    "url": "https://www.crypto-news-flash.com/us-federal-reserve-expands-oversight-on-banks-engaging-with-crypto-is-the-crypto-industry-at-risk-again/?utm_source=rss&utm_medium=rss&utm_campaign=us-federal-reserve-expands-oversight-on-banks-engaging-with-crypto-is-the-crypto-industry-at-risk-again",
    "description": "<img width=\"1920\" height=\"1238\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/11/bank-g73732b925_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/11/bank-g73732b925_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/bank-g73732b925_1920-300x193.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/bank-g73732b925_1920-1024x660.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/bank-g73732b925_1920-768x495.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/bank-g73732b925_1920-1536x990.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/bank-g73732b925_1920-24x15.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/bank-g73732b925_1920-36x23.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/bank-g73732b925_1920-48x31.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />The US Federal Reserve has expanded its Novel Activities Supervision Program. This program will now tight place crypto under its scrutiny across the board. In the latest move to limit the interaction of banks with cryptocurrency, the United States Federal Reserve has decided to expand the scope of its Novel Activities Supervision Program. According to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-09T15:00:58.000Z",
    "title": "DOT, KSM Trading Volumes Low, TOADS’ 400% Surge Elevating Trader Earnings",
    "url": "https://www.crypto-news-flash.com/dot-ksm-trading-volumes-low-toads-400-surge-elevating-trader-earnings/?utm_source=rss&utm_medium=rss&utm_campaign=dot-ksm-trading-volumes-low-toads-400-surge-elevating-trader-earnings",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T110222.582.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T110222.582.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T110222.582-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T110222.582-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Amidst the ever-evolving cryptocurrency landscape, both DOT and KSM are currently experiencing low trading volumes, sparking curiosity among market observers. Kusama (KSM), priced at $22, has seen a decline from $25.8 over the past month. The Kusama network&#8217;s native cryptocurrency, KSM, has been following a descending wedge pattern since the latter half of 2021. This [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-09T14:44:40.000Z",
    "title": "Rosen Bridge Nears Completion: New Cross-Chain Swap Between Ergo and Cardano",
    "url": "https://www.crypto-news-flash.com/rosen-bridge-nears-completion-new-cross-chain-swap-between-ergo-and-cardano/?utm_source=rss&utm_medium=rss&utm_campaign=rosen-bridge-nears-completion-new-cross-chain-swap-between-ergo-and-cardano",
    "description": "<img width=\"1038\" height=\"612\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1.png 1038w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1-300x177.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1-1024x604.png 1024w\" sizes=\"(max-width: 1038px) 100vw, 1038px\" />Rosen Bridge is creating a gateway between Cardano and Ergo protocol. The bridge is focused on ensuring security, a key need to prevent hacks. Web3.0 startup, Rosen Bridge is finalizing the release of a bridge on the Cardano (ADA) blockchain where users can swap their native assets between Ergo and Cardano. Precisely, the bridge is [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-09T14:42:52.000Z",
    "title": "Venom Foundation Partners with the UAE Government to Launch National Carbon Credit System",
    "url": "https://www.crypto-news-flash.com/venom-foundation-partners-with-the-uae-government-to-launch-national-carbon-credit-system/?utm_source=rss&utm_medium=rss&utm_campaign=venom-foundation-partners-with-the-uae-government-to-launch-national-carbon-credit-system",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Venom_Collaboraes_with_UAE_16915914832AEFTBSzb3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Venom_Collaboraes_with_UAE_16915914832AEFTBSzb3.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Venom_Collaboraes_with_UAE_16915914832AEFTBSzb3-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Venom_Collaboraes_with_UAE_16915914832AEFTBSzb3-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Venom_Collaboraes_with_UAE_16915914832AEFTBSzb3-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Abu Dhabi, UAE, August 9th, 2023, Chainwire Venom Foundation, a leader in blockchain technology adoption in regulated markets, is thrilled to announce the signing of a momentous Memorandum of Understanding (MOU) with the UAE Government to develop and implement the National Carbon Credit System. This landmark partnership represents a significant step towards leveraging blockchain technology [...]"
  }
]