[
  {
    "source": "CryptoSlate",
    "date": "2024-02-14T18:55:36.000Z",
    "title": "CNBC host Joe Kernen defends Bitcoin after Gensler claims its ‘not that decentralized’",
    "url": "https://cryptoslate.com/cnbc-host-joe-kernen-defends-bitcoin-after-gensler-claims-its-not-that-decentralized/",
    "description": "<p>News anchor Joe Kernen defended Bitcoin in a spirited exchange with SEC Chair Gary Gensler during an interview on CNBC&#8217;s &#8220;Squawk Box&#8221; on Feb. 14 after the regulator questioned the flagship crypto&#8217;s decentralized nature. The conversation, which veered into a wide-ranging discussion about crypto, investor protection, and the recent approval of spot Bitcoin ETFs, highlighted [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/cnbc-host-joe-kernen-defends-bitcoin-after-gensler-claims-its-not-that-decentralized/\">CNBC host Joe Kernen defends Bitcoin after Gensler claims its &#8216;not that decentralized&#8217;</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-14T18:44:00.000Z",
    "title": "Binance Coin Price Prediction 2024-2033: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2024-2033 After notable changes in its executive team, Binance has shown notable resilience and prospects for recovery. The departure of Changpeng Zhao, Binance&#8217;s CEO, who was also embroiled in legal challenges, initially caused a decline in the value of Binance Coin (BNB). Despite this initial setback, the cryptocurrency has shown a [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-14T19:00:47.000Z",
    "title": "Jerome Powell urges for stablecoin regulatory framework",
    "url": "https://crypto.news/jerome-powell-stablecoin-regulatory-framework/",
    "description": "Federal Reserve Chairman Jerome Powell addressed House Democrats regarding the necessity of a legislative framework for stablecoins."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-14T19:00:51.000Z",
    "title": "Robinhood Cash Surge: Sees $4 Billion Monthly Inflow From Users",
    "url": "https://www.newsbtc.com/robinhood/robinhood-cash-surge-sees-4-billion-monthly-inflow-from-users/",
    "description": "Robinhood, a significant player in the United States financial technology sector, has recorded major growth. The platform has seen a notable rise in monthly user inflow. Robinhood Monthly Deposits Surges To New Height A correspondent at CNBC, Kate Rooney, recently shared the development with the crypto community on the X (formerly Twitter) platform. The CNBC reporter said Robinhood recorded increased profits in its most recent quarterly results. Rooney pointed out that the platform is making some headway in its attempt to overtake established &#8220;brokerage companies&#8221; for market dominance. Additionally, Robinhood aims to expand beyond its &#8220;original base of inexperienced and younger traders&#8221; in the crypto market. Related Reading: Robinhood (HOOD) Extends Trading Services To The UK She further highlighted that over $100 billion of the firm&#8217;s assets are currently &#8220;under custody.&#8221; In addition, a &#8220;net positive transfer from every major brokerage competitor&#8221; drove the Q4 deposits to approximately $4.6 billion. Consequently, this suggests its increasing popularity among investors looking to include digital assets in their portfolios for diversification. It also indicates the growing confidence and inclination toward the trading firm among crypto investors.  The CNBC correspondent asserted that the numbers above consist of an &#8220;average customer transfer balance&#8221; of $100,000. As per Rooney&#8217;s X post, Robinhood saw a substantial rise in monthly deposits valued at $4 billion in January. So far, the recent uptick signifies the online trading platform&#8217;s strongest month since early 2021. During the same quarter last year, the trading platform lost $166 million, or $0.19 per share. However, this year, it made a profit of $30 million, or $0.3 per share. As was revealed, Robinhood&#8217;s income rose due to increased net interest and transaction-based and other revenue streams. Over the three months, its net interest income grew by 4% to $236 million. Taking Over The Active Trader Market Vlad Tenev, Robinhood&#8217;s Chief Executive Officer (CEO), has revealed Robinhood&#8217;s intentions to take over the active trader market. Tenev recently disclosed this objective during a quarterly earnings call. Related Reading: Altcoins Market Share Versus Bitcoin At A 4 Month High: What’s The Trigger? He stated that the firm&#8217;s user base and revenue have grown &#8220;nearly seven times&#8221; in the past four years. &#8220;looking at what is in front of us, we are excited by the opportunity to continue growing significantly from here,&#8221; he added. Robinhood has gained market share and attracted net asset inflows from its major rivals. According to Tenev, the company will continuously invest in its &#8220;user experience on mobile&#8221; to achieve its goal. Currently, the crypto enterprise stands out as the dominant player in market share. Tenev has confirmed the addition of futures and index options to the platform in the coming months of this year. Featured image from Shutterstock, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-14T19:05:51.000Z",
    "title": "BlackRock Accumulates $518,000,000 in Bitcoin in One Day As BTC Tags $52,000: On-Chain Analysis",
    "url": "https://dailyhodl.com/2024/02/14/blackrock-accumulates-518000000-in-bitcoin-in-one-day-as-btc-tags-52000-on-chain-analysis/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/Bullish-Turnaround-for-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/Bullish-Turnaround-for-Bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/Bullish-Turnaround-for-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/Bullish-Turnaround-for-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/Bullish-Turnaround-for-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/Bullish-Turnaround-for-Bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/Bullish-Turnaround-for-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Financial titan BlackRock just accumulated an additional $518 million in Bitcoin (BTC) as the crypto king moves higher. On Wednesday, BlackRock added 10,003 BTC into its new iShares Bitcoin Trust (IBIT), a spot exchange-traded fund (ETF), according to the on-chain analytics tracker Lookonchain. That brings BlackRock&#8217;s total holdings to 105,280 BTC. &#8220;iShares(BlackRock) added 10,003 BTC ($518M) [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/14/blackrock-accumulates-518000000-in-bitcoin-in-one-day-as-btc-tags-52000-on-chain-analysis/\">BlackRock Accumulates $518,000,000 in Bitcoin in One Day As BTC Tags $52,000: On-Chain Analysis</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]