[
  {
    "source": "Cointelegraph",
    "date": "2024-03-19T16:38:11.000Z",
    "title": " Why is Ethereum (ETH) price down today?  ",
    "url": "https://cointelegraph.com/news/why-is-ethereum-eth-price-down-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTIvNzY1MTY5ZjktYTBmMC00MTdlLTgwYTctZTQ2YzYyZDU4ZjI2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ether price is down today as Bitcoin’s sharper-than-expected sell-off shakes the entire crypto market. </p>\n                    <p><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) price is down by 8% on March 19 and the recent price correction comes amid reduced activity on the Ethereum network. Since <a href=\"https://cointelegraph.com/news/ether-eth-price-4-000-first-time-2021\">Ether’s price hit</a> $4,000 for the first time since 2021 on March 8, the second-largest cryptocurrency by market capitalization has continued to drop lower.</p><p>Let’s investigate the reasons why Ether price is down today.</p><p>Ether’s price decline has led to a rush of liquidations across the derivatives market. Bullish traders were caught off guard, leading to a quick spat of long liquidations. </p><p><a href=\"https://cointelegraph.com/news/why-is-ethereum-eth-price-down-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-19T16:23:24.000Z",
    "title": " History of Crypto: A timeline of events that shaped the future of money ",
    "url": "https://cointelegraph.com/news/history-of-crypto-introduction",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZjc1YmUyNmItNDNkYi00YWQwLThiYjEtODMwNjk1YzcwZTUxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The History of Crypto interactive timeline allows users to explore every significant development across the crypto industry.</p>\n                    <p><p data-ct-non-breakable=\"true\">Discover the thrilling world of cryptocurrency through Cointelegraph's immersive <a href=\"https://cointelegraph.com/history-of-crypto/\">“History of Crypto” timeline</a>, brought to you in partnership with Phemex. This interactive experience takes you on a journey from the birth of Bitcoin to the latest breakthroughs in the crypto space. </p><p data-ct-non-breakable=\"true\">Scroll through the timeline and be captivated by the key events that shaped the crypto industry. Each event is accompanied by engaging descriptions and links to in-depth articles for those eager to learn more. Whether you’re a seasoned investor or simply crypto-curious, this timeline is the perfect resource for anyone looking to deepen their understanding of the exciting and ever-evolving crypto landscape.</p><p data-ct-non-breakable=\"true\">This meticulously crafted interface allows users to effortlessly journey through the milestones that have defined the realm of digital currencies. Glowing markers illuminate key events as you traverse the timeline, offering a visual guide to significant moments across different years. Smaller dots indicate less prominent events, while larger, brightly glowing orbs signal major milestones, facilitating an easier discovery of pivotal developments. “The History of Crypto” provides a balanced, engaging experience for those looking to understand the intricate history of cryptocurrency, making the exploration of its past as informative as it is accessible.</p><p><a href=\"https://cointelegraph.com/news/history-of-crypto-introduction\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-19T16:15:01.000Z",
    "title": "MicroStrategy invests $623 million in Bitcoin, now owns over 1% of global supply",
    "url": "https://cryptoslate.com/microstrategy-invests-623-million-in-bitcoin-now-owns-over-1-of-global-supply/",
    "description": "<p>Bitcoin development and Business intelligence firm MicroStrategy has bought more than 9,000 BTC for $623 million, according to a March 19 filing with the US Securities and Exchange Commission (SEC). According to the filing: &#8220;MicroStrategy acquired approximately 9,245 bitcoins for approximately $623.0 million in cash, using $592.3 million of proceeds from the Offering and $30.7 [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/microstrategy-invests-623-million-in-bitcoin-now-owns-over-1-of-global-supply/\">MicroStrategy invests $623 million in Bitcoin, now owns over 1% of global supply</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-19T16:27:39.000Z",
    "title": "Arbitrum introduces cheaper gas fees in its ‘Phase 2’",
    "url": "https://cryptobriefing.com/arbitrum-introduces-cheaper-gas-fees/",
    "description": "The Atlas upgrade, combined with the introduction of blobs, promises to make Arbitrum gas fees to be lower than $0,01."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-19T16:17:58.000Z",
    "title": "Genesis settles with SEC for $21M over Gemini Earn",
    "url": "https://cryptobriefing.com/genesis-sec-settlement/",
    "description": "Genesis Global Capital agrees to pay the SEC a $21M penalty, finalizing the settlement over the Gemini Earn program violations."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-19T16:37:16.000Z",
    "title": "Analyst Sees Shiba Inu (SHIB) and Pepe Coin (PEPE) Flying High in 2024, But Says This Altcoin Could Deliver Bigger Numbers",
    "url": "https://cryptodaily.co.uk/2024/03/analyst-sees-shiba-inu-shib-and-pepe-coin-pepe-flying-high-in-2024-but-says-this-altcoin-could-deliver-bigger-numbers",
    "description": "As the cryptocurrency market continues to evolve and mature, investors are constantly on the lookout for the next big opportunity"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-19T16:30:19.000Z",
    "title": "Litecoin And Monero Investors Shift To Algotech Presale As Prices Stay Suppressed",
    "url": "https://cryptodaily.co.uk/2024/03/litecoin-and-monero-investors-shift-to-algotech-presale-as-prices-stay-suppressed",
    "description": "Despite the recent bull run that has seen many digital currencies soar to new heights, Litecoin (LTC) and Monero (XMR) have remained relatively stagnant."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-19T16:24:05.000Z",
    "title": "March 2024 Sees Bitgert Coin Steal the Show as the Trending Cryptocurrency",
    "url": "https://cryptodaily.co.uk/2024/03/march-2024-sees-bitgert-coin-steal-the-show-as-the-trending-cryptocurrency",
    "description": "We might just be looking at the craziest crypto gain of the year—maybe even the craziest ever! Bitgert,"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-19T16:18:35.000Z",
    "title": "Bluestonemining Redefines Giving Everyone the Opportunity to Earn Passive Income Through Innovative Cloud Mining",
    "url": "https://cryptodaily.co.uk/2024/03/bluestonemining-redefines-giving-everyone-the-opportunity-to-earn-passive-income-through-innovative-cloud-mining",
    "description": "February 16, 2016 bluestonemining are pioneering a transformative approach to the digital asset industry, democratizing the cryptocurrency mining space by introducing revolutionary cloud mining solutions. This groundbreaking development aims to make the process of mining digital currencies accessible to a wider audience by simplifying and removing human involvement."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-19T16:13:24.000Z",
    "title": "100X Predicted Koala Coin (KLC) Lights Up the Market: Ethereum (ETH) & Bitcoin (BTC) Traders Add a Touch of Whimsy to Their Portfolios",
    "url": "https://cryptodaily.co.uk/2024/03/100x-predicted-koala-coin-klc-lights-up-the-market-ethereum-eth-bitcoin-btc-traders-add-a-touch-of-whimsy-to-their-portfolios",
    "description": "Exciting newcomer Koala Coin (KLC) emerges at a time when crypto giants Bitcoin (BTC) and Ethereum (ETH)"
  },
  {
    "source": "NullTX",
    "date": "2024-03-19T16:33:24.000Z",
    "title": "Kelexo presale, XRP ATH prediction, BlockDAG; the top crypto presale",
    "url": "https://nulltx.com/kelexo-presale-xrp-ath-prediction-blockdag-the-top-crypto-presale/",
    "description": "BlockDAG Presale: Essential Buy for 5000x ROI Before Bitcoin Halving, XRP Predictions and Kelexo Presale Insights The crypto market is buzzing with the anticipated impact of upcoming Bitcoin halving on the overall market. Amid these anticipations, BlockDAG&#8217;s presale journey has been impressive, culminating in a significant milestone of raising over [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-19T16:22:50.000Z",
    "title": "Shiba Inu Can’t Compete with Algotech’s Utility, Says SHIB Whale As He Invests $200K in ALGT",
    "url": "https://nulltx.com/shiba-inu-cant-compete-with-algotechs-utility-says-shib-whale-as-he-invests-200k-in-algt/",
    "description": "Shiba Inu has risen as a prominent meme coin in the ever-evolving landscape of cryptocurrencies, showcasing remarkable growth and garnering substantial attention. However, recent developments suggest a shift in investor sentiment as a notable SHIB whale redirects a significant investment of $200K into an emerging entrant.  This move not only [&#8230;]"
  }
]