[
  {
    "source": "Cointelegraph",
    "date": "2023-09-11T03:04:51.000Z",
    "title": "Is 2023 the year genuine cross-chain interoperability takes off?",
    "url": "https://cointelegraph.com/news/blockchain-cross-chain-interoperability-to-accelerate-this-year-say-executives",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/4bd967d2-4826-410c-ad35-c85fcea54b74.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Blockchains need to become interoperable in order for the industry to truly flourish and several innovations will accelerate the ecosystem towards it, say executives.</p>\n                    <p><p>The future of blockchain will be an interoperable one — with the death of “chain tribalism,” the proliferation of “hundreds of chains” along with an end to cross-chain bridge hacks, according to executives at Korea Blockchain Week.</p><p>Backing up the claims are several products slated for release before the end of the year that could see blockchain interoperability efforts move away from current solutions which execs say don’t make sense and are a “honeypot” for hackers.</p><p>Vance Spencer, the co-founder of the crypto-focused venture firm Framework Ventures told Cointelegraph at KBW that he thinks with many solutions on the horizon including Chainlink’s <a href=\"https://cointelegraph.com/news/chainlink-launches-cross-chain-protocol-ccip-ethereum-blockchain-mainnet\">Cross-Chain Interoperability Protocol </a>(CCIP) — it soon won’t matter what blockchain a project uses.</p><p>He said most startups begin on layer-2 solutions such as Optimism or Arbitrum but soon begin to want their own roll-up. “It's like everyone's trying to create the standard,” he said.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Said another way, the interop protocols will accrue more value than L2s themselves over the long term. Especially if there are a lot/too many L2s/chains. The investment is a view on the likely fragmentation of contracts over too many chains, and the value of networking them.</p>&mdash; Vance Spencer (@pythianism) <a href=\"https://twitter.com/pythianism/status/1699595833174634516?ref_src=twsrc%5Etfw\">September 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In a cross-chain interoperable future, the paradigm will shift and “it's really not gonna matter which roll-up you're on,” Spencer said.</p><blockquote>“In the future, it's probably just going to be: ‘Can your contract talk to my contract?’”</blockquote><p>Spencer gave the example of CCIP which, he explained, allows a user to have assets on one chain and interact with contracts on another that uses cross-chain messages instead of a blockchain bridge.</p><p>ZetaChain core contributor Brandon Truong told Cointelegraph it operates in a similar way to CCIP — the main difference being it’s sent from ZetaChain’s network.</p><p>Truong added it sees interoperability becoming standard with new app builders and there will be less “chain tribalism” and more focus on utility.</p><p>He added that many older blockchain bridge solutions are “fragmented and often insecure.”</p><p>Another product is the <a href=\"https://cointelegraph.com/news/crypto-wallet-dapp-store-consensys-preps-cross-chain-metamask-snaps\">upcoming MetaMask Snaps</a> which will allow developers to launch functionality-expanding apps for the crypto wallet — allowing use with other blockchains including Bitcoin, Solana, Avalanche and Starknet.</p><h3>Hundreds of chains</h3><p>Speaking on a panel at KBW, cross-chain protocol Axelar co-founder Georgios Vlachos believes, at some point, there will be “hundreds of chains” all processing “significant economic activity.”</p><blockquote>“At this point, I think it's indisputable given how many people and important companies in this space are building cross-chain and are incentivized to launch their own Layer 1s.”</blockquote><p>Vlachos added multiple blockchains are needed as he believes a single blockchain won’t be capable of more than 10 million transactions per day — far below the nearly 530 million daily average transactions payments giant Visa <a href=\"https://annualreport.visa.com/financials/default.aspx\" target=\"_blank\" rel=\"noopener nofollow\">processed</a> in 2022.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Cross-chain … is only the beginning <a href=\"https://t.co/ogJ3DU2R5d\">https://t.co/ogJ3DU2R5d</a></p>&mdash; Axelar Network (@axelarcore) <a href=\"https://twitter.com/axelarcore/status/1701031384784007179?ref_src=twsrc%5Etfw\">September 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“If we want to become foundational architecture for Web2 we need to scale this by an order of magnitude and this is really, really hard,” he said.</p><blockquote>“The answer is to scale horizontally and create many, many different blockchains.”</blockquote><h3>Cross-chain bridges: Removing the hackers “honeypot”</h3><p>Currently, users wanting to send assets between networks largely use <a href=\"https://cointelegraph.com/explained/blockchain-bridges-explained\">blockchain bridges</a> which Router Protocol founder and CEO Ramani “Ram” Ramachandran thinks are prone to hacks and will soon be replaced by other cross-chain solutions — including one by his protocol.</p><p>Ramachandran explained to Cointelegraph at KBW that cross-chain bridges rely on locking up value for it to be represented on another blockchain making them an attractive target and the reason why \"so many bridges have been hacked.”</p><blockquote>“It's highly inefficient and a big honeypot risk because then you have a billion dollars locked up in the bridge and hackers around the world are literally salivating, licking their chops, trying to hack in and take a piece out.\"</blockquote><p>Ramachandran said one workaround to negate the issue is to source liquidity from multiple wallets — a solution Router plans to launch in the coming weeks.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/PeckShieldAlert?src=hash&amp;ref_src=twsrc%5Etfw\">#PeckShieldAlert</a> <a href=\"https://twitter.com/MultichainOrg?ref_src=twsrc%5Etfw\">@MultichainOrg</a> has been drained of ~$126M worth of cryptos, ranking it at #6 on our cross-chain bridge exploit leaderboard. <br>Additionally, <a href=\"https://twitter.com/hashtag/PolyNetwork?src=hash&amp;ref_src=twsrc%5Etfw\">#PolyNetwork</a>, which was exploited for ～$25M, stands at #8.<br><br>As of today, ~$1.92B associated with cross-chain bridges has… <a href=\"https://t.co/UvJF8BwQfs\">pic.twitter.com/UvJF8BwQfs</a></p>&mdash; PeckShieldAlert (@PeckShieldAlert) <a href=\"https://twitter.com/PeckShieldAlert/status/1677231320353886208?ref_src=twsrc%5Etfw\">July 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>It would see those wanting to move funds between chains use a tool more akin to a peer-to-peer transfer with a middleman taking on the role of fulfilling orders for cross-chain swaps for a fee.</p><p>“This middleman acts as a courier. [They] fulfill the destination side and then submit a proof saying ‘Okay, I've done this. Now give me my money,’” Ramachandran explained.</p><blockquote>“There’s no locked, steady liquidity on a bridge or semi-centralized bridge, this all stays in the intermediary wallets.”</blockquote><h3>Adapt or perish</h3><p>However, the need for immediate cross-chain interoperability isn’t only for the benefit of users but is needed for the industry to cement its legitimacy by providing real-world use cases, <a href=\"https://cointelegraph.com/learn/what-is-chainlink-a-beginners-guide-to-the-cross-chain-interoperability-protocol\">Chainlink</a> co-founder Sergey Nazarov said in a keynote at KBW.</p><p>He believed successful Web3 apps must be able to connect to all blockchains easily and users can seamlessly use apps across chains “without any concern.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">With Swift, multiple leading market infrastructures and the largest major financial institutions now clearly seeing the value of tokenization, we are nearing an inflection point for blockchain adoption in capital markets.<br><br>Chainlink and CCIP are key infrastructure to enable this… <a href=\"https://t.co/uCiQtQzxGh\">pic.twitter.com/uCiQtQzxGh</a></p>&mdash; Sergey Nazarov (@SergeyNazarov) <a href=\"https://twitter.com/SergeyNazarov/status/1699972335649083519?ref_src=twsrc%5Etfw\">September 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>He said the idea of choosing one blockchain and being “stuck” there with its market and infrastructure “really doesn't make sense because that's not how the internet works.”</p><p>“Our industry is going to be based on [the] ability to provide reliable use of systems that don't exist today,” Nazarov said. He added if a user puts value into an app it should be safe and reliably accessible to them when it moves somewhere else.</p><blockquote>“If we don't meet that minimum standard then we will remain in a place where this will look like a toy to people or would look like a confused idea.”</blockquote><p>Nazarov opined the banking system would bring in the next level of Web3 usage and adoption due to their value.</p><blockquote>“Frankly, our industry needs to find a way to take the value in banks and get that value into blockchains.”</blockquote><p>He said banks and the global financial system see a lot of value in blockchain and digital assets and Chainlink is working on how to connect banks both to each other and to public blockchains so the bank's value “flows into the public blockchain world.”</p><p><strong><em>Related: '</em></strong><a href=\"https://cointelegraph.com/news/pure-defi-little-chance-real-world-use-needs-oracles-bis\"><strong><em>Pure’ DeFi has little chance for real-world use because of need for oracles: BIS</em></strong></a></p><p>The issue Nazarov sees is the technical and legal barrier between the banks and blockchains and both are wanting to come together.</p><blockquote>“It's, at least to me, completely obvious that the banking and the public blockchain world want to connect, but they can't for two reasons: There isn't legal clarity on how they connect and the technical process of connecting doesn't exist.”</blockquote><p>“Frankly,” he added, “the more value flows into our industry the more we all benefit.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/zkrollups-endgame-scaling-blockchains-polygon-miden-founder/\"><strong><em>ZK-rollups are ‘the endgame’ for scaling blockchains, Polygon Miden founder</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-11T03:00:00.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-11T02:50:42.000Z",
    "title": "AI Chatbots to Reshape Education and Parental Roles",
    "url": "https://www.cryptopolitan.com/ai-chatbots-to-reshape-education/",
    "description": "As students return to school, parents often find themselves in the role of homework helpers. However, a new ally has emerged in this educational journey: AI chatbots equipped with artificial intelligence. In the realm of education, AI chatbots have become invaluable tools for both students and parents. These AI-powered assistants, including well-known ones like ChatGPT, ... <a title=\"AI Chatbots to Reshape Education and Parental Roles\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-chatbots-to-reshape-education/\" aria-label=\"More on AI Chatbots to Reshape Education and Parental Roles\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-11T02:43:33.000Z",
    "title": "How AI Is Changing Our Communication with Whales",
    "url": "https://www.cryptopolitan.com/how-ai-changing-communication-with-whales/",
    "description": "For centuries, the enigmatic world of whales has fascinated humanity. These majestic creatures, known for their intricate communication systems, have long eluded our understanding. However, the dawn of artificial intelligence has opened up new possibilities in bridging the gap between human and cetacean languages. AI is revolutionizing our ability to communicate with whales and broader ... <a title=\"How AI Is Changing Our Communication with Whales\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-ai-changing-communication-with-whales/\" aria-label=\"More on How AI Is Changing Our Communication with Whales\">Read more</a>"
  }
]