[
  {
    "source": "Cointelegraph",
    "date": "2024-01-10T08:52:18.000Z",
    "title": " Hollywood union and Replica strike a deal to regulate AI voice in video games ",
    "url": "https://cointelegraph.com/news/hollywood-union-replica-strike-regulate-ai-voice-video-games",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMzliZWYwNWUtN2JiOS00MTVhLWIzNjgtZGE0MDYzY2NlNTU2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The agreement will enable Replica to create and license a digital replica of the actors protected by SAG-AFTRA under “fair and ethical” conditions. </p>\n                    <p><p data-ct-non-breakable=\"true\">The Screen Actors Guild-American Federation of Television and Radio Artists (SAG-AFTRA) — a trade union representing 150,000 film and TV professionals — reached an agreement with an artificial intelligence (AI) voice technology company, Replica Studios. The “groundbreaking” deal concerning the use of AI voice in video games was <a href=\"https://www.sagaftra.org/sag-aftra-and-replica-studios-introduce-groundbreaking-ai-voice-agreement-ces\" target=\"_blank\" rel=\"noopener nofollow\">revealed</a> by the SAG-AFTRA on Jan. 9. </p><p>The agreement will enable Replica to create and license a digital replica of the actors protected by the SAG-AFTRA under “fair and ethical” conditions. Licensed voices can be used in AAA video games and “other interactive media projects” from pre-production to final release.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/fox-blockchain-platform-content-ai\"><strong><em>Fox Corp launches Polygon-based blockchain platform to address AI firms’ use of content</em></strong></a></p><p><a href=\"https://cointelegraph.com/news/hollywood-union-replica-strike-regulate-ai-voice-video-games\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-10T08:45:12.000Z",
    "title": "Less than 15,000 blocks until Bitcoin halving",
    "url": "https://cryptoslate.com/insights/less-than-15000-blocks-until-bitcoin-halving/",
    "description": "<p>Quick Take Bitcoin&#8217;s halving is fast approaching. Current on-chain analysis indicates that less than 15,000 blocks are remaining until this pivotal moment, with a tentative date set for April 20. The most recent difficulty adjustment showed an increase of 1.7%. As it stands today, approximately 900 Bitcoins are mined each day. Post-halving, this number will [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/less-than-15000-blocks-until-bitcoin-halving/\">Less than 15,000 blocks until Bitcoin halving</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-10T09:01:53.000Z",
    "title": "US Senators Ask SEC To Provide Report On X Account Breach",
    "url": "https://cryptodaily.co.uk/2024/01/us-senators-ask-sec-to-provide-report-on-x-account-breach",
    "description": "United States Senators J.D. Vance and Thom Tillis have called on the United States Securities and Exchange Commission to provide a report about the Jan 9th breach of its X account."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-10T09:04:37.000Z",
    "title": "Daily Maverick’s Journey: Experimenting with AI to Revolutionize News Summaries",
    "url": "https://www.cryptopolitan.com/daily-mavericks-journey-with-ai/",
    "description": "Daily Maverick, a prominent news publisher, embarked on an ambitious journey in late 2022 to harness the power of AI, particularly OpenAI&#8217;s ChatGPT-3, to enhance its news content. This endeavor aimed to explore the potential of AI-driven summaries, headlines, and more in the newsroom.&#160; Exploring the power of GPT-3 Daily Maverick initially experimented with OpenAI&#8217;s [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-10T09:05:06.000Z",
    "title": "Siemens partners with Sony to dive deeper into industrial metaverse",
    "url": "https://crypto.news/siemens-partners-with-sony-to-dive-deeper-into-industrial-metaverse/",
    "description": "Made for digital creators, the new metaverse-focused headset made by Siemens and Sony is expected to launch later in 2024. Siemens, the German multinational technology conglomerate, has teamed up with Sony to venture into the metaverse with a focus on&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-10T09:03:06.000Z",
    "title": "XAI tanks by 20% after airdrop and Binance listing",
    "url": "https://crypto.news/xai-tanks-by-20-after-airdrop-and-binance-listing/",
    "description": "The layer-3 gaming token fell by more than 20% after an airdrop and Binance listing on Jan. 9. According to CoinGecko, the layer-3 gaming token Xai has fallen by more than 22% in 24 hour trading. The current price of&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-10T09:00:00.000Z",
    "title": "Pullix rises as Cardano and Chainlink add to altcoin dominance",
    "url": "https://crypto.news/pullix-rises-as-cardano-and-chainlink-add-to-altcoin-dominance/",
    "description": "As investors look to diversify, Cardano (ADA) and Chainlink (LINK) are options. However, some are also exploring Pullix (PLX)"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-10T08:46:29.000Z",
    "title": "US Senators urge SEC for clarity following misleading tweet on Bitcoin ETFs",
    "url": "https://crypto.news/us-senators-urge-sec-for-clarity-following-misleading-tweet-on-bitcoin-etfs/",
    "description": "U.S. Senators J.D. Vance and Thom Tillis have urged the Securities and Exchange Commission (SEC) to provide a detailed report to Congress regarding the Jan. 9 breach of X account. In their Jan. 9 letter to SEC Chair Gary Gensler,&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-10T09:00:39.000Z",
    "title": "Is Stacks The New Safe Haven? STX Soars 16% In Turbulent Market",
    "url": "https://www.newsbtc.com/news/is-stacks-the-new-safe-haven-stx-soars-16-in-turbulent-market/",
    "description": "In a stunning divergence from the recent altcoin carnage, Stacks (STX) has emerged as a beacon of green. The token has not only weathered the storm but thrived, soaring for seven consecutive weeks and etching its highest price point since March 2023. At the time of writing, STX was trading at $1.80, down 10% in the last 24 hours, but managed to sustain a solid 16% rally in the last seven days, data from Coingecko shows. This bullish defiance is no fluke. Stacks broke through a key resistance level, showcasing investor confidence. The lack of pullbacks underscores the sustained buying pressure, while the flash crash&#8217;s long wick transformed the once-intimidating barrier into a sturdy support floor. Related Reading: AVAX Smashes South: Can Avalanche Find Traction After 15% Plunge? STX Resilience Amid Market Volatility Even amid the broader market correction, STX&#8217;s resilience speaks volumes about its relative strength. While this remarkable ascent undoubtedly excites, prudent skepticism remains. The rapid climb without pullbacks might trigger a sudden correction, and concerns about potential overheating linger. Ultimately, STX&#8217;s fate remains intertwined with the overall cryptocurrency market sentiment. Stacks has surged 694% in the past year, benefiting from the Bitcoin boom and standing out amid a recent decline in altcoins. This growth is driven by a mix of optimism around Bitcoin and Stacks serving as a prominent layer 2 solution for the cryptocurrency. Stacks currently trading at $1.799774492 territory. Chart: TradingView.com STX Price Movement Amid Anticipation Of BTC ETF Nod Meanwhile, the potential approval of a Bitcoin ETF has generated excitement in the crypto community, benefiting projects like Stacks. Stacks&#8217;s ability to incorporate smart contracts and decentralized applications onto the secure Bitcoin blockchain positions it well for potential developments in DeFi and NFTs within the Bitcoin ecosystem. As a leader in the Bitcoin layer 2 space, Stacks is well-positioned to meet the rising demand for scaling solutions. This advantage allows it to attract developers and users interested in building on the security of Bitcoin. However, the crypto market is volatile, and Stacks&#8217;s success depends on ongoing innovation and adoption, given intense competition in the layer 2 sector. STX price action in the last week. Source: Coingecko While acknowledging these challenges, Stacks&#8217;s impressive performance should be monitored by investors. The cryptocurrency is navigating the evolving landscape of the Bitcoin resurgence, and its ability to sustain momentum and establish a lasting presence remains uncertain. Nonetheless, the current chapter of Stacks&#8217;s story is filled with exciting possibilities. Related Reading: Cardano’s 2024 Rollercoaster: Price Plunges 18% Despite 250% Surge In Development Activity STX Technical Overview Stacks (STX) is feeling the heat from the bulls, who are aiming to break through the $1.80 psychological barrier and potentially climb to $1.95, the upper channel limit. This bullish sentiment finds fuel in a rising Relative Strength Index (RSI) at 66, suggesting buyer dominance, and upward-trending moving averages, hinting at favorable market conditions. If the bulls conquer $1.95, $2.0, a 14% climb from current levels, could be the next stop. Chart: TradingView However, caution lurks beneath the optimism. Buyer exhaustion or profit-taking could trigger a correction, sending STX dipping towards $1.6 and even $1.48, the lower channel boundary. The moving averages currently act as strong support zones, potentially buffering this potential dip. While the bulls lead the charge, keep an eye on the RSI and price action around $1.80 and $1.95. A clean break could propel STX higher, but consolidation or a dip is also a possibility. Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-10T09:00:58.000Z",
    "title": "The Latest Game-Fi Cryptocurrency Attracts Investors Away from Stellar and Shiba Inu",
    "url": "https://www.crypto-news-flash.com/the-latest-game-fi-cryptocurrency-attracts-investors-away-from-stellar-and-shiba-inu/?utm_source=rss&utm_medium=rss&utm_campaign=the-latest-game-fi-cryptocurrency-attracts-investors-away-from-stellar-and-shiba-inu",
    "description": "<img width=\"512\" height=\"292\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-64.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-64.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-64-300x171.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-64-150x86.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-64-450x257.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Stellar (XLM) remained stagnant in early January. Shiba Inu (SHIB) has fallen, although Shibarium’s popularity has jumped since early November. NuggetRush (NUGX) could become one of the top gaming projects in the NFT industry. Stellar (XLM) has stagnated since December 2023 despite the widespread bullishness in the crypto market. Shiba Inu (SHIB) has also fallen [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-10T08:51:02.000Z",
    "title": "Bitbot’s Presale: Redefining Telegram with Non-Custodial Trading",
    "url": "https://www.crypto-news-flash.com/bitbots-presale-redefining-telegram-with-non-custodial-trading/?utm_source=rss&utm_medium=rss&utm_campaign=bitbots-presale-redefining-telegram-with-non-custodial-trading",
    "description": "<img width=\"1600\" height=\"800\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Bitbot-Content-Media-Bank-–-Small-Logo-11.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Bitbot-Content-Media-Bank-–-Small-Logo-11.png 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Bitbot-Content-Media-Bank-–-Small-Logo-11-300x150.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Bitbot-Content-Media-Bank-–-Small-Logo-11-1200x600.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Bitbot-Content-Media-Bank-–-Small-Logo-11-768x384.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Bitbot-Content-Media-Bank-–-Small-Logo-11-1536x768.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Bitbot-Content-Media-Bank-–-Small-Logo-11-150x75.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Bitbot-Content-Media-Bank-–-Small-Logo-11-450x225.png 450w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />It’s no secret that Telegram trading bots are one of crypto’s fastest-growing sectors. With a crypto bull run on the horizon, thanks to Bitcoin’s scheduled halving event in April, these bots are forecast to see even more interest. A new project, Bitbot, is aiming to capitalize on the influx of investment in this area. Billed [...]"
  }
]