[
  {
    "source": "Bitcoin.com",
    "date": "2024-01-12T05:00:38.000Z",
    "title": "US Lawmakers Slam SEC Over Fake Bitcoin ETF Tweet — Say ‘This Failure Is Unacceptable’",
    "url": "https://news.bitcoin.com/us-lawmakers-slam-sec-over-fake-bitcoin-etf-tweet-say-this-failure-is-unacceptable/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-investigation-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"US Lawmakers Slam SEC Over Fake Bitcoin ETF Tweet — Say &#039;This Failure Is Unacceptable&#039;\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-investigation-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-investigation-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-investigation-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-investigation-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-investigation-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-investigation-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-investigation.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />U.S. lawmakers are demanding answers from the U.S. Securities and Exchange Commission (SEC) and Chair Gary Gensler regarding the regulator&#8217;s X account breach that led to a fake tweet on the social media platform announcing the approval of spot bitcoin exchange-traded funds (ETFs), a decision the commission hadn&#8217;t yet made at the time. The SEC [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-12T05:06:20.000Z",
    "title": "BNB Price Prediction – Why Bulls Could Aim Fresh Rally To $350",
    "url": "https://www.newsbtc.com/analysis/bnb/bnb-price-prediction-350/",
    "description": "BNB price is holding gains above the $300 pivot level. It is showing positive signs and might rally toward the $350 resistance zone. BNB price is moving higher above the $300 resistance. The price is now trading near $310 and the 100 simple moving average (4 hours). There is a key declining channel or a bullish flag pattern forming with resistance near $325 on the 4-hour chart of the BNB/USD pair (data source from Binance). The pair might continue to move up if there is a clear move above $315 and $325 BNB Price Aims Higher After a major increase, BNB price faced resistance near the $340 zone. The price started a downside correction and recently tested the $290 zone. A low was formed near $289, and the price is now attempting a fresh increase, like Bitcoin and Ethereum. There was a move above the $295 and $300 levels. The bulls pushed the price above the 50% Fib retracement level of the downward move from the $332 swing high to the $289 low. BNB is now trading near $310 and the 100 simple moving average (4 hours). The current price action is positive and signals more upsides. Immediate resistance is near the $315 level. It is close to the 61.8% Fib retracement level of the downward move from the $332 swing high to the $289 low. The next resistance sits near the $322 level. There is also a key declining channel or a bullish flag pattern forming with resistance near $325 on the 4-hour chart of the BNB/USD pair. A clear move above the $225 zone could send the price further higher. Source: BNBUSD on TradingView.com In the stated case, BNB price could test $340. A close above the $340 resistance might set the pace for a larger increase toward the $350 resistance. Any more gains might call for a test of the $375 level. Downside Correction? If BNB fails to clear the $322 resistance, it could start a downside correction. Initial support on the downside is near the $300 level. The next major support is near the $292 level. The main support sits at $288. If there is a downside break below the $288 support, the price could drop toward the $262 support. Any more losses could initiate a larger decline toward the $250 level. Technical Indicators 4-Hours MACD – The MACD for BNB/USD is gaining pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for BNB/USD is currently above the 50 level. Major Support Levels – $300, $292, and $288. Major Resistance Levels – $315, $322, and $325."
  }
]