[
  {
    "source": "CoinDesk",
    "date": "2023-12-19T16:18:50.000Z",
    "title": "FTX's Bahamas Wing Reaches Agreement With U.S. Bankruptcy Team, Streamlining Future Actions",
    "url": "https://www.coindesk.com/business/2023/12/19/ftxs-bahamas-wing-reaches-agreement-with-us-bankruptcy-team-streamlining-future-actions/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "This deal will pave the way for assets to be be pooled and distributed to FTX.com customers."
  },
  {
    "source": "Decrypt",
    "date": "2023-12-19T16:36:18.000Z",
    "title": "BONK Goes Bust? Solana Meme Coin Plunges 44% After Setting All-Time High",
    "url": "https://decrypt.co/210270/bonk-goes-bust-solana-meme-coin-plunges-44-after-setting-all-time-high",
    "description": "What went up last week has come crashing down—but Solana’s BONK is still up 500% this month despite the losses."
  },
  {
    "source": "Decrypt",
    "date": "2023-12-19T16:27:00.000Z",
    "title": "BlackRock Makes Key Changes to Bitcoin ETF Ahead of Expected Launch",
    "url": "https://decrypt.co/210278/blackrock-makes-key-changes-to-bitcoin-etf-ahead-of-expected-launch",
    "description": "In a new SEC filing, BlackRock said its iShares Bitcoin Trust would only allow cash—not in-kind—creation and changed its ticker to IBIT."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-19T16:30:34.000Z",
    "title": "Solana shows renewed strength against Ethereum in SOL/ETH ratio",
    "url": "https://cryptoslate.com/solana-shows-renewed-strength-against-ethereum-through-sol-eth-ratio/",
    "description": "<p>The SOL/ETH ratio, a metric comparing the value of Solana (SOL) to Ethereum (ETH), offers a clear lens to assess Solana&#8217;s standing in the competitive Layer-1 (L1) blockchain space. Amidst Solana&#8217;s growing user base and increasing market capitalization, this ratio is a vital tool for gauging its position as one of Ethereum&#8217;s most formidable rivals. [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/solana-shows-renewed-strength-against-ethereum-through-sol-eth-ratio/\">Solana shows renewed strength against Ethereum in SOL/ETH ratio</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-19T16:30:06.000Z",
    "title": "Veteran Trader Peter Brandt Shorts Ethereum, Signaling Potential Downturn",
    "url": "https://news.bitcoin.com/veteran-trader-peter-brandt-shorts-ethereum-signaling-potential-downturn/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/ether-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Veteran Trader Peter Brandt Shorts Ethereum, Signaling Potential Downturn\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/ether-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/ether-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/ether-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/ether-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/ether-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/ether-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/ether.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Monday, veteran trader Peter Brandt took to the social media channel X (previously known as Twitter) to reveal that he had taken a short position on ethereum (ETH), the crypto market&#x2019;s second-largest asset by valuation. He further shared a technical chart with his 707,000 followers on X to illustrate his strategy. Brandt Takes Short [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-19T16:34:54.000Z",
    "title": "Core Scientific’s Bankruptcy Exit Hearing Rescheduled: Aiming for Unanimous Stakeholder Support",
    "url": "https://www.cryptopolitan.com/core-scientifics-hearing-unanimous-support/",
    "description": "Core Scientific, a leading North American Bitcoin mining firm, has decided to postpone its bankruptcy exit final hearing to January 10, 2024. The move comes as the company engages in crucial negotiations to secure unanimous support from its key stakeholders for a more unified exit strategy. Core Scientific&#8217;s postponement for unanimous support Originally scheduled for [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-19T16:26:33.000Z",
    "title": "HyperPlay Integrates MetaMask Snaps for Enhanced Blockchain Gaming Experience",
    "url": "https://www.cryptopolitan.com/hyperplay-metamask-snaps-blockchain-gaming/",
    "description": "HyperPlay, a PC game launcher akin to platforms like Steam, Epic Games Store, and GoG (formerly Good Old Games), has taken a significant leap in blockchain gaming by integrating its wallet overlay with MetaMask Snaps. The integration marks a new era in gaming, allowing players to use custom wallet apps within games for a seamless [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-19T16:24:24.000Z",
    "title": "Central banks face the challenge of adaptation",
    "url": "https://www.cryptopolitan.com/central-banks-challenge-of-adaptation/",
    "description": "The global economy is currently witnessing a significant trial for central banks worldwide. This challenge isn&#8217;t about altering interest rates or implementing unconventional monetary policies. Rather, it&#8217;s a test of adaptability and responsiveness to rapidly shifting economic landscapes. The recent convergence of the Federal Reserve, European Central Bank, Bank of England, and Bank of Japan [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-19T16:12:44.000Z",
    "title": "ECB warns Eurozone banks of more volatility ahead",
    "url": "https://www.cryptopolitan.com/ecb-eurozone-banks-of-more-volatility-ahead/",
    "description": "The European Central Bank (ECB) has issued a stern warning to Eurozone banks, signaling the need for preparedness against potential volatility in the coming year. This cautionary advice comes amidst a backdrop of geopolitical tensions and economic uncertainties, urging banks to brace for potentially tumultuous times ahead. With the ECB supervising the Eurozone&#8217;s top banks [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-19T16:25:34.000Z",
    "title": "EthereumPoW dissolves core team, embraces full autonomy",
    "url": "https://crypto.news/ethereumpow-dissolves-core-team-embraces-full-autonomy/",
    "description": "EthereumPoW will disband its core development team to achieve full autonomy for the network."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-19T16:17:26.000Z",
    "title": "FTX and Bahamian liquidators agree on creditor payout plan",
    "url": "https://crypto.news/ftx-and-bahamian-liquidators-agree-on-creditor-payout-plan/",
    "description": "FTX has finalized a collaboration with Bahamian liquidators to outline details on how to pay back its creditors. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-19T16:30:44.000Z",
    "title": "Santiment Breaks Down “Most Trending” Altcoins Of Past Week",
    "url": "https://www.newsbtc.com/altcoin/santiment-breaks-down-trending-altcoins-week/",
    "description": "Here are the various altcoins that Santiment has identified to have been the most trending cryptocurrencies of the past week. Altcoins Like BONK Or SOL Saw Most Traction In Past Week In a new insight post, the on-chain analytics firm Santiment has discussed about some alts that have taken focus during the last week. Based on social media data, Santiment determines tokens to be &#8220;trending&#8221; if they have been receiving significant attention in the past 24 hours. Related Reading: XRP Gets Rejected Down: Analyst Predicts Bottom Target The below chart shows the top altcoins for each day in the past week on the basis of this metric: Looks like certain coins have repeatedly appeared on these lists &#124; Source: Santiment From the graph, it&#8217;s visible that the Solana-based meme coin BONK has pretty much observed the highest amount of traction on social media platforms during this period. The main reason behind the dog-themed coin being so trendy has been its listings on the two largest cryptocurrency exchanges in the sector, Coinbase and Binance. Injective Protocol (INJ) has been another asset that has consistently appeared on the Trending Tokens list. Santiment explains that the source of the altcoin&#8217;s popularity lies in its rally and hype for an upcoming airdrop. Solana (SOL), the sixth-largest cryptocurrency by market cap, has also been discussed by social media users. &#8220;Between December 11 and 17, SOL climbed the ranks, attributed to several high-profile projects and partnerships,&#8221; notes the analytics firm. &#8220;The ecosystem&#8217;s growth and its challenge to Ethereum&#8217;s dominance in Web3 were hot topics among traders and enthusiasts,&#8221; adds Santiment. Solana has also enjoyed some sharp uptrend in the past day, as the asset has shot up around 11% during the period. Unsurprisingly, Internet Computer (ICP) has also gained steam during the last week, as the asset has surged more than 73%. Since its high above $11.5, though, the altcoin has registered some significant decline, as it&#8217;s now trading around $9.75. &#8220;In summary, this week spotlighted the power of market catalysts — from exchange listings to pivotal updates — and their profound impact on project sentiments and trading activities,&#8221; says the analytics firm. BONK&#8217;s Exchange Listing Hype Has Observed Some Cooldown Soon after the meme coin received its listings on the aforementioned platforms, the BONK price shot up towards a new all-time high north of the $0.0000349 level. This extraordinary surge proved to be unsustainable, however, as profit-taking quickly ramped up and the altcoin fell back down. Related Reading: Bitcoin Crash To $38,000: Here’s What Could Trigger It BONK has since registered a very significant drop to the $0.0000206 mark. Here is a chart that shows how the meme coin&#8217;s performance has looked like in the past month: The price of the altcoin appears to have shot up recently &#124; Source: BONKUSD on TradingView Despite this drawdown of 41% from the top, though, BONK is still up more than 56% in the past week, which is an impressive return nonetheless. Overall in the past month, the meme coin is carrying profits of 617%, showcasing just how strong the coin&#8217;s recent rise has been. Featured image from Shutterstock.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-19T16:36:58.000Z",
    "title": "Dogecoin Co-founder Billy Markus Shuts Down Speculation About New Token",
    "url": "https://www.crypto-news-flash.com/dogecoin-co-founder-billy-markus-shuts-down-speculation-about-new-token/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-co-founder-billy-markus-shuts-down-speculation-about-new-token",
    "description": "<img width=\"1000\" height=\"664\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin4.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin4-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin4-768x510.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin4-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Markus&#8217;s involvement with a decade-old Bells network that was forked by unknown developers has been downplayed amid the ongoing meme coin hype. The Dogecoin developer reminded the followers that he would never be involved in another crypto project, and he was only relooking into the project to give investors some perspective. Amid the heightened meme [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-19T16:27:26.000Z",
    "title": "Layer 3 ClearSyncTM: Pioneering New Protocol for Secure Transactions",
    "url": "https://www.crypto-news-flash.com/layer-3-clearsynctm-pioneering-new-protocol-for-secure-transactions/?utm_source=rss&utm_medium=rss&utm_campaign=layer-3-clearsynctm-pioneering-new-protocol-for-secure-transactions",
    "description": "<img width=\"903\" height=\"508\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Yellow-network.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Yellow network\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Yellow-network.png 903w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Yellow-network-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Yellow-network-768x432.png 768w\" sizes=\"(max-width: 903px) 100vw, 903px\" />Layer 3 Foundation launches Yellow Clearing Network testnet in Duckies, innovating in decentralized clearing and counterparty risk mitigation. Layer 3&#8217;s Yellow Clearing Network, using ClearSyncTM protocol, promises to revolutionize trading, increasing security and efficiency in financial transactions. Layer 3 Foundation, a pioneer in blockchain-based financial technology, has announced the launch of a test network for [...]"
  }
]