[
  {
    "source": "CryptoSlate",
    "date": "2023-10-13T12:15:04.000Z",
    "title": "US tightens grip on AI chip export to China amid escalating tech battle",
    "url": "https://cryptoslate.com/us-tightens-grip-on-ai-chip-export-to-china-amid-escalating-tech-battle/",
    "description": "<p>The United States Government is contemplating shutting down Chinese companies&#8217; access to American artificial intelligence (AI) chips, Reuters reported on Oct. 13. The Biden administration aims to close loopholes allowing Chinese companies to acquire American AI chips via overseas subsidiaries. Last year, the U.S. government cut ties with China on chip trading and chip-making tools. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/us-tightens-grip-on-ai-chip-export-to-china-amid-escalating-tech-battle/\">US tightens grip on AI chip export to China amid escalating tech battle</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T12:19:15.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-13T12:19:28.000Z",
    "title": "Web3 games raised $600m in Q3, 50% less than in 2022",
    "url": "https://crypto.news/web3-games-raised-600m-in-q3-50-less-than-in-2022/",
    "description": "Analysts at DappRadar say the decline in funding is due to the distinct market dynamics of 2023. Web3 gaming projects raised $600 million in Q3 2023, which is 50% lower than in Q3 2022, according to data provided by DappRadar.&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-13T12:14:00.000Z",
    "title": "LOOM surges over 55% in a week, analyst suggests manipulation",
    "url": "https://crypto.news/loom-surges-over-55-in-a-week-analyst-suggests-manipulation/",
    "description": "The price of Loom Network's native LOOM token has seen significant gains over the past week, surging over 55% from $0.1719 on October 6th to $0.2667 today."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-13T12:30:45.000Z",
    "title": "Shiba Inu Price Stabilizes As Marketing Lead Teases Upcoming ‘Journey’",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-price-marketing-lead-upcoming-journey/",
    "description": "Amidst waves of volatility in the crypto market, the Shiba Inu price seems to be stabilizing. Meanwhile, Lucie, the marketing manager of Shiba Inu, provided important insights into the upcoming developments when she revealed the roadmap for the anticipated &#8220;journey&#8221;. The Upcoming &#8220;Shibarium Journey&#8221; In her most recent tweet, Lucie expressed the magnitude of the upcoming Shibarium journey. She stated, &#8220;Embarking on the Shibarium journey is a big task that demands a lot of time and commitment. Our goal is to create outstanding decentralized applications (dApps) that people will love and use.&#8221; Related Reading: Shiba Inu Price Dips Below Key Support: Time To Enter Or Exit SHIB? Elaborating on the roadmap, Lucie delved into the multifaceted strategy Shiba Inu plans to deploy. She highlighted the significant plans in store for the development of the project&#8217;s tokens, SHIB, BONE, and LEASH. Lucie underscored the goal to ensure that these tokens are &#8220;not only valuable but also have a strong utility within our ecosystem.&#8221; Such enhancements are hoped to draw in more users and investors, thereby amplifying benefits for the Shiba community. On the topic of decentralized applications, Lucie emphasized their focus on creating &#8220;exceptional dApps that will revolutionize the decentralized world.&#8221; According to her, the forthcoming dApps will be fashioned to be user-centric, innovative, and meet the demands of the community. Lucie also touched upon the virtual realms the team is concentrating on: the Shiboshi NFTs and the SHIB Metaverse. She believes these virtual environments will &#8220;serve as vibrant hubs for our community to connect, interact, and explore.&#8221; By shaping immersive and captivating online spaces, Lucie anticipates fostering a profound sense of community. Lucie wrapped up her tweet affirming the commitment to Shibarium&#8217;s growth as an L2 solution, stating, &#8220;Our steadfast commitment to building Shibarium as a successful L2 solution remains unshakable.&#8221; She championed the collaborative and innovative ethos that forms the foundation for the tokens and the burgeoning Shibarium ecosystem, saying: This journey, marked by collaboration, innovation, and dedication, is the bedrock of our tokens’ triumph and the thriving Shibarium ecosystem. Together, we’re shaping the future of decentralized applications, one innovative step at a time. #ShibariumJourney However, not all members of the SHIB community are on board with the project&#8217;s current trajectory. A notable tweet from @a_king_li read: &#8220;@ShytoshiKusama: L2 has been released for two months now, and there are no major projects, no good ecosystem or trustworthy swap. As a responsible official, should we release some official cooperative ecosystems or swap, so that funds can come in with peace of mind.&#8221; Related Reading: Shiba Inu-Based BONE Gearing Up For Massive Rally, Here’s Why The concerns primarily arise from the absence of any major dApp on Shibarium, as touched on by Lucie. Notable projects like ShibaSwap and the Metaverse are yet to be operational on Shibarium. Furthermore, there&#8217;s a noted decline in Shibarium&#8217;s user and transaction statistics. After an initial hype with over 200,000 transactions daily post-launch, recent numbers hover above a mere 10,000 transactions per day. Shiba Inu Price Stabilizes The stagnation in Shibarium&#8217;s development may be a contributing factor to the dissatisfaction of some community members, as well as SHIB&#8217;s recent price action. As detailed in our last in-depth analysis, the SHIB price currently treads on decisive technical grounds, influenced by two significant chart patterns. On the 1-week chart, SHIB showcases a promising quadruple bottom formation, indicating a potential bullish surge of up to 250% if realized. Contrarily, a descending triangle pattern, which has evolved over 60 weeks, suggests a bearish downturn. This is highlighted as SHIB&#8217;s price, currently at $0.00000682, has dropped below the descending triangle&#8217;s crucial neckline of $0.00000715. For now, SHIB has stabilized and recovered slightly, having already fallen to $0.00000671 yesterday. Hope also comes from previous instances, such as the dip in June followed by a 59% rally, suggesting the potential for swift recoveries. However, for this to happen, SHIB needs to record a weekly close above the $0.00000715 this week or next week. This might cement the bullish quadruple bottom trajectory. In case the scenario does not play out, SHIB could fall again towards the yearly low at $0.000006. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-13T12:27:29.000Z",
    "title": "Positioning for Success in 2023: Chiliz (CHZ), Tradecurve Markets (TCRV), ApeCoin (APE)",
    "url": "https://www.crypto-news-flash.com/positioning-for-success-in-2023-chiliz-chz-tradecurve-markets-tcrv-apecoin-ape/?utm_source=rss&utm_medium=rss&utm_campaign=positioning-for-success-in-2023-chiliz-chz-tradecurve-markets-tcrv-apecoin-ape",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-53.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-53.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-53-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-53-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />While we are already in the final stretch of 2023, there are still promising ventures with the potential for substantial returns. Standing out are Chiliz (CHZ), ApeCoin (APE), and Tradecurve Markets (TCRV). Let’s explore why these tokens are profitable, including factors that will propel their growth. Summary Chiliz’s convergence of blockchain and sports makes it [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-13T12:26:21.000Z",
    "title": "Crypto Analyst: Bitcoin (BTC) Set to Overtake Gold and Silver Market Cap",
    "url": "https://www.crypto-news-flash.com/crypto-analyst-bitcoin-btc-set-to-overtake-gold-and-silver-market-cap/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-analyst-bitcoin-btc-set-to-overtake-gold-and-silver-market-cap",
    "description": "<img width=\"562\" height=\"375\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Bild1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Bild1.jpg 562w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Bild1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Bild1-104x69.jpg 104w\" sizes=\"(max-width: 562px) 100vw, 562px\" />The crypto community is confident that Bitcoin will eventually overtake the market cap of gold and silver to become the preferred safe haven of the future. Part of the reason for the success is that, unlike precious metals, the digital asset can easily be verified and cannot be manipulated. A popular YouTube analyst has reiterated [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-13T12:11:48.000Z",
    "title": "Ripple and Cardano Founder Lock Horns Over ‘ETHgate’ Controversy",
    "url": "https://www.crypto-news-flash.com/ripple-and-cardano-founder-lock-horns-over-ethgate-controversy/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-and-cardano-founder-lock-horns-over-ethgate-controversy",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-1-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-1-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-1-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-1-1-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The Ripple community and Charles Hoskinson, Cardano&#8217;s founder, are in disagreement over the term &#8216;corruption&#8217; in light of the &#8216;ETHgate&#8217; scandal. The discord highlights broader industry concerns about the SEC&#8217;s alleged preferential treatment of Ethereum. The Underpinnings of &#8216;ETHgate&#8217;: Ripple vs. Cardano In the ever-evolving landscape of the cryptocurrency world, disagreements and debates are not [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-13T12:26:26.000Z",
    "title": "FLOKI: The Memecoin Messiah? Major Announcement on the 17th",
    "url": "https://coinedition.com/floki-the-memecoin-messiah-major-announcement-on-the-17th/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/FLOKI-now-warrants-a-pump-like-no-other-My-body-is-ready.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FLOKI now warrants a pump like no other My body is ready\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/FLOKI-now-warrants-a-pump-like-no-other-My-body-is-ready.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/FLOKI-now-warrants-a-pump-like-no-other-My-body-is-ready-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/FLOKI-now-warrants-a-pump-like-no-other-My-body-is-ready-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/FLOKI-now-warrants-a-pump-like-no-other-My-body-is-ready-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/FLOKI-now-warrants-a-pump-like-no-other-My-body-is-ready-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/FLOKI-now-warrants-a-pump-like-no-other-My-body-is-ready-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Meme coin network Floki, in a recent post on X (formerly Twitter), teased an upcoming major announcement. The tweet has since garnered the attention of community members, with many speculating on what the announcement could be. The cryptic post merely mentioned October 17, 2023, without providing any other information. However, many Floki community members speculate [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/floki-the-memecoin-messiah-major-announcement-on-the-17th/\">FLOKI: The Memecoin Messiah? Major Announcement on the 17th</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]