[
  {
    "source": "CoinDesk",
    "date": "2023-11-29T15:58:04.000Z",
    "title": "Hull City Sponsor Tomya Crypto Exchange Embroiled in Turkey Fraud Scandal",
    "url": "https://www.coindesk.com/policy/2023/11/29/hull-city-sponsor-tomya-crypto-exchange-embroiled-in-turkey-fraud-scandal/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The owner of Tomya was among 25 people detained in Turkey as the country prepares new crypto legislation."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-29T15:48:37.000Z",
    "title": "Crypto Mixer Sanctioned by U.S. Treasury for North Korea Allegations, as FBI and Finish Police Seize Website",
    "url": "https://www.coindesk.com/policy/2023/11/29/crypto-mixer-sanctioned-by-us-treasury-for-north-korea-allegations-as-fbi-and-finish-police-seize-website/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Treasury Department's Office of Foreign Asset Control listed two crypto addresses tied to Sinbad, a mixing service, in its latest sanctions list."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-29T16:00:14.000Z",
    "title": "'District 9' Director's Avalanche Shooter 'Off the Grid' Launches Mobile Game Amid Subnet Rollout",
    "url": "https://decrypt.co/207849/district-9-director-avalanche-shooter-off-grid-launches-mobile-game-subnet-rollout",
    "description": "In an exclusive interview, Gunzilla Games CEO Vlad Korolev shares the latest plans for Off the Grid and its many crypto integrations."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-29T16:00:14.000Z",
    "title": "Paxos poised to expand global stablecoin operations in Abu Dhabi with regulatory green light",
    "url": "https://cryptoslate.com/paxos-poised-to-expand-global-stablecoin-operations-in-abu-dhabi-with-regulatory-green-light/",
    "description": "<p>Paxos has obtained in-principle approvals from the Financial Services Regulatory Authority (FSRA) in the Abu Dhabi Global Market (ADGM). These approvals mark a significant step for Paxos in the region, allowing it to issue US dollars and other currency-backed stablecoins and offer crypto-brokerage and custody services from its regulated ADGM entities. This development is reportedly [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/paxos-poised-to-expand-global-stablecoin-operations-in-abu-dhabi-with-regulatory-green-light/\">Paxos poised to expand global stablecoin operations in Abu Dhabi with regulatory green light</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T16:06:17.000Z",
    "title": "Hut 8 set to finalize its merger agreement with USBTC",
    "url": "https://www.cryptopolitan.com/hut-8-set-to-finalize-its-merger-with-usbtc/",
    "description": "Hut 8 is on the brink of finalizing its merger with US Bitcoin Corp, a move set to usher in a new era of geographic diversity and increased revenue streams for the company. Termed a “merger of equals” by executives, the deal, initially disclosed in February, has gained momentum, with USBTC stockholders recently granting their ... <a title=\"Hut 8 set to finalize its merger agreement with USBTC\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hut-8-set-to-finalize-its-merger-with-usbtc/\" aria-label=\"More on Hut 8 set to finalize its merger agreement with USBTC\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T16:03:54.000Z",
    "title": "Why is the crypto market up today? Will BTC hit $40K by the end of the week?",
    "url": "https://www.cryptopolitan.com/why-is-the-crypto-market-up-will-btc-hit-40k/",
    "description": "Crypto markets are notoriously volatile, influenced by a myriad of factors ranging from macroeconomic trends and regulatory developments to technological advancements and market sentiment. Today, as the crypto market experiences an unexpected surge, enthusiasts and investors alike find themselves on the edge of anticipation, questioning the driving forces behind this sudden upswing. This surge prompts ... <a title=\"Why is the crypto market up today? Will BTC hit $40K by the end of the week?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/why-is-the-crypto-market-up-will-btc-hit-40k/\" aria-label=\"More on Why is the crypto market up today? Will BTC hit $40K by the end of the week?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T16:00:08.000Z",
    "title": "Deciphering Vitalik Buterin’s latest blog – The insights",
    "url": "https://www.cryptopolitan.com/vitalik-buterin-latest-blog-the-insights/",
    "description": "In the blockchain industry, few names command as much respect and intrigue as Vitalik Buterin. His latest blog, a compendium of insights and foresights, offers a window into the mind of a genius who has continually redefined the boundaries of technology and its implications on society. This article will unwrap the layers of Buterin&#8217;s complex ... <a title=\"Deciphering Vitalik Buterin&#8217;s latest blog &#8211; The insights\" class=\"read-more\" href=\"https://www.cryptopolitan.com/vitalik-buterin-latest-blog-the-insights/\" aria-label=\"More on Deciphering Vitalik Buterin&#8217;s latest blog &#8211; The insights\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T15:54:29.000Z",
    "title": "Europol arrests five ransomware attackers in Ukraine",
    "url": "https://www.cryptopolitan.com/europol-five-ransomware-attackers-in-ukraine/",
    "description": "Law enforcement agencies, including Europol and international partners, recently achieved a significant breakthrough in the battle against cybercrime. In a collaborative effort, five individuals were apprehended and accused of orchestrating a series of ransomware attacks that impacted over 1,800 victims worldwide. The arrests followed raids at 30 locations in Ukraine, targeting the criminal gang’s leader, ... <a title=\"Europol arrests five ransomware attackers in Ukraine\" class=\"read-more\" href=\"https://www.cryptopolitan.com/europol-five-ransomware-attackers-in-ukraine/\" aria-label=\"More on Europol arrests five ransomware attackers in Ukraine\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-29T16:00:59.000Z",
    "title": "Is $20 On The Cards? LINK Price Rides High With Chainlink Staking v0.2 Rollout",
    "url": "https://www.newsbtc.com/news/is-20-on-the-cards-link-price-rides-high-with-chainlink-staking-v0-2-rollout/",
    "description": "Chainlink, a widely used distributed computing platform, has recently introduced an upgrade to its staking capabilities. Known as Staking v0.2, this new version adds an extra layer of security to the network and stands as a key component of Chainlink&#8217;s Economic 2.0 strategy. The anticipated duration for the migration of the protocol for the current v0.1 stakeholders is nine days. Users cannot transfer their staked LINK or the associated rewards to version 0.2 at this time. According to the most recent data, LINK was trading at a price range of $14.7 to $14.9, representing a monthly growth of over 30%. The majority of LINK oscillators exhibit a consistent optimistic bias. The Relative Strength Index (RSI) indicates a possible purchasing opportunity at 50. #Chainlink Staking v0.2 is officially live on mainnet ⬡ Starting today, existing v0.1 stakers have a nine-day window to migrate their staked LINK and accrued rewards to the 45M LINK v0.2 pool, with guaranteed access before Early Access begins. 🧵https://t.co/pcFAVXct3L — Chainlink (@chainlink) November 28, 2023 Chainlink (LINK) is experiencing an extraordinary quarter, having gained nearly 100 percent since the start of October. At the time of writing, the altcoin had risen as high as 12th among the largest cryptocurrencies by market capitalization. LINK holders may still have more to look forward to, as on-chain data indicates that the recent ascent of the token has created favorable conditions for the formation of robust support levels. Among these strongest support levels, according to data provider IntoTheBlock, is the region between $13.15 and $13.50. Related Reading: LUNC Soars Over 70% – Temporary Spike Or Sustainable Climb Ahead? Chainlink: Staking And Migration Advancements LINK maintains its favorable outlook in spite of the general market volatility that has ensued since the regulatory issues faced by the Binance exchange and the discourse surrounding exchange-traded funds (ETFs). LINK market cap currently at $8.21 billion on the daily chart: TradingView.com Whale Transactions Up With the launch of the v0.2 migration, the industry-leading Oracle network Chainlink has provided stakers with a more flexible staking platform. In addition, it features an adaptive rewards system, enhanced security guarantees, and a modular architecture. Santiment, a market intelligence platform, reports that whale transactions (see chart below) comprising LINK worth a minimum of $100,000 increased by 1,145% in the previous day, from 176 transactions on November 28 to 2,198 transactions as of the time of writing. Source: Santiment Rapid growth in whale activity is typically associated with increased volatility in an asset. Furthermore, according to data from Santiment, LINK experienced a marginal increase in total open interest (OI) within the last day, rising from $211 million to $213 million. Eleven months have passed since the protocol&#8217;s December 2022 introduction of staking on the Chainlink network. A press statement from Chainlink on November 28th stated that the v0.2 update includes an increase in the amount of the staking pool to 45 million LINK. LINK price action in the last seven days. Source: Coingecko The aforementioned figure signifies a 96% growth from the initial allocation of 22.5 million LINK to the staking pool in December, which accounted for 8% of the altcoin&#8217;s circulating supply at the time. Related Reading: Revving Up: Solana Bulls Ready To Charge As Analysts Predict Rally Beyond $80 LINK Price Analysis: Eyes On The $20 Mark Meanwhile, with Chainlink&#8217;s Staking v0.2 in play, LINK&#8217;s value is on the rise, prompting the question: Will it hit $20? The excitement is building as investors keep a close eye on the numbers. The recent boost in LINK&#8217;s price has people hopeful about reaching that $20 mark. As the crypto world unfolds, it&#8217;s a waiting game to see where LINK&#8217;s journey takes us next. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-29T16:08:37.000Z",
    "title": "Bitcoin (BTC) Price Jumps to $38,000 as Exchange Supply Drops to 5-Year Low",
    "url": "https://www.crypto-news-flash.com/bitcoin-btc-price-jumps-to-38000-as-exchange-supply-drops-to-5-year-low/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-btc-price-jumps-to-38000-as-exchange-supply-drops-to-5-year-low",
    "description": "<img width=\"1920\" height=\"1152\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-g59eaf309d_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-g59eaf309d_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-g59eaf309d_1920-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-g59eaf309d_1920-1024x614.jpg 1024w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />On-chain data indicates a significant outflow of Bitcoins from exchanges, reaching the lowest level in five years since 2017. Despite concerns about a bearish movement, PlanB, the stock-to-flow model creator, expresses confidence that Bitcoin won&#8217;t dip below $35,000. After a short hiatus, Bitcoin (BTC) has once again given a strong movement shooting past $38,000 levels [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-29T16:05:31.000Z",
    "title": "Binance Coin (BNB) Faces Uphill Battle: Price Analysis and Future Predictions",
    "url": "https://www.crypto-news-flash.com/binance-coin-bnb-faces-uphill-battle-price-analysis-and-future-predictions/?utm_source=rss&utm_medium=rss&utm_campaign=binance-coin-bnb-faces-uphill-battle-price-analysis-and-future-predictions",
    "description": "<img width=\"1600\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"opBNB\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn.png 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-1536x864.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-24x14.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-36x20.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-48x27.png 48w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />In response to the ongoing changes in the Binance ecosystem, BNB has taken a downturn as market sentiments become increasingly negative.  Community members collectively express concerns over the perceived future of the Binance Coin (BNB) and the entire Binance ecosystem.  The Binance Coin (BNB) has been at the receiving end of the ongoing chaos that [...]"
  }
]