[
  {
    "source": "CryptoSlate",
    "date": "2023-05-29T08:45:00.000Z",
    "title": "Bitcoin realized price hits YTD high",
    "url": "https://cryptoslate.com/insights/bitcoin-realized-price-hits-ytd-high/",
    "description": "<p>Quick Take The realized price is the average cost basis for the entire Bitcoin market. The current realized price is at a year-to-date high of $20,180. Since March 2023, Bitcoin&#8217;s realized price has hovered around the 2020 and 2022 levels, of roughly $26,400. The highest realized price across all cohorts is currently from 2021 onwards [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-realized-price-hits-ytd-high/\">Bitcoin realized price hits YTD high</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-29T08:54:12.000Z",
    "title": "Bali Threatens to Sanction Tourists Who Pay in Crypto",
    "url": "https://cryptodaily.co.uk/2023/05/bali-threatens-to-sanction-tourists-who-pay-in-crypto",
    "description": "<p>Balinese authorities said they would crack down on foreign tourists who pay for products and services using cryptocurrencies. </p>\n<p>Tech in Asia reports the Bali Provincial Government threatened to impose strict sanctions on tourists and businesspeople who use cryptocurrencies for payments. Authorities decided to take action after a local news publication, Kompas, found tourists had been paying for services such as motorbike rentals, meditation practices, and meals using cryptocurrencies.</p>\n<p>In Indonesia, digital assets are officially recognised as tradeable commodities on future exchanges but cannot be used as a payment method.</p>\n<p>Bali Governor Wayan Koster spoke at a press conference on Sunday, where he warned foreign tourists of using crypto assets as a means of payment.</p>\n<p>Koster said:</p>\n\n<p>Foreign tourists who behave inappropriately, carry out activities that are not in accordance with visa permits, use crypto as a means of payment transactions, and violate other provisions will be dealt with strictly according to laws and regulations.</p>\n\n<p>The Governor said individuals contravening the laws would be dealt with in terms of a 2023 law which states that individuals found conducting foreign exchanges without a necessary permit may be subject to one to five years in prison and a fine of 50 million ($3,300) to 22 billion rupiahs ($1.4 million).</p>\n<p>Oversight of the crypto industry in Indonesia is governed by the Indonesia Commodity Futures Trading Regulatory Agency, also known as Bappebti.</p>\nIndonesia To Launch a National Crypto Exchange\n<p>Indonesia&rsquo;s trade minister, Zulkifli Hasan, announced earlier in the year that the country&rsquo;s long-awaited national crypto exchange would launch in June.</p>\n<p>The exchange, dubbed the Nat&rsquo;l Exchange, will act as a mediator between buyers and sellers and, as a custodian, will manage the flow of assets.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-29T08:48:08.000Z",
    "title": "Bitcoin.com's VERSE Token Now Available for Trading on Kucoin",
    "url": "https://cryptodaily.co.uk/2023/05/bitcoincoms-verse-token-now-available-for-trading-on-kucoin",
    "description": "<p>Tokyo, Japan, May 29th, 2023, Chainwire</p><p>Bitcoin.com&rsquo;s ecosystem token, VERSE, has been listed on Kucoin, a top-tier cryptocurrency exchange platform known for being the home of crypto gems. Trading is open now, with the initial pair being VERSE/USDT.</p><p>A milestone moment for Bitcoin.com, this first exchange listing for VERSE is significant because it amplifies the token&rsquo;s reach and accessibility to millions of users around the globe.</p><p>VERSE fuels Bitcoin.com's ecosystem by gamifying and incentivizing onboarding and engagement. The goal is to bring the advantages of cryptocurrency to more people and to fast-track the world&rsquo;s transition to a more inclusive financial system.</p>Bitcoin.com CEO Dennis Jarvis said, \"At&nbsp;Bitcoin.com, we believe in creating economic freedom and expanding access to opportunities by providing the tools people need to buy, sell, and use cryptocurrencies. We are proud to introduce VERSE, a token that supercharges our mission. And by listing on Kucoin, we're making it easier than ever for people to trade VERSE and harness its potential.\"<p>By facilitating rewards and serving as a utility token, VERSE enhances users' experiences within the Bitcoin.com ecosystem and beyond.</p>\"VERSE reduces hurdles, making the onboarding experience for newcomers seamless, fun, and rewarding,&rdquo; said Corbin Fraser, Head of Financial Services at&nbsp;Bitcoin.com. He added, &ldquo;We&rsquo;re in the process of making VERSE a multichain token, which will increase its utility. This is something that exemplifies our commitment to freedom of choice, a core value that permeates everything we do.\"<p>Since its inception in 2015, Bitcoin.com has evolved from pioneer to established leader in the crypto industry, hitting the 40 million self-custody wallets milestone earlier this month. The Bitcoin.com Wallet supports over a hundred cryptoassets across Bitcoin, Ethereum, Polygon, Avalanche, and Bitcoin Cash, with more chains coming soon. By providing 24/7 support, vast educational resources, and an award-winning news portal, Bitcoin.com has proven itself as the world&rsquo;s gateway to Bitcoin and beyond.</p><p>Kucoin, a platform where 1 out of 4 crypto holders worldwide trade, has consistently been a preferred choice for discovering hidden gems. Its 27 million registered users across 207 countries and regions demonstrate its widespread popularity and credibility. In celebration of the VERSE listing, Kucoin is hosting a VERSE trading contest with a lucrative $40,000 prize pool.</p><p>For more information about the VERSE listing and trading contest, visit Kucoin's&nbsp;official website.</p><p>About Bitcoin.com</p><p>Bitcoin.com is committed to making Bitcoin and other cryptocurrencies accessible to everyone. From offering educational resources and timely news to providing intuitive self-custody products,&nbsp;Bitcoin.com empowers individuals to explore the possibilities of cryptocurrencies and the future of finance.</p><p>Follow Bitcoin.com on Twitter for more information.</p><p>About VERSE</p><p>Launched in December 2022, VERSE is Bitcoin.com&rsquo;s rewards and utility token. By incentivizing and gamifying engagement in the Bitcoin.com ecosystem, VERSE supercharges&nbsp;Bitcoin.com&rsquo;s mission to onboard the world to crypto and accelerate the transition towards a more inclusive financial system. VERSE also powers Bitcoin.com&rsquo;s decentralized exchange Verse DEX, where anyone can trade permissionlessly and earn yield by contributing to liquidity pools and with Verse Farms.</p><p>Follow VERSE on Twitter and Join VERSE's official Telegram channel for more updates and additional information.</p><p>About Kucoin&nbsp;</p><p>Kucoin is a global cryptocurrency exchange that supports over 750 projects with 1,300+ trading pairs. Known as the \"People&rsquo;s Exchange,\" Kucoin boasts an extensive user base, with 70% of its users hailing from Europe, the Middle East &amp; Africa, and SEA. Recognized for its excellence, Kucoin has received accolades from TokenInsight, CoinMarketCap, Forbes Advisor, and The Ascent.</p>ContactHead of MarketingAndrew ToddBitcoin.comandrew@bitcoin.com"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-29T08:50:55.000Z",
    "title": "Bitcoin.com’s VERSE Token Now Available for Trading on Kucoin",
    "url": "https://www.cryptopolitan.com/bitcoin-coms-verse-token-now-available-for-trading-on-kucoin/",
    "description": "Tokyo, Japan, May 29th, 2023, Chainwire Bitcoin.com’s ecosystem token, VERSE, has been listed on Kucoin, a top-tier cryptocurrency exchange platform known for being the home of crypto gems. Trading is open now, with the initial pair being VERSE/USDT. A milestone moment for Bitcoin.com, this first exchange listing for VERSE is significant because it amplifies the ... <a title=\"Bitcoin.com&#8217;s VERSE Token Now Available for Trading on Kucoin\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-coms-verse-token-now-available-for-trading-on-kucoin/\" aria-label=\"More on Bitcoin.com&#8217;s VERSE Token Now Available for Trading on Kucoin\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-29T09:02:36.000Z",
    "title": "Level Finance exploiter moves $1m worth of BNB to Tornado Cash",
    "url": "https://crypto.news/level-finance-exploiter-moves-1m-worth-of-bnb-to-tornado-cash/",
    "description": "Level Finance was hacked on May 2. According to on-chain data, the hacker stole over $1m worth of BNB and is now moving the funds to Tornado Cash"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-29T08:54:57.000Z",
    "title": "Huobi to expand trading service into Hong Kong crypto market",
    "url": "https://crypto.news/huobi-to-expand-trading-service-into-hong-kong-crypto-market/",
    "description": "Huobi has announced the launch of Huobi HK, an initiative that aims to provide cryptocurrency trading services to users in Hong Kong"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-29T08:46:36.000Z",
    "title": "Bitcoin.com’s VERSE Token Now Available for Trading on Kucoin",
    "url": "https://www.crypto-news-flash.com/bitcoin-coms-verse-token-now-available-for-trading-on-kucoin/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-coms-verse-token-now-available-for-trading-on-kucoin",
    "description": "<p>Tokyo, Japan, May 29th, 2023, Chainwire Bitcoin.com’s ecosystem token, VERSE, has been listed on Kucoin, a top-tier cryptocurrency exchange platform known for being the home of crypto gems. Trading is open now, with the initial pair being VERSE/USDT. A milestone moment for Bitcoin.com, this first exchange listing for VERSE is significant because it amplifies the [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/bitcoin-coms-verse-token-now-available-for-trading-on-kucoin/\">Bitcoin.com&#8217;s VERSE Token Now Available for Trading on Kucoin</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]