[
  {
    "source": "Cointelegraph",
    "date": "2024-03-04T04:40:04.000Z",
    "title": " AI, ETFs will power a decade-long ‘gold rush’ for Bitcoin: Michael Saylor ",
    "url": "https://cointelegraph.com/news/decade-long-gold-rush-bitcoin-michael-saylor",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvODIzZjBhNDgtOTkwZC00ZGY3LTk4NjgtNDlkZmU3YTdkZDcxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Institutions will compete to capture as much of Bitcoin’s ever-decreasing supply until the end of 2034 as 99% of Bitcoin will have been mined by then, Saylor explained.</p>\n                    <p><p>Spot Bitcoin ETFs have triggered a decade-long institutional “gold rush” for Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC),</a> which will be aided by the rise of autonomous artificial intelligence, according to MicroStrategy chairman Michael Saylor.</p><p>During a panel discussion at the Bitcoin Atlantis conference on March 1, Saylor <a href=\"https://www.youtube.com/watch?v=SKAHlCpwsLc&amp;t=28514s\" target=\"_blank\" rel=\"noopener nofollow\">argued</a> that after the launch of spot Bitcoin ETFs, Bitcoin has entered a period of “high growth institutional adoption.\"</p><p>Saylor said that by the year 2035, 99% of all Bitcoin will have been mined and that 2035 will mark the start of the “growth phase.” </p><p><a href=\"https://cointelegraph.com/news/decade-long-gold-rush-bitcoin-michael-saylor\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-04T04:53:00.000Z",
    "title": "Ethereum Price Key Indicators Suggest A Strengthening Case For Surge To $3,800",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-surge-3800/",
    "description": "Ethereum price is consolidating gains above $3,400. ETH is showing positive signs and might soon aim for a move above the $3,500 resistance zone. Ethereum is holding gains and consolidating below the $3,500 resistance zone. The price is trading above $3,400 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $3,420 on the hourly chart of ETH/USD (data feed via Kraken). The pair seems to be setting up for a move toward the $3,650 and $3,800 levels. Ethereum Price Remains Supported Ethereum price formed a base above the $3,350 level and started another increase, like Bitcoin. ETH broke the $3,400 level to set the pace for more upsides. There was a clear move above the 50% Fib retracement level of the downside correction from the $3,519 swing high to the $3,305 low. The bulls are now active above the $3,420 level. There is also a key bullish trend line forming with support at $3,420 on the hourly chart of ETH/USD. Ethereum is now trading above $3,450 and the 100-hourly Simple Moving Average. It is showing positive signs above the 76.4% Fib retracement level of the downside correction from the $3,519 swing high to the $3,305 low. Immediate resistance on the upside is near the $3,500 level. The first major resistance is near the $3,520 level. The next major resistance is near $3,550, above which the price might gain bullish momentum.  The next stop for the bulls could be near the $3,650 level. Source: ETHUSD on TradingView.com If there is a move above the $3,650 resistance, Ether could even rally toward the $3,720 resistance. Any more gains might call for a test of $3,800. Are Dips Supported In ETH? If Ethereum fails to clear the $3,520 resistance, it could start a downside correction. Initial support on the downside is near the $3,420 level and the trend line. The first major support is near the $3,400 zone or the 100 hourly SMA. The next key support could be the $3,350 zone. A clear move below the $3,350 support might send the price toward $3,320. Any more losses might send the price toward the $3,150 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $3,400 Major Resistance Level – $3,520"
  }
]