[
  {
    "source": "CoinDesk",
    "date": "2023-09-11T15:43:37.000Z",
    "title": "AI Is Killing Crypto Venture Capital Interest",
    "url": "https://www.coindesk.com/consensus-magazine/2023/09/11/ai-is-killing-crypto-venture-capital-interest/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Scandals like FTX drove away VCs, leading to a collapse in venture funding. Now, artificial intelligence is soaking up the capital still available in an uncertain macro environment, says Chris Coll-Beswick, at Transcend Labs, a startup accelerator."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-11T15:59:33.000Z",
    "title": "Arbitrum Confirms Zero Fraud Proofs Invoked Since Mainnet",
    "url": "https://cryptodaily.co.uk/2023/09/arbitrum-confirms-zero-fraud-proofs-invoked-since-mainnet",
    "description": "This indicates that no validator has challenged another over potential dishonesty or inaccuracies in transaction batches."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-11T15:47:14.000Z",
    "title": "Polygon and Polkadot Whales Are Buying Into Tradecurve Markets Presale As Token Reaches New ATH",
    "url": "https://cryptodaily.co.uk/2023/09/polygon-and-polkadot-whales-are-buying-into-tradecurve-markets-presale-as-token-reaches-new-ath",
    "description": "Recently, Polygon (MATIC) and Polkadot (DOT) whales have been steering their portfolios toward the promising Tradecurve Markets (TCRV) presale"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-11T16:00:36.000Z",
    "title": "Biggest Movers: SHIB Plunges to Multi-Month Low on Monday",
    "url": "https://news.bitcoin.com/biggest-movers-shib-plunges-to-multi-month-low-on-monday/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2116506779-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers: SHIB Plunges to Multi-Month Low on Monday\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2116506779-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2116506779-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2116506779-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2116506779-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2116506779-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2116506779-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2116506779-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Shiba inu started the week by dropping to its lowest point since June, as a red wave swept through cryptocurrency markets. This has pushed the global market cap 1.20% lower at the time of writing. XRP fell by as much as 5%, as Ripple&#x2019;s battle with the Securities and Exchange Commission (SEC) continued. Shiba Inu [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-11T15:52:23.000Z",
    "title": "Indian Railways Develops AI-Driven Safety Device for Loco Pilots",
    "url": "https://www.cryptopolitan.com/indian-develops-ai-driven-safety-device/",
    "description": "In a pioneering move to enhance safety in train operations, the Indian Railways (IR) is on the verge of introducing an innovative Artificial Intelligence (AI)-driven device known as the &#8220;Railway Driver Assistance System&#8221; (RDAS). This cutting-edge technology aims to monitor the alertness of on-duty locomotive pilots, with the potential to prevent mishaps by issuing timely ... <a title=\"Indian Railways Develops AI-Driven Safety Device for Loco Pilots\" class=\"read-more\" href=\"https://www.cryptopolitan.com/indian-develops-ai-driven-safety-device/\" aria-label=\"More on Indian Railways Develops AI-Driven Safety Device for Loco Pilots\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-11T16:00:08.000Z",
    "title": "Remember That Guy That Lost A Flashdrive With 8,000 BTC? Here’s What He’s Up To Now",
    "url": "https://www.newsbtc.com/bitcoin-news/flashdrive-8000-btc/",
    "description": "James Howells, a Welsh Bitcoin investor and the man who inadvertently lost $557 million worth of BTC in a flash drive is seeking to file a lawsuit against Newport City Council (NCC) in the United Kingdom for refusing his requests to excavate the area he presumed he misplaced the hard drive.  Howells Threatens Legal Action Against NCC After 10 years of searching for the elusive flash drive carrying a fortune of 8,000 BTC, Howells has taken an aggressive approach to his hunt and threatened the NCC with proper legal action that may see the council firmly bankrupt if the court rules in favor of Howells. Related Reading: Shiba Inu Community Sounds Warning Alarm As Scammers Siege Shibarium The NCC is a single-tier unitary authority that oversees the administration of all areas in Newport, one of the principal areas in Wales. Howells has been in contact with the council over the years, requesting permission to undergo a landfill excavation in the area that supposedly harbors the flash drive.  Howells claims that he has raised sufficient funds to propel the excavation work and only needed the council to give the go-ahead. However, the NCC has been adamant about its rejection despite Howells’ funding claims.  The council has consistently declined Howells’ requests for a landfill excavation, with reasons of environmental concerns and prioritizing working officers&#8217; time who ensure the safety and well-being of Newport residents.  “In the current environment, we cannot justify wasting officers’ valuable time providing services to the residents of Newport,” a council spokesperson stated.  In response to the multiple rejections, Howells has stated that he would sue the council for damages worth $557 million. He has submitted a letter to the council, demanding a concession to perform a landfill excavation on Monday, September 18.  Following a failure to adhere to the ultimatum, Howells has requested a judicial review to evaluate the legitimacy of the council’s judgment to reject his Bitcoin recovery efforts. Bitcoin price struggles below $26,000 &#124; Source: BTCUSD on Tradingview.com NCC Can Keep 10% Of Recovered BTC In an attempt to influence the decision of the NCC regarding the landfill excavation work, Howells has promised to deliver 10% of the total Bitcoin funds recovered. He has stated that he will use the funds to transform Newport into a “crypto-mecha.”  The Welsh crypto investor also offered to provide 50 Euros to all Newport residents and facilitate the implementation of crypto terminals in local shops.  Related Reading: Crypto Analyst Presents Bull Case For XRP Price To Hit $130, Here’s When Howells has been vigorously trying to recover his 8,000 BTC since 2013. With Bitcoin’s price over 1,000 times the value it was in 2013, the Welsh investor is desperate to locate the flash drive containing his potential fortune.  He has expressed his frustration and determination with the NCC’s rejections, stating “I’ve tried everything possible for 10 years; they didn’t want to play ball, so now we have to take the legal route.” Featured image from Medium, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-11T16:00:41.000Z",
    "title": "Tron ($TRX) and Neo ($NEO) Gains Pale in Comparison: Domini.art’s ($DOMI) Meteoric Rise!",
    "url": "https://www.crypto-news-flash.com/tron-trx-and-neo-neo-gains-pale-in-comparison-domini-arts-domi-meteoric-rise/?utm_source=rss&utm_medium=rss&utm_campaign=tron-trx-and-neo-neo-gains-pale-in-comparison-domini-arts-domi-meteoric-rise",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-34-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-34-1.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-34-1-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-34-1-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-34-1-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-34-1-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Tron and Neo have long stood-out as top digital investments, offering early investors substantial gains. But the recent emergence of innovative DeFi (decentralized finance) cryptos has shifted the crypto investment paradigm, propelling the fast-rising project Domini.art ($DOMI) into the limelight. The rapid growth and adoption of Domini.art, especially compared to the gains of other well-known [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-11T16:00:27.000Z",
    "title": "Polygon and Bitcoin Spark: Why Building New Is Better Than Building Layer-2",
    "url": "https://www.crypto-news-flash.com/polygon-and-bitcoin-spark-why-building-new-is-better-than-building-layer-2/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-and-bitcoin-spark-why-building-new-is-better-than-building-layer-2",
    "description": "<img width=\"512\" height=\"266\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-32-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-32-1.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-32-1-300x156.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The debate between building new blockchains from scratch versus developing Layer-2 solutions has become increasingly relevant. However, Bitcoin Spark provides a compelling illustration of why constructing entirely new blockchains is better. What is Polygon (MATIC)? Polygon (MATIC) is a layer-2 solution that was designed to address the scalability issues faced by the Ethereum blockchain. It [...]"
  }
]