[
  {
    "source": "Cointelegraph",
    "date": "2023-09-07T08:24:25.000Z",
    "title": "CBN missed opportunity for blockchain regulation in 2021 - Convexity CEO",
    "url": "https://cointelegraph.com/news/blockchain-cbn-missed-opportunity-blockchain-regulation-in-2021-convexity-ceo",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/5aca3913-e40e-4741-833f-6ce3773aaf5f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Mr. Owonibi stated that a blockchain regulation strategy should have been created by the Central Bank of Nigeria (CBN) in 2021 instead of cutting ties between cryptocurrency exchange firms and local banks. </p>\n                    <p><p>A group of Nigerian professionals in digital assets took to the stage at the Stakeholders in Blockchain Technology Association of Nigeria (SIBAN)’s Digital Assets Summit 2023, held in Abuja, the nation’s capital, to discuss the future of digital assets in Nigeria in regards to regulation. </p><p>In the panel titled “The Future of Digital Assets: Regulatory Uncertainty and the Way Forward,” the group discussed why the implementation of digital assets regulation and blockchain policy has been slow in Nigeria.</p><p>The <a href=\"https://cointelegraph.com/news/nigerian-national-blockchain-policy-gets-government-approval\">developmental regulation created by NITDA</a> is a big step towards understanding and creating a favorable environment for the blockchain and crypto industry, according to Mr. Adedeji Owonibi, chief executive officer (CEO) of Convexity. Mr Owonibi stated that this step was what the <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/central-bank-of-nigeria\">Central Bank of Nigeria (CBN)</a> should have taken back in 2021 instead of <a href=\"https://cointelegraph.com/news/more-harm-than-good-nigerian-crypto-users-in-disbelief-over-cbn-ban\">cutting ties</a> between cryptocurrency exchange firms and local banks. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/52a013ef-ca38-4d8a-b043-da4c28e5a6c6.jpg\"  /><figcaption style=\"text-align: center;\"><em>The panel on the Future of Digital Assets at the SIBAN Digital Assets Summit</em></figcaption></figure><p>Acknowledging NITDA's strides in crafting a blockchain policy, Preye Itonyo, Deputy Director of the Digital Economy Development Department, highlighted the regulatory hurdle posed by the decentralized nature of blockchain, resulting in a lack of understanding of blockchain and cryptocurrency concepts in Nigeria. He pointed out that this lack of understanding fueled the 2021 crypto-traditional finance ban. </p><p>In a recent global survey, Africa’s largest economy, Nigeria, was found to be<a href=\"https://cointelegraph.com/news/99-of-nigerians-are-crypto-aware-consensys-report\"> the most cryptocurrency-aware population in the world</a> and 90% of the Nigerian respondents expressed interest in investing in cryptocurrencies in the next year. However, there is a need for regulation in the industry to foster security while encouraging scalability.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/99-of-nigerians-are-crypto-aware-consensys-report\"><strong><em>99% of Nigerians are crypto aware — ConsenSys report</em></strong></a></p><p>In response to this, Itonyo stated that the already established blockchain policy is the first step Nigeria has taken towards ensuring the safety and protection of crypto investors. He went ahead to reveal that a steering committee has been set up by NITDA to facilitate the implementation strategies of the national blockchain policy. According to Itonyo, the CBN and the Nigerian Communications Commission (NCC) are members of the committee.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-07T08:29:45.000Z",
    "title": "Ripple’s UBRI Program Incorporates Four New European Universities to Advance Blockchain Research",
    "url": "https://www.cryptoglobe.com/latest/2023/09/ripples-ubri-program-incorporates-four-new-european-universities-to-advance-blockchain-research/",
    "description": "Ripple is broadening its academic affiliations in Europe with the addition of four new institutions to its University Blockchain Research Initiative (UBRI). Now in its fifth year, the UBRI program has enlisted Trinity College Dublin (Ireland), EPITA (France), IE University (Spain), and the University of Trento (Italy) to augment blockchain and cryptocurrency research and education […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-07T08:13:33.000Z",
    "title": "US Companies Showcase High-Tech Innovations at 2023 CIFTIS",
    "url": "https://www.cryptopolitan.com/us-companies-tech-innovations-at-ciftis/",
    "description": "US companies have made a resounding presence at the 2023 China International Fair for Trade in Services (CIFTIS), unveiling cutting-edge technologies and expressing their unwavering commitment to the Chinese market. This year&#8217;s event featured key players like Tesla, Intel, and Qualcomm, highlighting the thriving US-China economic relationship and the exciting innovations in various sectors. Innovative ... <a title=\"US Companies Showcase High-Tech Innovations at 2023 CIFTIS\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-companies-tech-innovations-at-ciftis/\" aria-label=\"More on US Companies Showcase High-Tech Innovations at 2023 CIFTIS\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-07T08:13:33.000Z",
    "title": "Ethereum WASM enhanced with Stylus as Chainlink and SWIFT partner, Borroe.Finance surges 25%",
    "url": "https://crypto.news/ethereum-wasm-enhanced-with-stylus-as-chainlink-and-swift-partner-borroe-finance-surges-25/",
    "description": "Borroe.Finance is soaring as ROE adds 25% in ongoing presale. Meanwhile, Ethereum and Chainlink prices are in tight ranges"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-07T08:30:20.000Z",
    "title": "Pepe Coin Fall From Grace: What’s Turning The Whales Away?",
    "url": "https://www.newsbtc.com/news/pepe-coin-fall-from-grace-whats-turning-the-whales-away/",
    "description": "Popular meme coin PEPE has recently come under the spotlight due to significant whale activity that has left many investors concerned about its future. Large holders of PEPE tokens have been selling their holdings at a loss, leading to increased market uncertainty.  A recent report notes the meme coin&#8217;s price movements are strongly influenced by its presence in the social sector. However, over the last week, social activity surrounding PEPE has taken a notable downturn, with social engagements falling by 28% and social mentions decreasing by 18%. Related Reading: Ethereum Bears Gain Upper Hand With Escalating Sell-Off: Impact On ETH Price Whale Exodus: Massive PEPE Transfers Raise Eyebrows Lookonchain, a blockchain analysis platform, shed light on a puzzling development as it uncovered that three wallets, potentially controlled by the same individual, had transferred a staggering 1.5 trillion PEPE tokens to the popular cryptocurrency exchange, Binance.  An hour ago, 3 wallets (probably the same person) deposited 1.5T $PEPE ($1.2M) into #Binance at a loss of $242K. These 3 wallets withdrew 1.5T $PEPE($1.45M at the time) from #OKX after the Pepe team dumped 16T $PEPE on August 24. pic.twitter.com/StKCuGMGFZ — Lookonchain (@lookonchain) September 6, 2023 At current exchange rates, these tokens are valued at approximately $1.2 million. What raises eyebrows is the fact that these wallets sold their tokens at a price lower than when they initially acquired them, resulting in a collective loss of $242,000. This mass transfer followed an unexpected 16 trillion PEPE transaction on August 24, where the tokens were worth a staggering $1.45 million. Official Response: ‘Ex-Team Members’ Accused Of Theft According to a separate report, the team behind PEPE issued a statement alleging that &#8220;three ex-team members&#8221; had accessed the project&#8217;s multisig wallet without the consent of others and absconded with a substantial 16 trillion PEPE tokens. This revelation sent shockwaves through the community and further fueled the uncertainty surrounding the meme coin. As of today, the market cap of cryptocurrencies was barely unchanged at $1.02 trillion. Chart: TradingView.com While the recent decline in social activity and the questionable whale transactions have cast a shadow over PEPE&#8217;s future, an intriguing aspect emerges from the data. Despite the reduced social engagement, the weighted sentiment around the memecoin has continued to grow.  This suggests that, at the time of writing, there are more positive comments and sentiments surrounding PEPE than negative ones, potentially indicating resilience within the community. Related Reading: Pepe Coin September Challenge: Can It Reach $0.000001 Again? As of the most recent data available, PEPE is trading at $0.000000801962 according to CoinGecko, with a modest 0.5% gain in the last 24 hours. However, over the past seven days, it has experienced a 6.5% decline in value.  Investors and enthusiasts are now closely monitoring the situation, hoping for clarity and stability to return to the PEPE ecosystem. The meme coin&#8217;s future hangs in uncertainty, as the crypto community watches for further developments and the resolution of the alleged theft involving the 16 trillion PEPE tokens. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Box Mining"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-07T08:29:16.000Z",
    "title": "Ethereum ETF on the Horizon: ARK Invest and 21Shares Forge Crypto Future",
    "url": "https://www.crypto-news-flash.com/ethereum-etf-on-the-horizon-ark-invest-and-21shares-forge-crypto-future/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-etf-on-the-horizon-ark-invest-and-21shares-forge-crypto-future",
    "description": "<img width=\"1920\" height=\"1080\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/ethereum-g3da2e1262_1920-48x27.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />ARK Invest and 21Shares are setting the standard after filing for the second spot ether ETF in the U.S. Ethereum could outperform Bitcoin and possibly flip it if its spot ETF is approved ahead of the Bitcoin ETF. ARK Invest aims to be the first firm to launch a spot Ether spot ETF. As predicted [...]"
  }
]