[
  {
    "source": "Cointelegraph",
    "date": "2024-03-22T04:19:20.000Z",
    "title": " 3 theories why the SEC may be eyeing down Ethereum: Crypto lawyer ",
    "url": "https://cointelegraph.com/news/why-sec-could-be-investigating-ethereum-security",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZDkzNjg4M2EtNjUwYS00NmFkLTkwZDktYWU5NGU0NjQ1ZDZmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The regulator does not want to undermine its arguments in ongoing legal action against Coinbase and Binance. </p>\n                    <p><p>The reported probe into Ethereum and its foundation could be a way for the securities regulator to comfortably deny spot Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) ETFs and satisfy senator blowback without undermining its ongoing lawsuits, according to a crypto lawyer.</p><p>On March 22, general partner of Van Buren Capital and finance lawyer Scott Johnsson offered his opinion on why the SEC may have reportedly launched its probe into Ethereum and <a href=\"https://cointelegraph.com/news/sec-ether-security-classification\">the Ethereum Foundation</a>. </p><p>One of the theories, according to Johnsson, is that the SEC could be using the probe to placate crypto skeptics who have <a href=\"https://cointelegraph.com/news/senators-urge-sec-gary-gensler-reject-further-crypto-etfs\">demanded a tougher stance</a> from the agency.</p><p><a href=\"https://cointelegraph.com/news/why-sec-could-be-investigating-ethereum-security\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-22T04:15:51.000Z",
    "title": "Ethereum Price Signals Uptrend Continuation But Can Bulls Clear This?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-signals-uptrend-3580/",
    "description": "Ethereum price is attempting a recovery wave above the $3,500 zone. ETH must clear the $3,580 resistance to continue higher in the near term. Ethereum started a decent recovery wave above the $3,350 zone. The price is trading above $3,450 and the 100-hourly Simple Moving Average. There was a break above a short-term bullish flag pattern with resistance at $3,480 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to rise if it settles above the $3,580 resistance zone. Ethereum Price Holds Support Ethereum price started a decent upward move above the $3,250 and $3,350 resistance levels, like Bitcoin. ETH even surpassed the $3,500 resistance to move into a positive zone. A high was formed at $3,587 and there was a minor pullback. The price declined below the $3,500 level and spiked below the 23.6% Fib retracement level of the recovery wave from the $3,059 swing low to the $3,587 high. However, the bulls are active near $3,400. Recently, there was a break above a short-term bullish flag pattern with resistance at $3,480 on the hourly chart of ETH/USD. Ethereum price is now trading above $3,500 and the 100-hourly Simple Moving Average. Source: ETHUSD on TradingView.com On the upside, immediate resistance is near the $3,550 level. The first major resistance is near the $3,580 level. The next key resistance sits at $3,670, above which the price might gain bullish momentum. In the stated case, Ether could rally toward the $3,800 level. If there is a move above the $3,800 resistance, Ethereum could even climb toward the $4,000 resistance. Any more gains might call for a test of $4,080. Another Decline In ETH? If Ethereum fails to clear the $3,580 resistance, it could start another decline. Initial support on the downside is near the $3,410 level. The first major support is near the $3,320 zone or the 50% Fib retracement level of the recovery wave from the $3,059 swing low to the $3,587 high. The next key support could be the $3,200 zone. A clear move below the $3,200 support might send the price toward $3,060. Any more losses might send the price toward the $3,000 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $3,400 Major Resistance Level – $3,580"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-22T04:38:18.000Z",
    "title": "JasmyCoin (JASMY) Price Prediction 2024-2030: Will JASMY Hit $0.05 Soon?",
    "url": "https://coinedition.com/jasmycoin-jasmy-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/JasmyCoin-JASMY-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/JasmyCoin-JASMY-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/JasmyCoin-JASMY-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/JasmyCoin-JASMY-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/JasmyCoin-JASMY-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/JasmyCoin-JASMY-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Apart from Bitcoin (BTC) and Ethereum (ETH), there are other digital currencies worth considering for people looking to diversify their portfolios and gain experience with new cryptocurrencies. JasmyCoin (JASMY) is one of them. Jasmy’s blockchain platform is intended to restore and safeguard individual data sovereignty. It combines traditional IoT and blockchain technology, allowing people to [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/jasmycoin-jasmy-price-prediction/\">JasmyCoin (JASMY) Price Prediction 2024-2030: Will JASMY Hit $0.05 Soon?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]