[
  {
    "source": "CoinDesk",
    "date": "2023-06-23T10:17:28.000Z",
    "title": "Crypto Ban May Not Be Best Approach to Balance Risk, Demand: IMF",
    "url": "https://www.coindesk.com/policy/2023/06/23/crypto-ban-may-not-be-best-approach-to-balance-risk-demand-imf/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The IMF recommended that countries focus on addressing the drivers of crypto demand and unmet digital payment needs in a post."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-23T10:11:08.000Z",
    "title": "Crypto.com Approved to Operate in Spain",
    "url": "https://www.coindesk.com/policy/2023/06/23/cryptocom-approved-to-operate-in-spain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The crypto exchange said it has registered as a virtual asset service provider with the country's central bank following a \"comprehensive\" compliance review."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-23T10:28:20.000Z",
    "title": "German Intelligence Agency’s Dogs of BND Collection Mints Out",
    "url": "https://decrypt.co/145893/german-intelligence-agencys-dogs-of-bnd-collection-mints-out",
    "description": "The NFT collection was launched as part of a drive to recruit crypto and blockchain experts to Germany’s BND."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-23T10:20:42.000Z",
    "title": "Binance faces scrutiny in Brazil, exec summoned to testify before Congress",
    "url": "https://cointelegraph.com/news/binance-scrutiny-in-brazil-as-government-demands-executive-testimony",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/a051ad6e-788a-4438-b061-86f197ad2de7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This development comes amid a global regulatory crackdown on Binance, which is facing investigations in multiple countries.</p>\n                    <p><p>Deputy Alfredo Gaspar, a member of the Brazilian Chamber of Deputies, has requested the summoning of Guilherme Haddad, the director of Binance Brazil, to appear before the Brazilian parliament as part of an ongoing Parliamentary Commission of Inquiry (CPI) investigation into alleged pyramid schemes in the country.</p><p>The June 21 <a href=\"https://www.camara.leg.br/proposicoesWeb/prop_mostrarintegra?codteor=2291668&amp;filename=Tramitacao-REQ%2015/2023%20CPIPIRAM\" target=\"_blank\" rel=\"noopener nofollow\">request</a> will be voted on by members of the CPI on June 27. </p><p> <a href=\"https://portaldobitcoin.uol.com.br/deputado-pede-convocacao-de-diretor-da-binance-no-brasil-para-depor-na-cpi-das-piramides-financeiras/\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to a translation of the Brazilian news outlet Portal do Bitcoin, if the vote is approved, Haddad will be summoned to appear before the Brazilian Chamber of Deputies if the vote is approved. This development comes amid a global regulatory crackdown on the largest cryptocurrency exchange. Binance has faced <a href=\"https://cointelegraph.com/news/binance-france-investigation-report\">scrutiny from authorities</a> in the United States, France, the Netherlands, the United Kingdom and Brazil, underscoring international attention on the company.</p><p>Furthermore, the deputy claimed that Binance was utilized by pyramid schemes in the country to facilitate asset transfers. </p><p>He said: </p><blockquote>“Hence, it is vital to understand Binance’s operations, its association with B Fintech, and its involvement with companies facing legal action for harming Brazilian consumers, as this strongly links Binance to the ongoing investigation.“</blockquote><p>In a statement sent to Cointelegraph, a Binance spokesperson said that the company’s top priority is ensuring the protection of users in Brazil and worldwide. They emphasized its collaboration with local authorities in an ongoing effort to combat cyber and financial crimes. This includes proactive measures like tracking suspicious accounts and identifying fraudulent activities.</p><p>According to the statement, Binance is compliant with the Brazilian regulatory framework:</p><blockquote>“We are eager to continue to work collaboratively to earn the trust of the Brazilian government and regulators around the world to develop the blockchain industry on behalf of users and society as a whole.”</blockquote><p>Authorities in the South American nation explained that the intent for summons is due to the fact the company is facing the scrutiny mentioned above from regulators worldwide. In Brazil, Binance <a href=\"https://cointelegraph.com/news/brazilian-authorities-investigate-binance-for-guiding-clients-past-stop-order-report\">is also being investigated</a> by the Federal Prosecutor’s Office and Federal Police. The cryptocurrency exchange has allegedly been helping clients evade a stop order on cryptocurrency derivatives investments.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-cz-allege-sec-made-misleading-statements-assets\"><strong><em>Binance, Binance.US and CZ allege SEC made ‘misleading’ statements on exchange assets</em></strong></a></p><p>The Securities and Exchange Commission of Brazil has already been pressing Binance to stop offering Bitcoin futures products to Brazilian customers, <a href=\"https://portaldobitcoin.uol.com.br/cvm-considerou-medidas-da-binance-insuficientes-em-caso-de-stop-order-de-futuros-mostra-documento/\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to a previous report from Portal do Bitcoin.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/us-and-china-try-to-crush-binance-sbfs-40m-bribe-claim-asia-express/\"><strong><em>US and China try to crush Binance</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-23T10:27:03.000Z",
    "title": "TrueUSD maintains it has no exposure to Prime Trust despite community claims",
    "url": "https://cryptoslate.com/trueusd-maintains-it-has-no-exposure-to-prime-trust-despite-community-claims/",
    "description": "<p>TrueUSD (TUSD) stated in a June 22 Twitter post that it is not affected by the issues faced by crypto custodial firm Prime Trust. Prime Trust was forced to suspend all deposits of fiat and digital assets by Nevada financial regulators on June 21 because it failed to safeguard assets under its custody and could [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/trueusd-maintains-it-has-no-exposure-to-prime-trust-despite-community-claims/\">TrueUSD maintains it has no exposure to Prime Trust despite community claims</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-23T10:09:47.000Z",
    "title": "Will the crypto rally continue?",
    "url": "https://cryptodaily.co.uk/2023/06/will-the-crypto-rally-continue",
    "description": "<p>Was bitcoin&rsquo;s latest surge just a last fling before sinking lower, or does it have the legs to continue on upwards?</p>\nJust a narrative pump?\n<p>Some analysts and commentators would have us believe that there just isn&rsquo;t the market order flow for any sustained moves, and it must be said that volume is quite low, having been so since late March.</p>\n<p>A short term relief rally to the upside?</p>\n<p>Is everyone just FOMOing in because of all the new ETF filings which began with Blackrock&rsquo;s Spot Bitcoin ETF application of just a week ago and then the subsequent Fidelity, Wisdom Tree, Invesco, and Valkyrie filings, and then the Wall Street-backed EDX Markets?</p>\n<p>This is likely the case. Bitcoin and crypto haven&rsquo;t had much to shout about for quite a while so the perceived positive news here does look to be responsible for the price action, and perhaps it&rsquo;s just a matter of time before the ETF narrative starts to die down.</p>\n<p>Also, could it be that the traditional institutions are coordinating with the SEC with a view to taking down the crypto businesses before providing their own solutions taken from the crypto innovations?</p>\nBullish in the short term\n<p>Be this as it may, at least in the short term, bitcoin is still looking strong. After briefly touching $30,800 bitcoin looks as though it is forming a bull flag, although another touch of the flag bottom is probably needed. The 4-hour Stochastic RSI has reset to the bottom and we should see a cross up soon.&nbsp;</p>\n<p>Ethereum is behaving in a similar way, and looks to be breaking out of its own bull flag already. In relation to BTC, ETH has been rather a laggard though, and has been steadily forming lower highs and lows from all the way back to September of 2022.</p>\n<p>A bottom could now have been found given that ETH is currently sitting at the 0.618 Fibonacci level against its BTC pair. Also, with the ongoing ETH staking narrative helping to drastically reduce the market supply, perhaps this is the time for Ethereum to start to shine.</p>\nMany altcoins will die\n<p>As for the rest of the crypto market it does rather look as though the altcoins as a whole are not going to do their usual thing and rise en masse. Instead, a small group of alts, with strong use cases and narratives might be the only ones to make the big moves.</p>\n<p>Things are changing in crypto, and previous cycles where just about anything might rocket skywards on a given day is likely not to happen any more. In the coming times the wheat is going to be sorted from the chaff.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T10:27:02.000Z",
    "title": "SEC delays BlockFi’s $30 million penalty, focusing on investor reimbursement",
    "url": "https://www.cryptopolitan.com/sec-delays-blockfis-30-million-penalty-focusing-on-investor-reimbursement/",
    "description": "In a significant development, the U.S. Securities and Exchange Commission (SEC) has agreed to postpone the enforcement of a $30 million penalty against BlockFi, the defunct cryptocurrency lender. This decision comes because the SEC aims to ensure investors receive their rightful refunds before collecting penalties. BlockFi, which failed to register with the SEC before launching ... <a title=\"SEC delays BlockFi&#8217;s $30 million penalty, focusing on investor reimbursement\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-delays-blockfis-30-million-penalty-focusing-on-investor-reimbursement/\" aria-label=\"More on SEC delays BlockFi&#8217;s $30 million penalty, focusing on investor reimbursement\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T10:23:20.000Z",
    "title": "Generative AI Models Encode Biases and Fabricate Nonsensical Information, Research Reveals",
    "url": "https://www.cryptopolitan.com/generative-ai-models-encoding-biases/",
    "description": "In recent months, generative AI models such as ChatGPT, Google&#8217;s Bard, and Midjourney have gained increasing popularity among individuals for both personal and professional purposes. However, research is uncovering a troubling trend: these models are embedding biases and negative stereotypes in their users while also generating and spreading nonsensical but seemingly accurate information.&#160; The consequences ... <a title=\"Generative AI Models Encode Biases and Fabricate Nonsensical Information, Research Reveals\" class=\"read-more\" href=\"https://www.cryptopolitan.com/generative-ai-models-encoding-biases/\" aria-label=\"More on Generative AI Models Encode Biases and Fabricate Nonsensical Information, Research Reveals\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T10:31:38.000Z",
    "title": "Bitcoin Bulls Flock to BRICS: Nearly 20 Countries Begging for Membership in the Growing Economic Coalition",
    "url": "https://www.crypto-news-flash.com/bitcoin-bulls-flock-to-brics-nearly-20-countries-begging-for-membership-in-the-growing-economic-coalition/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-bulls-flock-to-brics-nearly-20-countries-begging-for-membership-in-the-growing-economic-coalition",
    "description": "Over 20 nations eagerly seek to become part of the BRICS. The Islamic Republic has emphasized that its objectives align with the BRICS countries&#8217; objectives. As the BRICS Summit approaches in August, the primary focus for the bloc appears to be expansion. The bloc&#8217;s expansion has been an ongoing narrative, but the roster of interested [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-23T10:30:15.000Z",
    "title": "OSMO Leads the Way in Terms of Monthly Developer Activity",
    "url": "https://coinedition.com/osmo-leads-the-way-in-terms-of-monthly-developer-activity/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Top-DeFi-Projects-by-Developer-Activity.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Top-DeFi-Projects-by-Developer-Activity.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Top-DeFi-Projects-by-Developer-Activity-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Top-DeFi-Projects-by-Developer-Activity-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Top-DeFi-Projects-by-Developer-Activity-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Top-DeFi-Projects-by-Developer-Activity-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Top-DeFi-Projects-by-Developer-Activity-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Top-DeFi-Projects-by-Developer-Activity-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Top-DeFi-Projects-by-Developer-Activity-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Top-DeFi-Projects-by-Developer-Activity-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Top-DeFi-Projects-by-Developer-Activity-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Top-DeFi-Projects-by-Developer-Activity-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Top-DeFi-Projects-by-Developer-Activity-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Top-DeFi-Projects-by-Developer-Activity-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Top-DeFi-Projects-by-Developer-Activity-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Top-DeFi-Projects-by-Developer-Activity-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Top-DeFi-Projects-by-Developer-Activity-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A crypto analytics platform CryptoDep shared the top Decentralized Finance (DeFi) projects by developer activity in a tweet yesterday. According to the post, Osmosis (OSMO) posted the most development activity in the past 30 days, while Uniswap (UNI) and Kyber Network (KNC) occupied the second and third positions on the list respectively. DeFiChain (DFI) and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/osmo-leads-the-way-in-terms-of-monthly-developer-activity/\">OSMO Leads the Way in Terms of Monthly Developer Activity</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]