[
  {
    "source": "CoinDesk",
    "date": "2023-06-14T06:25:08.000Z",
    "title": "Binance CEO Hits Back at Rumors of Exchange Selling Bitcoin For BNB Coin",
    "url": "https://www.coindesk.com/markets/2023/06/14/binance-ceo-hits-back-at-rumors-of-exchange-selling-bitcoin-for-bnb-coin/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto traders on Twitter are citing data that suggests bitcoin has been traded to keep BNB afloat."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-14T06:17:32.000Z",
    "title": "Prime Trust Unit Banq Files for Bankruptcy",
    "url": "https://www.coindesk.com/business/2023/06/14/prime-trust-unit-banq-files-for-bankruptcy/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bankruptcy filing comes as TrueUSD stops redemptions and Haru Invest ceases operations citing problems with an unnamed partner."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-14T06:30:50.000Z",
    "title": "VC Company A16z Expands to London to Take Advantage of Friendly Web3 Regulation",
    "url": "https://news.bitcoin.com/vc-company-a16z-expands-to-london-to-take-advantage-of-friendly-web3-regulation/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1405243415-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"VC Company A16z Expands to London to Take Advantage of Friendly Web3 Regulation\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1405243415-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1405243415-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1405243415-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1405243415-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1405243415-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1405243415-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1405243415.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A16z, a tech-focused venture capital company, has announced that it will open its first office in London to take advantage of the friendly regulatory environment in the U.K. Prime Minister Rishi Sunak stated he was thrilled about this expansion and that the U.K. would continue to embrace innovations like Web3, powered by blockchain tech. A16z [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-14T06:30:43.000Z",
    "title": "The Role Of Proper Regulation In Cryptocurrency Adoption",
    "url": "https://nulltx.com/the-role-of-proper-regulation-in-cryptocurrency-adoption/",
    "description": "Cryptocurrency has emerged as a disruptive force in the world of finance, offering numerous advantages such as decentralization, transparency, and faster transactions. However, its rapid growth and decentralized nature have also given rise to concerns regarding security, fraud, and money laundering. In order to ensure the widespread adoption of cryptocurrencies and harness their full potential, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-14T06:24:31.000Z",
    "title": "XRP Smothered In Red Despite Massive Whale Accumulation, Hinman Docs Release",
    "url": "https://www.newsbtc.com/news/xrp-in-red-despite-hinman-docs-release/",
    "description": "XRP, the cryptocurrency at the center of the continuing legal battle between payment company Ripple and the US Securities and Exchange Commission, faces a crucial turning point with the unsealing of the highly-anticipated Hinman documents on Tuesday. This development carries significant implications for the future of the cryptocurrency market. During an address in 2018, former head of the SEC&#8217;s finance division William Hinman essentially declared that Ether (ETH) was not a security since it had become &#8220;sufficiently decentralized.&#8221; The documents in question pertain to this speech. Related Reading: Solana Price Plunges Below March Low – Could It Drop Further? On Tuesday morning, as soon as media outlets had obtained copies of the Hinman speech materials, the price of XRP, Ripple&#8217;s native cryptocurrency, soared to $0.56, a 2023 high. XRP Soaked In Crimson Amid Hinman Papers Disclosure Now, red was the dominant color for XRP at the time this article was written. CoinMarketCap data shows that XRP has traded at $0.51, down 2.31% in the previous 24 hours. Among the hubbub around the release of the Hinman documents, the token also suffered a hit in the weekly timeframe, falling by 2.18%. Source: CoinMarketCap According to early reports, the freshly disclosed Hinman records have far-reaching consequences, suggesting a positive outcome for Ripple (XRP) in their lengthy legal struggle against the US regulator. As stated by Hinman in his talk: “Based on my understanding of the present state of Ether, the Ethereum network and its decentralized structure, current offers and sales of Ether are not securities transactions.” Many news organizations have recently expressed optimism that the information contained inside the Hinman documents could be decisive in Ripple&#8217;s ongoing legal showdown with the SEC. However, at the moment, such optimism doesn&#8217;t mean much in terms of XRP&#8217;s price movements, as seen in the graph below: XRP price trajectory retreating in the red zone in the last 24 hours. Source: CoinMarketCap Whales Scoop Up More Of The Crypto As new details unfurl, on-chain data reveals that crypto whales had spent an additional $170 million in XRP in the days leading up to the release of the Hinman speech papers. Below is a chart from Santiment showing the 310 million new XRP that crypto whales with 1–100 million in their holdings bought between June 10–13. XRP price climbing as per whales' wallet balances. Source: Santiment If the fresh investment made by whale investors is valued at the market price of $0.51, then their total accumulation is worth around $158 million. As XRP finds itself painted in crimson, the anticipation of a favorable rally in price in the midst of the drama portrayed in the SEC versus Ripple legal tussle grows. When whales spend so much on a particular cryptocurrency, and in this case XRP, it usually means they expect the price to rise, and this indicates confidence in the broader crypto market. But, the question is &#8211; will this huge appetite by whales enough to pump new vigor into the crypto? XRP market cap currently at $26 billion. Chart: TradingView.com A Climb To $0.60, Or A Drop Below $0.51? Meanwhile, the recent market integration of XRP&#8217;s latest developments raises questions about the influence of major XRP holders, and their potential efforts to drive the price up to $0.60. These influential entities possess substantial amounts of XRP and may utilize their holdings to exert upward pressure on the cryptocurrency&#8217;s value. Related Reading: XRP Could Be Set For A Breakout As Investment Inflows Continue However, there is also a possibility that XRP may experience a decline, falling below its important support level of $0.51. Factors such as market sentiment, regulatory changes, and broader economic conditions could contribute to a potential decrease in XRP&#8217;s value. Ultimately, the interplay of various market forces and the sentiment among XRP holders will determine whether the cryptocurrency will rally towards $0.60 or retreat below the critical threshold of $0.51. Featured image from Core EM"
  }
]