[
  {
    "source": "NewsBTC",
    "date": "2023-11-04T00:00:16.000Z",
    "title": "Is Fantom (FTM) About To Explode Like Solana (SOL)? This Analyst Thinks So",
    "url": "https://www.newsbtc.com/fantom/fantom-explode-like-solana-analyst-bullish/",
    "description": "FTM, the native currency of the Fantom ecosystem, might be the next coin to follow and perhaps outperform Solana (SOL). This optimistic preview is by one technical analyst, &#8220;Magnate,&#8221; who, in an X post on October 3, said traders who missed the SOL rally may have a chance with FTM.  Solana Is Exploding: Reverses Post-FTX Losses At press time, SOL is trading at new 2023 highs and has reversed all post-FTX losses. Changing hands at $39 as of writing on November 3, the SOL uptrend remains, looking at the candlestick arrangement in the daily chart. Specifically, SOL is up 125% from September lows and 190% from June 2023 highs.  At this pace, SOL has outpaced Bitcoin (BTC) and Ethereum (ETH), two of the world&#8217;s largest cryptocurrencies. This is despite Bitcoin, buoyed by the broader crypto&#8217;s optimism of the United States Securities and Exchange Commission (SEC) approving the first spot Bitcoin exchange-traded fund (ETF) in the coming weeks. The general confidence is despite the SEC laying out a potential timeframe for when this product will go live. Related Reading: Ripple Achieves Regulatory Approval To Offer XRP Services Looking at the SOL daily chart, primary support is around the November 2022 high at around $36&#8211;a key reaction line traders are closely monitoring. As it is, there has been a cool-off, but traders are confident of a pullback, pushing the coin back higher in a bullish breakout formation.  Is Fantom (FTM) Preparing For A 100% Surge? Magnate, sharing the daily and weekly charts of FTM, noted that the coin appears to be bouncing off a critical support zone. In the weekly chart, the uptrend is defined. FTM is picking momentum, edging higher as confidence, partly due to fundamental events and the recovery across the board, is changing sentiment, propping bulls.  Related Reading: This Chainlink Metric Just Hit Meteoric Levels – Good News For LINK Price? From the daily chart, FTM found support at 2022 lows before edging higher to spot rates. This leg up has catalyzed demand, lifting the coin 35% from October lows. Still, FTM is down approximately 65% from February 2023 highs. Even so, only time will tell if FTM will track SOL, lifting off by over 100%, as the technical analyst predicts. Although there have been some challenges, there are also some positive developments taking place. One such development is that Messari, an analytics platform, recently observed a surge in Fantom&#8217;s on-chain activity.  According to their findings, the average number of new addresses added to the network daily increased by 106% in the last quarter. In comparison, the average number of active addresses per day rose by 3% in the same period. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-04T00:04:56.000Z",
    "title": "$40,000,000,000 in Unrealized Losses Hits JPMorgan Chase As Bank of America, Wells Fargo and Citigroup Face Exposure to US Treasuries: Report",
    "url": "https://dailyhodl.com/2023/11/03/40000000000-in-unrealized-losses-hits-jpmorgan-chase-as-bank-of-america-wells-fargo-and-citigroup-face-exposure-to-us-treasuries-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/dollar-hundred-bank.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/dollar-hundred-bank.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/dollar-hundred-bank.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/dollar-hundred-bank.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/dollar-hundred-bank.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/dollar-hundred-bank.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/dollar-hundred-bank.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>JPMorgan Chase has quietly revealed tens of billions of dollars in losses on securities, according to a new report on the company&#8217;s overall balance sheet. The banking giant is now stuck with roughly $40 billion in unrealized bond losses as of Q3 of this year, which is a 20% rise over the previous quarter, reports [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/03/40000000000-in-unrealized-losses-hits-jpmorgan-chase-as-bank-of-america-wells-fargo-and-citigroup-face-exposure-to-us-treasuries-report/\">$40,000,000,000 in Unrealized Losses Hits JPMorgan Chase As Bank of America, Wells Fargo and Citigroup Face Exposure to US Treasuries: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]