[
  {
    "source": "Decrypt",
    "date": "2023-07-19T20:58:07.000Z",
    "title": "Apple Is Quietly Creating an AI Chatbot to Compete With ChatGPT: Report",
    "url": "https://decrypt.co/149251/apple-is-quietly-creating-an-ai-chatbot-to-compete-with-chatgpt-report",
    "description": "Unlike ChatGPT, Apple’s tool isn’t meant for public consumption, and the company has no plans to release it to consumers."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-19T20:45:53.000Z",
    "title": "Terraform Labs appoints Chris Amani as CEO to replace Do Kwon",
    "url": "https://cryptoslate.com/terraform-labs-replaces-do-kwon-with-new-ceo-to-lead-recovery-attempt/",
    "description": "<p>Terra and Luna creator Terraform Labs has appointed a new CEO in an effort to make a recovery, the Wall Street Journal reported on July 20. Chris Amani, who has been with Terraform Labs since 2021, initially serving as COO and later CFO, has now been appointed as the company&#8217;s CEO. He succeeds the firm&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/terraform-labs-replaces-do-kwon-with-new-ceo-to-lead-recovery-attempt/\">Terraform Labs appoints Chris Amani as CEO to replace Do Kwon</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-19T21:00:00.000Z",
    "title": "Spectrum Finance To Integrate With Cardano $SPF $ADA",
    "url": "https://cryptodaily.co.uk/2023/07/spectrum-finance-to-integrate-with-cardano-spf-ada",
    "description": "<p class=\"md-end-block md-p\">Spectrum Finance, a distinguished name in the decentralized exchange (DEX) landscape, renowned for fostering trustless, cross-chain programmable messaging, has revealed its strategic collaboration with Cardano, the innovative smart contract platform.</p>\n<p class=\"md-end-block md-p\">The partnership is intended to extend Spectrum's capabilities into the Cardano ecosystem, enabling new opportunities for seamless blockchain interoperability.</p>\nAmplified Capacities\n<p class=\"md-end-block md-p\">Spectrum Finance has garnered recognition in the crypto industry by offering various functionalities tailored to user-specific needs, providing access to the Spectrum Network, a cross-chain smart contract platform for facilitating the creation of dApps that operate natively in a cross-chain environment.</p>\n<p class=\"md-end-block md-p\">Its standout feature is its ability to interact seamlessly with native currencies and tokens across different blockchains simultaneously. This negates the need for wrapped or synthetic assets when conducting transactions between blockchains, allowing actions such as swapping native ETH from the Ethereum mainnet to native ADA on the Cardano mainnet with ease.</p>\n<p class=\"md-end-block md-p\">For Cardano, a platform built on peer-reviewed research and high-assurance development, the partnership with Spectrum Finance signals a significant enhancement. It will enable Cardano to offer its users a broader range of cross-chain functionality, capitalizing on Spectrum's interoperability capabilities. The integration with Spectrum sets the stage for the creation of innovative dApps leveraging the combined potential of Cardano's sophisticated smart contract capabilities and Spectrum's cross-chain abilities. This synergy is expected to yield dApps with unprecedented reach and functionality, harnessing the best features from both platforms.</p>\nChallenges For Interoperability\n<p class=\"md-end-block md-p\">Blockchain interoperability has been a central challenge inhibiting wider adoption of the technology. It ensures seamless transactions across various blockchain networks without the need for intermediaries, reducing the fragmentation of the crypto ecosystem.</p>\n<p class=\"md-end-block md-p\">However, interoperability protocol implementation is complex, as different blockchains have distinct security solutions, consensus algorithms, and programming languages.</p>\n<p class=\"md-end-block md-p\">Solutions such as the Spectrum Protocol, which offers a truly decentralized, secure, and scalable cross-chain interoperability solution, are vital to overcoming this hurdle. The integration of Spectrum and Cardano represents a critical step towards both transforming and effectively pushing forward blockchain interoperability, with the promise and potential of unlocking new possibilities for the crypto industry, bringing users closer to an interconnected and seamless blockchain ecosystem.</p>\n<p class=\"md-end-block md-p\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T21:07:44.000Z",
    "title": "Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better ... <a title=\"Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fantom-price-prediction/\" aria-label=\"More on Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T21:07:14.000Z",
    "title": "U.S. lawmakers send a letter to Gary Gensler about crypto",
    "url": "https://www.cryptopolitan.com/us-lawmakers-send-a-letter-to-gary-gensler/",
    "description": "In an effort to smooth out the path for cryptocurrency regulation, U.S. Rep. French Hill, Vice-Chairman of the House Committee on Financial Services Republicans and Subcommittee Chairman, has penned a letter to Gary Gensler, the Chairman of the Securities and Exchange Commission (SEC). This is in line with the rising trend of lawmakers keen on ... <a title=\"U.S. lawmakers send a letter to Gary Gensler about crypto\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-lawmakers-send-a-letter-to-gary-gensler/\" aria-label=\"More on U.S. lawmakers send a letter to Gary Gensler about crypto\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-19T21:00:54.000Z",
    "title": "Litecoin (LTC), Monero (XMR) and DigiToads (TOADS) Show Bullish Signs as Bitcoin (BTC) Consolidates below $30K",
    "url": "https://nulltx.com/litecoin-ltc-monero-xmr-and-digitoads-toads-show-bullish-signs-as-bitcoin-btc-consolidates-below-30k/",
    "description": "A recent analysis of crypto market leader Bitcoin suggests that prices are currently consolidating just below and around $30K. While the good news is that this is better than continuing to suggest losses, it still isn&#8217;t exactly what investors have been hoping for: they want gains. And for many newcomers to crypto, Bitcoin is often [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-19T21:00:06.000Z",
    "title": "Litecoin (LTC) Poised for 13% Rally Upon Breaking Key Resistance Level, InQubeta (QUBE) on track to raise $10 million",
    "url": "https://nulltx.com/litecoin-ltc-poised-for-13-rally-upon-breaking-key-resistance-level-inqubeta-qube-on-track-to-raise-10-million/",
    "description": "The crypto market is abuzz with anticipation as Litecoin (LTC) shows signs of a potential rally, with a 13% surge expected upon breaking a key resistance level. Meanwhile, InQubeta (QUBE), an innovative AI crypto project, is making remarkable progress in its presale, with the project on track to raise an impressive $10 million. In this [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-19T21:00:16.000Z",
    "title": "Dogecoin Barks Upwards: Elon Musk’s Twitter Feed Sends DOGE Up 3%",
    "url": "https://www.newsbtc.com/dogecoin-2/dogecoin-barks-upwards-elon-musks-twitter-feed-sends-doge-up-3/",
    "description": "Popular cryptocurrency Dogecoin (DOGE) experienced another price surge following a tweet from Tesla CEO Elon Musk. The dog-themed cryptocurrency saw a 4% jump just a few minutes after Musk&#8217;s post. Musk has previously supported DOGE on multiple occasions via his Twitter account, often posting memes and comments about the cryptocurrency. His tweets have been known to cause significant price movements in the market, with DOGE often surging by double-digit percentages following his endorsements. Musk&#8217;s Tweet Causes Another Dogecoin Surge, But Will It Be Short-Lived? Despite experiencing a surge in price following Elon Musk&#8217;s tweet, DOGE&#8217;s value remains considerably lower than its July high of $0.07518. At its peak, the cryptocurrency rose from $0.069 to $0.072 but soon lost some of its gains.  Related Reading: Bitcoin Has Broken This Open Interest Pattern, Quant Explains Currently, DOGE is trading around the $0.070 mark, at $0.0687 at the time of writing. Nonetheless, DOGE is still up by 3% in the 24-hour timeframe. It&#8217;s important to note that DOGE&#8217;s recent price movements have been encouraging. Despite being range-bound for the past two weeks, DOGE&#8217;s price has managed to maintain above its 200-day Moving Average (MA), which is a positive sign for the potential continuation of bullish momentum. In addition, DOGE&#8217;s average directional movement index (ADX) indicator is pointing towards another attempt to breach and regain its July high. The ADX is currently peaking to the upside, which indicates that the altcoin is gaining strength. Furthermore, DOGE&#8217;s Squeeze Momentum Indicator suggests that the cryptocurrency is entering another potential uptrend phase, which its ADX also supports. All these factors combined could help DOGE regain the $0.01 mark it reached in April. Nevertheless, despite its recent surge in price, DOGE may face challenges in maintaining its uptrend due to low trading volume. In addition, the cryptocurrency is expected to encounter significant resistance in the near term. If DOGE can sustain its uptrend, it will likely face challenges from the 50-day Moving Average (MA) currently at $0.07481. Furthermore, DOGE must overcome a resistance wall at $0.0752 to regain its July high. Related Reading: Ethereum Monthly Burn Surpasses 146,000 ETH As Total Clears $6.5 Billion According to Token Terminal data, DOGE&#8217;s market capitalization is $9.83 billion, with a circulating supply of tokens. Its fully diluted market capitalization is also $9.83 billion.  However, DOGE&#8217;s price-to-fully-diluted ratio (P/F ratio) is currently at an extremely high level of 16,006.25x, indicating that the cryptocurrency is trading at a premium relative to its fully diluted market capitalization. The P/F ratio has increased by 226.7% over the past 24 hours, suggesting that there may be increased demand for DOGE in the market. In conclusion, while DOGE&#8217;s recent surge in price can be attributed to Musk&#8217;s tweet, it remains to be seen whether it will continue to experience significant price movements in response to social media mentions and other media attention. Featured image from iStock, chart from TradingView.com"
  }
]