[
  {
    "source": "CryptoSlate",
    "date": "2023-08-14T12:00:03.000Z",
    "title": "HBAR surges 15% as FedNow support Hedera-based Dropp for real-time transactions",
    "url": "https://cryptoslate.com/hbar-surges-15-as-fednow-support-hedera-based-dropp-for-real-time-transactions/",
    "description": "<p>The Federal Reserve FedNow payment system has enabled support for Dropp, a micropayment platform based on Hedera (HBAR) Network, according to available information on its website. What is Dropp? Dropp is a payments platform based on Hedera that allows merchants to get paid in digital assets, including HBAR, USD Coin (USDC), and fiat USD. Merchants [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/hbar-surges-15-as-fednow-support-hedera-based-dropp-for-real-time-transactions/\">HBAR surges 15% as FedNow support Hedera-based Dropp for real-time transactions</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-14T11:40:47.000Z",
    "title": "Ethereum-Based BTCX Token Raises $1.5M to Build the World’s First Bitcoin Xin Blockchain",
    "url": "https://www.cryptoglobe.com/latest/2023/08/ethereum-based-btcx-token-raises-1-5m-to-build-the-worlds-first-bitcoin-xin-blockchain/",
    "description": "Granite city, U.S. Outlying Islands, August 14th, 2023, Chainwire BTCX Token, a revolutionary platform inspired by the rebranding of Twitter and the visionary influence of Elon Musk, has secured $1.5 million in pre-seed and seed funding to address inefficiencies in the cryptocurrency market. With the aim of upgrading Bitcoin by introducing hyper-deflationary features, BTCX Token […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-14T11:58:30.000Z",
    "title": "Bitcoin could be entering Argentina despite IMF",
    "url": "https://cryptodaily.co.uk/2023/08/bitcoin-could-be-entering-argentina-despite-imf",
    "description": "<p>In spite of the IMF obliging the Argentine central bank to say it wouldn&rsquo;t entertain Bitcoin, the next potential president is very much pro the king of the cryptocurrencies.</p>\nIMF should be concerned\n<p>When the International Monetary Fund (IMF) forced the Argentine central bank to guarantee that it wouldn&rsquo;t dabble in bitcoin, on pain of having its last crucial loan denied, the global financial agency must have thought that it had stopped bitcoin from being used in at least one Latin American country.</p>\n<p>A short time later, and the IMF must be feeling more than a trifle worried as a libertarian pro-Bitcoin candidate looks to be about to win the country&rsquo;s presidential primary elections with more than 90% of the vote already counted.</p>\nCentral bank is a scam\n<p>Javier Milei, young leader of La Libertad Avanza party, is not a meek and mild libertarian either. He is openly campaigning to abolish the Argentine central bank, calling it a &ldquo;scam&rdquo;.</p>\n<p>Such a statement is inflammatory in the extreme and will probably be taken by many from the Argentine elites and the banking sector as the rantings of a revolutionary hot head.</p>\n<p>However, the presidential hopeful has shown in interviews that he understands how money works, and he is calling out politicians and the central bank for cheating people with an &ldquo;inflationary tax&rdquo;.</p>\n<p>Milei had the following to say in an interview:</p>\n\n<p>&ldquo;The problem is that governments are not going to want to give up compulsory use of fiat currency. Bitcoin is the natural reaction to central bank fraud, but allowing money to become private once more isn&rsquo;t something the thieving politicians will allow.&rdquo;</p>\n\n<p>In past times, such language used by an aspiring politician, let alone one that would be president of his country, would have been denounced by the ruling class and would have been enough to see that this person got nowhere near any position of power.</p>\nArgentina running out of options\n<p>However, this is Argentina, a country that has played the IMF game for many decades, with presidents and top bank officials doing exactly as they were told, only for Argentina to lurch from one default crisis to another, over and over again, with citizens' purchasing power in the Argentine peso practically going to zero, and with an annual inflation rate of well over 100%.</p>\n<p>For Argentina to move onto the sound money base that is Bitcoin, could be a very interesting move for the country. That the elites in Argentina, plus the powers that be across the globe, might allow such a decision is something else.</p>\n<p>Argentina is in an extremely precarious financial position, and has only just managed to avoid default just recently with the help of China and the Latin American Development Bank. It will take a very brave and resolute leader to oversee such an incredible transition. For Argentina, there may be no other option.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-14T11:39:42.000Z",
    "title": "Thus far Infallible bitcoin signal just flashed",
    "url": "https://cryptodaily.co.uk/2023/08/thus-far-infallible-bitcoin-signal-just-flashed",
    "description": "<p>The Bitcoin Hash Ribbons has just signalled again. Is this yet another infallible buy signal for this indicator?</p>\nPrice action about to change?\n<p>All quiet on the Bitcoin front as the apex cryptocurrency continues to follow a meandering, slightly boring and predictable sideways trajectory between the $29,000 to $30,000 range.</p>\n<p>However, momentum is perhaps just starting to bubble up underneath Bitcoin&rsquo;s wanderings as one of the most successful and trusted indicators has suddenly sprung into life - flashing a buy signal that was last seen at the beginning of the year, after which Bitcoin started to thrust its way out of the last bear market.</p>\nThe Bitcoin hash rate\n<p>The Bitcoin hash rate is the amount of computing power that Bitcoin miners contribute to the network. The hash rate goes up when more miners are competing for blocks. On the flip side, when the price drops, or does not go up for a long period of time, miner capitulation happens, meaning that mining is no longer profitable, and miners take their machines offline.</p>\n<p>Even though the Hash Ribbons are a lagging indicator, on the higher time frame they are a very reliable sign that a bottom or a dip in the Bitcoin price has been reached.</p>\n<p>Given that Bitcoin is at a rather crucial point in what is seen by some as just a bear market rally, and by others as the initial phase of the new bull market, this signal will perhaps tip the argument more in the favour of the latter exponents.</p>\nA perilous financial time\n<p>A backdrop of dire economic warnings make for an incredibly interesting time for Bitcoin. The traditional monetary and banking system is on the edge of a cliff of financial oblivion, and should it go over this cliff, most financial assets might be expected to go with it.</p>\n<p>There are analysts who say that Bitcoin is a risk asset, and so would be expected to be one of the first to feel the pain of a financial meltdown. However, others would say that Bitcoin was created precisely for such an extreme scenario, and given that it is outside of the traditional financial system, many investors would see it as a liferaft to which they could transfer their wealth.</p>\n<p>It is certainly hoped that financial armageddon can be avoided, but given the way that governments and central banks have handled world economies, things are looking extremely perilous.&nbsp;</p>\n<p>It can be argued that the fiat currency experiment has reached the bitter end. All those still hoarding currency in the bank are doing so naively, probably unaware that their purchasing power is diminishing rapidly, and that they run the risk of being &lsquo;bailed in&rsquo; should the bank fail.&nbsp;</p>\n<p>Bitcoin is a sovereign store of wealth that is scarce, predictable, and the most secure computing system on the planet. Those looking to save themselves in the perilous time to come would do well to investigate Bitcoin&rsquo;s properties.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T11:53:48.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-14T11:40:04.000Z",
    "title": "SHIB, PEPE, APE Gain Against Bitcoin, Santiment Explains What This Means",
    "url": "https://www.newsbtc.com/altcoin/shib-pepe-ape-gain-bitcoin-santiment-explains-means/",
    "description": "Shiba Inu (SHIB), Pepe (PEPE), and ApeCoin (APE) have performed well against Bitcoin recently. Here&#8217;s what the memecoins&#8217; profits mean. SHIB, PEPE, And APE Have Enjoyed An Uptrend Recently Bitcoin has been going through a major phase of stagnation recently as the number 1 cryptocurrency&#8217;s price has remained stuck between the $29,000 and $30,000 levels. Much of the other market hasn&#8217;t been all that different, either. Out of the few coins that have gone against the grain and have displayed some volatility. However, the meme coins have especially stood out. Shiba Inu, Pepe, and Apecoin, in particular, have all pulled away from BTC. Dogecoin (DOGE), the original meme coin, also saw bullish momentum earlier, but the asset has slowed down recently. Out of these assets, PEPE has been the best performer, as it has observed profits of about 22% within the past week. Looks like PEPE has been going up recently &#124; Source: PEPEUSD on TradingView While Pepe&#8217;s weekly gains are certainly the most impressive of the bunch, the meme coin is actually in severe losses of 17% when considering the period of the past month. Related Reading: Want A Bitcoin Spot ETF? Then Prove BTC Is Not Manipulated, Says SEC ApeCoin has risen by 12% in the past week, and while the coin isn&#8217;t in negative during the past month, its performance for the period is still only flat. APE has also gone up in recent days &#124; Source: APEUSD on TradingView Unlike these two assets with significantly smaller market caps, Shiba Inu has not only registered impressive gains of 16% during the past week, but it has also observed a massive 32% rise during the last month. SHIB has sharply jumped recently &#124; Source: SHIBUSD on TradingView The reason behind the solid Shiba Inu performance is likely to be the much-hyped Shibarium upgrade, which is expected to launch sometime later in the current week. Does The Memecoin Rally Hold Any Significance For The Greater Market? All in all, it&#8217;s clear that these three meme coins have been building up bullish momentum recently, and they have been doing so simultaneously. In a new insight post, the on-chain analytics firm Santiment has revealed that while these assets may be rising, their social volumes haven&#8217;t budged much. SHIB and others haven't seen too high social volumes &#124; Source: Santiment The &#8220;social volume&#8221; here is a metric that keeps track of the degree of discussion that an asset is receiving on the major social media platforms. When this indicator has a high value, it&#8217;s a sign that a large number of users are talking about the coin and that there may be FUD or hype present around the coin. In uptrends, this metric reaching very high values is generally not a good sign, as it shows that FOMO is on the rise among social media users, which is something that has historically had an opposite effect on the price and has led to top formations. Since these metrics have risen for SHIB and the other meme coins, it means that social media users haven&#8217;t been paying too much attention so far to the pumps that these cryptocurrencies have been going through. Related Reading: Goldman Foresees Q2 2024 Fed Rate Cut: A Boost For Bitcoin? In the same post, Santiment also explains that the meme coins pulling away from Bitcoin have historically held significance for the entire sector. &#8220;This can often signal that the entire crypto market may be veering toward &#8216;overheated&#8217; territory,&#8221; notes the analytics firm. Santiment also says that when SHIB and co. see isolated pumps, &#8220;it is often associated with greed and/or boredom from the crowd. And these two behaviors often have adverse impacts on the markets.&#8221; Featured image from iStock.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-14T12:00:47.000Z",
    "title": "From $100+ Million to 50% Faster: Ripple and XRP to Revolutionize InstaReM’s Ecosystem",
    "url": "https://www.crypto-news-flash.com/from-100-million-to-50-faster-ripple-and-xrp-to-revolutionize-instarems-ecosystem/?utm_source=rss&utm_medium=rss&utm_campaign=from-100-million-to-50-faster-ripple-and-xrp-to-revolutionize-instarems-ecosystem",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/Ripple-and-its-security-the-case-against-the-project-and-releated-ryscs.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple and stellar Swift integration\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/Ripple-and-its-security-the-case-against-the-project-and-releated-ryscs.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/Ripple-and-its-security-the-case-against-the-project-and-releated-ryscs-300x300.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/Ripple-and-its-security-the-case-against-the-project-and-releated-ryscs-150x150.jpg 150w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" />InstaRem and Ripple renew their commitment to building streamlined treasury operations for their Small and Medium-sized Enterprises (SMEs). InstaRem has had its transaction times reduced by 50 percent as the Head of InstaRem lauds Ripple&#8217;s payment solution.  One of the leading cross-border money transfer service providers in SouthEast Asia, InstaRem, entered into a strategic partnership [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-14T11:55:00.000Z",
    "title": "“SEC Will Not Approve a Bitcoin Spot ETF,” Says SEC Ex-Official",
    "url": "https://coinedition.com/sec-will-not-approve-a-bitcoin-spot-etf-says-sec-ex-official/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/0411.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/0411.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/0411-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/0411-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/0411-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/0411-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/0411-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/0411-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/0411-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/0411-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/0411-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/0411-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/0411-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/0411-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/0411-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/0411-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/0411-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>John Reeds Stark, an ex-official of the U.S Securities and Exchange Commission, says the SEC will not approve a Bitcoin Spot exchange-traded fund (ETF). Stark, who formerly headed the SEC’s Office of Internet Enforcement, raised these concerns in a post on Sunday. &#8220;My take is that the current SEC will not approve a bitcoin spot [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sec-will-not-approve-a-bitcoin-spot-etf-says-sec-ex-official/\">“SEC Will Not Approve a Bitcoin Spot ETF,” Says SEC Ex-Official</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-14T11:45:23.000Z",
    "title": "US Treasuries and Real World Assets Bringing Renewed Interest in DeFi, Says Analytics Firm IntoTheBlock",
    "url": "https://dailyhodl.com/2023/08/14/us-treasuries-and-real-world-assets-bringing-renewed-interest-in-defi-says-analytics-firm-intotheblock/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/07/Undervalued-DeFi-Altcoin-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/07/Undervalued-DeFi-Altcoin-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/07/Undervalued-DeFi-Altcoin-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/07/Undervalued-DeFi-Altcoin-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/07/Undervalued-DeFi-Altcoin-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/07/Undervalued-DeFi-Altcoin-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/07/Undervalued-DeFi-Altcoin-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Market intelligence firm IntoTheBlock says that US treasuries, stablecoins yields and real-world assets are giving decentralized finance (DeFi) a shot in the arm. In a new article, IntoTheBlock head of research Lucas Outumuro says that MakerDAO’s (MKR) new 8% yield on stablecoin Dai (DAI), which has gathered $1 billion in deposits in less than a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/14/us-treasuries-and-real-world-assets-bringing-renewed-interest-in-defi-says-analytics-firm-intotheblock/\">US Treasuries and Real World Assets Bringing Renewed Interest in DeFi, Says Analytics Firm IntoTheBlock</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]