[
  {
    "source": "CoinDesk",
    "date": "2023-08-02T08:02:02.000Z",
    "title": "Race for Ether Futures ETFs Kicks Off With 6 Firms Filing SEC Applications",
    "url": "https://www.coindesk.com/policy/2023/08/02/race-for-ether-futures-etfs-kicks-off-with-6-firms-filing-sec-applications/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "As many as six entities have filed applications with the U.S. Securities and Exchange (SEC) for Ethereum Futures exchange-traded funds (ETFs) as of filing time on August 2, 2023."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-02T07:46:42.000Z",
    "title": "Kenyan Government Suspends Worldcoin Activity",
    "url": "https://www.coindesk.com/policy/2023/08/02/kenyan-government-suspends-worldcoin-activity/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Kenya is the first country to fully suspend Worldcoin operations. Data protection offices in Europe have started investigations."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-02T07:50:00.000Z",
    "title": "Curve Finance’s CRV Receives Support From Justin Sun And DCF God",
    "url": "https://cryptodaily.co.uk/2023/08/curve-finances-crv-receives-support-from-justin-sun-and-dcf-god",
    "description": "<p>Curve Finance and CEO Michael Egorov have received support from prominent names in the crypto space, including Justin Sun and DCF God.&nbsp;</p>\n<p>Curve had suffered a major exploit earlier in the week, leading to the protocol losing nearly $50 million to hackers.&nbsp;</p>\nChaos At Curve Finance&nbsp;\n<p>Curve Finance suffered a major exploit earlier in the week, allowing hackers to siphon off nearly $50 million worth of crypto. This included CRV tokens worth $4.52 million, leading to a significant drop in the token&rsquo;s price. The exploit resulted from a reentrancy bug in Vyper, the programming language powering parts of the Curve ecosystem. The CRV token saw a decline of nearly 20% following the attack.&nbsp;</p>\n<p>The markets were further spooked after reports emerged that the founder of Curve Finance, Michael Egorov, had allegedly taken several loans, using nearly 47% of the total circulating supply of CRV. Reentrancy attacks have become relatively common in the DeFi space. In such an exploit, hackers trick smart contracts by making repeated calls to the protocol and stealing user assets. As a result, Upbit has suspended deposits and withdrawals of the CRV token, while other exchanges have warned users to exercise caution when dealing with investments related to CRV. Upbit had tweeted,&nbsp;</p>\n\n<p>&ldquo;Today, certain vulnerabilities have been discovered in some of the stablecoin pools associated with Curve (CRV). As a result, CRV is currently experiencing significant volatility. We advise exercising caution when considering any investments related to CRV. To ensure the safety of digital asset transactions, we have temporarily suspended deposits and withdrawals for CRV.&rdquo;</p>\n\nCurve And Egorov Find Support&nbsp;\n<p>The plummeting CRV price significantly increased the risk of liquidating the loans Egorov took. However, prominent players from the crypto space have stepped in to assist Curve and Egorov. These include Power DeFi user DCF God, Tron Foundation CEO Justin Sun, and Jeffrey Huang, also known as Machi Big Brother. All have since stepped in and purchased CRV tokens from Egorov. As a result of this help, the principal value of Egorov&rsquo;s loan dropped from $63 million to $54 million.&nbsp;</p>\n<p>Tron founder Justin Sun tweeted that he was excited to assist Curve, demonstrating his support for the protocol by acquiring a number of CRV tokens. According to available on-chain data, Sun purchased around 5 million CRV tokens worth around $3 million. The tokens were purchased from a wallet called the Curve.fi Founder, and was completed through an over-the-counter transaction. Sun tweeted,&nbsp;</p>\n\n<p>&ldquo;Excited to assist Curve! As steadfast partners, we remain committed to providing support whenever needed. Our joint efforts will introduce an @stusdt pool on Curve, amplifying user benefits. Together, we aim to empower the community and forge a decentralized finance!&rdquo;</p>\n\n<p>Other players that chipped in to assist Curve were Cream Finance, who sent Egorov $1 million in USDT and USDC stablecoins. Egorov also received $1.5 million worth of USDT from Jeffrey Huang (Machi Big Brother), according to data sourced from PeckShield. Egorov also transferred over 50 million CRV to other entities, including the Web3 investment firm DWF Labs and Power DeFi user DCF God. Going by these numbers, Egorov sold around 50 million CRV tokens at a price of around $0.4 per token, making the transactions worth close to $20 million.&nbsp;</p>\nMajor Implications For DeFi&nbsp;\n<p>The Curve Finance exploit could have major implications for the larger DeFi ecosystem, with the CRV token&rsquo;s value suffering a significant decline, putting Egorov&rsquo;s $168 million lending position at risk of liquidation. If the position were to be liquidated, it could have a domino effect on the larger DeFi ecosystem. Egorov has a $70 million loan on Aave v2, for which he has used CRV as collateral. Additionally, he has also borrowed $17 worth of FRAX, putting $32 million worth of CRV as collateral, along with another $18 million loan from DeFi protocol Abracadabra.&nbsp;</p>\n<p>Concerns about the concentration of CRV on Aave were flagged by Gauntlet, who recommended freezing the token on Aave.&nbsp;</p>\n\n<p>&ldquo;The amount of CRV concentrated on Aave, relative to the circulating supply of CRV, is already high. Given the limitations of V2 mechanisms, including the possibility of circumventing an LTV of 0, the only way to truly prevent more risk of this position is to prevent borrowing of all assets on V2.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T08:00:00.000Z",
    "title": "Gems with 100x Growth Potential for Your Portfolio: Polkadot (DOT), Filecoin (FIL), and Borroe ($ROE)",
    "url": "https://www.cryptopolitan.com/gems-with-100x-growth-potential-for-your-portfolio-polkadot-dot-filecoin-fil-and-borroe-roe/",
    "description": "In the world of cryptocurrencies, identifying hidden gems with explosive growth potential is an art. As the crypto market continues to evolve, seasoned investors and newcomers alike are on the lookout for promising altcoins that could multiply their investments manifold.&#160; Let’s delve into three cryptocurrencies that experts believe have the potential to achieve remarkable 100x ... <a title=\"Gems with 100x Growth Potential for Your Portfolio: Polkadot (DOT), Filecoin (FIL), and Borroe ($ROE)\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gems-with-100x-growth-potential-for-your-portfolio-polkadot-dot-filecoin-fil-and-borroe-roe/\" aria-label=\"More on Gems with 100x Growth Potential for Your Portfolio: Polkadot (DOT), Filecoin (FIL), and Borroe ($ROE)\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T07:48:33.000Z",
    "title": "Is Relying Solely on AI for Managing Personal Finance a Risky Approach?",
    "url": "https://www.cryptopolitan.com/relying-ai-personal-finance-risky/",
    "description": "With the rapid advancements in artificial intelligence (AI) and automation, individuals now have access to powerful tools that can assist them in managing their finances more effectively. However, there are limitations to what AI can achieve, and relying solely on technology to fix one&#8217;s financial woes may not be the best approach. While AI-powered applications ... <a title=\"Is Relying Solely on AI for Managing Personal Finance a Risky Approach?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/relying-ai-personal-finance-risky/\" aria-label=\"More on Is Relying Solely on AI for Managing Personal Finance a Risky Approach?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-02T08:06:35.000Z",
    "title": "Binance Executes Terra Classic (LUNC) Token Burn, Community Burn Surpasses 72 Billion Tokens – Is it Time to Buy LUNC?",
    "url": "https://www.crypto-news-flash.com/binance-executes-terra-classic-lunc-token-burn-community-burn-surpasses-72-billion-tokens-is-it-time-to-buy-lunc/?utm_source=rss&utm_medium=rss&utm_campaign=binance-executes-terra-classic-lunc-token-burn-community-burn-surpasses-72-billion-tokens-is-it-time-to-buy-lunc",
    "description": "Binance has burned 1.41 billion LUNC tokens in the 12th batch of the LUNC burn mechanism, contributing to reducing the circulating supply of LUNC. The TerraCVita team released a whitepaper for the Terraport project, aiming to burn billions of LUNC tokens every week and increase the value of the protocol native token, TERRA. Our report [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-02T08:03:47.000Z",
    "title": "FTX Confirms Relaunch: Would You Trust SBF Now?",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/ftx-confirms-relaunch-would-you-trust-sbf-now/",
    "description": "<p>FTX has come up with a reorganization plan that would enable it to operate as an offshore company. The company proposed to divide its claimants into different classes. Court documents filed late Monday night showed that an important part of the plan includes an opportunity for a particular class of claimants to potentially resurrect FTX [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/ftx-confirms-relaunch-would-you-trust-sbf-now/\">FTX Confirms Relaunch: Would You Trust SBF Now?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]