[
  {
    "source": "CryptoGlobe",
    "date": "2024-01-13T18:52:32.000Z",
    "title": "ARK Invest CEO Cathie Wood Forecasts Bitcoin’s Potential Surge to $1.5 Million by 2030",
    "url": "https://www.cryptoglobe.com/latest/2024/01/ark-invest-ceo-cathie-wood-forecasts-bitcoins-potential-surge-to-1-5-million-by-2030/",
    "description": "In a recent appearance on CNBC’s “Squawk Box,” ARK Invest CEO and CIO Cathie Wood engaged in a comprehensive discussion with co-anchor Andrew Ross Sorkin about Bitcoin’s future. Bitcoin’s Price Trajectory and ARK’s Forecast Wood, known for her forward-looking views on technology and finance, reaffirmed her firm’s bullish stance on Bitcoin. She referenced ARK Invest’s […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-13T19:01:21.000Z",
    "title": "US Senators double down on calls to investigate SEC’s ETF tweet",
    "url": "https://www.cryptopolitan.com/us-senators-double-investigate-sec-etf-tweet/",
    "description": "In a significant turn of events, members of the United States Congress are urging the Securities and Exchange Commission (SEC) to address a recent cybersecurity breach that led to a false announcement regarding the approval of a spot Bitcoin exchange-traded fund (ETF). Senators Ron Wyden and Cynthia Lummis have taken action by sending a letter [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-13T18:45:24.000Z",
    "title": "GameStop exits the NFT space after shutting down its marketplace",
    "url": "https://www.cryptopolitan.com/gamestop-exits-nft-space-after-marketplace/",
    "description": "GameStop has decided to exit the NFT business, shutting down its NFT marketplace about a year and a half after its launch. The publicly-traded video game retailer cited regulatory uncertainty in the cryptocurrency space as the reason for winding down its platform, which supported gaming NFTs and other collectibles across Ethereum scaling networks Immutable X [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-13T18:43:30.000Z",
    "title": "Avalanche Price Prediction 2024-2033: Time to Buy AVAX?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2024-2033 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here’s a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-13T18:39:56.000Z",
    "title": "Unusual trading volumes detected on Upbit for Altcoins",
    "url": "https://www.cryptopolitan.com/unusual-trading-volumes-detected/",
    "description": "Cryptocurrency enthusiasts and traders were taken by surprise as unusual trading volumes were observed on Upbit, South Korea&#8217;s largest and the world&#8217;s second-largest cryptocurrency exchange.&#160; Several altcoins, including Aptos (APT), Ontology (ONT), IOST (IOST), Blur (BLUR), and Dogecoin (DOGE), experienced significant fluctuations in their trading volumes, sparking intrigue and speculation within the crypto community. Aptos [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-13T18:54:13.000Z",
    "title": "Nike dives into video game wearables, explores NFT fashion",
    "url": "https://crypto.news/nike-dives-video-game-wearables-explores-nft-fashion/",
    "description": "Nike, is diving deeper into the domain of video game fashion, despite expressing doubts over NFT expansion plans, according to a Jan. 12 blog post."
  }
]