[
  {
    "source": "Decrypt",
    "date": "2024-04-05T18:36:02.000Z",
    "title": "Tensor NFT Marketplace Reveals Solana Token Launch, Coinbase to List",
    "url": "https://decrypt.co/225016/tensor-nft-marketplace-reveals-solana-token-launch-coinbase-to-list",
    "description": "The TNSR token is coming to Coinbase, joining previously listed Solana tokens like BONK, FIDA, and ORCA."
  },
  {
    "source": "Decrypt",
    "date": "2024-04-05T18:23:55.000Z",
    "title": "China Is Escalating AI Use in Efforts to Influence US Elections, Microsoft Warns",
    "url": "https://decrypt.co/225017/china-us-election-misinformation-ai-sockpuppet-social-media",
    "description": "The tech giant sounds the alarm about China's use of AI-generated content and “sockpuppets” on social media."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-05T18:28:32.000Z",
    "title": " Terraform Labs was ‘built on lies’ — SEC at trial ",
    "url": "https://cointelegraph.com/news/terraform-labs-lies-sec-trial",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvYzhmZTNmOWYtYTRkZS00YzNlLTk5YzItNWFkMGZhZDczZjZhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The civil trial between the U.S. Securities and Exchange Commission and Terraform Labs entered its tenth day without the attendance of Do Kwon.</p>\n                    <p><p>As the trial between Terraform Labs and the United States Securities and Exchange Commission (SEC) approaches the finish line, attorneys alleged the crypto firm made several false claims regarding the platform to investors.</p><p>According to an April 5 Reuters report, SEC lawyers <a href=\"https://www.reuters.com/legal/terraform-labs-make-final-pitch-jury-civil-fraud-trial-wraps-2024-04-05/\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in U.S. District Court for the Southern District of New York that Terraform’s story was “built on lies,” which included the stability of algorithmic stablecoin TerraUSD (UST) and an integration with a South Korean payment app. Terraform attorney Louis Pellegrino reportedly claimed co-founder <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/do-kwon\">Do Kwon</a> had been truthful in public statements, and the SEC’s case relied on information taken out of context.</p><p>The civil trial with the SEC came more than a year after the commission filed a lawsuit against Terraform in February 2023. The regulator <a href=\"https://cointelegraph.com/news/sec-sues-do-kwon-and-terraform-labs-for-fraud\">alleged at the time</a> that the platform and Kwon “orchestrat[ed] a multi-billion dollar crypto asset securities fraud.” </p><p><a href=\"https://cointelegraph.com/news/terraform-labs-lies-sec-trial\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-04-05T18:37:02.000Z",
    "title": "Bitcoin Cash hits new peak since 2021, sparking debate over Bitcoin’s next move",
    "url": "https://cryptoslate.com/insights/bitcoin-cash-hits-new-peak-since-2021-sparking-debate-over-bitcoins-next-move/",
    "description": "<p>Quick Take The recent Bitcoin Cash (BCH) halving has sparked a significant price rally, propelling the digital asset to its highest level since 2021. Based on CryptoSlate research, an intriguing pattern has been observed in the lead-up to this halving event, potentially holding implications for the broader digital assets market. In the months preceding the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoin-cash-hits-new-peak-since-2021-sparking-debate-over-bitcoins-next-move/\">Bitcoin Cash hits new peak since 2021, sparking debate over Bitcoin&#8217;s next move</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2024-04-05T18:20:25.000Z",
    "title": "Ethena’s USDe stablecoin rockets past $2b supply",
    "url": "https://crypto.news/ethenas-usde-stablecoin-market-cap/",
    "description": "Ethena Labs’ synthetic dollar has surged to a $2 billion market cap less than two months after the protocol released its product on Ethereum’s public mainnet. "
  }
]