[
  {
    "source": "CryptoSlate",
    "date": "2023-07-28T23:00:28.000Z",
    "title": "SEC commissioner Hester Peirce calls watchdog’s public accounting warning into question",
    "url": "https://cryptoslate.com/sec-commissioner-hester-peirce-calls-watchdogs-public-accounting-warning-into-question/",
    "description": "<p>The United States Securities and Exchange Commission&#8217;s (SEC) Commissioner Hester Peirce questioned why the regulator wants to discourage good-faith efforts to provide more transparency for the cryptocurrency industry in a July 27 tweet. Peirce was reacting to a statement from the SEC chief accountant, Paul Munter, who warned that accounting firms acting as performing &#8220;audit&#8221; [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sec-commissioner-hester-peirce-calls-watchdogs-public-accounting-warning-into-question/\">SEC commissioner Hester Peirce calls watchdog&#8217;s public accounting warning into question</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-28T23:00:37.000Z",
    "title": "ATPBot Launches the Easiest Automated Crypto Trading Bot for Investors",
    "url": "https://news.bitcoin.com/atpbot-launches-the-easiest-automated-crypto-trading-bot-for-investors/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/8cd8d2d8-a30f-4289-a411-bfeba0ac091e-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/8cd8d2d8-a30f-4289-a411-bfeba0ac091e-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/8cd8d2d8-a30f-4289-a411-bfeba0ac091e-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/8cd8d2d8-a30f-4289-a411-bfeba0ac091e-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/8cd8d2d8-a30f-4289-a411-bfeba0ac091e-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/8cd8d2d8-a30f-4289-a411-bfeba0ac091e-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/8cd8d2d8-a30f-4289-a411-bfeba0ac091e-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/8cd8d2d8-a30f-4289-a411-bfeba0ac091e.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. ATPBot, the renowned leader in quantitative trading strategy development, proudly introduces its revolutionary auto trading bot to the cryptocurrency market. This cutting-edge bot boasts a user-friendly interface and a proven set of features, designed to cater to both novice and seasoned traders alike. ATPBot leverages the power of artificial intelligence to create and [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-28T23:00:32.000Z",
    "title": "Cardano (ADA) Price Remains Muted Despite Significant Milestones, Why?",
    "url": "https://www.newsbtc.com/news/cardano/cardano-ada-price-remains-muted-despite-significant-milestones-why/",
    "description": "Cardano (ADA) has been at the forefront of network development over the last few months. This continued commitment to further development on the blockchain has led to the network hitting multiple new milestones. However, the price of ADA has remained stagnant, so what’s going on? Latest Achievements For Cardano The year 2023 has been a good year for the Cardano network so far as it has celebrated multiple achievements during this time. The first of these is the fact that the Cardano network has recorded one of the longest uptimes of any blockchain in the space. Related Reading: Dogecoin Falls While Others Rally, Is It Decoupling From The Market? Cardano has recorded a continuous uptime record of 2,131 days as of July 28, which means that the network has not had an outage in almost six years. This achievement points to the sound technology behind the blockchain, in comparison to competitors such as Solana which has been characterized by multiple outages since its launch. Cardano has a current UPTIME of 2129 days exactly. That&#8217;s 5.83 YEARS with NO downtime. Built to last, an uptime the largest service providers in the world cannot &#38; will never come close to challenging. Research Wins. We are Cardano. Choose Cardano. 🙌👏@IOHK_Charles @Cardano… — Dave 🧑‍🚀💽 🐋 (@beaumont_dvd) July 26, 2023 Another achievement for the network has the consistent development taking place. Cardano has consistently ranked among the top 3 ecosystems when it comes to development and this time around has been no different. ADA price trending at $0.31 &#124; Source: ADAUSD on TradingView.com According to data from the on-chain tracker Santiment, the network is number 3 on the list of assets with the most developments over the last 30 days. This puts it behind only Polkadot (DOT) and Kusama Network (KSM), both of which emerged 1st and 2nd, respectively. This placement also puts Cardano ahead of its largest competitor Ethereum in terms of development. 🧑‍💻 Top 10 #crypto assets by development activity: notable #github commits, past 30 days: T1 @Polkadot $DOT T1 @kusamanetwork $KSM 3 @Cardano $ADA 4 @dfinity $ICP 5 @hedera $HBAR 6 @vegaprotocol $VEGA 7 @ethstatus $SNT 8 @cosmos $ATOM 9 @Ethereum $ETH 10 @decentraland $MANA pic.twitter.com/SnWDQf5a3y — Santiment (@santimentfeed) July 27, 2023 But Why Is ADA Not Reflecting The Achievements? Usually, when a network such as Cardano is recording such achievements as it has, it is reflected in the price of its native in the form of a rally. However, there has been no such performance from ADA. Rather, the altcoin has been shedding its gains since June. The problem may not be from ADA and might stem from the fact that the crypto market just reverted into another bear market trend. As a result, the broader market has been following the movement of Bitcoin, which on its own has reversed toward the low $29,000s. Related Reading: Bitcoin Pre-Halving Patterns Suggest Bull Market Is Not Starting In 2023 Given Cardano’s developments, if the market were to resume its rally, then ADA may emerge as one of the top performers. This would stem from the positive sentiment surrounding the token due to its significant achievements. Meanwhile, ADA is still performing well on a broader scale. At its current price, the digital asset’s price is up over 40% from its June lows, and ADA holding a good chunk of these gains shows that demand is rising to meet supply, thereby steadying the price. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  }
]