[
  {
    "source": "CryptoSlate",
    "date": "2023-07-25T08:47:52.000Z",
    "title": "Web3 part of a ‘new capitalism’ says Japan PM Kishida",
    "url": "https://cryptoslate.com/web3-part-of-a-new-capitalism-says-japan-pm-kishida/",
    "description": "<p>In a move demonstrating Japan&#8217;s commitment to Web3, Japanese Prime Minister Fumio Kishida stated the government is actively working to enhance and promote Web3, aligning with his administration&#8217;s larger vision of a &#8220;new capitalism. As per a report by CoinPost, during its WebX Asia conference on July 25, Prime Minister Kishida shared insights via a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/web3-part-of-a-new-capitalism-says-japan-pm-kishida/\">Web3 part of a &#8216;new capitalism&#8217; says Japan PM Kishida</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-25T08:55:09.000Z",
    "title": "API for Uniswap v3 Applications Now Live with Oku",
    "url": "https://cryptobriefing.com/api-for-uniswap-v3-applications/?utm_source=feed&utm_medium=rss",
    "description": "Oku has launched its API for applications built on Uniswap v3. Backed by the Uniswap Foundation, the API is designed to democratize access to real-time and historic Uniswap v3 market..."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-25T09:00:27.000Z",
    "title": "$BTC: Why a Bloomberg Senior Macro Strategist Believes Bitcoin Could Once Again Drop Below $20K",
    "url": "https://www.cryptoglobe.com/latest/2023/07/btc-why-a-bloomberg-senior-macro-strategist-believes-bitcoin-could-once-again-drop-below-20k/",
    "description": "Mike McGlone, a Senior Macro Strategist at Bloomberg Intelligence, recently reiterated his belief that Bitcoin (BTC), the flagship cryptocurrency, could reach a staggering $100,000. However, he also issued a warning that Bitcoin might face a significant dip, potentially dropping below $20,000, before achieving this milestone. According to a report by The Daily Hodl, in a […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-25T09:01:00.000Z",
    "title": "SBF Agrees To Gag Order After Putting Bail Status In Jeopardy",
    "url": "https://cryptodaily.co.uk/2023/07/sbf-agrees-to-gag-order-after-putting-bail-status-in-jeopardy",
    "description": "<p>FTX founder Sam Bankman-Fried has agreed to a gag order that prevents him from publicly discussing his case after prosecutors alleged he was discrediting their witness, Caroline Ellison.&nbsp;</p>\n<p>Bankman-Fried had come under fire for conducting an interview with the New York Times, which prosecutors have claimed amounts to witness tampering.&nbsp;</p>\nBail Status In Jeopardy&nbsp;\n<p>The gag order prevents the FTX founder from making any public statements related to the lawsuit, FTX, and the people involved with the lawsuit. Judge Lewis Kaplan, who is presiding over the case, will make a ruling on whether the gag order is required at the upcoming hearing for the lawsuit, scheduled on the 26th of July. The judge will also look at the &ldquo;adequacy and continuation&rdquo; of Bankman-Fried&rsquo;s bail, suggesting that his current bail status could be in jeopardy.&nbsp;</p>\n<p>The proposed order bans Bankman-Fried and others associated with the lawsuit from discussing anything with the press that could interfere with a fair trial. This includes statements regarding the credibility of witnesses, information that is not admissible during the trial, and any statement or opinion about the case that could influence the public. The order also extends to attorneys. However, it does not prevent Bankman-Fried from asserting his innocence.&nbsp;</p>\nThe New York Times Story&nbsp;\n<p>Bankman-Fried came under criticism following a story published in the New York Times. The story&rsquo;s focus was Caroline Ellison, the CEO of Alameda Research, and talked about writings found in her personal journals and Google Docs, appearing to show her ambivalence about her relationship with SBF and role at FTX. These were written by Ellison when she was the head of Alameda Research and before the collapse of FTX. She also talked about her struggles when it came to leading Alameda, which she described as &ldquo;overwhelming.&rdquo;</p>\n<p>Following the story, federal prosecutors launched a scathing attack on SBF, accusing him of leaking stories to newspapers and showing their witness in poor light. They also described it as a malicious effort to influence the jury pool toward the witness.&nbsp;</p>\n\n<p>&ldquo;In addition to tainting the jury pool, the effect, if not the intent, of the defendant&rsquo;s conduct is not only to harass Ellison but also to deter other potential trial witnesses from testifying.&rdquo;</p>\n\nNothing Malicious&nbsp;\n<p>Bankman-Fried&rsquo;s lawyers confirmed in a letter sent to Judge Kaplan that the former FTX CEO had met with reporters, adding that he gave them Ellison&rsquo;s documents. However, they denied all allegations of witness tampering as alleged by the prosecution. Bankman-Fried&rsquo;s lawyers argued that the prosecution&rsquo;s allegations were unfounded and that he had no malicious intention when he shared the documents with reporters.&nbsp;</p>\n\n<p>&ldquo;[SBF] did not violate the protective order in this case, nor did he violate his bail conditions, nor did he violate any law or rule.&rdquo;</p>\n\n<p>Additionally, the defense stated that Bankman-Fried would agree to the gag order and refrain from discussing or making public statements regarding the case. However, they argued that the gag order should also apply to the prosecution, along with all witnesses, including current FTX CEO John Ray. Bankman-Fried&rsquo;s lawyers argued that Ray had publicly vilified and attacked their client and continues to portray him as a villain, despite the case&rsquo;s ongoing status.&nbsp;</p>\nBankman-Fried&rsquo;s House Arrest&nbsp;\n<p>Bankman-Fried has already been summoned by Judge Kaplan following the accusations, with the judge skeptical regarding his bail conditions. He has already warned Kaplan has already warned SBF that he could end up going back to jail if he did not curtail his use of VPN programs and encrypted messaging apps.&nbsp;</p>\n<p>The former CEO is under house arrest at his parent&rsquo;s home in California as part of a $250 million bail package. However, the bail conditions have already been tightened twice. Visitors are now required to hand over their devices to a guard at the front door. Additionally, Bankman-Fried&rsquo;s internet usage is heavily monitored, and he is banned from using certain encrypted applications and contacting witnesses. The second condition was imposed after he messaged a potential witness and emailed John Ray.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T08:45:34.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s Solana price is $23.10 with a 24-hour trading volume of $618,897,839. Solana is up 5.99% in the last 24 hours. The current CoinMarketCap ranking is #9, with a live market cap of $7,273,881,101. It has a circulating supply of 394,890,490 SOL coins and the max. supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T09:06:55.000Z",
    "title": "Cardano (ADA) volume stagnation spells opportunity for Borroe (ROE) presale and its 100x potential",
    "url": "https://www.crypto-news-flash.com/cardano-ada-volume-stagnation-spells-opportunity-for-borroe-roe-presale-and-its-100x-potential/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-ada-volume-stagnation-spells-opportunity-for-borroe-roe-presale-and-its-100x-potential",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T172608.776-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T172608.776-1.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T172608.776-1-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T172608.776-1-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T172608.776-1-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T172608.776-1-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As Cardano&#8217;s trading volume struggles to keep pace with other top cryptocurrencies, a hidden gem emerges in the form of Borroe (ROE). The ROE presale presents a promising investment opportunity with its massive potential for 100x gains. Cardano&#8217;s volume woes: A win for Borroe (ROE) Cardano (ADA), the top 20 ranked cryptocurrency in terms of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T08:46:04.000Z",
    "title": "IOTA Releases Latest IOTA SDK Upgrade to Provide Developers with a Seamless Experience to Build on Network",
    "url": "https://www.crypto-news-flash.com/iota-releases-latest-iota-sdk-upgrade-to-provide-developers-with-a-seamless-experience-to-build-on-network/?utm_source=rss&utm_medium=rss&utm_campaign=iota-releases-latest-iota-sdk-upgrade-to-provide-developers-with-a-seamless-experience-to-build-on-network",
    "description": "<img width=\"1000\" height=\"600\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-48x29.jpg 48w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The support for iota-sdk 1.0 starts with the Stardust Protocol, and it will continue for all upcoming protocol upgrades, including 2.0. The IOTA SDK client module and wallet module give developers an easy interface to build applications on the Shimmer network. The IOTA Foundation is taking efforts for the developer community to interact with nodes [...]"
  }
]