[
  {
    "source": "CoinDesk",
    "date": "2023-05-30T17:19:07.000Z",
    "title": "BRC-721E Token Standard Bridges Ethereum NFTs to Bitcoin Ordinals",
    "url": "https://www.coindesk.com/web3/2023/05/30/brc-721e-token-standard-bridges-ethereum-nfts-to-bitcoin-ordinals/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The new token standard allows traders to burn their ERC-721 NFTs and transfer them to Ordinals on the Bitcoin network."
  },
  {
    "source": "CoinDesk",
    "date": "2023-05-30T17:13:26.000Z",
    "title": "U.S. CFTC Warns About Clearing Derivatives Tied to Digital Assets",
    "url": "https://www.coindesk.com/policy/2023/05/30/us-cftc-warns-about-clearing-derivatives-tied-to-digital-assets/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The derivatives agency said that clearing organizations it oversees have moved into the crypto space and it issued a reminder that they need to actively address the risks."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-30T17:30:34.000Z",
    "title": "Binance Australia Users Selling Bitcoin at Discount Ahead of AUD Withdrawals Halt",
    "url": "https://news.bitcoin.com/binance-australia-users-selling-bitcoin-at-discount-ahead-of-aud-withdrawals-halt/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1036215787-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Binance Australia Users Selling Bitcoin at Discount Ahead of AUD Withdrawals Halt\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1036215787-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1036215787-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1036215787-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1036215787-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1036215787-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1036215787-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1036215787.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Customers of Binance Australia were trading bitcoin and other cryptocurrencies at lower prices than those on other platforms on Tuesday. The discount is apparently due to a popular Australian payment service preparing to cut off the crypto exchange from withdrawals in local currency. Bitcoin Trading at Lower Rates on Binance Australia Australians traded bitcoin (BTC) [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-30T17:34:15.000Z",
    "title": "Bitcoin ordinals’ creator steps down as inscriptions surpass 10m",
    "url": "https://crypto.news/bitcoin-ordinals-creator-steps-down-as-inscriptions-surpass-10m/",
    "description": "Casey Rodarmor, the person behind bitcoin ordinals, reveals he will step aside from his role, with the platform reaching a milestone of over 10 million user registrations."
  },
  {
    "source": "BTCManager",
    "date": "2023-05-30T17:17:55.000Z",
    "title": "Roger Ver makes millions despite crypto bear market",
    "url": "https://crypto.news/roger-ver-makes-millions-despite-crypto-bear-market/",
    "description": "Renowned cryptocurrency pioneer and entrepreneur Roger Ver shared his views on the importance of decentralized peer-to-peer electronic cash systems such as bitcoin (BTC)."
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-30T17:30:01.000Z",
    "title": "Bitcoin Ordinals Achieve Milestone With Over 10M Inscriptions As Creator Rodarmor Departs",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-ordinals-achieve-milestone-with-over-10m-inscriptions-as-creator-rodarmor-departs/",
    "description": "A prominent non-fungible token (NFT) protocol based on the Bitcoin blockchain, &#8220;Ordinals,&#8221; surpassed an impressive benchmark in a significant turn of events. The network&#8217;s transaction surged to 10 million a few days after the Ordinals creator, Rodarmor, announced stepping down from the project.  Related Reading: Pepecoin Eyes Rebound As It Finds Support In Strong Algorithm Data Score Reaching over 10 million inscriptions suggests that many transactions have occurred on the protocol. Casey Rodarmor tweeted that he had stepped down as the lead maintainer of Ordinals.  He claimed that he was not giving Ordinal full attention and handed over the role to a programmer, Raphjaph. He further emphasized that donations from the community will fund the coder&#8217;s work on the project. Ordinals Protocol And Its Rapid Growth Bitcoin Ordinals is a protocol that supports the transcription of a unique identifier to individual satoshis (SATs) to enable easy tracking during transactions. After the launch of Ordinals in January, the protocol quickly gained popularity as a means to create new assets on the Bitcoin blockchain. Initially, Ordinals served to &#8220;inscribe&#8221; data on individual satoshis (the smallest divisible unit of BTC). However, the rapid growth in the number of Ordinals inscriptions occurred when the BRC-20 token standard was introduced in early March. Related Reading: Floki Inu: Does Meme Coin Have What It Takes To Re-Enter Top 100 Spot? This new token standard, established by the pseudonymous &#8220;Domo,&#8221; enabled users to mint new tokens on the Bitcoin blockchain.  According to data from BRC-20.io, in the first week, the number of Bitcoin-based tokens jumped from a hundred to 25,000 at the time of writing. The introduction of the BRC-20 token standard has expanded Bitcoin’s functionality. This increased utility has boosted the adoption and use of the Bitcoin blockchain for tokenization and asset creation. Controversy Surrounding Bitcoin Ordinals &#8211; Efficiency And Speed Concern The growth of Ordinals has not been without its share of controversy, as critics among the Bitcoin community have raised concerns about its method of &#8220;inscribing&#8221; assets on the network. They argue this approach is &#8220;inefficient and wasteful,&#8221;, particularly regarding block space and transaction fees. In response, alternative developers have been exploring using smart contracts to mint assets and non-fungible tokens (NFTs) on the Bitcoin blockchain. They aim to address the efficiency issues associated with Ordinals by leveraging smart contracts. On the other hand, proponents of the initiative have praised Ordinals for its ability to attract new users to the broader Bitcoin ecosystem.  Notably, even prominent anti-Bitcoin advocate Peter Schiff recently minted a small number of NFTs on Bitcoin using the Ordinals protocol. While the surge in Ordinals-related activity has increased BTC transaction fees, miners have greatly benefited from this heightened network engagement.  According to data from Dune Analytics, miners have received over $44 million in fees related to Ordinals transactions. Featured image from Pixabay and chart from TradingView"
  }
]