[
  {
    "source": "Decrypt",
    "date": "2023-08-02T23:54:28.000Z",
    "title": "AI Startup Inworld Raises $50M to Create Better Video Game Characters",
    "url": "https://decrypt.co/151063/ai-startup-inworld-raises-50m-to-create-better-video-game-characters",
    "description": "The company’s tech has already been used to flesh out NPCs in games like Skyrim and Grand Theft Auto V."
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-03T00:00:20.000Z",
    "title": "Why Isn’t Bitcoin Outperforming Most Risk Assets? A Market Conundrum",
    "url": "https://www.newsbtc.com/bitcoin-news/why-isnt-bitcoin-outperforming-most-risk-assets-a-market-conundrum/",
    "description": "Mike McGlone, Senior Commodity Strategist at Bloomberg Intelligence, has recently suggested that Bitcoin&#8217;s (BTC) underperformance compared to the stock market may be a warning sign for investors.  BTC’s Failure To Outshine In A Bull Market McGlone notes that Bitcoin has declined compared to the Nasdaq 100 stock index since its 2021 peak and April bounce. This waning performance may presage rising headwinds not only for Bitcoin but also for the broader crypto market. McGlone stated: If Bitcoin truly is the &#8220;fastest-horse-in-the-race,&#8221; as some consider it to be, then it should logically be outperforming in an everything bull market. However, that is not the case.  Notably, McGlone points to the most aggressive liquidity pull from central banks in history, which may be a significant factor in Bitcoin&#8217;s underperformance. Related Reading: Buying Pressure Incoming? MicroStrategy Files Notice With SEC To Sell $750 Million In Stocks The Federal Reserve (Fed) is still sighting in 3Q, despite the producer price index finished-goods gauge at minus 3.1% and dropping from 2022’s 18.3% peak at its fastest pace since 1948, which may be part of what underperforming Bitcoin is “sniffing out,” according to McGlone.  On a one-year basis to August 1st, Bitcoin is up just over 20%, similar to the Nasdaq, yet the crypto’s volatility is about two times greater. McGlone believes Bitcoin&#8217;s underperformance may be a warning sign for the broader market. The fact that Bitcoin is not outperforming as it should be in an everything-bull market could indicate that more significant market issues are at play, particularly in the face of aggressive liquidity pulls from central banks. Bitcoin And Ethereum Volatility At Historic Lows In a statement shared with NewsBTC Luuk Strijers, the Chief Commercial Officer at Deribit, a prominent cryptocurrency derivatives exchange, has recently stated that the Deribit Volatility Index (DVOL) for both Bitcoin and Ethereum is currently trading at an all-time low.  This is a significant development, especially since the DVOL for ETH is trading below the DVOL for BTC, which is a rare occurrence and may have been caused by the activity of a single large trader, commonly known as a whale. Despite the current low levels of volatility, Luuk Strijers highlights that the market is anticipating a considerable upswing in volatility shortly. This expectation is driven by several factors, including the upcoming ruling on the Blackrock spot Exchange-Traded Fund (ETF) and the approaching Bitcoin Halving. Strijers notes that Deribit has been observing signs of these expectations in the market, such as the significant steepness of the term structure, with June &#8217;24 trades at approximately 50, and the enduring call skew.  These indicators suggest that the market is anticipating increased volatility and potential price movements shortly, despite the current low levels of volatility. The Blackrock spot ETF ruling is anticipated to impact the cryptocurrency market significantly. If approved, the ETF will allow investors to gain exposure to Bitcoin without directly holding the cryptocurrency, potentially increasing demand and driving up prices.  Related Reading: Shiba Inu Price Prediction: Is Shibarium The Key To A Trend Reversal? On the other hand, if the ruling is not approved, it may lead to a temporary drop in prices and increased volatility. The approaching Bitcoin Halvening, which is expected to occur in 2024, is another factor contributing to the anticipation of increased volatility, according to Strijers.  The Halvening is a significant event in the Bitcoin network that occurs roughly every four years, where the block reward for Bitcoin miners is cut in half. This tends to reduce the supply of Bitcoin on the market, potentially driving up prices and increasing volatility. Despite the current low levels of volatility, Strijers suggests that investors and traders should remain vigilant and prepare for potential price movements and increased volatility in the cryptocurrency market. At the time of writing, BTC is trading at $29,100, representing a slight increase of 0.8% in the past 24 hours. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-03T00:04:43.000Z",
    "title": "Billion-Dollar Bank Facing US Government Investigation For Allegedly Dodging Rules on Record Keeping",
    "url": "https://dailyhodl.com/2023/08/02/billion-dollar-bank-facing-us-government-investigation-for-allegedly-dodging-rules-on-record-keeping/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/bank-vault-investigation.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/bank-vault-investigation.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/bank-vault-investigation.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/bank-vault-investigation.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/bank-vault-investigation.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/bank-vault-investigation.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/bank-vault-investigation.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>European lending giant BNP Paribas is currently in talks with US regulators to settle probes over its employees&#8217; use of messaging applications that may have violated rules on record keeping. According to the bank&#8217;s latest earnings report, BNP Paribas Securities Corp, the firm&#8217;s US-registered broker-dealer, is being investigated by the U.S. Securities and Exchange Commission [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/02/billion-dollar-bank-facing-us-government-investigation-for-allegedly-dodging-rules-on-record-keeping/\">Billion-Dollar Bank Facing US Government Investigation For Allegedly Dodging Rules on Record Keeping</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-03T00:00:23.000Z",
    "title": "Short Squeeze In Sight for DeFi Altcoin That Suffered $41 Million Exploit, According to Crypto Analyst",
    "url": "https://dailyhodl.com/2023/08/02/short-squeeze-in-sight-for-defi-altcoin-that-suffered-41-million-exploit-according-to-crypto-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/short-squeeze-in-sight.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/short-squeeze-in-sight.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/short-squeeze-in-sight.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/short-squeeze-in-sight.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/short-squeeze-in-sight.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/short-squeeze-in-sight.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/short-squeeze-in-sight.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto strategist says a short squeeze could materialize for an altcoin project that just suffered a $41 million hack. Pseudonymous analyst Credible Crypto tells his 343,200 Twitter followers that Curve (CRV) is experiencing a massive amount of short interest. However, the analyst says that if the native token on the decentralized finance [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/02/short-squeeze-in-sight-for-defi-altcoin-that-suffered-41-million-exploit-according-to-crypto-analyst/\">Short Squeeze In Sight for DeFi Altcoin That Suffered $41 Million Exploit, According to Crypto Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]