[
  {
    "source": "CryptoSlate",
    "date": "2023-06-15T10:45:36.000Z",
    "title": "Crypto traders scramble for arbitrage as Tether’s USDT strays from dollar peg",
    "url": "https://cryptoslate.com/crypto-traders-scramble-for-arbitrage-as-tethers-usdt-strays-from-dollar-peg/",
    "description": "<p>Tether&#8217;s USDT deviated from its dollar peg in the early hours of June 15, falling to $0.9979 at the time of writing, according to CryptoSlate&#8217;s data. Some traders took advantage of this opportunity, profiting by shorting USDT and setting up arbitrage trades. The price deviation was attributed to unusual DeFi liquidity pool activity, particularly on Uniswap [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/crypto-traders-scramble-for-arbitrage-as-tethers-usdt-strays-from-dollar-peg/\">Crypto traders scramble for arbitrage as Tether&#8217;s USDT strays from dollar peg</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-15T10:58:52.000Z",
    "title": "Ethereum (ETH/USD) Price Analysis – 15 June 2023: ‘STRONG SELL’ Suggested by Technical Indicators and Moving Averages",
    "url": "https://www.cryptoglobe.com/latest/2023/06/ethereum-eth-usd-price-analysis-15-june-2023-strong-sell-suggested-by-technical-indicators-and-moving-averages/",
    "description": "Introduction This report provides a comprehensive analysis of Ethereum’s (ETH) price dynamics, covering technical indicators, moving averages, and pivot points. Price and Volume Overview As of 10:11 a.m. UTC on 15 June 2023, on Binance, the price of ETH is $1,640.29, which is a decrease of $104.80 (-6.01%) from the previous close. The volume of […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-15T11:00:44.000Z",
    "title": "Astar Network Unveils the ‘Astar 2.0 Vision’ to Deliver Web3 Mass Adoption to Billions of Users",
    "url": "https://cryptodaily.co.uk/2023/06/astar-network-unveils-the-astar-20-vision-to-deliver-web3-mass-adoption-to-billions-of-users",
    "description": "<p>Tokyo, Japan, June 15th, 2023, Chainwire</p>Setting the long-term direction, the Astar 2.0 Vision aligns tokenomics, organizational structure, and key pillars of technology to drive Web3 mass adoption<p>Astar Network, the smart contract platform for multichain, is delighted to introduce the &lsquo;Astar 2.0 Vision&rsquo; as it aims to drive mass adoption of Web3 to billions of users. With developers&rsquo; growing interest in base layers that offer scalability, security, and interoperability, Astar Network aims to position itself as the go-to Layer-1 blockchain by providing them with all the tools, resources, and support to help them build unstoppable dApps.</p><p>The &lsquo;Astar 2.0 Vision&rsquo; sets the long-term direction for the rapidly-growing Astar ecosystem. It aligns the network&rsquo;s tokenomics, organizational structure, and pillars of technology to achieve its mission of enabling Web3 innovations that empower billions of people worldwide.</p>1. Tokenomics<p>Astar Network will revamp its current tokenomics to align with the long-term vision and the DAO will make Astar sustainable for the future.</p><p>The Astar Foundation is building this with the community in forums to gain their valuable insights. A redesigned ASTR token better serves the needs of network participants, from users and builders to enterprise partners. It&rsquo;s essential to ensuring a sustainable future of growth and success.</p>2. Astar Link&nbsp;<p>Connects the fragmented layers of the blockchain industry. With customizable options and tailor-made SDKs, developers can create limitless solutions. Astar Link unlocks diverse use cases from gaming to enterprise that is only possible by linking different ecosystems to each other.</p>3. Organizations supporting Astar Network<ol><li>Startale Labs - The enterprise arm that enables users and businesses to embrace blockchain in Japan. With a focus on Web3 infrastructure, Startale aims to build innovative products to enable the widespread adoption of Web3 technologies.</li><li>Astar Foundation - It is currently the main contributor and maintainer of the Astar Network Source Code. The Foundation deploys resources to expand Astar Network through partnerships, community activities, hiring developers, funding projects, and other initiatives.</li><li>Formation of Astar DAO - Astar is actively working with the community to realize this goal in Community Forums. The DAO will help create an unstoppable network by embracing decentralization and handing governance to the community. Anyone can use Astar Network anywhere to improve their communities</li></ol>4. Creating unstoppable dApps&nbsp;<p>Improving the developer experience to help them build unstoppable dApps with two pillars of technology:</p><ol><li>Cross-chain applications - Astar supports both EVM and WebAssembly (WASM) environments, and interoperability between them using a Cross-Virtual Machine (XVM). With XVM, smart contracts will work seamlessly regardless of the blockchain. Astar 2.0 brings more options and is scalable.</li><li>DApp staking - Improved tokenomics will return more value to builders and stakers via dApp staking. Astar&rsquo;s innovative Build2Earn program empowers developers to get paid through a dApp staking mechanism for the dApps they build. It allows network users to stake their tokens to support their favorite projects.</li></ol>5. Supernova: Paving the path forward<p>Actions speak louder than words. Watch out for our coming updates in the middle of Q3 which will see Astar deliver on its web3 promises. Like a supernova exploding and impacting the universe, Astar aims to have the same impact in the web3 universe. Bringing Astar technology and vision to the masses.</p><p>Interested developers and users can explore the 2.0 Vision here. Moreover, Japan&rsquo;s leading corporations have shown strong belief in Astar&rsquo;s vision and its ability to execute. Astar will share more details later in June and July.</p><p>The Astar Foundation and Startale Labs have been working with many of the world&rsquo;s leading global players to achieve the 2.0 Vision. Japan&rsquo;s leading corporations including Toyota Motor Corporation and Sony Network Communications have teamed up with Astar Network to explore the opportunities in Web3.</p><p>Sota Watanabe, the Founder of Astar Network, said, &ldquo;We will push the network to unlock Web3 for billions. Each part of Astar 2.0 is being shaped and improved, starting with token economics and developer tooling to ensure the sustainable long-term growth of the network.&rdquo;</p><p>Astar Network is the leading Layer-1 in Japan, having been voted the most popular blockchain in the country by the Japanese Blockchain Association. It is the go-to blockchain for developers and enterprises interested in exploring the Japanese Web3 space. Astar is also the first public blockchain from the country to be listed there despite Japan&rsquo;s strict listing regulations. Astar&rsquo;s native token ASTR is registered as a cryptocurrency, not a security, by the Japanese government.</p><p></p>About Startale Labs <p>Startale Labs is a web3 tech company developing multichain applications and infrastructure. We also conduct R&amp;D and incubation activities based on the experience and connections developed in coordination with Astar Network. In addition, a subsidiary, Startale Labs Japan, was established on January 31st 2023 to provide web3 business development and strategic consulting services to corporate enterprises and governments, leveraging the strengths of Japan&rsquo;s most widely-recognized public blockchain.</p><p></p>About Astar Network<p>Astar is Japan&rsquo;s most popular smart contract platform, supporting both EVM and WebAssembly (Wasm) environments, and interoperability between them using a Cross-Virtual Machine. Astar Network is friendly to all kinds of developers, and tools and languages they already know. Backed by the shared security of Polkadot, Astar shines brilliantly on its own within a vibrant and healthy ecosystem, and is a leading star in the blockchain industry overall, driving international corporate adoption, and consumer interest in web3 technologies.</p><p>For more information, visit: Website | Twitter | Discord | Telegram | GitHub | Reddit | YouTube&nbsp;</p>ContactSota Watanabeinfo@startale.org"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-15T10:55:00.000Z",
    "title": "Aave’s Proposal To Freeze Curve Founder Loans Draws Community Ire",
    "url": "https://cryptodaily.co.uk/2023/06/aaves-proposal-to-freeze-curve-founder-loan-draws-community-ire",
    "description": "<p>An Aave proposal intended to prevent a particular account from accumulating more debt has led to significant controversy, with some stating that it violates the principle of neutrality in DeFi.&nbsp;</p>\n<p>The proposal suggested imposing a cap on using CRV tokens as collateral, preventing the wallet address in question from adding more loans.&nbsp;</p>\nThe Account In Question&nbsp;\n<p>Many believe that Curve (CRV) founder Michael Egonov owns the account in question. Egonov had begun borrowing stablecoins on Aave in April, beginning with $37 million worth of Tether (USDT) being sent to Bitfinex and a further $51 million in USDC being sent to market maker Wintermute. More recently, Egorov deposited $24 million worth of Curve DAO (CRV) tokens to Aave to mitigate the liquidation risk of a $65 million stablecoin loan.</p>\n\n<p>&nbsp;&ldquo;Seems like Curve&rsquo;s founder has a $110m leverage position against his $CRV stack across all Defi. If not repaid at some point (spoil: it prob won&rsquo;t, my man is taking profit), this will cascade into a lot of bad debt for lending protocols.&rdquo;</p>\n\nLiquidation Risk&nbsp;\n<p>According to the author of the proposal, the address associated with the account (0x7a16ff8270133f063aab6c9977183d9e72835428) has gone on to accumulate over $67 million worth of debt in USDC and USDT using the AAVE v2 protocol and putting up $185 million worth of CRV tokens as collateral. The proposal&rsquo;s author expressed concern that the account could continue increasing its debt, increasing the risk that it could be liquidated if the price of CRV suddenly drops. Adding to the problem is the fact that CRV has suffered a recent decline in liquidity over the past few months.&nbsp;</p>\n<p>This could lead to considerable slippage if the account is liquidated, as there may not be enough buyers looking to purchase CRV and take on such a significant amount of CRV tokens, leading to millions of dollars worth of bad debt for the Aave protocol.&nbsp;</p>\nFreeze on CRV As Collateral&nbsp;\n<p>According to Aave user DecentMuse, the wallet address is tagged as belonging to Michael Egonov, the founder of Curve. According to the user, the loan could be a way for Egonov to take profits from his activities on behalf of Curve. Financial modeling platform Gauntlet, the proposal&rsquo;s author suggested that the AAVE decentralized autonomous organization (DAO) freeze further use of CRV tokens as collateral for taking out loans. Such a move would allow the account to hold its current loan position but prevent it from accumulating more debt.&nbsp;</p>\n<p>The proposal found some support among users who criticized the account for taking on so much debt. One user wondered if the account intended to pay off its debt, adding that it constantly added to its position despite the token losing value.&nbsp;</p>\nProposal Criticized&nbsp;\n<p>However, critics of the proposal defended the account. One user suggested that the account owner may believe that CRV tokens are undervalued, leading them to increase their use as collateral as their price declines. Marc Zeller, Aave-Chan Initiative founder, also put forward his views, adding that the AAVE DAO should not violate neutrality, which is one of the core tenets of DeFi.&nbsp;</p>\n\n<p>&ldquo;The intention of users or what they do with their funds is not our primary concern. Users should be free to utilize the protocol as they see fit.&rdquo;</p>\n\n<p>So far, the proposal is only listed as a &ldquo;recommendation,&rdquo; meaning it has not yet been turned into an Aave Improvement Proposal (AIP), which the DAO can vote on. However, Gauntlet has stated that turning it into a formal AIP is the next step.&nbsp;</p>\nAn Ongoing Debate&nbsp;\n<p>There is an ongoing debate in the larger blockchain ecosystem regarding the limits of censorship resistance. In January, Bitcoin saw a similar debate where users complained of high fees caused by some users minting and trading ordinals. Some Bitcoin users wanted a ban on Ordinals, while others opposed a ban, stating it would be censorship. In April, Tether blacklisted an address that drained $25 million from EVM-front-running bots.&nbsp;</p>\n<p>Jayanti Kanani, Polygon co-founder, stated that the blacklisting could establish a bad precedent and lead to more transactions being censored. However, ZachXBT, the on-chain sleuth, stated that Tether could have been forced to act by a court order.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T10:51:35.000Z",
    "title": "Cryptocurrency lender Celsius’s bankruptcy plan faces creditor pushback",
    "url": "https://www.cryptopolitan.com/cryptocurrency-lender-celsiuss-bankruptcy-plan-faces-creditor-pushback/",
    "description": "Unexpectedly, cryptocurrency lender Celsius has made a significant stride forward in its efforts to relaunch operations by submitting an amended bankruptcy plan. Several high-profile investors, including Arrington Capital and US Bitcoin Corp., formed the Fahrenheit consortium and ultimately won the bidding for Celsius&#8217; assets, reflected in the proposed strategy. With this result, NovaWulf could not ... <a title=\"Cryptocurrency lender Celsius&#8217;s bankruptcy plan faces creditor pushback\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cryptocurrency-lender-celsiuss-bankruptcy-plan-faces-creditor-pushback/\" aria-label=\"More on Cryptocurrency lender Celsius&#8217;s bankruptcy plan faces creditor pushback\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T10:42:46.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T10:40:57.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-15T10:50:05.000Z",
    "title": "Sam Bankman-Fried to face trial only on 8 initial charges",
    "url": "https://crypto.news/sam-bankman-fried-to-face-trial-only-on-8-initial-charges/",
    "description": "The US Department of Justice (DOJ) has decided to move forward with the trial of Sam Bankman-Fried, the former CEO and founder of FTX. However, the trial will only involve the original eight charges filed in December 2022, which include wire fraud, securities fraud, and money laundering."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-15T10:45:31.000Z",
    "title": "South Korean crypto lending platform Delio suspends withdrawals",
    "url": "https://crypto.news/south-korean-crypto-lending-platform-delio-suspends-withdrawals/",
    "description": "Delio, a Korea-owned cryptocurrency lending and savings company, has temporarily suspended fund withdrawals, citing increased market volatility.  Delio, a South Korea-based digital assets lending platform offering users high returns on their crypto holdings, has suspended fund withdrawals, citing increased market&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-15T10:40:19.000Z",
    "title": "Cardano (ADA) Price Sheds 19% As Bearish Sentiment Looms Large",
    "url": "https://www.newsbtc.com/news/cardano-ada-price-sheds-19/",
    "description": "Cardano (ADA) experienced a significant upswing in March, reaching a year-to-date high of $0.4622. Excitement spread among ADA investors as the price climbed, but unfortunately, it was short-lived. The price faced rejection at that level, causing ADA to plummet to the $0.3760 support level.  However, despite this setback, ADA managed to find some stability as the bulls defended this crucial support level. Throughout May, the price of ADA fluctuated above and below the support level, giving hope to investors. Related Reading: Shiba Inu Collapses: How Long Can The Meme Coin Climb Back Up? However, the tides turned in June when intense selling pressure gripped the market. ADA, like many other altcoins, found itself caught in the aftermath of regulatory issues with its supposed security label. The market sentiment turned bearish, and altcoins suffered significant losses as a result. ADA Not A Security: Gensler Once Again Getting Ahead of Himself #Cardano #cardanofeed #ADA #crypto #cardanocommunity #bitcoin #CoinMarketCap #blockchain #cryptocurrency #CardanoADA #btc $ADAhttps://t.co/cwM1SD0Brm — Cardano Feed ($ADA) (@CardanoFeed) June 14, 2023 Now, the question arises: What lies ahead for ADA as the bearish sentiment continues to loom? The Correlation Between Bitcoin Price, Altcoin Performance At the time of writing, Bitcoin (BTC) is trading below the $25,000 level, exerting its influence on the broader cryptocurrency market. The price decline of BTC has had a profound impact on altcoins, causing a ripple effect throughout the entire crypto ecosystem. Source: Coingecko Altcoins, including Cardano&#8217;s ADA, have been significantly affected by Bitcoin&#8217;s downturn. ADA, currently priced at $0.259126 at CoinGecko, has experienced a 7.3% slump in the past 24 hours alone, contributing to a substantial seven-day decline of 22%. These figures illustrate the strong correlation between Bitcoin&#8217;s price movements and the performance of altcoins. Related Reading: Bitcoin Price Hammered Below $25,000 Amid Fed’s Hawkish Tone, SEC Lawsuits Bitcoin, being the largest and most established cryptocurrency, often serves as the bellwether for the entire crypto market. When Bitcoin experiences a price drop, it tends to instigate a domino effect, triggering a widespread sell-off across various digital assets. This correlation stems from the fact that many altcoin traders and investors use Bitcoin as a benchmark or a base currency for trading. ADA market cap slightly below $9 billion. Chart: TradingView.com Furthermore, Bitcoin&#8217;s price movements often reflect the overall market sentiment and investor confidence in the cryptocurrency industry. When Bitcoin faces significant challenges or negative news, it creates a sense of uncertainty and fear among market participants. As a result, investors may seek to reduce their exposure to riskier assets like altcoins, leading to a decline in their prices. Waning Interest In Cardano Bullish Rally According to data provided by Coinalyze on the four-hour timeframe, it has been observed that the Open Interest (OI) for ADA has been decreasing. The diminishing Open Interest suggests that market speculators are displaying a lack of enthusiasm toward a potential bullish rally for ADA. ADA Open Interest down. Source: Coinalyze Similarly, the Spot CVD (Cumulative Volume Delta) has been consistently on a downward trend, highlighting the prevailing bearish sentiment in the market. This further emphasizes the dominance of bearish market forces, indicating a negative outlook for ADA. Featured image from CoinChapter"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T10:44:30.000Z",
    "title": "Crypto Analyst Reveals Reversal Levels for Ethereum, Binance Coin, and Litecoin Amid Altcoin Correction – Potential Trend Reversals Ahead",
    "url": "https://www.crypto-news-flash.com/crypto-analyst-reveals-reversal-levels-for-ethereum-binance-coin-and-litecoin-amid-altcoin-correction-potential-trend-reversals-ahead/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-analyst-reveals-reversal-levels-for-ethereum-binance-coin-and-litecoin-amid-altcoin-correction-potential-trend-reversals-ahead",
    "description": "Crypto analyst, Michaël van de Poppe, shared valuable observations regarding potential levels of reversal for Ethereum (ETH), Binance Coin (BNB), and Litecoin (LTC). Van de Poppe indicates that BNB’s inability to sustain support around the $270 level indicates a possible trajectory toward $200. In a YouTube video, cryptocurrency analyst, Michaël van de Poppe, shared valuable [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T10:40:07.000Z",
    "title": "Synthetix (SNX) or This Rival Token, Which Should Investors Buy For An Easy 1000% Profit?",
    "url": "https://www.crypto-news-flash.com/synthetix-snx-or-this-rival-token-which-should-investors-buy-for-an-easy-1000-profit/?utm_source=rss&utm_medium=rss&utm_campaign=synthetix-snx-or-this-rival-token-which-should-investors-buy-for-an-easy-1000-profit",
    "description": "Discovering profitable investments in the cryptocurrency market can be challenging. Today, we compare two promising tokens: Synthetix (SNX), a DeFi token, and Pikamoon ($PIKA), a GameFi token. Which one has the potential for a massive 1000% profit?  Let&#8217;s explore their features and evaluate the pros and cons. Synthetix (SNX): The DeFi Champ Synthetix is a [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-15T10:52:39.000Z",
    "title": "Ethereum Tops the List of the Biggest Blockchains by TVL",
    "url": "https://coinedition.com/ethereum-tops-the-list-of-the-biggest-blockchains-by-tvl/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/ETH-3-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/ETH-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/ETH-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/ETH-3.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Data from the crypto market tracking website, CoinMarketCap, revealed the top 5 most prominent blockchains by Total Value Locked (TVL). The blockchains included on the list were Ethereum (ETH), Tron (TRX), Binance Coin (BNB), Arbitrum (ARB), and Polygon (MATIC). TVL is used as a metric to measure the total value of digital assets that are [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ethereum-tops-the-list-of-the-biggest-blockchains-by-tvl/\">Ethereum Tops the List of the Biggest Blockchains by TVL</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]