[
  {
    "source": "Cointelegraph",
    "date": "2023-11-23T17:10:48.000Z",
    "title": "Stablecoin bill is a ‘no-brainer’ — Consensys director on US legislation",
    "url": "http://cointelegraph.com/news/stablecoin-bill-no-brainer-consensys-director",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/495739f0-f475-4cb0-8c30-b3c62cce1720.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Consensys senior counsel and director of global regulatory matters Bill Hughes spoke at the North American Blockchain Summit on crypto bills and their role in politics.</p>\n                    <p><p>Amid ongoing campaigns for the elections in 2024, many United States lawmakers have not sealed the deal on legislation aimed at establishing regulatory clarity on aspects of the digital asset space, including stablecoins.</p><p>Speaking with Cointelegraph at the North American Blockchain Summit on Nov. 16, Consensys senior counsel and director of global regulatory matters Bill Hughes said it was “an exciting time in the policy world” as members of Congress considered which crypto bills they planned to support. Hughes said legislating on stablecoins should be a “no-brainer” for lawmakers once they resolved issues related to state-level regulators. </p><p>“Stablecoins are a huge part of the crypto ecosystem — it is one of the best use cases of blockchain technology,” said the Consensys director. “There’s just this one policy stumbling block which is holding stuff up.”</p><p>Hughes added that Massachusetts Senator Elizabeth Warren’s crypto bill, aimed at <a href=\"https://cointelegraph.com/news/crypto-bill-us-nine-senators-back-elisabeth-warren\">cracking down on the illicit use</a> of digital assets, may have support but was “problematic” in addressing Anti-Money Laundering. In contrast, the Clarity for Payment Stablecoins Act, introduced by House Financial Services Committee chair Patrick McHenry, was “pretty sensible, all things considered,” according to the Consensys director.</p><p>“Crypto has definitely become a political football of sorts in D.C.,” said Hughes. “There are obviously those that are outwardly and gleefully hostile. There are a lot who view it as an exciting space that needs to be given room to breathe while also being mindful that there are meaningful risks that may be rightfully the subject of federal policy.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This legislation she proposes does nothing to solve the problem she claims it solves.  Literally nothing.  <br><br>DOJs settlement today does help, however. <a href=\"https://t.co/IkcFIAygLO\">https://t.co/IkcFIAygLO</a></p>&mdash; Bill Hughes : wchughes.eth  (@BillHughesDC) <a href=\"https://twitter.com/BillHughesDC/status/1727124848248225933?ref_src=twsrc%5Etfw\">November 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Like many in the space, Hughes expected that the U.S. Securities and Exchange Commission could give the green light to a spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund, or ETF, but didn’t rule out the regulator continuing to delay a decision: </p><blockquote>“It wouldn’t surprise me if the Bitcoin ETF was finally allowed to go forward [...] there’s a huge supplier demand for it [...] The current rationale for not having one has been incoherent.” </blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/us-fsc-discuss-illicit-activity-crypto-upcoming-hearing\"><strong><em>US House FSC to discuss illicit activity in crypto at upcoming hearing</em></strong></a></p><p>Candidates for the 2024 presidential election, including Republican Vivek Ramaswamy and Independent Robert F. Kennedy, Jr., attended the North American Blockchain Summit and <a href=\"https://cointelegraph.com/news/event-recap-north-american-blockchain-summit\">expressed their support</a> for many crypto-related policies — an issue that largely hasn’t taken center stage at Republican Party debates. According to Hughes, crypto was “very much off the beaten path” regarding political issues and more likely to be represented in candidates’ views on wider-reaching issues like financial freedom and the size of government. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\"><strong><em>Unstablecoins: Depegging, bank runs and other risks loom</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-11-23T17:16:52.000Z",
    "title": "Singapore Floats Stricter Rules to Discourage Crypto Retail Trading",
    "url": "https://cryptobriefing.com/singapore-stricter-rules-discourage-crypto-retail-trading/?utm_source=feed&utm_medium=rss",
    "description": "Singapore central bank to curb crypto retail trading, banning incentives, leverage and card payments to limit volatility risks."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-23T17:30:35.000Z",
    "title": "Navigating NFT Categories to Unlock Their Unique Potentials",
    "url": "https://www.cryptopolitan.com/nft-categories-to-unlock-unique-potentials/",
    "description": "NFTs, or Non-Fungible Tokens, represent a seismic shift in digital ownership and authenticity. Unlike cryptocurrencies such as Bitcoin or Ethereum, NFTs are unique and indivisible, each carrying its own distinct value. Grounded in blockchain technology, primarily the Ethereum network, NFTs are digital certificates of ownership and provenance, spanning a wide range of assets from art ... <a title=\"Navigating NFT Categories to Unlock Their Unique Potentials\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nft-categories-to-unlock-unique-potentials/\" aria-label=\"More on Navigating NFT Categories to Unlock Their Unique Potentials\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-23T17:27:52.000Z",
    "title": "Solana surging, investors exploring these 5 altcoins",
    "url": "https://crypto.news/solana-surging-investors-exploring-these-5-altcoins/",
    "description": "Investors are exploring Lido DAO (LDO), Bitcoin ETF Token (BTCETF), Render (RNDR), Meme Kombat (MK), and Avalanche (AVAX) as the market recovers"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-23T17:19:20.000Z",
    "title": "SEI token skyrockets 91% in 7 days amid Circle investment",
    "url": "https://crypto.news/sei-token-skyrockets-91-in-7-days-amid-circle-investment/",
    "description": "SEI, the layer-1 blockchain, witnessed a remarkable 91% surge in seven days, following a strategic investment from Circle. Data from CoinMarketCap shows SEI has now surged 91.13% to $0.20. At the time of writing, the token also reported an increase of&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-23T17:17:05.000Z",
    "title": "Ripple’s XRP Gains Momentum as Multiple ETPs Inject Liquidity into the Market",
    "url": "https://www.crypto-news-flash.com/ripples-xrp-gains-momentum-as-multiple-etps-inject-liquidity-into-the-market/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-xrp-gains-momentum-as-multiple-etps-inject-liquidity-into-the-market",
    "description": "<img width=\"800\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XUMM\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-48x29.jpg 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" />XRP liquidity is poised to reach record highs with multiple ETPs expected to hit the European market next month. These products point to a growing institutional demand for the digital asset, a major driver for long-term price increases. The XRP community is anticipating a huge rise in XRP liquidity beginning next month. In a recent [...]"
  }
]