[
  {
    "source": "CoinDesk",
    "date": "2023-11-24T16:53:46.000Z",
    "title": "Bitcoin Eyes $40K After Breaching $38K for First Time Since May 2022",
    "url": "https://www.coindesk.com/markets/2023/11/24/bitcoin-eyes-40k-after-breaching-38k-for-first-time-since-may-2022/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bitcoin [BTC] has risen above $38,000 for the first time since May 2022 after battling this level for the past two weeks."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-11-24T16:46:45.000Z",
    "title": "Binance CZ Fights to Return Home Despite Flight Risk Worries",
    "url": "https://cryptobriefing.com/binance-cz-fights-return-home-flight-risk-worries/?utm_source=feed&utm_medium=rss",
    "description": "No flight risk seen as Binance's founder CZ voluntarily came to US court to plead guilty, take responsibility in AML case"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-24T16:59:14.000Z",
    "title": "3 Tokens Under $5 To Buy Now for Potential Explosive Growth",
    "url": "https://cryptodaily.co.uk/2023/11/3-tokens-under-5-to-buy-now-for-potential-explosive-growth",
    "description": "Discover the top 3 cryptocurrency tokens priced under $5 with significant growth potential. Explore our expert analysis on these affordable yet promising digital assets that could explode in value. Ideal for investors looking to diversify their portfolio"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-24T16:50:25.000Z",
    "title": "Unbelievable Black Friday Deal as Xbox Series X Drops to £359 in the UK, a 25% Discount",
    "url": "https://www.cryptopolitan.com/black-friday-as-xbox-series-x-drops-to-359/",
    "description": "The Xbox Series X, Microsoft&#8217;s powerhouse gaming console, is now available for an unprecedented £359 in the UK for Black Friday, marking the lowest price ever seen for this current-gen gaming marvel. Black Friday has dawned with an incredible offer for gamers in the UK. The Xbox Series X, Microsoft&#8217;s flagship gaming console, is currently ... <a title=\"Unbelievable Black Friday Deal as Xbox Series X Drops to £359 in the UK, a 25% Discount\" class=\"read-more\" href=\"https://www.cryptopolitan.com/black-friday-as-xbox-series-x-drops-to-359/\" aria-label=\"More on Unbelievable Black Friday Deal as Xbox Series X Drops to £359 in the UK, a 25% Discount\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-24T17:00:49.000Z",
    "title": "Will Recent Binance Events Trigger This Historical Bitcoin Bull Run Signal?",
    "url": "https://www.newsbtc.com/bitcoin-news/binance-trigger-historical-bitcoin-bull-run-signal/",
    "description": "The recent events at cryptocurrency exchange Binance could trigger the next Bitcoin bull run if this pattern continues to form. Will Bitcoin Exchange Reserve Ratio Turn Around After Binance News? As explained by an analyst in a CryptoQuant Quicktake post, the BTC exchange reserve ratio for US versus off-shore platforms has followed a specific pattern during past bull markets of the asset. The &#8220;exchange reserve ratio&#8221; here refers to an indicator that compares the exchange reserves of any two platforms or group of platforms. The exchange reserve is the total amount of Bitcoin sitting in the wallets of the exchange/group in question. In the context of the current discussion, the exchange reserve ratio between the US-based exchanges and foreign platforms is of interest. The trend in this metric can tell us about which type of exchanges users prefer to use. Related Reading: Is Dogecoin About To Reverse? Key Factors To Watch When the ratio&#8217;s value declines, the off-shore exchanges gain steam as investors deposit their coins to them faster than to the US platforms (alternatively, they are withdrawing at a slower pace). On the other hand, an increase implies the dominance of the American exchanges is going up as their exchange reserve is growing relative to that of the global platforms. Now, here is a chart that shows the trend in the Bitcoin exchange reserve ratio for these two sets of exchanges over the last few years: Looks like the value of the metric has been going up in recent weeks &#124; Source: CryptoQuant In the graph, the quant has highlighted the two phases that the Bitcoin exchange reserve ratio for these platforms appeared to have followed during the last two bull runs. In the first phase (marked in green), the indicator rises while the cryptocurrency goes through a buildup period for the bull rally. This suggests that large entities start participating in the American exchanges ahead of the bull run. Once the bull run starts properly, the indicator&#8217;s value starts sliding down as investors withdraw their coins from these platforms again (the red box in the graph). From the chart, it&#8217;s visible that the Bitcoin exchange reserve ratio for US vs. foreign exchanges was in a continued decline since the start of the bear market but has recently shown signs of turning around. The indicator has only registered a small increase so far, so it&#8217;s hard to say if it&#8217;s a sign of a trend taking shape or just a temporary deviation. Whatever the case, though, a development has happened in the Bitcoin market that can tip the favor towards the American platforms regardless. Related Reading: Chainlink Retests $14: Here’s What Will Happen If Support Holds Binance, the largest cryptocurrency exchange based on trading volume, has seen a leadership change following Changpeng Zhao&#8217;s resignation. The instability has kickstarted outflows from the exchange, while US-based Coinbase has enjoyed inflows. Thus, this may be the event that leads to a proper reversal in the BTC exchange reserve ratio. &#8220;If the recent regulations on CZ and Binance lead to an increase in the percentage of Bitcoin held on US exchanges, we will be ready for the next bull market,&#8221; notes the analyst. BTC Price Bitcoin has once again been trying to breach the $38,000 level today, as the chart below shows. BTC has registered some increase during the past day &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-24T16:43:53.000Z",
    "title": "Shiba Inu and Dogecoin’s Jaws Drop as Euler Network Brings in $3 Million",
    "url": "https://www.crypto-news-flash.com/shiba-inu-and-dogecoins-jaws-drop-as-euler-network-brings-in-3-million/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-and-dogecoins-jaws-drop-as-euler-network-brings-in-3-million",
    "description": "<img width=\"720\" height=\"405\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/17.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/17.png 720w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/17-300x169.png 300w\" sizes=\"(max-width: 720px) 100vw, 720px\" />In the world of cryptocurrency, missing out on lucrative opportunities can leave investors longing for the next big thing. If you&#8217;ve felt that pang of regret watching Shiba Inu and Dogecoin rise to prominence, fear not—Euler Network is here, and it&#8217;s set to be the next major money maker. With a staggering $3 million raised [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-24T16:55:00.000Z",
    "title": "Court Approves Terra’s Do Kwon Extradition to U.S. and South Korea",
    "url": "https://coinedition.com/court-approves-terras-do-kwon-extradition-to-u-s-and-south-korea/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Do-Kwon-Flees-to-UAE-After-a-Disgusting-Drama-Forkast-Reports.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Court Approves Terra’s Do Kwon Extradition to U.S. and South Korea\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Do-Kwon-Flees-to-UAE-After-a-Disgusting-Drama-Forkast-Reports.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Do-Kwon-Flees-to-UAE-After-a-Disgusting-Drama-Forkast-Reports-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Do-Kwon-Flees-to-UAE-After-a-Disgusting-Drama-Forkast-Reports-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Do-Kwon-Flees-to-UAE-After-a-Disgusting-Drama-Forkast-Reports-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Do-Kwon-Flees-to-UAE-After-a-Disgusting-Drama-Forkast-Reports-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Montenegro’s justice minister will decide on Do Kwon’s extradition. Do Kwon is serving a four-month prison term in the country for document forgery. A Montenegro court said requirements for Do Kwon’s extradition to the U.S. or South Korea have been met. Troubled Terraform Labs (TFL) founder Do Kwon’s extradition to either South Korea or the [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/court-approves-terras-do-kwon-extradition-to-u-s-and-south-korea/\">Court Approves Terra’s Do Kwon Extradition to U.S. and South Korea</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]