[
  {
    "source": "NewsBTC",
    "date": "2024-01-18T01:00:06.000Z",
    "title": "BNB Quarterly Burning: Over 2 Million Tokens Vanish, Valued At $636 Million",
    "url": "https://www.newsbtc.com/analysis/bnb/bnb-quarterly-burning-over-2-million-tokens-vanish-valued-at-636-million/",
    "description": "In a recent announcement by Binance, the BNB Foundation declared the successful completion of the 26th quarterly Binance Coin token burn through the BNB Chain. The burn, which included Auto-Burn and the Pioneer Burn Program, eliminated a significant amount of the exchange&#8217;s native token from circulation.  BEP95 Initiative Results In 210K BNB Permanently Burned During this latest burn event, the Auto-Burn process removed 2,141,487.27 BNB from circulation, equivalent to approximately $636 million in USD.  It is worth noting that the Auto-Burn mechanism operates independently of Binance&#8217;s centralized exchange (CEX), providing an auditable and objective process, according to the exchange’s statement.  Additionally, the Pioneer Burn Program contributed by removing 1542.15 tokens from circulation. This program permanently eliminates an amount of BNB equal to the provable lost funds of eligible users.  Related Reading: QCP Capital Forecasts ETH’s Dominance Over Bitcoin To Persist, Ethereum ETFs In Focus Since the introduction of BEP95, an estimated 210,000 tokens have been permanently burned under this mechanism. As announced, the Pioneer Burn Program helps maintain the integrity of the ecosystem and ensures that lost funds do not influence the circulating supply. Furthermore, BNB Chain&#8217;s Real-Time-Burn mechanism continuously reduces the token supply. This mechanism enables burning a portion of BNB Chain&#8217;s gas fees in real-time, further contributing to the ongoing supply reduction efforts. Completing the 26th quarterly BNB token burn marks another significant milestone for the BNB ecosystem. The independent Auto-Burn mechanism, combined with the Pioneer Burn Program and Real-Time-Burn mechanism, showcases BNB Chain&#8217;s approach to reducing token supply and fostering long-term value.  Robust User Adoption In addition to its quarterly token burn, BNB has recently displayed notable strength and progress, as revealed by Token Terminal&#8217;s on-chain data.  With a circulating market cap of $47.86 billion, BNB Chain has experienced a 30.45% increase in market capitalization. This surge in value reflects the growing confidence and demand for the token among investors.  BNB Chain&#8217;s financial metrics are equally impressive. The platform has witnessed a revenue growth of 30.47% over the past 30 days, generating $1.72 million in revenue during this period, as seen in the chart below.  Extrapolating this data to an annualized basis, the chain&#8217;s revenue is noteworthy at $20.96 million, reflecting solid financial stability and sustainable growth. The data from Token Terminal also highlights BNB Chain&#8217;s increasing user adoption and developer activity. The platform has seen a surge in active daily users, with a 30-day average of 1.42 million, representing a robust 48.6% growth.  Related Reading: SUI Overtakes Bitcoin, Aptos To Become 13th-Largest DeFi Network The Binance Coin price performance has been steady, with a 2.14% decrease over the past 24 hours, while showing a positive trend over more extended periods.  The token recorded a 4.38% increase in the past seven days, and over the past 30 days, it achieved an impressive growth of 30.51%. Furthermore, BNB&#8217;s performance over the past 180 days has been significant, with a growth rate of 29.92%. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-18T01:00:17.000Z",
    "title": "Trader Issues Warning on Solana Rival That’s Up 247% in One Month, Updates Outlook on LDO and One Other Altcoin",
    "url": "https://dailyhodl.com/2024/01/17/trader-issues-warning-on-solana-rival-thats-up-247-in-one-month-updates-outlook-on-ldo-and-one-other-altcoin/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/rival-up-outlook.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/rival-up-outlook.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/rival-up-outlook.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/rival-up-outlook.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/rival-up-outlook.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/rival-up-outlook.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/rival-up-outlook.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto strategist warns that a Solana (SOL) competitor that&#8217;s up more than 3x in the last 30 days is flashing signals that it may have printed a short-term top. The pseudonymous analyst known as Altcoin Sherpa tells his 205,700 followers on the social media platform X that while layer-1 blockchain Sei (SEI) [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/17/trader-issues-warning-on-solana-rival-thats-up-247-in-one-month-updates-outlook-on-ldo-and-one-other-altcoin/\">Trader Issues Warning on Solana Rival That’s Up 247% in One Month, Updates Outlook on LDO and One Other Altcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]