[
  {
    "source": "Decrypt",
    "date": "2024-02-23T01:37:18.000Z",
    "title": "Kraken Decries ‘Expansive New Theory’ Behind SEC Lawsuit, Calls for Dismissal",
    "url": "https://decrypt.co/218673/kraken-motion-to-dismiss-sec-case-securities",
    "description": "The crypto exchange says Gary Gensler's agency is trying to “commandeer expansive new authority over the U.S. economy.”"
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-23T01:32:46.000Z",
    "title": "Adam Back files previously unseen Satoshi Nakamoto emails in Craig Wright trial",
    "url": "https://cryptoslate.com/adam-back-files-previously-unseen-satoshi-nakamoto-emails-in-craig-wright-trial/",
    "description": "<p>Adam Back has submitted his early correspondence with Bitcoin creator Satoshi Nakamoto to a UK court as part of his testimony in the Crypto Open Patent Alliance (COPA) vs. Craig Wright trial on Feb. 22. Back is testifying against Wright, who claims to be the creator of Bitcoin and wants to assert a copyright claim [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/adam-back-files-previously-unseen-satoshi-nakamoto-emails-in-craig-wright-trial/\">Adam Back files previously unseen Satoshi Nakamoto emails in Craig Wright trial</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-23T01:30:25.000Z",
    "title": "Aave Joins Binance’s BNB Chain Ecosystem – Here’s How Users Benefit",
    "url": "https://www.newsbtc.com/analysis/bnb/aave-joins-binances-bnb-chain-ecosystem-heres-how-users-benefit/",
    "description": "In a significant development for the Binance Smart Chain (BSC) ecosystem, Aave (AAVE), one of the largest decentralized finance (DeFi) market protocols, has announced its integration with BNB Smart Chain. Aave joins prominent projects such as Uniswap, Ambit Finance, PancakeSwap, and Lista DAO. BNB Chain Welcomes Aave According to the announcement, this latest development opens up new opportunities for BNB Chain users, giving them access to what the protocol calls &#8220;top-tier lending platforms&#8221; and enhanced liquidity. With the launch of First Digital USD (FDUSD), users can now leverage &#8220;robust&#8221; liquidity, allowing them to explore different applications and opportunities in the Binance ecosystem. Related Reading: Fundstrat Exec Predicts Bitcoin Will Reach $150,000, Here’s When On the other hand, Aave users can now benefit from BNB Chain&#8217;s fees and the ability to integrate with one of the largest DeFi ecosystems, fostering increased collaboration between the two communities. The announcement also noted the following about the Aave integration: This not only complements but strategically aligns with BNB Chain&#8217;s 2024 outlook. Focused on mass adoption, high-frequency DeFi applications, and network efficiency improvements, the ecosystem is set for an exciting evolution. 2024 Goals Looking ahead, BNB Chain has set numerous goals for 2024. The introduction of opBNB &#8211; the Layer 2 (L2) scaling solution for the BNB Smart Chain &#8211; aims to achieve a transaction processing capacity of 10,000 transactions per second (TPS) by doubling the gas limit to 200 M/s. Enhanced security measures accompany this increase in capacity through multi-proof mechanisms. In addition, implementing Ethereum&#8217;s EIP4844 and Greenfield&#8217;s data availability upgrades will reduce gas fees by 5-10 times, providing users with a more cost-effective experience. In a move called &#8220;BNB Chain Fusion,&#8221; the BNB Beacon Chain will be merged with the BSC, further enhancing the efficiency and security of the network. The expansion of the number of validators, which will increase from 40 to 100 by 2024, is also expected to contribute to the stability of the network. Market Cap And Token Holders On The Rise According to Token Terminal data, the BNB chain has experienced significant growth, evidenced by several key metrics. Related Reading: Polygon Could See Bull Rally To $1.73 If This Happens: Analyst One notable metric is the fully diluted market cap, which stands at $75.71 billion, representing a significant increase of 23.9% over the past 30 days, highlighting the confidence in the protocol.  The circulating market cap, another crucial indicator, currently sits at $54.73 billion, showing a solid 11.6% growth over the same 30-day period.  On the other hand, the number of BNB token holders has shown a positive trend, reaching 113.51 million, with a significant increase of 3.5% in the last 30 days, demonstrating interest in the ecosystem. Featured image from Shutterstock, chart from TradingView.com"
  }
]