[
  {
    "source": "CoinDesk",
    "date": "2023-09-21T15:45:00.000Z",
    "title": "Top 3 Crypto Myths Tackled for Advisors",
    "url": "https://www.coindesk.com/business/2023/09/21/top-3-crypto-myths-tackled-for-advisors/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Christopher Jensen from Franklin Templeton tackles myths about crypto in the Crypto for Advisors newsletter."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-21T15:40:30.000Z",
    "title": "UK’s Financial Conduct Authority issues ‘final warning’ about upcoming marketing and disclosure rules",
    "url": "https://cryptoslate.com/uks-financial-conduct-authority-issues-final-warning-about-upcoming-marketing-and-disclosure-rules/",
    "description": "<p>U.K.&#8217;s Financial Conduct Authority (FCA) has issued its final warning to cryptocurrency firms about the upcoming financial promotions regime slated to begin in October. In a Sept. 21 letter, the financial regulator stated that all firms marketing crypto assets to U.K. consumers, including overseas firms, must comply with these regulations. The financial promotions regime outlines [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/uks-financial-conduct-authority-issues-final-warning-about-upcoming-marketing-and-disclosure-rules/\">UK&#8217;s Financial Conduct Authority issues &#8216;final warning&#8217; about upcoming marketing and disclosure rules</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T16:02:25.000Z",
    "title": "US presidential candidate Vivek Ramaswamy unveils crypto policy agenda",
    "url": "https://www.cryptopolitan.com/us-presidential-candidate-crypto-policy/",
    "description": "US Presidential candidate Vivek Ramaswamy made a significant announcement during his appearance at Messari’s Mainnet crypto conference, unveiling plans to develop a comprehensive crypto policy framework ahead of Thanksgiving. In a fireside chat with Messari CEO Ryan Selkis, Ramaswamy offered insights into his stance on cryptocurrencies, recent SEC rulings, and the role of crypto in ... <a title=\"US presidential candidate Vivek Ramaswamy unveils crypto policy agenda\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-presidential-candidate-crypto-policy/\" aria-label=\"More on US presidential candidate Vivek Ramaswamy unveils crypto policy agenda\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T15:48:00.000Z",
    "title": "Authors Guild v. OpenAI copyright infringement lawsuit takes a new turn",
    "url": "https://www.cryptopolitan.com/authors-guild-v-openai-copyright-lawsuit/",
    "description": "In a significant legal development, the Authors Guild, alongside thirteen prominent authors, has initiated a class-action lawsuit against OpenAI. The suit, filed in the Southern District of New York, alleges that OpenAI used copyrighted works without authorization as part of the training data for its large language model, ChatGPT. The Authors Guild and the plaintiffs ... <a title=\"Authors Guild v. OpenAI copyright infringement lawsuit takes a new turn\" class=\"read-more\" href=\"https://www.cryptopolitan.com/authors-guild-v-openai-copyright-lawsuit/\" aria-label=\"More on Authors Guild v. OpenAI copyright infringement lawsuit takes a new turn\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-21T15:45:41.000Z",
    "title": "IMX token jumped by 33% in a few hours, experts suspect market manipulation",
    "url": "https://crypto.news/imx-token-jumped-by-33-in-a-few-hours-experts-suspect-market-manipulation/",
    "description": "The price of the Immutable X blockchain project token jumped by 33% in a few hours, crypto experts claim this is a result of market manipulation. On the morning of Sept. 21, the IMX token rate increased by 32.56%, according&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-21T16:00:31.000Z",
    "title": "Binance & Deribit Traders Aggressively Short Bitcoin, Squeeze Incoming?",
    "url": "https://www.newsbtc.com/bitcoin-news/binance-deribit-traders-short-bitcoin-squeeze/",
    "description": "Data shows Bitcoin shorts have been piling up on cryptocurrency exchanges Binance and Deribit during the past few days. Bitcoin Funding Rates On Binance &#38; Deribit Are Deep Red Right Now According to data from the analytics firm Santiment, traders on the derivative market have continued to bet against the cryptocurrency recently. The relevant indicator here is the &#8220;funding rate,&#8221; which keeps track of the periodic fee that derivative contract holders on an exchange are paying each other right now. When this metric has a positive value, it means that the long traders are paying a premium to the short traders in order to hold onto their positions. Such a trend suggests that the majority sentiment on the given exchange is bullish currently. On the other hand, the metric being under the zero mark implies the traders on the platform hold a bearish mentality at the moment, as the shorts are the dominant force. Related Reading: Is Bitcoin Bull Run Coming Soon? What Network Fundamentals Say Now, here is a chart that shows the trend in the Bitcoin funding rates for Binance and Deribit over the past month: Looks like the value of the metric has been quite red in recent days &#124; Source: Santiment on X As displayed in the above graph, the Bitcoin funding rate for both of these exchanges had been mostly positive during the last third of August and the starting third of this month, implying that the majority of the traders had been longs. The bets of these holders had failed, however, as the price had seen an overall downtrend in this period. Since the rebound earlier this month, though, the sentiment has flipped in the market as shorts have piled up on both of these platforms. These short traders haven&#8217;t been successful so far, either, as the value of the cryptocurrency has seen net growth since they have appeared. Historically, the market has actually been more likely to go against the expectation of the majority, so this pattern may be in line with that. The reason why the asset would move against the bets of these contract holders is that mass liquidation events, called squeezes, become more likely to happen the more lopsided the sector is. A large amount of long liquidations can amplify crashes, while short liquidations can provide the fuel for upward surges. Since Bitcoin is still seeing aggressive shorting, it may be a positive sign for the cryptocurrency&#8217;s current price rise, as a potential short squeeze could help it extend further. Related Reading: Bitcoin May Not See Lasting Bullish Momentum Until This Happens Interestingly, while Bitcoin is being bet against right now, Ethereum&#8217;s funding rates are positive, as pointed out by analyst James V. Straten in a post on X. The two metrics have diverged recently &#124; Source: @jimmyvs24 on X From the graph, it&#8217;s visible that the funding rates of the top two assets in the sector have gone opposite ways recently. This means that while BTC may be able to build an uptrend off the shorts, ETH could face the opposite effect if the longs end up being liquidated. BTC Price Bitcoin has seen a drawdown of about 1.5% today as the asset&#8217;s price has now dropped towards the $26,700 level. BTC is still overall up in the past week &#124; Source: BTCUSD on TradingView Featured image from Yiğit Ali Atasoy on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-21T16:00:44.000Z",
    "title": "Safemoon Holders Can Finally Profit From The Crypto Markets With This New 100X Bitcoin Alternative",
    "url": "https://www.crypto-news-flash.com/safemoon-holders-can-finally-profit-from-the-crypto-markets-with-this-new-100x-bitcoin-alternative/?utm_source=rss&utm_medium=rss&utm_campaign=safemoon-holders-can-finally-profit-from-the-crypto-markets-with-this-new-100x-bitcoin-alternative",
    "description": "<img width=\"512\" height=\"307\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-132.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-132.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-132-300x180.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-132-336x200.png 336w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Cryptocurrencies have turned the financial system around, allowing investors to enter a decentralized and fast-evolving market. Safemoon is one of such cryptocurrencies that has caught the attention of many. In this article, we will explore what Safemoon is, whether it&#8217;s a good investment, and introduce a compelling alternative, Bitcoin Spark, that can provide Safemoon holders [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-21T15:50:29.000Z",
    "title": "Hedera (HBAR) Powers HashPack Wallet’s Web3 Revolution for 40 Million Customers",
    "url": "https://www.crypto-news-flash.com/hedera-hbar-powers-hashpack-wallets-web3-revolution-for-40-million-customers/?utm_source=rss&utm_medium=rss&utm_campaign=hedera-hbar-powers-hashpack-wallets-web3-revolution-for-40-million-customers",
    "description": "<img width=\"1280\" height=\"731\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/02/divewallet_1645550815jHBoOQoXiG.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/02/divewallet_1645550815jHBoOQoXiG.jpeg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2022/02/divewallet_1645550815jHBoOQoXiG-300x171.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/02/divewallet_1645550815jHBoOQoXiG-1024x585.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/02/divewallet_1645550815jHBoOQoXiG-768x439.jpeg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/02/divewallet_1645550815jHBoOQoXiG-24x14.jpeg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/02/divewallet_1645550815jHBoOQoXiG-36x21.jpeg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/02/divewallet_1645550815jHBoOQoXiG-48x27.jpeg 48w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />HashPack Wallet announces a partnership with Sphera World and Kooora.com as part of its effort to expand into Web3. HashPack wallet is based on the Hedera Hashgraph DLT (Distributed Ledger Technology) platform.  A non-custodial wallet, HashPack, which is built on the Hedera Hashgraph DLT (Distributed Ledger Technology) platform has announced a strategic partnership with a [...]"
  }
]