[
  {
    "source": "Decrypt",
    "date": "2023-08-17T22:50:38.000Z",
    "title": "Bitcoin, Ethereum Flash Crash Triggers $800 Million in Liquidations",
    "url": "https://decrypt.co/152872/bitcoin-ethereum-flash-crash-triggers-800-million-liquidations",
    "description": "Bitcoin crashed hard on Thursday afternoon, dipping below $26,000. The rest of the crypto market followed suit—as did the liquidations."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-17T23:00:45.000Z",
    "title": "Federal Reserve shuts down Farmington Bank over unapproved stablecoin project",
    "url": "https://cryptoslate.com/federal-reserve-shuts-down-farmington-bank-over-unapproved-stablecoin-project/",
    "description": "<p>The Federal Reserve took action against Farmington State Bank on Aug. 17, asserting the bank took on a stablecoin strategy without notifying supervisors or gaining approval. The U.S. government agency said that it approved Farmington&#8217;s application to become a bank holding company in 2020, at which time it imposed certain conditions on the bank and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/federal-reserve-shuts-down-farmington-bank-over-unapproved-stablecoin-project/\">Federal Reserve shuts down Farmington Bank over unapproved stablecoin project</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T22:43:26.000Z",
    "title": "Hello, bear market – Bitcoin price falls below $26K for the first time in 2 months",
    "url": "https://www.cryptopolitan.com/bitcoin-price-falls-below-26k-in-2-months/",
    "description": "After several days of declining prices, Bitcoin (BTC) fell 9% in less than 10 minutes to temporarily dip below $26,000. According to CoinGecko, the BTC price was hovering around $27,600 at 9:30 p.m. UTC on August 17 before falling more than 8% to $25,320 at the time of writing. According to reports, Bitcoin fell on ... <a title=\"Hello, bear market &#8211; Bitcoin price falls below $26K for the first time in 2 months\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-falls-below-26k-in-2-months/\" aria-label=\"More on Hello, bear market &#8211; Bitcoin price falls below $26K for the first time in 2 months\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-17T23:00:48.000Z",
    "title": "Why Is Dogecoin Price Down Today?",
    "url": "https://www.newsbtc.com/analysis/doge/why-is-dogecoin-price-down-today/",
    "description": "The Dogecoin price is down around 5% in the last day following the general market crash. The meme coin which had seen improved sentiment did a quick 180 and started to bleed. However, while the Dogecoin price could only be following Bitcoin’s descent, are there other factors driving the decline? Why Is Dogecoin Price Falling? One reason that the Dogecoin price is down today is due to its proximity to Shiba Inu. The latter saw a highly anticipated Shibarium launch go awry on Wednesday, sparking rapid declines among the meme coins in its ecosystem. Related Reading: Can Ethereum Price Cross $2,000 Before The End Of August? As a result of this unfortunate event, the price of SHIB fell almost 10% in a matter of hours and this seemed to have spilled over to Dogecoin. Dogecoin, being a meme coin and the largest competitor for Shiba Inu, was expected to rally if SHIB had gone up as a result of the Shibarium launch. There is also the issue of competition expected between Dogechain and Shibarium, further fueling this correlation. The problem with such correlations is that they tend to follow the same negative, as well as positive, path. Given this, when the price of Shiba Inu started to fall, Dogecoin followed suit with the expectations that both of these assets would go in the same direction. DOGE price falls alongside SHIB in volatile market conditions &#124; Source: DOGEUSD on Tradingview.com Additionally, DOGE, being one of the top 10 largest-crypto in the space, often tracks the performance of Bitcoin quite closely. So as Bitcoin declined off the back of the FOMC meeting, Dogecoin was hit with a double-decker bus, plunging it deep into the red territory. Can DOGE Price Recover From Here? It is not all bad news for Dogecoin according to crypto analyst “Tony The Bull.” In a recent analysis, he points out that DOGE had tagged the 1-month parabolic SAR. Now, this is notable because the last time the meme coin touched this level was back in 2021. DOGE tags 1M Parabolic SAR &#124; Source: Tony The Bull on X The result of this was that DOGE’s price went from $0.0018 to over $0.7. This translated to an over 24,000% increase at the time. So it stands to reason that if the altcoin is tagging this 1M parabolic SAR again, then there could be a rally in the near future. Related Reading: Will Bitcoin Price Crash Similarly To 2019 And 2020? However, it is unlikely that the price of DOGE will actually rise more than $50 at this level. This is because the crypto market is still in peak bear season while 2021 was peak bull season. Nevertheless, a rally toward $0.09 is not out of the question. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  }
]