[
  {
    "source": "CoinDesk",
    "date": "2024-01-30T13:19:32.000Z",
    "title": "First Mover Americas: Bitcoin Eclipses $43K Having Gained Nearly 10% in a Week",
    "url": "https://www.coindesk.com/markets/2024/01/30/first-mover-americas-bitcoin-eclipses-43k-having-gained-nearly-10-in-a-week/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin [BTC] and crypto markets in context for Jan. 30, 2024. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-30T13:31:42.000Z",
    "title": " Binance’s market share rebounds post $4.3B U.S. settlement deal ",
    "url": "https://cointelegraph.com/news/binance-market-share-recovery-post-us-settlement",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMmFjYTA1OWUtMjQxNC00MjY3LWI4MzEtMzcwZjgxNGI0NTc3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A Binance spokesperson said that it’s putting its focus on its users as it moves into a new chapter. </p>\n                    <p><p data-ct-non-breakable=\"true\">Crypto exchange Binance has started to recover its trading volume market share months after settling its case with the United States Department of Justice and paying a $4.3 billion settlement fine.</p><p>According to data from crypto research firm Kaiko, Binance’s trading volume market share rose to 49% two months after the exchange settled its case with U.S. regulators. The uptick follows multi-year lows as the exchange navigated its legal issues. </p><p>On Nov. 21, U.S. officials <a href=\"https://cointelegraph.com/news/us-officials-announce-binance-settlement\">announced a $4.3 billion settlement</a> with Binance. Attorney General Merrick Garland said in a press release that the amount would cover “civil regulatory enforcement actions” by government departments, including the Treasury and Commodity Futures Trading Commission (CFTC)</p><p><a href=\"https://cointelegraph.com/news/binance-market-share-recovery-post-us-settlement\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-30T13:20:18.000Z",
    "title": "Grayscale crypto holdings up $1.2 billion since last week as Bitcoin surges",
    "url": "https://cryptoslate.com/insights/grayscale-crypto-holdings-up-1-2-billion-since-last-week-as-bitcoin-surges/",
    "description": "<p>Following a persistent decline in Bitcoin outflows from the Grayscale Bitcoin ETF, Bitcoin&#8217;s recent surge from $39,900 to over $43,500 has seen the value of Grayscale&#8217;s crypto holdings grow by $1.25 billion since the end of last week. While roughly 18,000 BTC has left the fund since Friday, as per Arkham Intelligence data, the price [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/grayscale-crypto-holdings-up-1-2-billion-since-last-week-as-bitcoin-surges/\">Grayscale crypto holdings up $1.2 billion since last week as Bitcoin surges</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-30T13:22:47.000Z",
    "title": "Abracadabra Finance suffers $6.5 million exploit, MIM stablecoin crashes to $0.76",
    "url": "https://cryptobriefing.com/abracadabra-finance-suffers-6-5-million-exploit-mim-stablecoin-crashes-076/?utm_source=feed&utm_medium=rss",
    "description": "The threat actors behind the attack targeted a vulnerability in Abracadabra's lending and borrowing smart contracts."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-30T13:25:10.000Z",
    "title": "‘The Dollar Is Finished As the World’s Reserve Currency,’ Says Renowned Financial Analyst",
    "url": "https://www.cryptoglobe.com/latest/2024/01/the-dollar-is-finished-as-the-worlds-reserve-currency-says-renowned-financial-analyst/",
    "description": "Richard X. Bove, a distinguished financial analyst with over five decades of experience, recently made a striking declaration about the future of the U.S. dollar. Accordg to a report by Rob Copeland for The New York Times (NYT) published on January 27, in an interview following his retirement announcement, Bove, known for his candid and […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-30T13:38:43.000Z",
    "title": "How Do Arbitrum (ARB) and Chainlink (LINK) Investors Justify their Incredible Kelexo (KLXO) Interest?",
    "url": "https://cryptodaily.co.uk/2024/01/how-do-arbitrum-arb-and-chainlink-link-investors-justify-their-incredible-kelexo-klxo-interest",
    "description": "As an investor in the crypto market, one must always be forward-thinking. Renowned projects like Arbitrum (ARB) and Chainlink (LINK) are faltering."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-30T13:31:02.000Z",
    "title": "Toncoin (TON) and Litecoin (LTC) Receive a Neutral Rating Monday: Holders Jump Ship to DeeStream (DST)",
    "url": "https://cryptodaily.co.uk/2024/01/toncoin-ton-and-litecoin-ltc-receive-a-neutral-rating-monday-holders-jump-ship-to-deestream-dst",
    "description": "How's the market today? We help you find out and stay informed of all the recent details and crypto news to assist you in making the right investment choices. We dive into the facts, figures and finances to uncover how specific tokens are coming along."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-30T13:26:10.000Z",
    "title": "Why DeeStream (DST) is predicted to be the best investment of 2024 as Tether (USDT) and USD Coin (USDC) holders join",
    "url": "https://cryptodaily.co.uk/2024/01/why-deestream-dst-is-predicted-to-be-the-best-investment-of-2024-as-tether-usdt-and-usd-coin-usdc-holders-join",
    "description": "Stablecoins play a crucial role in the ever-changing world of crypto as a bridge between traditional and decentralized finance."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-30T13:24:23.000Z",
    "title": "Socrates Announces Light of Debate Season 2 Airdrop",
    "url": "https://cryptodaily.co.uk/2024/01/socrates-announces-light-of-debate-season-2-airdrop",
    "description": "Socrates Announces Light of Debate Season 2 Airdrop"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-30T13:20:54.000Z",
    "title": "Ethereum (ETH) Millionaire buys into the Kelexo (KLXO) presale while Bitcoin (BTC) drops",
    "url": "https://cryptodaily.co.uk/2024/01/ethereum-eth-millionaire-buys-into-the-kelexo-klxo-presale-while-bitcoin-btc-drops",
    "description": "With a major liquidation of Ethereum (ETH) tokens from bankrupt lender Celsius in the process, Ethereum (ETH) holders are looking for projects to diversify their portfolios ahead of what could be more turbulence."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-30T13:30:17.000Z",
    "title": "GBTC Holdings Dip Below 500K BTC as Rivals Ramp up Accumulation",
    "url": "https://news.bitcoin.com/gbtc-holdings-dip-below-500k-btc-as-rivals-ramp-up-accumulation/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/btcout-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/btcout-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/btcout-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/btcout-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/btcout-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/btcout-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/btcout-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/btcout.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The latest data from Grayscale&#x2019;s GBTC reveals that the trust&#x2019;s bitcoin holdings have diminished to below 500,000, following a departure of 6,138.79 bitcoin from its reserves in the past day. Conversely, Blackrock&#x2019;s IBIT has bolstered its bitcoin assets by 4,603.24 bitcoin, valued at $199 million. GBTC&#x2019;s Bitcoin Holdings Wane as Competing Funds Increase Their Caches [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-30T13:22:39.000Z",
    "title": "Unlocking the Potential of AI in Pharma Marketing: Developing Essential Human Skills",
    "url": "https://www.cryptopolitan.com/the-potential-of-ai-in-pharma-marketing/",
    "description": "Artificial Intelligence (AI) has become a buzzword in the pharmaceutical industry, promising to revolutionize marketing strategies. However, many organizations still hesitate to fully embrace AI-driven solutions due to perceived risks and uncertainties. In the eye of this impending storm, pharmaceutical marketers must prepare for the inevitable AI integration.&#160; The current state of AI in pharma [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-30T13:20:57.000Z",
    "title": "Analysts place Bitcoin’s price at $170K after BTC halving",
    "url": "https://www.cryptopolitan.com/analysts-place-bitcoin-price-at-170k-halving/",
    "description": "As Bitcoin enthusiasts eagerly await the next halving event, analysts have been fervently crunching numbers and delving into historical trends to formulate predictions on where the crypto giant&#8217;s price might be headed. Their findings have given rise to bold projections, with some industry experts placing BTC&#8217;s price at an impressive $170,000 post the upcoming halving. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-30T13:15:31.000Z",
    "title": "Peugeot Boosts EV Confidence with Allure Care Warranty and ChatGPT Integration",
    "url": "https://www.cryptopolitan.com/peugeot-boosts-ev-confidence/",
    "description": "Peugeot, a prominent European automaker, has made significant announcements during its E-Lion Day 2024 event, marking a pivotal moment for the company&#8217;s commitment to electric vehicles (EVs) and innovative technology integration.&#160; The event unveiled an industry-leading eight-year/100,000-mile warranty program called &#8220;Peugeot Allure Care,&#8221; designed to instill confidence in customers considering the switch to electric vehicles. [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-30T13:37:39.000Z",
    "title": "RAYDIUM PRICE ANALYSIS & PREDICTION (January 30) – Ray Remains Up In Three Months Despite Weeks Of Correction, Signals Bullish",
    "url": "https://nulltx.com/raydium-price-analysis-prediction-january-30-ray-remains-up-in-three-months-despite-weeks-of-correction-signals-bullish/",
    "description": "Despite losing some chunks of dollars in the last couple of weeks, Radium&#8217;s price is still up by a staggering 550% in 90 days as it sits above a key support level. It resurged this week and saw a rejection few hours ago. The Solana-based automated market makes (AMM) and [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-30T13:32:40.000Z",
    "title": "Dogecoin, Shiba Inu and Sponge meme coins rallying",
    "url": "https://crypto.news/dogecoin-shiba-inu-and-sponge-meme-coins-rallying/",
    "description": "Dogecoin, Shiba Inu, and Sponge meme coins are rallying. The uptrend will likely continue, especially for SPONGEV2"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-30T13:30:11.000Z",
    "title": "Shiba Inu Burn Rate Surges Over 1,400%, As Price Recovers",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-burn-rate-surges-over-1400-as-price-recovers/",
    "description": "Shiba Inu, an Ethereum-based meme coin, is presently in the limelight as its burn initiative has witnessed a significant surge in its token burn rate in the past day, suggesting increased engagement from the community. Shiba Inu Daily Burn Rate Skyrockets Data from Shibburn reveals that the last 24 hours have seen a notable spike in the Shiba Inu burn rate. The tracker reported that the burn rate has recorded a massive 1,411% increase today, January 30. According to the platform, over 61 million SHIB tokens have been incinerated in the last 24 hours. The increase in burn rate coincides with a recent rally in the price of Shiba Inu. Related Reading: Shiba Inu Burn Rate Skyrockets Over 300% As Price Sheds A Zero Shibburn shows that the present rise in burn rate was caused by two large burn transactions. It was discovered that the two transactions destroyed a total of 48.9 million SHIB in less than one hour. The first transaction orchestrated by the wallet address 0x85a860003705c56&#8230;7eb2f4bcc7 witnessed about 21 million SHIB being destroyed. Meanwhile, the second transaction carried out by another wallet address 0x85a860003705c56&#8230;7eb2f4bcc7 saw over 27 million SHIB tokens being burned. The Shiba Inu burn rate might have been up in the past day, but in the past week, the rate appears to have been down. From the hourly SHIB burn update on X (formerly Twitter), the rate is down by over 48% in the past week. Furthermore, the report noted that over 113.42 million Shiba Inu tokens have been destroyed in the past seven days. Even though tokens have been burned virtually every day for more than a year now, the burn rate has not made a crater in the supply that is in circulation. So far, Shiba Inu has burned over 410.70 trillion SHIB since the initiative was introduced.  Currently, the overall supply in circulation is about 581.29 trillion SHIB. This indicates more work to be done by the SHIB community before the incineration has a weighty effect. SHIB Prices Recovers Amid Burn Rate Rise Shiba Inu price, as of today, appears to have recovered from a lengthy bearish trend it has been struggling with. However, there is no solid proof that the rise in burn rate had any impact on the crypto asset&#8217;s recent rally. Related Reading: Shiba Inu Price Enters Most Crucial Week In 1.5 Years, Here’s Why As of the time of writing, the price of Shiba Inu was sitting at $0.000009254, indicating a 2.24% rise in the past 24 hours. CoinMarketCap reveals that its market cap and trading volume are up by 2.19% and 45.16% in the past day. Furthermore, the digital asset is now ranked 17th overall in terms of market cap due to its recent price recovery. With the recovery, SHIB has attracted attention from investors and sparked fresh sentiments over possible long-term growth. Featured image from iStock, chart by Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-30T13:38:35.000Z",
    "title": "Increase in Dogecoin Addresses Suggests Possible Growth in Market Value",
    "url": "https://www.crypto-news-flash.com/increase-in-dogecoin-addresses-suggests-possible-growth-in-market-value/?utm_source=rss&utm_medium=rss&utm_campaign=increase-in-dogecoin-addresses-suggests-possible-growth-in-market-value",
    "description": "<img width=\"1200\" height=\"600\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-rudolfs-klintsons-7767506.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"dogecoin-memecoin\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-rudolfs-klintsons-7767506.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-rudolfs-klintsons-7767506-300x150.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-rudolfs-klintsons-7767506-768x384.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-rudolfs-klintsons-7767506-150x75.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-rudolfs-klintsons-7767506-450x225.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />1,100% increase in new Dogecoin addresses in one week, according to analyst Ali Martinez, indicating growing interest. Potential impact of Dogecoin&#8217;s growth on its price: community speculates on reaching the value of $0.1 per coin. The memecoin Dogecoin (DOGE) is in the spotlight of the cryptocurrency market, due to a surprising increase in the number [...]"
  }
]