[
  {
    "source": "Cointelegraph",
    "date": "2024-02-09T17:35:00.000Z",
    "title": " Governance poses threat to 75% of top tokens — Report ",
    "url": "https://cointelegraph.com/news/governance-poses-threat-75-percent-top-tokens-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZmIxOTNjNWItZGNkMi00MzEyLTlkZTAtZTg4NTEwYjhmY2UzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>An analysis by Web3 firm De.Fi shows that nearly 75% of the top tokens by volume feature governance risk factors.</p>\n                    <p><p>A bulk of the largest tokens by volume face significant governance risks, failing to follow best practices to prevent exploits and other security threats. </p><p>According to an analysis from Web3 firm De.Fi, of the 429 tokens with governance frameworks, nearly 75% have risk factors associated with their contracts, including hidden owners and wallets with special permissions.</p><p>Only 16.6% of the analyzed contracts are managed by multisig wallets, which require up to five different private keys to approve any transaction. The application is seen as a tool for reducing phishing and malware-based hacking risks, notes the report. </p><p><a href=\"https://cointelegraph.com/news/governance-poses-threat-75-percent-top-tokens-report\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-09T17:23:53.000Z",
    "title": " Bitcoin shorts should brace to ‘get squeezed’ as BTC price eyes $50K ",
    "url": "https://cointelegraph.com/news/bitcoin-shorts-get-squeezed-btc-price-eyes-50k",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMDBmNGE2OTgtNWVmZi00MzIxLTk4MmYtZGYzNjA2MTY2OWEwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin may be consolidating after 6% daily gains, but the potential for runaway BTC price upside is there, says analysis.</p>\n                    <p><p data-ct-non-breakable=\"true\">Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) took a rain check on snap upside at the Feb. 9 Wall Street open as 24-hour gains hit 6%.</p><p data-ct-non-breakable=\"true\">Data from <a href=\"https://subscription.cointelegraph.com/\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> showed BTC price trajectory retracing after reaching $47,700.</p><p>The move, driven by spot markets, <a href=\"https://cointelegraph.com/news/bitcoin-price-46k-sp-500-historic-highs\">barely stopped for breath overnight</a> as successive Asia and United States trading sessions posed little problem for bulls.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-shorts-get-squeezed-btc-price-eyes-50k\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-09T17:13:20.000Z",
    "title": " Former SEC official compares Dallas Mavericks’ Voyager partnership to heroin ",
    "url": "https://cointelegraph.com/news/sec-official-nba-voyager-digital-heroin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMjEzYjJkNWUtYzZhZi00NzJmLTk1MmUtNzZkYTY5YzdjZDU3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>John Reed Stark suggested the NBA should prohibit crypto sponsorships, just as if a team partnered with “a heroin manufacturing firm or a blood diamond mining company.”</p>\n                    <p><p>John Reed Stark, the former internet enforcement chief for the United States Securities and Exchange Commission (SEC), has sided with aggrieved crypto investors in a lawsuit against the National Basketball Association (NBA).</p><p>In a Feb. 8 X post, Stark <a href=\"https://twitter.com/JohnReedStark/status/1755594335888826462\" target=\"_blank\" rel=\"noopener nofollow\">criticized</a> the NBA for approving a partnership between defunct cryptocurrency exchange Voyager Digital and the Dallas Mavericks, resulting in a class-action lawsuit from investors. The partnership between Voyager and the NBA team, announced in October 2021, came as the crypto exchange allegedly made false claims regarding investor protection. </p><p>“[In my humble opinion], by partnering with Voyager, the Mavs not only shamelessly exploited their fans and players by shilling crypto FOMO and diamond hands, but the Mavs also share culpability for the devastation that Voyager wreaked upon its investors,” said Stark. “Think of it this way: if the Washington Wizards decided to partner with a heroin manufacturing firm or a blood diamond mining company, the NBA would certainly step in and prohibit that arrangement. The same should go for crypto-partnerships.”</p><p><a href=\"https://cointelegraph.com/news/sec-official-nba-voyager-digital-heroin\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-09T17:32:44.000Z",
    "title": "WazirX CEO Advocates for CBDC Integration on Public Blockchains to Address Stablecoin Concerns",
    "url": "https://www.cryptopolitan.com/wazirx-ceo-advocates-for-cbdc-integration-on-public-blockchains-to-address-stablecoin-concerns/",
    "description": "In an era where digital currencies are becoming increasingly central to the global financial ecosystem, Nishchal Shetty, the visionary CEO and Founder of WazirX, India&#8217;s premier cryptocurrency exchange, has stepped forward with a compelling proposition.  Shetty is championing the integration of Central Bank Digital Currencies (CBDCs) onto public blockchains as a strategic move to counteract [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-09T17:10:00.000Z",
    "title": "Tron Price Prediction 2024-2033: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2024-2033 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network. TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-09T17:31:31.000Z",
    "title": "EigenLayer’s TVL nears $6b, enters top 5 defi protocols",
    "url": "https://crypto.news/eigenlayer-tvl-6-billion-enters-top-5-defi-protocols/",
    "description": "EigenLayer's TVL surged to nearly $6 billion, making it a top five DeFi protocol after lifting deposit caps temporarily."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-09T17:15:00.000Z",
    "title": "PEPE is stable but bullish, traders flow to Solana meme coins",
    "url": "https://crypto.news/pepe-is-stable-but-bullish-traders-flow-to-solana-meme-coins/",
    "description": "PEPE is stable but bullish, looking at price charts. Meanwhile, Solana meme coins like SMOG are being watched by investors"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-09T17:31:51.000Z",
    "title": "Litecoin Surges with 2-Month High RSI, Defying Altcoin Struggles: Analysis",
    "url": "https://www.crypto-news-flash.com/litecoin-surges-with-2-month-high-rsi-defying-altcoin-struggles-analysis/?utm_source=rss&utm_medium=rss&utm_campaign=litecoin-surges-with-2-month-high-rsi-defying-altcoin-struggles-analysis",
    "description": "While Litecoin (LTC) has been described as an underperformer compared to new flashy layer one and layer two coins, the altcoin is on the cusp of breaking out of a macro-falling logarithmic trend. Litecoin price has continued to consolidate since 2018 to date despite having experienced two halvings that have reduced its annual inflation. Litecoin [...]"
  }
]