[
  {
    "source": "CoinDesk",
    "date": "2023-08-08T05:54:04.000Z",
    "title": "Huobi Receives $200M USDT, $9M Ether From Whale",
    "url": "https://www.coindesk.com/markets/2023/08/08/huobi-receives-200m-usdt-9m-ether-from-whale/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Transfers occur as outflows from exchange continue."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-08T06:00:00.000Z",
    "title": "Solana-based Cypher Protocol Suffers $1M Exploit",
    "url": "https://cryptodaily.co.uk/2023/08/solana-based-cypher-protocol-suffers-1m-exploit",
    "description": "<p class=\"md-end-block md-p\">Cypher Protocol, a decentralized futures exchange operating on the Solana blockchain, disclosed on August 7th that a significant security breach occurred on their platform.</p>\n<p class=\"md-end-block md-p md-focus\">The breach led to an estimated unauthorized transfer of assets valued at around $1 million. Swiftly addressing the event, Cypher Protocol informed its community of followers on X (formerly Twitter) and took immediate action by freezing its associated smart contract.</p>\n<p class=\"md-end-block md-p\">A statement from the firm emphasized their responsive action:</p>\n\n<p class=\"md-end-block md-p\">\"Cypher has experienced a security incident. The smart contract has been frozen. Investigations are ongoing. The team is currently working with individuals and investigating. To the hacker: We are writing to see whether you would be open to speaking with us about any potential next steps.\"</p>\n\n<p class=\"md-end-block md-p\">Data sourced from the Solana blockchain explorer, Solscan, has been invaluable in providing insights into the breach. It appears that the attacker or attackers absconded with a considerable 38,530 Solana (SOL) tokens in addition to $123,184 USD Coin (USDC). In sum, these unauthorized transactions amounted to roughly $1,035,203. </p>\n<p class=\"md-end-block md-p\">What has raised eyebrows in the aftermath of the breach was the movement of the alleged funds. Within a short span following the exploit, a sum of 30,000 USDC from the contentious wallet was rerouted to Binance&rsquo;s specific Solana USDC address. The rapidity of these fund movements highlights the speed at which digital assets can change hands, emphasizing the need for robust security measures and real-time monitoring.</p>\nCommunity Response and Calls for Accountability\n<p class=\"md-end-block md-p\">The aftermath of the exploit was punctuated by unique, digital-era responses. Members from the cryptocurrency community sent a series of NFTs to the suspected wallet. These weren&rsquo;t typical assets, but they bore messages &ndash; some of which appealed to the hacker's conscience to return the stolen funds. Among the various messages, one read:</p>\n\n<p class=\"md-end-block md-p\">\"Seriously though, you used Binance and KuCoin to fund and to try and get 30k out. People will find you. Please do the right thing and give the rest back.\"</p>\n\n<p class=\"md-end-block md-p\">The timing of this security breach was rather inopportune, as it coincided with Cypher Protocol&rsquo;s collaborative mtnDAO hacker house event, which they co-hosted with another Solana protocol, Marginfi. Ensuring clarity and dispelling doubts about their own security, Marginfi swiftly relayed via their Telegram channel that they remained unaffected by the breach and continue to maintain their operational independence from Cypher.</p>\n<p class=\"md-end-block md-p\">As of the time of reporting, no Solana-based funds have been detected as transferred to the Ethereum network, leaving the next steps of the alleged hacker unpredictable.</p>\n<p class=\"md-end-block md-p\">Incidents like these not only impact the entities directly involved but also reverberate throughout the crypto community. They underscore the persistent challenges in the realm of digital security and emphasize the need for continuous improvements in safeguarding digital assets.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T05:55:12.000Z",
    "title": "Decentralized Exchange Cypher Protocol falls victim to $1 million security breach",
    "url": "https://www.cryptopolitan.com/decentralized-exchange-cypher-protocol-falls-victim-to-1-million-security-breach/",
    "description": "Decentralized futures exchange Cypher Protocol, operating on the Solana blockchain, has been forced to halt its smart contract after falling victim to an estimated $1 million exploit. The incident, which took place on August 7, resulted in freezing the smart contract as a security measure. The Cypher team immediately informed its community about the security ... <a title=\"Decentralized Exchange Cypher Protocol falls victim to $1 million security breach\" class=\"read-more\" href=\"https://www.cryptopolitan.com/decentralized-exchange-cypher-protocol-falls-victim-to-1-million-security-breach/\" aria-label=\"More on Decentralized Exchange Cypher Protocol falls victim to $1 million security breach\">Read more</a>"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-08T05:45:10.000Z",
    "title": "Crypto Influencer Projects Bearish Momentum for BTC and XRP",
    "url": "https://coinedition.com/crypto-influencer-projects-bearish-momentum-for-btc-and-xrp/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Mixed-Reactions-Over-Bets-of-BTC-Hitting-1M-and-XRP-Reaching-589.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Mixed Reactions Over Bets of BTC Hitting $1M and XRP Reaching $589\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Mixed-Reactions-Over-Bets-of-BTC-Hitting-1M-and-XRP-Reaching-589.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/Mixed-Reactions-Over-Bets-of-BTC-Hitting-1M-and-XRP-Reaching-589-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Mixed-Reactions-Over-Bets-of-BTC-Hitting-1M-and-XRP-Reaching-589-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Mixed-Reactions-Over-Bets-of-BTC-Hitting-1M-and-XRP-Reaching-589-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Mixed-Reactions-Over-Bets-of-BTC-Hitting-1M-and-XRP-Reaching-589-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/Mixed-Reactions-Over-Bets-of-BTC-Hitting-1M-and-XRP-Reaching-589-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Popular crypto influencer BitBoy Crypto believes that Bitcoin (BTC) and Ripple (XRP) will witness a price decline this month. According to him, BTC may fall as low as $25,000, while XRP may sink to $0.55 before the cryptocurrencies see a reversal and rally to new local highs. The influencer also projected bearish momentum for Shiba [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-influencer-projects-bearish-momentum-for-btc-and-xrp/\">Crypto Influencer Projects Bearish Momentum for BTC and XRP</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]