[
  {
    "source": "CoinDesk",
    "date": "2024-03-14T20:43:55.000Z",
    "title": "Ether ETFs Could Be Bigger Than Bitcoin ETFs, Says VanEck",
    "url": "https://www.coindesk.com/business/2024/03/14/ether-etfs-could-be-bigger-than-bitcoin-etfs-says-vaneck/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The issuer of the VanEck Bitcoin Trust this week dropped its management fee to zero for a limited time in an attempt to attract more capital to that fund."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-14T20:43:23.000Z",
    "title": "Craig Wright Was Finally Called Out in Court and Hodlonaut Is Celebrating",
    "url": "https://www.coindesk.com/consensus-magazine/2024/03/14/craig-wright-was-finally-called-out-in-court-and-hodlonaut-is-celebrating/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "“It hasn't always been easy, but I'm very happy that I stood my ground,” says Hodlonaut of his long legal fight with Craig Wright, who claimed, falsely, to be Satoshi Nakamoto."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-14T20:40:18.000Z",
    "title": "A $300M Ponzi Scheme That Targeted Latinos Falsely Claimed to Buy Crypto, SEC Says",
    "url": "https://www.coindesk.com/policy/2024/03/14/a-300m-ponzi-scheme-that-targeted-latinos-falsely-claimed-to-buy-crypto-sec-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Securities and Exchange Commission sued 17 individuals tied to an alleged Ponzi scheme that took in $300 million from over 40,000 victims."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-14T21:01:02.000Z",
    "title": "'MadWorld' Mobile NFT Shooter Launches in Early Access as Studio Raises $13 Million",
    "url": "https://decrypt.co/221788/madworld-mobile-nft-shooter-early-access-carbonated-raises-13-million",
    "description": "Carbonated Inc. reveals backing by Andreessen Horowitz and Com2uS as its iOS and Android game MadWorld begins testing."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-14T20:49:23.000Z",
    "title": " Lazarus Group moves $12M from HTX, HECO hacks to Tornado Cash  ",
    "url": "https://cointelegraph.com/news/lazarus-group-moves-12-million-htx-heco-hacks-tornado-cash",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNWJiMjE2NWYtYTVlMS00NmMxLTg1MjctOTJmYTU3OTNkZjcwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Despite U.S. sanctions, North Korea’s Lazarus Group has resumed laundering stolen crypto funds through Tornado Cash.</p>\n                    <p><p>North Korea’s Lazarus Group has resumed using Tornado Cash to launder funds stolen from hacks, despite sanctions against the crypto mixer. </p><p>According to on-chain activity <a href=\"https://www.elliptic.co/blog/north-korean-hackers-return-to-tornado-cash-despite-sanctionshttps://www.elliptic.co/blog/north-korean-hackers-return-to-tornado-cash-despite-sanctions\" target=\"_blank\" rel=\"noopener nofollow\">flagged</a> by analytics firm Elliptic, hackers from Lazarus Group have transferred cryptocurrency worth $12 million to Tornado’s wallets since March 13. The funds were stolen in November from the crypto exchange HTX and its cross-chain bridge HTX Eco Chain, or HECO. </p><p>Hot wallets on HTX’s exchange were<a href=\"https://cointelegraph.com/news/htx-exchange-loses-14-million-hot-wallet-hack\"> drained $30 million</a> during an attack on Nov. 22, while the HECO Chain<a href=\"https://cointelegraph.com/news/heco-chain-bridge-hack-86-million-lost\"> was hacked for $86.6 million</a> on the same day. The funds were swapped to Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) through decentralized exchanges and were dormant until this week. </p><p><a href=\"https://cointelegraph.com/news/lazarus-group-moves-12-million-htx-heco-hacks-tornado-cash\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-14T20:45:36.000Z",
    "title": "Hong Kong adds Bybit to its list of suspicious crypto exchanges",
    "url": "https://cryptoslate.com/hong-kong-adds-bybit-to-its-list-of-suspicious-crypto-exchanges/",
    "description": "<p>Hong Kong&#8217;s Securities and Futures Commission (SFC) has added Bybit to its list of suspicious virtual asset trading platforms and issued a public warning about its unlicensed operations. In a March 14 warning, the SFC said the platform is unlicensed and expressed concerns that Bybit has offered its products to Hong Kong investors. Unlicensed operations [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/hong-kong-adds-bybit-to-its-list-of-suspicious-crypto-exchanges/\">Hong Kong adds Bybit to its list of suspicious crypto exchanges</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-14T21:00:35.000Z",
    "title": "Bitfrost and Stacks Foundation Team up to Enhance Bitcoin Utility",
    "url": "https://news.bitcoin.com/bitfrost-and-stacks-foundation-team-up-to-enhance-bitcoin-utility/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/foofofldlldlf-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/foofofldlldlf-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/foofofldlldlf-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/foofofldlldlf-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/foofofldlldlf-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/foofofldlldlf-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/foofofldlldlf-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/foofofldlldlf.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a recent development, the Bitfrost Foundation has allied with the Stacks Foundation to explore new opportunities within the Bitcoin ecosystem. This partnership is dedicated to harnessing Bitcoin&#8217;s potential by introducing innovative use cases and improving interoperability with assets and protocols based on Bitcoin. Bitfrost and Stacks Foundation Partner to Expand Bitcoin Ecosystem On Thursday, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-14T21:07:00.000Z",
    "title": "Adopt Me Introduces the New Diamond Hamster: Here’s How to Get Yours",
    "url": "https://www.cryptopolitan.com/adopt-me-introduces-diamond-hamster/",
    "description": "Discover the latest buzz in Adopt Me with our guide on snagging the elusive Diamond Hamster, including tips and strategies on using Golden Corn."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-14T21:00:56.000Z",
    "title": "Solana Tokens Among Top Gainers: JUP and WEN Soar Over 12%, WIF Hits New ATH",
    "url": "https://www.newsbtc.com/news/solana/solana-tokens-among-top-gainers-jup-and-wen-soar-over-12-wif-hits-new-ath/",
    "description": "The Solana ecosystem has experienced notable growth, and SOL’s price has turned many experts bullish on it. Similarly, the Solana-based tokens are showing impressive performances during this bull run, with many being among the top gainers in different timeframes. Related Reading: Solana Smashes Major Resistance Levels, New All-Time High Imminent? Solana Chain Driven By Memecoins? According to CoinGecko data, Solana is currently the 5th largest blockchain by Total Value Locked (TVL), registering over 12.8% growth in the past day. During this timeframe, Solana has outperformed its competitors, including Ethereum, which has registered a 2.2% decrease since yesterday. In the 7-day and 30-day timeframes, Solana has seen a TVL growth of 35.3% and 89.8%, respectively. As displayed in the chart below, it surpassed the performance of the four chains above it. Top 5 blockchains by TVL. Source: CoinGecko.com Franklin Templeton Digital Assets shared its perspective on the value of memecoins and their native networks. The financial giant considers that there’s a strong relationship between memecoins and the performance of their native chains. In the last year, crypto markets have seen multiple meme coins parabolically surge, most notably, Solana based BONK during Q4 2023. Solana daily active user addresses were up 75% quarter over quarter from Q3 to Q4 2023. The asset management firm deems that the connection between the two is further alluded to because “the Solana network captured a large percent of the activity of all the active addresses during the same time that BONK saw a price surge” during Q4 2023. According to CoinMarketCap data, the market capitalization of the Solana-based tokens increased by 5.5% from yesterday to over $222.36 billion. The performance of the memecoins seems to have put a notch on the network’s belt. Performance Un-like Cats and Dogs Tokens in the Solana chain have registered massive performances recently, and the newest tokens around the block (dogwifhat, Wen, Jupiter) continue to shake the crypto market ground. Notably, dog- and cat-themed tokens continue to be hot topics in the community. According to CoinGecko Data, the Solana-based Myro, Bonk, and Popcat are trending tokens in their sub-categories. Las Vegas Puts Its Hat On Since the launch of dogwifhat (WIF), the token has gone from being a &#8220;cute dog with a crochet hat on to gathering a robust community seemingly able to back it up.&#8221; $WIF SPHERE UNLOCKED dog $wif hat, in all $SOL colors, coming to your local LAS VEGAS SPHERE HAT STAYS ON@dogwifcoin pic.twitter.com/NR1kln4X4u &#8212; Curb◎ (@CryptoCurb) March 13, 2024 The over $650,000 raised for the “wif on sphere” fundraiser campaign could serve as evidence of the community’s support. As a result of the campaign, the Las Vegas Sphere will display WIF’s icon for a week on the world’s largest LED screen. Since the news, the token skyrocketed to a new all-time high (ATH) of $3.36 this morning, representing a 42.3% increase in the last 24 hours. At writing time, WIF changes hands at $3.1, just 4.3% lower than its ATH. Space Suit On, Wen Goes To Jupiter Jupiter (JUP) recently announced its partnership with the cat-themed token WEN. The latest Jupiter Work Group (JWG) will collaborate with the WEN Work Group. According to the announcement, it “will be focused on contributing awesome vibes and content to amplify crucial Jupiter message.” Jup 🤝 Wen Wen has a spacesuit for a reason, this cute cat is headed to Jupiter 🪐 https://t.co/7k7h2AIdvk &#8212; Wen (@wenwencoin) March 13, 2024 The community seemingly took the partnership positively. After the news, both tokens surged. WEN’s price rose above $0.00040 in the early hours of the day, and it’s currently trading at $0.00038, a 12.5% increase in the last 24 hours. JUP propelled to a new ATH of $0.988, almost hitting $1. At writing time, the token is trading at $0.948, representing a 12.8% price surge in the 1-day timeframe. Similarly, its daily trading volume increased over 58%, with $418.04 million being traded in the past day. Related Reading: Solana Demand Soars As Institutions Buy Up SOL At A Massive 870% Premium The Crypto Total Market Cap is at $2.66 trillion. Source: TOTAL on TradingView.com Featured image from Unsplash.com, Chart from TradingView.com"
  }
]