[
  {
    "source": "Decrypt",
    "date": "2024-02-06T19:20:46.000Z",
    "title": "Solana Went Down Again—It Likely Won't Be the Last Time",
    "url": "https://decrypt.co/216132/solana-outage-developers-say-could-happen-again",
    "description": "Outages are a recurring headache, but Solana developers say it’s worth tolerating to ensure long-term safety and security."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-06T19:30:00.000Z",
    "title": " Nuclear fusion breakthrough could revolutionize artificial intelligence ",
    "url": "https://cointelegraph.com/news/nuclear-fusion-breakthrough-revolutionize-artificial-intelligence",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZDk1NzIwYzctYjNhMC00NTIyLTllMDgtYzA0N2Y1NzViMDk2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>What could potentially be one of the most significant milestones in the history of nuclear physics has now been confirmed through peer review.</p>\n                    <p><p>A recent physics breakthrough that could serve as a proof-of-concept for the development of nuclear fusion reactors capable of producing near-unlimited energy has finally passed its official peer-review successfully. </p><p>On Dec. 5, 2022, a team of researchers at the U. S. National Ignition Facility (NIF) in California recorded data indicating that they’d achieved a nuclear fusion reaction that created more energy than it took to produce. The reported results were the first of their kind.</p><p>In physics this is sometimes colloquially referred to as a “free lunch,” meaning that we could one day scale a nuclear fusion reactor to the point where it was capable of producing near-unlimited energy. </p><p><a href=\"https://cointelegraph.com/news/nuclear-fusion-breakthrough-revolutionize-artificial-intelligence\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-06T19:15:01.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">A United States federal judge has ordered Ripple to disclose financial statements to the Securities and Exchange Commission (SEC). Meanwhile, spot Bitcoin exchange-traded funds (ETFs) influenced miners’ Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) reserves, with more than $1 billion of BTC flowing from miner wallets to exchanges in the first 48 hours of trading. Elsewhere, a new service creating fake identification documents that others claim can bypass crypto exchange KYC. </p><p><a href=\"https://cointelegraph.com/news/ripple-disclose-financial-statements-sec-court-order\">Ripple has been ordered</a> to produce certain financial documents to the United States Securities and Exchange Commission (SEC) as part of the regulator’s ongoing enforcement actions against the blockchain company. </p><p>According to a Feb. 5 filing in the U.S. District Court for the Southern District of New York, Magistrate Judge Sarah Netburn granted the SEC’s motion requiring Ripple to produce financial statements and contracts on “institutional sales” from 2022 and 2023. </p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-06T19:30:07.000Z",
    "title": "Genesis’ bankruptcy plan faces pushback from parent company DCG over creditor payouts",
    "url": "https://cryptoslate.com/genesis-bankruptcy-plan-faces-pushback-from-parent-company-dcg-over-creditor-payouts/",
    "description": "<p>Digital Currency Group (DCG), the parent company of the defunct crypto lender Genesis, has filed an objection against the approval of its subsidiary&#8217;s bankruptcy plan, which was created via a &#8220;clandestine approach.&#8221; In a Feb. 5 court filing, DCG argued that Genesis&#8217; plan aims to exceed legal obligations by overcompensating creditors. According to the firm, [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/genesis-bankruptcy-plan-faces-pushback-from-parent-company-dcg-over-creditor-payouts/\">Genesis&#8217; bankruptcy plan faces pushback from parent company DCG over creditor payouts</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-06T19:31:18.000Z",
    "title": "Taki Games and Game7 Make Web3 Loyalty Accessible to Mainstream Gamers",
    "url": "https://www.cryptoglobe.com/latest/2024/02/taki-games-and-game7-make-web3-loyalty-accessible-to-mainstream-gamers/",
    "description": "Singapore, Singapore, February 6th, 2024, Chainwire Taki Games, the player-owned mobile gaming network powered by the TAKI token, has launched its latest mobile game in partnership with the Web3 player-owned Game7 nation. Game7 Food Fighter is an exciting new title developed by Taki Games that merges highly addictive gameplay with a novel tokenomic design to bring blockchain-based […]\n"
  }
]