[
  {
    "source": "Cointelegraph",
    "date": "2023-08-21T18:00:00.000Z",
    "title": "Scientists reverse-engineered the Luna flash crash using particle physics",
    "url": "https://cointelegraph.com/news/scientists-reverse-engineered-the-luna-flash-crash-using-particle-physics",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/25d1ec56-1a3e-4cde-b65a-1cb3cb25be37.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Some of the same techniques used to study the thermal history of the universe can be used to understand crypto crashes.</p>\n                    <p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Do Kwon: &quot;95% are going to die [coins], but there&#39;s also entertainment in watching companies die too&quot; <br><br>8 days ago. Ironic. <a href=\"https://t.co/fEQMZIyd9a\">pic.twitter.com/fEQMZIyd9a</a></p>&mdash; Pedr (@EncryptedPedro) <a href=\"https://twitter.com/EncryptedPedro/status/1524531474237640706?ref_src=twsrc%5Etfw\">May 11, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>More than $40 billion in investor assets were lost in the crash between May 5 and May 13, 2022. Less than a year later, Do Kwon was arrested after allegedly attempting to flee prosecution for criminal activity associated with the losses. </p><p>Volumes have since been written <a href=\"https://cointelegraph.com/magazine/2022/05/20/knifefight-terra-collapse-hubris-as-collateral\">discussing the breakdown</a>, which saw the Luna coin plummet and Terra’s UST stablecoin de-pegged from the U.S. dollar. </p><p>Now, for what appears to be the first time, scientists have <a href=\"https://arxiv.org/pdf/2308.08683.pdf\" target=\"_blank\" rel=\"noopener nofollow\">applied</a> statistical mechanics to essentially reverse-engineer the crash using the same techniques used to study particle physics. </p><p>The research, conducted at King’s College London, concentrated on transaction events and orders occurring during the crash. Per the team’s preprint research paper:</p><blockquote>“We view the orders as physical particles with motion on a 1-dimensional axis. The order size corresponds to the particle mass, and the distance the order has moved corresponds to the distance the particle moves.”</blockquote><p>These same techniques are <a href=\"https://www.nature.com/subjects/statistical-mechanics\" target=\"_blank\" rel=\"noopener nofollow\">used</a> to map thermodynamics interactions, molecular dynamics, and atomic-level interactions. By applying them to individual events occurring during a specific period of time in a contained ecosystem, such as the Luna market, the researchers were able to glean deeper insight into the coin’s microstructure and the underlying causes for the collapse. </p><p>The process involved moving away from the snapshot methodology involved in the current state-of-the-art approach, Z-score-based anomaly detection, and into a granular view of events as they occurred. </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/16vAjsnazEM\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>By viewing events as particles, the team was able to incorporate layer 3 data into their analysis (which, above layer one and two data, includes data pertaining to order submissions, cancellations, and matches). </p><p>According to the researchers, this led them to uncover “widespread instances of spoofing and layering in the market,” which greatly contributed to the Luna flash crash.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/caec8ca0-c588-47e1-80f1-017f426e4fc0.jpg\"  /><figcaption style=\"text-align: center;\"><em>Luna spoofing revealed during the Terra collapse using three disparate data analysis techniques.</em> <em>Image source: </em><a href=\"https://arxiv.org/pdf/2308.08683.pdf\" target=\"_blank\" rel=\"noopener nofollow\"><em>Li, Polukarov, 2023</em></a><em>.</em></figcaption></figure><p>The team then developed an algorithm to detect layering and spoofing. This presented a significant challenge, according to the paper, as there are no known datasets related to the Luna crash that contain accurately labelled instances of spoofing or layering.</p><p>In order to train their model to recognize these activities without such data, the researchers created synthetic data. Once trained, the model was then applied to the Luna dataset and benchmarked against existing analysis conducted via the Z-score system. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/uk-university-partners-with-ai-startup\"><strong><em>Top UK university partners with AI startup to analyze crypto market</em></strong></a></p><p>“Our method successfully detected spoofing events in the original dataset of LUNA trading market,” write the researchers, before noting that the Z-score method “not only failed to identify spoofing but also incorrectly flagged large limit orders as spoofing.”</p><p>Going forward, the researchers believe their work could serve as a foundation for studying market microstructure across finance.</p><p>The <a href=\"https://cointelegraph.com/news/breaking-terra-blockchain-officially-halted-following-luna-price-collapse\">Luna flash crash</a> happened just eight days after Terra co-founder Do Kwon told American-Canadian chess star Alexandra Botez that 95% of crypto coins would fail, adding that there was “entertainment in watching companies die.\"</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-21T18:00:15.000Z",
    "title": "Binance Plans to Halt EUR Withdrawals via SEPA Amid Third-Party Payment Challenges",
    "url": "https://news.bitcoin.com/binance-halts-eur-withdrawals-via-sepa-amid-third-party-payment-challenges/",
    "description": "<img width=\"696\" height=\"392\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/bb.webp\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Binance Halts EUR Withdrawals via SEPA Amid Third-Party Payment Challenges\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" />Numerous sources have indicated that Binance, the largest crypto exchange by global trading volume, has temporarily halted EUR withdrawals and deposits through SEPA due to challenges with a third-party payment facilitator. However, a post published by Binance&#8217;s customer support team at 12:21 p.m. (ET) on Monday notes the service will officially halt on September 25, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T18:01:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-21T18:00:20.000Z",
    "title": "Will Bitcoin Retest $20,500 Again? This Pattern May Suggest So",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-retest-20500-again-this-pattern-suggest/",
    "description": "Bitcoin is forming a pattern that has historically led to the asset retesting a specific line. At present, this level would be found at $20,500. Bitcoin Has Dropped Below The 200-Day SMA With The Recent Crash A few days back, Bitcoin observed a sharp crash that took the cryptocurrency&#8217;s price toward the $26,000 mark. As this plummet was already significant, many have wondered whether this was it or if the drawdown will continue. An analyst on X, Ali, shared a chart that may provide hints about where the asset could be heading next. The trend in the realized price and the 200-day SMA for BTC &#124; Source: @ali_charts on X The analyst has attached the data for two Bitcoin-related metrics in the graph: the 200-day simple moving average (SMA) and the realized price. The chart shows that the BTC price has dropped below the 200-day SMA (colored in purple) with the latest crash. According to the analyst, when the cryptocurrency&#8217;s price has crossed below this level during the past ten years, it has often retested the realized price (colored in orange). The &#8220;realized price&#8221; here refers to the cost basis or the buying price of the average investor in the BTC market. This means that whenever the cryptocurrency dips below this level, the average holder enters a state of loss. On the other hand, breaks above the line imply a return to profits for most of the market. Historically, this metric has had some interesting interactions with the spot price of the coin. During bullish periods, the line has generally supported the asset, while during bearish periods, it has acted as resistance. Related Reading: Bitcoin Price Consolidates Losses and At Risk of Fresh Decline To $25K The explanation behind these curious interactions may lie in how the investors&#8217; minds work in each period. In bull markets, the average investor may think that the price will only go up, so whenever the asset drops to its buying price, they accumulate more of the asset. Similarly, in bearish trends, the holders may believe the cryptocurrency will only go down, so the price they bought in (their break-even mark) would be the ideal exit opportunity. This buying and selling may cause the level to act as support and resistance in the respective regimes. The latest example of this behavior was seen earlier in the year when Bitcoin rebounded off the line back in March. As the asset now appears to have broken below the 200-day SMA, it may be heading towards a retest, as has often happened many times in the past. Related Reading: Here Are The Factors That Could Be Behind The Latest Bitcoin Wipeout Right now, the cost basis of the average investor is $20,500, which means that if BTC is going to touch this line again, a significant drawdown would need to occur. If this scenario indeed plays out, then it&#8217;s possible that Bitcoin could find a rebound at the realized price once again. A retest failure, however, would be a very concerning sign, as it might signal the return of the bear market. BTC Price At the time of writing, Bitcoin is trading around $26,000, down 11% in the last week. BTC has been moving sideways since the crash &#124; Source: BTCUSD on TradingView Featured image from Maxim Hopman on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-21T18:05:57.000Z",
    "title": "Decoding Bitcoin Spark: The Next Big Thing After Dogecoin?",
    "url": "https://www.crypto-news-flash.com/decoding-bitcoin-spark-the-next-big-thing-after-dogecoin/?utm_source=rss&utm_medium=rss&utm_campaign=decoding-bitcoin-spark-the-next-big-thing-after-dogecoin",
    "description": "<img width=\"512\" height=\"389\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-62.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-62.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-62-300x228.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The pioneer meme coin, Dogecoin (DOGE), has long been in the spotlight. However, a new pioneer, Bitcoin Spark (BTCS), could be the next big thing. Will Dogecoin go up? While DOGE is still trading well below its all-time high, it does have the potential to go up. The coin’s low fees make it an attractive [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-21T18:00:28.000Z",
    "title": "ApeCoin Fizzles Out Despite BAYC Role, This Crypto to Flip APE in 2023?",
    "url": "https://www.crypto-news-flash.com/apecoin-fizzles-out-despite-bayc-role-this-crypto-to-flip-ape-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=apecoin-fizzles-out-despite-bayc-role-this-crypto-to-flip-ape-in-2023",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-85.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-85.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-85-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-85-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-85-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-85-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the world of cryptocurrencies, trends shift rapidly. What captures the limelight today might fade into obscurity tomorrow. Such is the case with ApeCoin, a cryptocurrency that burst onto the scene with the promise of riding on the coattails of the immensely popular Bored Ape Yacht Club (BAYC) NFTs. However, as the initial fervor around [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-21T18:05:35.000Z",
    "title": "Here’s Where the Next 100x Opportunity in Crypto Is, According to DeFi Veteran Arthur Cheong",
    "url": "https://dailyhodl.com/2023/08/21/heres-where-the-next-100x-opportunity-in-crypto-is-according-to-defi-veteran-arthur-cheong/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/blast-biden-crypto-ecosystem.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/blast-biden-crypto-ecosystem.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/blast-biden-crypto-ecosystem.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/blast-biden-crypto-ecosystem.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/blast-biden-crypto-ecosystem.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/blast-biden-crypto-ecosystem.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/blast-biden-crypto-ecosystem.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Venture capitalist Arthur Cheong is speculating on where the next 100x opportunities in the crypto space will be. Cheong, the founder of DeFiance Capital, tells his 150,000 X followers that he believes that crypto projects without large amounts of venture capital (VC) backing and that are not traded on centralized exchanges (CEXes) will start offering [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/21/heres-where-the-next-100x-opportunity-in-crypto-is-according-to-defi-veteran-arthur-cheong/\">Here’s Where the Next 100x Opportunity in Crypto Is, According to DeFi Veteran Arthur Cheong</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]