[
  {
    "source": "Cointelegraph",
    "date": "2024-02-18T09:27:39.000Z",
    "title": " VanEck admits violation, agrees to SEC fine in ETF marketing ",
    "url": "https://cointelegraph.com/news/vaneck-admits-violation-agrees-to-sec-fine-in-etf-marketing",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvY2UzYjQyNTgtNzQ3MC00ZmI3LWEzMjAtZWZhMWNlYjk4MzliLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The regulator noticed an undisclosed detail, which was that the influencer’s fee was tied to the fund’s growth, guaranteeing higher compensation as the fund expanded.</p>\n                    <p><p>VanEck Associates Corporation will pay a $1.75 million fine to resolve Securities and Exchange Commission (SEC) charges linked to its 2021 launch of a social media-focused exchange-traded fund (ETF).</p><p>The United States SEC imposed a civil penalty on the investment adviser. On Feb. 16, the SEC revealed in a <a href=\"https://www.sec.gov/news/press-release/2024-20\" target=\"_blank\" rel=\"noopener nofollow\">statement</a> that during the VanEck Social Sentiment ETF launch in March 2021, VanEck did not fully disclose the participation of a prominent social media personality in marketing the product.</p><p>The ETF aimed to follow an index using “positive insights” from social media and other data sources. However, the SEC discovered that seeking to boost the fund’s success via social media, VanEck collaborated with an influential and divisive online personality to enhance the fund’s appeal.</p><p><a href=\"https://cointelegraph.com/news/vaneck-admits-violation-agrees-to-sec-fine-in-etf-marketing\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-18T09:37:04.000Z",
    "title": "Innovative Research at Arkansas State University Aids Veterans",
    "url": "https://www.cryptopolitan.com/research-at-arkansas-university-aid-veterans/",
    "description": "In an unprecedented effort to address mental health issues and suicide prevention among military veterans, Arkansas State University&#8217;s Masters of Athletic Training Program conducted a groundbreaking study using virtual reality (VR) and artificial intelligence (AI) technologies. This initiative, part of the Veterans’ Suicide Prevention Project, saw nearly 100 veterans participate in a comprehensive two-day survey [&#8230;]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-18T09:17:10.000Z",
    "title": "Magic Eden’s Non FungibleDAO: $NFT Token Rewards",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/magic-edens-non-fungibledao-nft-token-rewards/",
    "description": "<p>Magic Eden leads in the NFT space, offering a decentralized platform for trading NFTs for artists and collectors. The introduction of the Non-FungibleDAO and its $NFT token rewards is a step further in their commitment to not only enhancing the user experience. Also, it supports the open-source community that is fundamental to the growth and [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/magic-edens-non-fungibledao-nft-token-rewards/\">Magic Eden&#8217;s Non FungibleDAO: $NFT Token Rewards</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]