[
  {
    "source": "CoinDesk",
    "date": "2023-07-18T07:46:59.000Z",
    "title": "Reddit Community Tokens Rocket as Rule Change Speculation Boosts MOON, BRICK",
    "url": "https://www.coindesk.com/markets/2023/07/18/reddit-community-tokens-rocket-as-rule-change-speculation-boosts-moon-brick/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Reddit's Terms of Service recently changed where it now explicitly allows for trading Reddit's tokenized Community Points, one observer said while explaining the price rally."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-18T07:42:49.000Z",
    "title": "Ripple’s Legal Win: A Precursor to U.S. Regulatory Clarity?",
    "url": "https://cryptobriefing.com/ripples-legal-win-a-precursor-to-u-s-regulatory-clarity/?utm_source=feed&utm_medium=rss",
    "description": "The latest court victory by Ripple in its case against the SEC could be a crucial stepping stone to clarifying cryptocurrency regulations in the U.S., says Caroline Pham, Commissioner at..."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T07:45:57.000Z",
    "title": "Canadian phishing scammer Soup allegedly stole over $1m in crypto",
    "url": "https://www.cryptopolitan.com/canadian-phishing-scammer-soup-steals-1m/",
    "description": "ZachXBT, a popular on-chain sleuth, has exposed another crypto and NFT scammer. This time, the scammer in question got away with over $1 million in crypto through phishing attacks. The scammer targeted Decentralized Finance(DeFi) projects like Orbiter Finance and Pika Protocol. Soup exploited Pika Protocol and Orbiter Finance ZachXBT detailed in a Monday Twitter thread ... <a title=\"Canadian phishing scammer Soup allegedly stole over $1m in crypto\" class=\"read-more\" href=\"https://www.cryptopolitan.com/canadian-phishing-scammer-soup-steals-1m/\" aria-label=\"More on Canadian phishing scammer Soup allegedly stole over $1m in crypto\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T07:44:00.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T07:43:25.000Z",
    "title": "SEC Chair Gensler calls for AI regulation amid rising economic risks",
    "url": "https://www.cryptopolitan.com/sec-chair-gensler-calls-for-ai-regulation-amid-economic-risks/",
    "description": "SEC Chair Gary Gensler warns of potential global economic destabilization due to the unregulated development of artificial intelligence (AI) for financial markets applications, particularly by big tech firms. The transformative power of AI and its risks In his speech at the National Press Club on July 17, where he later expressed his disappointment about the ... <a title=\"SEC Chair Gensler calls for AI regulation amid rising economic risks\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-chair-gensler-calls-for-ai-regulation-amid-economic-risks/\" aria-label=\"More on SEC Chair Gensler calls for AI regulation amid rising economic risks\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-18T08:00:52.000Z",
    "title": "BTC Price Analysis: Why Is Bitcoin Down Today?",
    "url": "https://www.newsbtc.com/news/bitcoin/btc-price-analysis-why-is-bitcoin-down-today/",
    "description": "The Bitcoin price has fallen to the lower end of its almost one-month trading range between $29,800 and $31,300. Already yesterday, BTC briefly fell to as low as $29,704, only to recover to $30,306 within a few hours. At press time, BTC was again moving towards the $30,000 mark, and another fall and liquidity grab seems likely. While this week the macro data releases are pretty quiet, it&#8217;s worth taking a look at what&#8217;s happening in the Bitcoin market itself. Why Is Bitcoin Down Today? Swissblock Insights observed a peculiar calm in the market when Bitcoin reached a new yearly high of $31.840 last week. However, the momentum quickly faded, and selling pressure increased, causing BTC to drop to the low $30ks. They highlight the narrow Bollinger Bands, stating, &#8220;The Bollinger Bands are very narrow, with only a 4.2% value difference separating the upper and lower bands. A move is brewing.&#8221; Moreover, the analysts emphasize the need for a significant catalyst to inject life into the current lackluster scenario: Volatility is expected to appear on the scene, although, in the short term, we are in no man’s land; liquidity remains low, open interest is still flat and shorts are nowhere to be seen. There’s no command in the direction we are going, and only a significant catalyst can spice things up in this dull scenario we are in. According to the analysts, a breakdown of the $29.650 support level would invalidate a long setup. On the other hand, a bullish leg up $31.500 could reignite momentum and surge the price to $33,000. But for this to happen, spot demand needs to reignite strongly and longs need to enter the market, “otherwise momentum will continue to fading.&#8221; Related Reading: This Bitcoin Continuation Pattern Points To 3-6 Months Of Uptrend Ahead Glassnode, an on-chain data provider, further illuminates the current state of the Bitcoin market. Despite the temporary yearly high, they describe the market as &#8220;extremely quiet&#8221;, also pointing to the Bollinger Bands. This compression in volatility signals a market reminiscent of the calm observed in early January, as NewsBTC reported yesterday. Furthermore, Glassnode’s analysis reveals a slow but steady inflow of capital into Bitcoin. The Realized Cap currently sits just shy at $396 billion. After hitting a cycle low at $380 billion, the metric indicates that a slow but steady stream of capital is entering the market throughout 2023. Glasnode also emphasizes that investors remain unwilling to part with their held supply, resulting in choppy market conditions similar to those seen in 2016 and 2019-20 periods. Total realized profit and loss resembles the historic trend: If we take a ratio between total realized profit and loss, [&#8230;] we can also note that a lower high in this ratio was set this week. If sustained, it may allude to similar choppy market conditions seen in both 2019-20, and again in the second half of 2021. The analysis also highlights the profit-locking behavior among Bitcoin holders, with the majority of both short-term (88%) and long-term holders&#8217; balances (73%) held in profit. However, short-term holders are the primary entities that are active in the market. Related Reading: Big Bitcoin Move Ahead: Bollinger Bands See Extreme Squeeze Out of the total 39.600 BTC in daily exchange inflows, 78% of this is associated with the STH cohort. This means that short term holders may have to trim their profits for the time being before selling pressure eases and the bulls can take the upper hand again. GreekLive, an options expert, explains that the Bitcoin market is still losing liquidity, which makes it highly susceptible to spikes and V-shaped recoveries: Cryptocurrencies encountered a V-shaped market today, with BTC falling below $29,700 and ETH below $1,875, before rebounding in a V-shaped during Asian trading hours to regain the round number of points, but the options market barely reacted to this. The analysis advises sellers to focus on static protection and have risk control plans for holding options until expiration. For buyers, timely profit-taking and using futures to hedge options are recommended risk management strategies. At press time, BTC traded at $30,064. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-18T08:01:02.000Z",
    "title": "Pepecoin (PEPE) Earns 18% in One Day – DigiToads (TOADS) Breaks the $6 Million Milestone",
    "url": "https://www.crypto-news-flash.com/pepecoin-pepe-earns-18-in-one-day-digitoads-toads-breaks-the-6-million-milestone/?utm_source=rss&utm_medium=rss&utm_campaign=pepecoin-pepe-earns-18-in-one-day-digitoads-toads-breaks-the-6-million-milestone",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-18T094735.461.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-18T094735.461.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-18T094735.461-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-18T094735.461-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the fast-paced world of cryptocurrency, Pepecoin (PEPE) and DigiToads (TOADS) have recently made waves with their notable achievements. PEPE, a digital currency known for its connection to the iconic Pepe the Frog meme, experienced an impressive 18% surge in value over just one day. This upward trajectory has brought the PEPE price to $0.000001779, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-18T07:47:20.000Z",
    "title": "Ripple (XRP) Scores Partial Victory over SEC, but Will Gary Gensler Appeal and Challenge the Verdict Already in August? Details",
    "url": "https://www.crypto-news-flash.com/ripple-xrp-scores-partial-victory-over-sec-but-will-gary-gensler-appeal-and-challenge-the-verdict-already-in-august-details/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-xrp-scores-partial-victory-over-sec-but-will-gary-gensler-appeal-and-challenge-the-verdict-already-in-august-details",
    "description": "<img width=\"512\" height=\"279\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-71.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-71.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-71-300x163.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />SEC Chair Gary Gensler expresses disappointment with the court&#8217;s classification of Ripple&#8217;s XRP token as a non-security. Gensler suggests the possibility of an appeal, indicating that the SEC is still assessing the court&#8217;s opinion. SEC Chair Gary Gensler Raises Possibility of Appeal in Ripple Case In a breaking tweet, Eleanor Terrett shared an important update [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-18T07:45:39.000Z",
    "title": "Cardano (ADA) Price Turns Bullish as NMKR and Nucast Create First-Ever NFT Ticketing Solution for Million-Dollar Event",
    "url": "https://www.crypto-news-flash.com/cardano-ada-price-turns-bullish-as-nmkr-and-nucast-create-first-ever-nft-ticketing-solution-for-million-dollar-event/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-ada-price-turns-bullish-as-nmkr-and-nucast-create-first-ever-nft-ticketing-solution-for-million-dollar-event",
    "description": "<img width=\"3840\" height=\"2160\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano ADA\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1.jpg 3840w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-2048x1152.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-48x27.jpg 48w\" sizes=\"(max-width: 3840px) 100vw, 3840px\" />The upcoming Cardano Summit 2023 in November will have an NFT ticketing solution built by Nucast and NMKR. Cardano&#8217;s ADA cryptocurrency might soon be on bullish momentum with strong DeFi activity on the Cardano blockchain. In an announcement on Monday, July 17, the Cardano Foundation announced that Nucast and NMKR will serve as the technical [...]"
  }
]