[
  {
    "source": "Cointelegraph",
    "date": "2023-06-07T09:43:00.000Z",
    "title": "SEC lawsuit against Binance stalls Gopax acquisition deal in South Korea",
    "url": "https://cointelegraph.com/news/sec-lawsuit-against-binance-stalls-gopax-acquisition-deal-in-south-korea",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/68681091-11b5-45de-94d1-8d350c4ade14.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The country’s financial watchdog claimed it was very difficult to accept the acquisition requests amid accusations of securities laws violations.</p>\n                    <p><p>The United States Securities and Exchange Commission’s (SEC) lawsuit against Binance could damage the crypto exchange’s business opportunities in South Korea.</p><p>A <a href=\"https://m.newspim.com/news/view/20230607000608\" target=\"_blank\" rel=\"noopener nofollow\">report</a> published in a South Korean daily suggests that the Financial Service Committee (FSC) — the country’s financial watchdog — is reviewing Binance’s acquisition of local crypto trading platform Gopax. Binance acquired a <a href=\"https://cointelegraph.com/news/binance-re-enters-south-korea-with-gopax-exchange\">majority stake in Gopax in February</a>, intending to reenter the South Korean crypto market after a two-year hiatus.</p><p>The FSC has reportedly suspended Gopax’s executive change report filed on March 7, citing the recent SEC lawsuit. The report detailed the nomination of three Binance members as inside directors of Gopax, including Leon Singh Poong, the CEO of Binance Asia Pacific.</p><p>In its review of the Gopax deal, the FSC claimed it was very difficult to accept the acquisition request at this point, given the alleged accusations of securities law violations and <a href=\"https://cointelegraph.com/news/binance-us-user-funds-safe-amid-sec-injunction-freeze-assets\">further requests from the SEC</a> to freeze Binance.US assets. One of the executives from FSC said that it is important to consider the SEC’s lawsuit, adding:</p><blockquote>“It is cautious to say that the report is being reviewed internally,”</blockquote><p>Binance’s acquisition of Gopax was not just about the crypto exchange’s reentry into South Korea but also a revival of the troubled local crypto trading platform. In November 2022, Gopax halted withdrawals of principal and interest payments from its decentralized finance service GoFi <a href=\"https://cointelegraph.com/news/ftx-collapse-the-crypto-industry-s-lehman-brothers-moment\">after the collapse of the FTX </a>crypto exchange and <a href=\"https://cointelegraph.com/news/crypto-lender-genesis-files-for-bankruptcy\">bankruptcy of digital assets financial services firm Genesis</a>.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-labels-61-cryptocurrencies-securities-after-binance-suit\"><strong><em>Binance lawsuit: 61 cryptocurrencies are now seen as securities by the SEC</em></strong></a></p><p>Genesis’ parent company, the Digital Currency Group, was reportedly Gopax’s second-largest shareholder and a key business partner providing its GoFi product. The acquisition deal by Binance promised to funnel new capital into the Gopax exchange for customer withdrawals and interest payments for GoFi. </p><p>The SEC lawsuit against Binance accused the crypto exchange of commingling customers’ funds and violating various securities laws. The SEC has filed 13 charges against the exchange, its subsidiaries and its CEO, Changpeng Zhao.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-wendy-on-trashing-the-sec-sexism-and-how-underdogs-can-win-hall-of-flame/\"><strong><em>Crypto Wendy on trashing the SEC, sexism, and how underdogs can win: Hall of Flame</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-07T09:44:22.000Z",
    "title": "BinaryX and AiGC Labs Developing First AI-Powered Virtual Reality Game on the Metaverse",
    "url": "https://www.cryptoglobe.com/latest/2023/06/binaryx-and-aigc-labs-developing-first-ai-powered-virtual-reality-game-on-the-metaverse/",
    "description": "Singapore, Singapore, June 7th, 2023, Chainwire BinaryX today announced their plans to expand into Virtual Reality (VR) and Artificial Intelligence Game Content (AIGC). Building upon their GameFi expertise, BinaryX has reportedly entered into agreements with their VR and AIGC partners, AiGC Labs, to develop a groundbreaking new GameFi genre of AI-based VR games. First AI-Powered Virtual […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-07T09:58:00.000Z",
    "title": "USDC Issuer Circle Obtains Major Payment Institution License",
    "url": "https://cryptodaily.co.uk/2023/06/usdc-issuer-circle-obtains-major-payment-institution-license",
    "description": "<p>Circle Internet Singapore Pte. Ltd. announced on Wednesday that it had received a Major Payment Institution (MPI) license from the Monetary Authority of Singapore (MAS).&nbsp;</p>\n<p>Circle Internet Singapore Pte. Ltd. is an affiliate of Circle Internet Financial LLC.&nbsp;</p>\nMajor Payment Institution License (MPI)&nbsp;\n<p>The Major Payment Institution License will allow Circle Internet Singapore to offer users in Singapore digital token payments services, cross-border money transfer services, and domestic money transfer services in the city-state through its portfolio of products and services. These include the Circle Account, which allows institutional customers to access USDC. Circle Singapore only set up its office last month after receiving in-principle approval as a major payment institution from local authorities.&nbsp;</p>\n<p>Jeremy Allaire, the co-founder and CEO of Circle, stated that the company was committed to being an integral part of Singapore&rsquo;s economy and was honored to receive the Major Payment Institution (MPI) license from the Monetary Authority of Singapore (MAS).&nbsp;</p>\n\n<p>&ldquo;Singapore is integral to Circle&rsquo;s global expansion and mission in raising global economic prosperity and through the frictionless exchange of value. We are honored to receive the MPI license from MAS, and we remain committed to being a part of Singapore&rsquo;s dynamic economy by advancing the future of financial technology innovations in the city-state, uplifting its emerging technology and fintech sector, and creating business and career opportunities for its technology and financial industry talent.&rdquo;</p>\n\nMPI License Underscores Circle&rsquo;s Strong Reputation\n<p>In a press release, Circle stated that receiving the Major Payment Institution License highlighted Circle&rsquo;s strong reputation as a responsible digital financial company. Furthermore, it also serves as a testament to the company&rsquo;s strong track record and contributions to the emerging, internet-based global financial system. It further added that the receipt of the license is significant for regulated dollar digital currencies in Singapore.&nbsp;</p>\n<p>Now that it is a licensed entity, Circle Singapore can look to leverage its expertise and drive innovation fully. It can also expand its offerings and deliver value to clients and stakeholders. Circle&rsquo;s Head of Global Policy and Chief Strategy Officer, Dante Disparte, stated,&nbsp;</p>\n\n<p>&ldquo;This is a significant step forward for Circle and the future of financial infrastructure and dollar digital currencies in the region. The receipt of the MPI license represents our continued commitment to work with forward-thinking leaders and stakeholders at a global level and contribution to Singapore&rsquo;s position as a hub for responsible financial services innovation.&rdquo;</p>\n\nCircle&rsquo;s Growth In Singapore\n<p>The receipt of the License comes against the backdrop of Circle&rsquo;s continued momentum and growth in the Singapore markets. In February 2023, Circle announced a collaboration with the country&rsquo;s first government-supported blockchain ecosystem builder, Tribe. Under the partnership, Circle launched a training and support program aimed at upskilling the Web3 developers in the region. Circle&rsquo;s USDC stablecoin is currently the 5th largest cryptocurrency, with a market capitalization of over $28 billion.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-07T10:00:48.000Z",
    "title": "Russian Finance Minister Talks Dollar Attack on Russia, Importance of Developing Alternatives for Settlements",
    "url": "https://news.bitcoin.com/russian-finance-minister-talks-dollar-attack-on-russia-importance-of-developing-alternatives-for-settlements/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2251010331-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Russian Finance Minister Talks Dollar Attack on Russia, Importance of Developing Alternatives for Settlements\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2251010331-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2251010331-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2251010331-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2251010331-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2251010331-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2251010331-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2251010331.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Russian Finance Minister Anton Siluanov has given his opinion on the perceived attack the Russian economy has been receiving from the U.S. dollar, and how the country has moved to keep trade going. Siluanov also remarked on the importance of developing settlements in national currencies. Russian Finance Minister Anton Siluanov: &#8216;The Dollar Has Challenged Russia&#8217; [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T09:58:04.000Z",
    "title": "What is making crypto so popular with online gamblers?",
    "url": "https://www.cryptopolitan.com/what-is-making-crypto-so-popular-with-online-gamblers/",
    "description": "Written by Tom Bakersfield Cryptocurrencies and blockchain have become a fixture of modern life. Some argue that crypto has the power to change society, while others dismiss them as a gimmick. There is no denying that their popularity in many industries is growing — online gambling being a prime example. In fact, if you’ve visited ... <a title=\"What is making crypto so popular with online gamblers?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/what-is-making-crypto-so-popular-with-online-gamblers/\" aria-label=\"More on What is making crypto so popular with online gamblers?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-07T10:08:44.000Z",
    "title": "Former Twitter CEO sparks debate by labeling ethereum as security",
    "url": "https://crypto.news/former-twitter-ceo-sparks-debate-by-labeling-ethereum-as-security/",
    "description": "In a recent social media skirmish, Former Twitter CEO and Bitcoin advocate Jack Dorsey sparked a heated debate with prominent figures from the crypto industry by affirming that Ethereum (ETH) could be considered a security."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-07T09:54:40.000Z",
    "title": "Global crypto market surges despite FUD around Binance",
    "url": "https://crypto.news/global-crypto-market-surges-despite-fud-around-binance/",
    "description": "The global crypto market witnessed a harsh wind as the US Securities and Exchange Commission (SEC) took legal action against two of the largest crypto exchanges, Binance and Coinbase. CoinMarketCap (CMC) data shows that the global cryptocurrency market cap saw&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-07T09:52:38.000Z",
    "title": "Robinhood reassessing crypto offerings in response to SEC crackdow",
    "url": "https://crypto.news/robinhood-reassessing-crypto-offerings-in-response-to-sec-crackdow/",
    "description": "Robinhood reevaluates cryptocurrency offerings after SEC crackdown on top digital asset platforms. The brokerage actively reviews regulatory analysis to determine appropriate actions."
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-07T09:52:44.000Z",
    "title": "DOJ May File Criminal Charges Against Binance: Crypto Lawyer",
    "url": "https://coinedition.com/doj-may-file-criminal-charges-against-binance-crypto-lawyer/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/There_have_been_rumors_or_reports_that_the_DOJ_may_file_criminal-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/There_have_been_rumors_or_reports_that_the_DOJ_may_file_criminal-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/There_have_been_rumors_or_reports_that_the_DOJ_may_file_criminal-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/There_have_been_rumors_or_reports_that_the_DOJ_may_file_criminal.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>As the U.S. Securities and Exchange Commission (SEC) pursues legal action against Binance, speculation is growing about potential criminal charges being filed against the largest crypto exchange by the U.S. Department of Justice (DOJ). Prominent crypto lawyer John E Deaton recently took to Twitter, expressing his belief that the DOJ might indeed bring criminal charges [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/doj-may-file-criminal-charges-against-binance-crypto-lawyer/\">DOJ May File Criminal Charges Against Binance: Crypto Lawyer</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]