[
  {
    "source": "Cointelegraph",
    "date": "2023-05-27T14:42:55.000Z",
    "title": "Crypto Biz: Ledger halts recovery service, Web3 in Hong Kong, and another CEX goes down ",
    "url": "https://cointelegraph.com/news/crypto-biz-ledger-halts-recovery-service-web3-in-hong-kong-and-another-cex-goes-down",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/42e0d061-0ab3-465f-904f-a46ef7db8b78.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This week’s Crypto Biz explores Hotbit’s closure, Hong Kong’s licensing of crypto firms, Bitstamp’s acquisition by Ripple and Ledger’s branding crisis.</p>\n                    <p><p>Another centralized exchange (CEX) bites the dust, with Hotbit announcing it will close operations due to adverse business conditions. As is common among CEX collapses in recent months, the crypto firm mentioned FTX, the ongoing banking system crisis, and even a probe, as reasons for its cash flow problems.</p><p>Also facing a tough time is wallet provider Ledger. The company decided to postpone its controversial recovery service amid community backlash. Security reputation is critical for a crypto wallet provider, but Ledger’s dilemma may be beyond a public relations crisis. The recovery service was also a path toward subscription services, which could generate recurring revenue for the wallet provider. The feature is now postponed until most of its code is open-sourced, said Ledger. </p><p>In challenging times, there are also opportunities for others. Honk Kong is advancing its plans to become a crypto hub, with over 150 crypto firms waiting for approval to operate as virtual assets trading platforms in the city. </p><p>This week’s Crypto Biz explores Hotbit’s closure, Hong Kong’s licensing of crypto firms, Bitstamp’s acquisition by Ripple and Ledger’s branding crisis. </p><h2>Hotbit exchange halts operations, urges users to withdraw funds</h2><p>Crypto exchange Hotbit is <a href=\"https://cointelegraph.com/news/hotbit-exchange-halts-operations-urges-users-to-withdraw-funds\">winding down operations</a>, urging users to withdraw funds by June 21. According to an announcement, Hotbit’s operations have deteriorated since an investigation of a former team member took place in August 2022. Authorities believe a former management employee was involved in a project that violated criminal laws. The probe forced the exchange to halt business for weeks. Hotbit’s cash flow was also impacted by the FTX collapse and the banking crisis — incidents that resulted in a continuous outflow of funds from centralized exchanges, said the firm. The announcement was followed by phishing links pretending to be the official Hotbit website on Google. </p><h2>Ledger key recovery service paused amid backlash, will open-source code</h2><p>Ledger’s public relations nightmare took a new turn this week, leading the company to <a href=\"https://cointelegraph.com/news/ledger-recover-paused-code-will-open-source\">pause its recovery service tool</a> amid ongoing community backlash. Disclosed on May 16, the Ledger Recover feature would allow users that lost their private seed phrase to get it back via an optional function. Earlier in the week, Ledger’s CEO Pascal Gauthier confirmed that private seed phrases of users using the service could, in theory, be <a href=\"https://cointelegraph.com/news/ledger-sharded-wallet-keys-shared-if-subpoenaed\">handed over to governments</a> if they were to be subpoenaed. In response to concerns, the firm is accelerating efforts to open-source most of its codebase, including core components of its operating system and Ledger Recover, which is postponed until after this process is completed.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Ledger Recover will be launched as soon as the source code is auditable. We believe in these amendments to the project and will continue to build the industry together.</p>&mdash; Pascal Gauthier @Ledger (@_pgauthier) <a href=\"https://twitter.com/_pgauthier/status/1661012643971465220?ref_src=twsrc%5Etfw\">May 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Hong Kong to open crypto exchange access for retail users, but there’s a catch</h2><p>Hong Kong has taken another step toward building its reputation as a crypto hub. Earlier this week, its Securities and Futures Commission announced that virtual assets trading platforms would <a href=\"https://cointelegraph.com/news/hong-kong-crypto-exchanges-to-serve-retail-in-june\">soon be licensed to serve retail investors</a>. Compliance guidelines will include asset custody safety requirements, cybersecurity standards and segregation of client assets. Further measures to protect investors may involve enhanced token due diligence and regular disclosures. The legal framework was approved by local legislators in December 2022, seeking to give cryptocurrency exchanges the same market recognition as traditional financial institutions. Providing regulatory clarity for crypto firms has been part of Hong Kong’s strategy in attracting businesses and positioning itself as a Web3 city.</p><h2>Ripple acquires Pantera’s stake in Bitstamp</h2><p>Digital payment network Ripple <a href=\"https://cointelegraph.com/news/ripple-acquires-pantera-s-stake-in-bitstamp\">took a minority stake</a> in the crypto exchange Bitstamp in the first quarter of 2023. Galaxy Digital advised on the deal, according to a transcript of Galaxy’s shareholder conference call on May 9. Ripple acquired shares previously owned by Pantera Capital, a United States-based digital asset investment firm. It is unclear how much Ripple paid for the acquisition or how the deal was structured. Founded in 2011, Bitstamp was one of the first crypto exchanges to offer digital assets transactions. Based in Luxembourg, the company serves clients in over 100 countries.</p><p><em>Crypto Biz is your weekly pulse of the business behind blockchain and crypto, delivered directly to your inbox every Thursday.</em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-27T15:00:24.000Z",
    "title": "Binance CEO highlights timing of Beijing’s web3 white paper amid China, Hong Kong crypto regulatory changes",
    "url": "https://cryptoslate.com/binance-ceo-highlights-timing-of-beijings-web3-white-paper-amid-china-hong-kong-crypto-regulatory-changes/",
    "description": "<p>On May 27, Beijing released an &#8220;Internet 3.0 Innovation and Development&#8221; white paper outlining advancements and support for Internet 3.0 (web3) and the metaverse, according to reports from Chinese media, ThePaper. However, as Binance CEO Changpeng Zhao (CZ) highlighted on Twitter, the white paper&#8217;s publication is just days from the upcoming June 1 application opening [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-ceo-highlights-timing-of-beijings-web3-white-paper-amid-china-hong-kong-crypto-regulatory-changes/\">Binance CEO highlights timing of Beijing&#8217;s web3 white paper amid China, Hong Kong crypto regulatory changes</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-27T14:55:17.000Z",
    "title": "Cascade of Crypto Influence: TMS Network (TMSN) Ascent Dwarfs Aave (AAVE) and Aave (AAVE)",
    "url": "https://www.cryptopolitan.com/cascade-of-crypto-influence-tms-network-tmsn-ascent-dwarfs-aave-aave-and-aave-aave/",
    "description": "Hype contributes significantly to the overall crypto market influence. Take Aave (AAVE) and Conflux (CFX) for example &#8211; their ideas are innovative, the hype is growing, and they are pushing the industry forward. However, TMS Network (TMSN) has taken center stage within this hype, dwarfing the previously mentioned value growth of Aave (AAVE) and Conflux (CFX). This might sound ... <a title=\"Cascade of Crypto Influence: TMS Network (TMSN) Ascent Dwarfs Aave (AAVE) and Aave (AAVE)\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cascade-of-crypto-influence-tms-network-tmsn-ascent-dwarfs-aave-aave-and-aave-aave/\" aria-label=\"More on Cascade of Crypto Influence: TMS Network (TMSN) Ascent Dwarfs Aave (AAVE) and Aave (AAVE)\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-05-27T15:00:39.000Z",
    "title": "Dogecoin Whales and Pro Traders are increasingly using the Avorak AI Trading Bot",
    "url": "https://nulltx.com/dogecoin-whales-and-pro-traders-are-increasingly-using-the-avorak-ai-trading-bot/",
    "description": "Dogecoin has been on the buzz amid its price surges, and many enthusiasts, including tech-savvy investors, are profiting from the cryptocurrency. Dogecoin whales and pro traders are leveraging the Avorak AI trading bot in trading crypto, and this has been a successful process for them. Also, considering Dogecoin’s price continues to surge, its excitement grows. [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-27T14:49:39.000Z",
    "title": "Dogecoin and Solana Set to Break Crucial Resistance Level; Will DOGE Hit $0.08 and SOL Reach $20.50? Report",
    "url": "https://www.crypto-news-flash.com/dogecoin-and-solana-set-to-break-crucial-resistance-level-will-doge-hit-0-08-and-sol-reach-20-50-report/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-and-solana-set-to-break-crucial-resistance-level-will-doge-hit-0-08-and-sol-reach-20-50-report",
    "description": "<p>Dogecoin (DOGE) shows signs of a potential price reversal as a falling wedge pattern suggests bullish sentiment, with buyers entering the market to prevent further decline. Amid the recent surge in the ETH gas fee after the strong popularity of the memecoin PEPE, traders have been looking at alternatives like Solana. This could potentially drive [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/dogecoin-and-solana-set-to-break-crucial-resistance-level-will-doge-hit-0-08-and-sol-reach-20-50-report/\">Dogecoin and Solana Set to Break Crucial Resistance Level; Will DOGE Hit $0.08 and SOL Reach $20.50? Report</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]