[
  {
    "source": "Decrypt",
    "date": "2023-10-07T14:01:28.000Z",
    "title": "Uranium-Backed Stablecoin? Maker Proposal Goes Nuclear",
    "url": "https://decrypt.co/200422/uranium-backed-stablecoin-maker-proposal-goes-nuclear",
    "description": "The latest proposal to back Maker's DAI stablecoin with tokenized uranium might not be as crazy as it sounds. "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-07T13:45:24.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-07T13:43:10.000Z",
    "title": "Hong Kong Delays Retail Trading of Stablecoins Pending Comprehensive Policy",
    "url": "https://www.cryptopolitan.com/hong-kong-delays-stablecoins-retail-trading/",
    "description": "In a recent announcement made by the Secretary for Financial Services and the Treasury in Hong Kong, Christopher Hui, it was revealed that retail trading of stablecoins will not be permitted in the region until a comprehensive stablecoin policy is unveiled next year. The decision comes amidst growing concerns about the lack of regulation in ... <a title=\"Hong Kong Delays Retail Trading of Stablecoins Pending Comprehensive Policy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hong-kong-delays-stablecoins-retail-trading/\" aria-label=\"More on Hong Kong Delays Retail Trading of Stablecoins Pending Comprehensive Policy\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-07T14:00:46.000Z",
    "title": "Solana Outshines Rivals On Weekend Top 10 Roster With 18% Rally",
    "url": "https://www.newsbtc.com/news/solana-outshines-rivals-on-weekend/",
    "description": "Solana experienced a significant surge of approximately 20% during the last few days of September and into the first week of October. This sudden price increase has piqued the interest of investors and enthusiasts alike, sparking discussions about its underlying causes. One prominent question on people&#8217;s minds is whether this uptick in SOL&#8217;s value is directly correlated with Bitcoin&#8217;s performance during the same period or if there are distinct factors driving SOL&#8217;s price rise independently of Bitcoin&#8217;s movements. Related Reading: Dogecoin Under Pressure: Will Bearish Momentum Push Meme Coin Below $0.06? Before this increase, SOL had a tough time because a U.S. court allowed the sale of $1.3 billion worth of SOL from the bankrupt exchange FTX. So, there&#8217;s curiosity about whether SOL&#8217;s recent price jump is connected to Bitcoin or if there are other factors behind it. Solana: Challenges And Market Allure The Solana (SOL) blockchain network has seen recent difficulties, however it has garnered significant attention and demand in the market. Despite the lackluster price performance of its native token, the proof-of-stake (PoS) network has utilised the bear market to improve its technological capabilities and forge important alliances with prominent entities in the realm of traditional banking. Source: Coingecko The bankruptcy court has implemented mechanisms to mitigate the potential adverse impact of FTX asset liquidation on the cryptocurrency market. These measures involve mandating the sale of assets through a financial advisor in weekly installments, adhering to predetermined regulations. At the time of writing, SOL was trading at $23.43, down a measly 0.3% in the last 24 hours, but gained sustained an 18% rally in the last seven days, data from crypto market tracker Coingecko shows. Related Reading: Trillions In Shiba Inu On The Move: What Lies Ahead For The Meme Coin? SOL Liquidity Soars With Network Stability Nansen, an on-chain analytics firm, recently published a report on Solana, highlighting its key strengths and potential. Solana is known for its cost-efficiency and high-speed transactions, earning it the nickname &#8220;The Ethereum Killer.&#8221; It boasts a transaction processing speed of over 3,000 transactions per second, which is nearly 30 times faster than Ethereum. The chain&#8217;s liquidity improved as a result of the dramatic increase in network stability. At press time, the TVL in terms of SOL was $27.12 million, more than double what it was at the start of the year. SOL market cap currently at $9.7 billion. Chart: TradingView.com Solana&#8217;s Rise Fueled by DApps And NFTs, Targets 5th-Largest Crypto Spot The surge of SOL was further bolstered by the expansion in the adoption of decentralized applications (DApps) and the rise in nonfungible token (NFT) volumes on the Solana blockchain. The current price of SOL is now making efforts to establish a support level at $23, aiming to solidify its position as the fifth-largest cryptocurrency (excluding stablecoins) in terms of market capitalization. In the recent Epoch 512, 19.637 million SOL were unstaked, with a net unstake of 16.516 million SOL (about $372 million). Most belonged to a16z and the previous Alameda (now or ftx estate). a16z: BZpEFk&#8230;oPPBm7 unstaked 5.006 million SOL, a16z-2: GCmFQL&#8230;ozXMwY unstaked 2.033… — Wu Blockchain (@WuBlockchain) October 6, 2023 Meanwhile, recent updates to Solana Compass have revealed details about recent activities on the Solana network, particularly during the 512 epoch. The website that keeps tabs on SOL staking activity suggests that there were around 19.637 million SOL coins that were unstaked during this time. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from iStock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-07T14:00:42.000Z",
    "title": "Crypto Analyst Nicholas Merten Sounds Alarm on Cardano (ADA) and Ripple ($XRP); InQubeta’s ($QUBE) Upward Trend Entices Major Investors",
    "url": "https://www.crypto-news-flash.com/crypto-analyst-nicholas-merten-sounds-alarm-on-cardano-ada-and-ripple-xrp-inqubetas-qube-upward-trend-entices-major-investors/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-analyst-nicholas-merten-sounds-alarm-on-cardano-ada-and-ripple-xrp-inqubetas-qube-upward-trend-entices-major-investors",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-28.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-28.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-28-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The insights of seasoned analysts serve as a guide for investors navigating the digital asset universe. Recently, crypto analyst Nicholas Merten has sounded an alarm, drawing attention to two prominent players in the crypto arena: Cardano ($ADA) and Ripple ($XRP). These remarks have caused an uproar in the crypto community, sparking discussions and raising pertinent [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-07T13:43:00.000Z",
    "title": "SBF Lieutenant Testifies on FTX Fabricated Insurance Fund Balance",
    "url": "https://coinedition.com/sbf-lieutenant-testifies-on-ftx-fabricated-insurance-fund-balance/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/SBF-and-FTX.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SBF and FTX\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/SBF-and-FTX.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/SBF-and-FTX-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/SBF-and-FTX-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/SBF-and-FTX-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/SBF-and-FTX-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/SBF-and-FTX-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>On the fourth day of the trial involving FTX founder Sam Bankman-Fried (SBF), FTX’s former Chief Technology Officer, Gary Wang, delivered a bombshell testimony that sent shockwaves through the crypto world. Parts of Wang&#8217;s revelations centered around the alleged fraudulent nature of FTX&#8217;s published insurance fund balance. Under intense questioning, Wang admitted that the published [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sbf-lieutenant-testifies-on-ftx-fabricated-insurance-fund-balance/\">SBF Lieutenant Testifies on FTX Fabricated Insurance Fund Balance</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]