[
  {
    "source": "CoinDesk",
    "date": "2023-08-30T00:00:00.000Z",
    "title": "Tornado Cash Indictments May Prove to Be Just a Localized Storm After All",
    "url": "https://www.coindesk.com/policy/2023/08/30/tornado-cash-indictments-may-prove-to-be-just-a-localized-storm-after-all/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Tornado Cash indictments could be another tipping point for crypto. How the case plays out could define how the federal government can deal with decentralized trading platforms if they’re seen as broad precedents. But the case may be much more straightforward than initial reactions suggested."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-30T00:07:45.000Z",
    "title": "Grayscale Bitcoin ETF decision: What’s at stake?",
    "url": "https://www.cryptopolitan.com/grayscale-bitcoin-etf-decision-what-at-stake/",
    "description": "Alright, folks, let&#8217;s cut through the noise. With bated breath, the financial world watches Grayscale&#8217;s next move after the U.S. Court of Appeals gave the Securities and Exchange Commission (SEC) a long overdue reality check. That&#8217;s right, the sacred spot market Bitcoin ETF might just become a reality in the U.S., and here&#8217;s why it&#8217;s ... <a title=\"Grayscale Bitcoin ETF decision: What&#8217;s at stake?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/grayscale-bitcoin-etf-decision-what-at-stake/\" aria-label=\"More on Grayscale Bitcoin ETF decision: What&#8217;s at stake?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-29T23:58:18.000Z",
    "title": "Today’s crypto highlights: Unmissable updates unveiled",
    "url": "https://www.cryptopolitan.com/today-crypto-highlights-unmissable-updates/",
    "description": "The crypto sphere never slows down, and neither should you. From Binance&#8217;s fresh stance to Grayscale&#8217;s courtroom standoff, it&#8217;s been a whirlwind. Not to be left behind, Shibarium’s audacious move only further heats the crypto arena. Let’s dive into the details. Grayscale&#8217;s Victory: More than Just a Headline In the quest for Bitcoin ETF dominance, ... <a title=\"Today&#8217;s crypto highlights: Unmissable updates unveiled\" class=\"read-more\" href=\"https://www.cryptopolitan.com/today-crypto-highlights-unmissable-updates/\" aria-label=\"More on Today&#8217;s crypto highlights: Unmissable updates unveiled\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-29T23:50:21.000Z",
    "title": "USDC debuts on Base network: Circle CEO",
    "url": "https://www.cryptopolitan.com/usdc-debuts-on-base-network-circle-ceo/",
    "description": "Major shifts are on the horizon for USDC users and the Base network. An announcement from Circle&#8217;s CEO, Jeremy Allaire, revealed that their renowned stablecoin, USD Coin (USDC), will soon make its native appearance on the Base network. This move promises to simplify transactions and replace the workaround coin most have been using, marking yet ... <a title=\"USDC debuts on Base network: Circle CEO\" class=\"read-more\" href=\"https://www.cryptopolitan.com/usdc-debuts-on-base-network-circle-ceo/\" aria-label=\"More on USDC debuts on Base network: Circle CEO\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-29T23:40:56.000Z",
    "title": "Surprise move: X to allow pre-election political ads",
    "url": "https://www.cryptopolitan.com/x-to-allow-pre-election-political-ads/",
    "description": "Treading an uncharted path, X, once recognized as Twitter to millions, has taken the bold step to reintroduce political ads from parties and individual candidates to its platform, gearing up for the 2024 presidential showdown. This significant shift in policy has set the social media universe abuzz, raising questions, concerns, and opportunities in equal measure. ... <a title=\"Surprise move: X to allow pre-election political ads\" class=\"read-more\" href=\"https://www.cryptopolitan.com/x-to-allow-pre-election-political-ads/\" aria-label=\"More on Surprise move: X to allow pre-election political ads\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-30T00:00:23.000Z",
    "title": "Grayscale’s Win Breathes Life Into Litecoin, Post-Halving Rally On?",
    "url": "https://www.newsbtc.com/news/litecoin/grayscales-win-breathes-life-into-litecoin-post-halving-rally-on/",
    "description": "In a refreshing ruling on August 29, the United States District of Columbia Court of Appeals said the stringent Securities and Exchange Commission (SEC) was, after all, wrong in denying Grayscale to convert their over-the-counter (OTC) Bitcoin Trust (GBTC) into a Bitcoin spot exchange-traded fund (ETF).  The regulator had previously barred the conversion of the GBTC to an ETF, citing an alleged absence of measures to prevent price manipulation, forcing Grayscale to sue. Before this ruling, the presiding judge said SEC needed to elaborate on why they denied Grayscale&#8217;s application. Litecoin Rebounds Following today&#8217;s court statement, Bitcoin prices soared, and the aftermath of this pump has positively impacted Litecoin. As it is, BTC is up roughly 10%, sharply rebounding from around $25,800 support recorded last week. Meanwhile, LTC, the bitcoin &#8220;silver,&#8221; is up 7% when writing, aiming to reverse losses of August 17.  Litecoin is changing hands at around $70, with a noticeable increment in trading volumes. Typically, in crypto trading, a spike in volumes, regardless of trend direction, can point to engagement and provide a &#8220;hint&#8221; of traders&#8217; sentiment. With rising volumes and expanding prices, it could suggest that bulls are positioning themselves for even more gains in the sessions ahead. Meanwhile, sharp losses with increasing volumes may mean bears are unloading, and prices may drop. Related Reading: Bitcoin Bullish Signal: Exchange Netflow Remains Negative Post-Halving Rally On? The expansion in LTC trading volumes, as visible in the daily chart, could translate to a possible bottom for the digital asset that has been under pressure in the past few sessions. To illustrate, LTC is down 26% in August 2023 alone. This dump is despite news of the Litecoin network halving its miner rewards to 6.25 LTC in early August.  In crypto, halving events has historically been associated with fresh cycles of increasing demand for the underlying coin. For Bitcoin, past performances indicate that the coin tends to rally months after the halving event. Meanwhile, in Litecoin, it has been mixed, but spot prices are generally higher than in 2019 when it halved. With Grayscale igniting demand in Bitcoin and other proof-of-work altcoins like Litecoin, it is yet to be seen whether bulls will build on this and push prices, especially of LTC, higher. LTC prices are currently trending inside the August 17 bear candlestick. Technically, this is bearish from volume analysis. A sharp reversal and rally, ideally above $75, peeling back August 17 losses, might catalyze more demand, potentially setting the base for a relieving post-halving rally.  Related Reading: Bitcoin Price Taps $28,000 On Grayscale Ruling, Soaring Stock Market If this is the case, August 17&#8217;s losses could be the climactic end of the leg down as LTC establishes a triple bottom at around the $60 and $65 support zone. Previously, LTC found support in this region in March 2023 and December 2022. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-30T00:00:57.000Z",
    "title": "Bloomberg Analyst Says Ethereum Will Be the Winner of the ‘Stablecoin Wars’ Amid Massive Adoption Trends",
    "url": "https://dailyhodl.com/2023/08/29/bloomberg-analyst-says-ethereum-will-be-the-winner-of-the-stablecoin-wars-amid-massive-adoption-trends/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/says-ethereum-winner-wars.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/says-ethereum-winner-wars.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/says-ethereum-winner-wars.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/says-ethereum-winner-wars.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/says-ethereum-winner-wars.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/says-ethereum-winner-wars.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/says-ethereum-winner-wars.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto market analyst at Bloomberg Intelligence thinks it&#8217;s already &#8220;pretty clear&#8221; that Ethereum (ETH) will win the &#8220;upcoming stablecoin wars.&#8221; Jamie Coutts says on the social media platform X that Ethereum and its broader ecosystem, including layer-2 projects like Optimism (OP), Base and Arbitrum (ARB), leads all other alternative networks across most network-adoption metrics. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/29/bloomberg-analyst-says-ethereum-will-be-the-winner-of-the-stablecoin-wars-amid-massive-adoption-trends/\">Bloomberg Analyst Says Ethereum Will Be the Winner of the ‘Stablecoin Wars’ Amid Massive Adoption Trends</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]