[
  {
    "source": "Cointelegraph",
    "date": "2023-11-24T13:49:02.000Z",
    "title": "Interactive Brokers Hong Kong licensed in Hong Kong for retail virtual asset trading  ",
    "url": "http://cointelegraph.com/news/interactive-brokers-hong-kong-licensed-in-hong-kong-for-retail-virtual-asset-trading",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/ee72ad7b-5518-44c8-9490-06dcf5f99552.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> Interactive Brokers Hong Kong was approved for a license in Hong Kong for virtual asset trading for retail clients, as announced by the regional managing director on LinkedIn.</p>\n                    <p><p>The brokerage firm Interactive Brokers Hong Kong has been licensed in Hong Kong for virtual asset trading by retail clients, according to a <a href=\"https://www.linkedin.com/posts/david-friedland-a756ab11_another-first-interactive-brokers-hong-activity-7133698391158489088-pEI7/?utm_source=share&amp;utm_medium=member_ios\" target=\"_blank\" rel=\"noopener nofollow\">post</a> on LinkedIn by the Managing Director for Asia Pacific at Interactive Brokers, David Friedland.</p><p>The post said the trading of virtual assets is currently in Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), with additional information on the licensing soon to be available in the official announcement. </p><p>Cointelegraph contacted Interactive Brokers for additional information and comments on the development, but has not yet received a reply. </p><p>This announcement comes in the heat of a <a href=\"https://cointelegraph.com/news/hong-kong-mass-crypto-adoption-hashkey-capital-jupiter-zheng\">crypto industry build-up in Hong Kong</a>. The region has increasingly become a hotspot for crypto-related activities, with companies flocking to receive local licensing. </p><p>Back in August of this year, Hashkey was <a href=\"https://cointelegraph.com/news/hong-kong-welcomes-first-licensed-retail-crypto-exchange-hashkey\">the first crypto exchange in Hong Kong</a> to receive a specific license to offer crypto assets to retail investors.</p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/osl-owner-secures-90-million-investment\"><strong><em>Owner of Hong Kong crypto exchange OSL secures $90M investment</em></strong></a></p><p>In November, the Swiss crypto bank SEBA received a license from the Hong Kong Securities and Futures Commission (SFC), allowing it to <a href=\"https://cointelegraph.com/news/swiss-crypto-bank-seba-hong-kong-sfc-license\">offer various crypto-related services</a> to clients in the region.</p><p>However, the Hong Kong crypto scene was also hit with a scandal in September, which involved the unlicensed crypto exchange<a href=\"https://cointelegraph.com/news/hong-kong-mass-crypto-adoption-hashkey-capital-jupiter-zheng\"> JPEX allegedly scamming investors</a> out of nearly $165 million. </p><p>A month after this, regulators in Hong Kong announced <a href=\"https://cointelegraph.com/news/hong-kong-regulator-changes-crypto-policies\">updates to its crypto policies</a> “in light of the latest market developments and inquiries from the industry.” The updated policy states that certain digital currency offerings will only be available to professional investors. </p><p>Moreover, prior to handling transactions, the crypto intermediaries should “assess whether clients have knowledge of investing in virtual assets.” </p><p>In a recent survey by the Investor and Financial Education Council (IFEC) of Hong Kong, it emerged that only <a href=\"https://cointelegraph.com/news/less-50-percent-hong-kong-retail-crypto-investors-aware-regulations\">47% of retail investors in Hong Kong</a> are aware of local virtual asset regulations. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/htx-hacked-again-100k-koreans-test-cbdcs-binance-asia-express/\"><strong><em>HTX hacked again for $30M, 100K Koreans test CBDC, Binance 2.0: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-24T13:42:05.000Z",
    "title": "Tether, Bitfinex agree to drop opposition to FOIL request",
    "url": "http://cointelegraph.com/news/tether-bitfinex-agree-drop-opposition-foil-request",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/c0213bce-d532-4403-9e47-8d433787cf6d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Tether and Bitfinex say the decision not to appeal the Freedom of Information Law request by several media outlets was made in the interests of \"transparency.\"</p>\n                    <p><p>Tether and Bitfinex have jointly agreed to drop initial opposition to a freedom of information (FOIL) request lodged in New York by a number of high-profile news publications.</p><p>A <a href=\"http://docs.google.com/document/u/0/\" target=\"_blank\" rel=\"noopener nofollow\">statement </a>from the USDT stablecoin issuer and cryptocurrency exchange shared with Cointelegraph notes that it is committed to transparently sharing information following a FOIL request from Coindesk earlier this year.</p><p>The companies also indicated that they would not be openly releasing documentation, claiming that the approach is not in line with its business practices:</p><blockquote>“It's essential to clarify that transparency does not mean a wholesale release of all our documents.”</blockquote><p>Tether and Bitfinex will not appeal against the FOIL request put forward by journalists including Zeke Faux, Shane Shifflett and Ada Hui, while claiming that this is despite “certain behaviors” exhibited by the writers in question.</p><p>The company’s claim that Faux’s past reports on Tether and Bitfinex have “extended beyond the boundaries of professional journalism”. They also claim that media outlets including the Wall Street Journal and Bloomberg, whose journalists are participating in the ongoing FOIL request, have been “one-sided and inaccurate”.</p><p><a href=\"https://cointelegraph.com/news/tether-cto-paolo-ardoino-money-2020-interview\"><strong><em>Related: Tether’s game plan in El Salvador: Why invest in Volcano Energy?</em></strong></a></p><p>The statement stresses that both companies are committed to transparency and remain open to engagement with journalists and regulatory authorities, given that they “adhere to ethical reporting standards and respect data privacy boundaries”.</p><p>Tether and Bitfinex have also called for “responsible document review” before any public release of information and that their efforts to be transparent do not “equate to unrestricted public disclosure of all documents”.</p><p>Cointelegraph has reached out to Tether to ascertain finer details of the FOIL request and the information it pertains to.</p><p>The ongoing FOIL request came after Tether and Bitfinex reached an agreement with the New York attorney general’s (NYAG) office in Feb. 2021. As initially <a href=\"https://www.cnbc.com/2021/02/23/tether-bitfinex-reach-settlement-with-new-york-attorney-general.html\" target=\"_blank\" rel=\"noopener nofollow\">reported </a>by CNBC, this involved paying an $18.5 million fine to settle a two-year long legal dispute regarding the alleged comingling of $850 million of client and corporate funds. </p><p>Part of the settlement required Tether and Bitfinex to submit quarterly transparency reports to the NYAG for two years. Following the end of these obligations, Coindesk submitted a FOIL request in New York, seeking public disclosure of materials relating to Tether’s first quarterly that it had submitted under the agreement of the settlement. </p><p>In <a href=\"https://tether.to/en/tether-on-FOIL-and-continued-commitment-to-transparency/\" target=\"_blank\" rel=\"noopener nofollow\">June 2023</a>, Tether claimed that it had opposed the FOIL request to prevent public dissemination of “confidential customer data” and to prevent the use of “sensitive commercial information” which it fears could be exploited by “malicious actors”.</p><p><a href=\"https://cointelegraph.com/magazine/interview-2-years-after-john-mcafee-death-wife-janice-broke-still-grieving/\"><strong><em>Magazine: Exclusive: 2 years after John McAfee’s death, widow Janice is broke and needs answers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-24T13:44:23.000Z",
    "title": "Gold Rush Global Group Pty Ltd Showcases Leadership in Financial Services with Emphasis on Cryptocurrency Trading",
    "url": "https://cryptodaily.co.uk/2023/11/gold-rush-global-group-pty-ltd-showcases-leadership-in-financial-services-with-emphasis-on-cryptocurrency-trading",
    "description": "Gold Rush Global Group Pty Ltd Showcases Leadership in Financial Services with Emphasis on Cryptocurrency Trading"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-24T13:51:25.000Z",
    "title": "Analysts bullish on Polygon, traders exploring PEPE and Everlodge",
    "url": "https://crypto.news/analysts-bullish-on-polygon-traders-exploring-pepe-and-everlodge/",
    "description": "As Polygon trends higher, traders have their attention on PepeCoin (PEPE) and Everlodge (ELDG)"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-24T13:50:55.000Z",
    "title": "Victory Securities gains approval by Hong Kong SFC",
    "url": "https://crypto.news/victory-securities-gains-approval-by-hong-kong-sfc/",
    "description": "In a Nov. 24 announcement, the Hong Kong-based securities firm Victory Securities has shared the news that it has secured official approval from the Hong Kong Securities and Futures Commission (SFC) to offer virtual asset trading and consulting services to&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-24T14:00:45.000Z",
    "title": "XRP Price Could Hit $10,000 If It Overtakes SWIFT, Pundit Suggests",
    "url": "https://www.newsbtc.com/xrp-news/xrp-price-10000-overtakes-swift/",
    "description": "Edward Farina, Head of Social Adoption at XRP Healthcare, recently proposed a scenario where the price of XRP could potentially surge to $10,000. His projection is based on the possibility of the token as a bridge currency and RippleNet replacing SWIFT (Society for Worldwide Interbank Financial Telecommunication) in the global cross-border payment systems. Could XRP Price Reach $10,000? Farina&#8217;s commentary dives into the principles of market dynamics. He argues against common misconceptions about the cryptocurrency&#8217;s potential growth. “Few people seem to understand the principle of supply and demand. I always see people being shocked when they see someone saying that XRP can reach $10k. (Not saying it necessarily will.),” Farina remarked. Related Reading: Pro-XRP Lawyer Deaton Picks His Top 10 Cryptos For The Year Ahead He emphasizes that the global financial sector&#8217;s movement of hundreds of trillions of dollars annually means even a small market share could lead to a significant surge in its valuation. Farina also elaborates on the current capabilities of the SWIFT system, handling billions of transactions per hour, and the impact of RippleNet potentially replacing it. “The problem with the way most people view XRP’s potential to grow exponentially, is that they think it can&#8217;t reach that high of a market cap. They&#8217;re failing to realize that Financial Institutions move hundreds of trillions worldwide. If XRP captures a tiny fraction of that, it will catapult XRP to unprecedented levels,” he explains. This highlights the vast, untapped market that XRP could penetrate. However, Farina does not provide exact figures, nor does he explain how much capital would have to flow into the cryptocurrency to reach the price of $10,000. Related Reading: XRP On The Verge Of A Surge: Analyst Pinpoints Next Bullish Targets Besides that, Farina underscores XRP&#8217;s supposed technological superiority, particularly in terms of transaction speed and finality. “XRP settles value in real time (an average of 3 seconds) and with finality. BTC cannot do that, neither ETH nor SWIFT. Period,” he asserts, making a case for the tokens&#8217; efficiency and reliability over existing systems. Can Ripple Replace SWIFT? The discussion about whether XRP can reach a four- or five-digit price if Ripple replaces SWIFT or only a part of it is almost as old as the token itself. It was only recently that influencer Crypto Eri unearthed a five-year-old statement from Ripple CTO David Schwartz. Schwartz outlined the positive correlation between an asset&#8217;s price and its liquidity. “Higher prices tend to correlate with higher liquidity, which means cheaper payments,” he noted, explaining that as the tokens&#8217; value increases, it becomes a more viable medium for large-scale financial transfers. This ties back to Farina&#8217;s vision of the cryptocurrency disrupting the current financial systems. Grayscale has also recently confirmed XRP&#8217;s potential to compete with SWIFT. In its latest &#8220;Currencies Crypto Sector&#8221; report, the company writes, “Beyond Bitcoin, XRP is the second largest asset. Designed as an alternative to SWIFT, XRP aims to offer fast cross-border payments at lower transaction costs than competitors.” At press time, XRP traded at $0.6208. Featured image from Shutterstock/ FinanzBusiness, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-24T14:00:00.000Z",
    "title": "Binance’s Massive Outflow Resulted in the Suspension of Withdrawal",
    "url": "https://coinedition.com/binances-massive-outflow-resulted-in-the-suspension-of-withdrawal/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/06-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance’s Massive Outflow Resulted in the Suspension of Withdrawal\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/06-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/06-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/06-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/06-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/06-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/06-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/06-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/06-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/06-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/06-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/06-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/06-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/06-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/06-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/06-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/06-1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The world’s largest crypto exchange, Binance, has been creating shockwaves in the crypto economy with Changpeng Zhao’s guilty plea and his subsequent resignation. Though the following 24 hours saw massive outflows from Binance, customers are unable to withdraw their holdings at present. Edward Farina, the CEO of Alpha Lions Academy, a prominent player in the [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/binances-massive-outflow-resulted-in-the-suspension-of-withdrawal/\">Binance’s Massive Outflow Resulted in the Suspension of Withdrawal</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-24T13:55:28.000Z",
    "title": "Gas (GAS) Price Prediction 2023-2030: Will GAS Price Hit $100 Soon?",
    "url": "https://coinedition.com/gas-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/Gas-GAS-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Gas-(GAS)-Price-Prediction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/Gas-GAS-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/Gas-GAS-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/Gas-GAS-Price-Prediction-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/Gas-GAS-Price-Prediction-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/Gas-GAS-Price-Prediction-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/Gas-GAS-Price-Prediction-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/Gas-GAS-Price-Prediction-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/Gas-GAS-Price-Prediction-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/Gas-GAS-Price-Prediction-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/Gas-GAS-Price-Prediction-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/Gas-GAS-Price-Prediction-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/Gas-GAS-Price-Prediction-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/Gas-GAS-Price-Prediction-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/Gas-GAS-Price-Prediction-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/Gas-GAS-Price-Prediction-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/Gas-GAS-Price-Prediction-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Neo has made its mark in the crypto industry with its diverse features and services. As investor demand for Neo continues to spike, developments can be seen throughout the network. At the same time, GAS has become a key token on several investor watchlists. As interest increases for this token, the community will be curious [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/gas-price-prediction/\">Gas (GAS) Price Prediction 2023-2030: Will GAS Price Hit $100 Soon?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]