[
  {
    "source": "CoinDesk",
    "date": "2024-01-09T21:31:53.000Z",
    "title": "SEC Twitter 'Compromised,' Chair Gensler Says After Account Said Bitcoin ETFs Approved",
    "url": "https://www.coindesk.com/policy/2024/01/09/sec-twitter-compromised-chair-gensler-says-after-account-said-bitcoin-etfs-approved/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Securities and Exchange Commission (SEC) has not approved any spot bitcoin ETF applications as of Tuesday afternoon, despite a tweet from the regulator's X (formerly Twitter) account saying they had been, the agency's chair said."
  },
  {
    "source": "CoinDesk",
    "date": "2024-01-09T21:13:53.000Z",
    "title": "No, a Trump Victory Might Be Bad for Crypto",
    "url": "https://www.coindesk.com/consensus-magazine/2024/01/09/no-a-trump-victory-might-be-bad-for-crypto/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A response to Politico’s article predicting good times if the ex-POTUS wins re-election."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-09T21:37:37.000Z",
    "title": " Gary Gensler reports SEC X account hacked — no spot Bitcoin ETF approval yet   ",
    "url": "https://cointelegraph.com/news/sec-account-hacked-no-spot-bitcoin-etf-approval",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMjJjZjI3Y2UtMWZhNS00ZWM4LTk3MGUtYTc1NTNmOGM3Yjc3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Gensler's post came 15 minutes after the SEC's X account falsely reported that spot Bitcoin ETFs were approved.</p>\n                    <p><p>Multiple news outlets released a false story following the official X (formerly Twitter) account from the United States Securities and Exchange Commission (SEC), posting a tweet claiming that the regulator had approved spot Bitcoin exchange-traded funds for the first time.</p><p>In a Jan. 9 X post, SEC chair Gary Gensler <a href=\"https://twitter.com/GaryGensler/status/1744833049064288387\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the commission had “not approved the listing and trading of spot bitcoin exchange-traded products,” despite a tweet from the official SEC X account. News outlets including Cointelegraph, Blockworks, and Reuters reported on the story from the SEC before Gensler’s statement.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><p><a href=\"https://cointelegraph.com/news/sec-account-hacked-no-spot-bitcoin-etf-approval\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-09T21:35:00.000Z",
    "title": " FINRA adds crypto assets section to its annual oversight report ",
    "url": "https://cointelegraph.com/news/finra-adds-crypto-assets-section-annual-oversight-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYTJmOTc2MzctYjNhMi00NmUzLTk1MGMtMmIzNjVlYzU5YWVhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The securities industry’s self-regulating organization offers annual advice to its members on how to stay out of trouble. </p>\n                    <p><p>The Financial Industry Regulatory Authority (FINRA) has released its 2024 Annual Regulatory Oversight Report, which contains a section devoted to crypto assets for the first time.</p><p>FINRA is the United States self-regulatory organization that oversees securities broker-dealers, for whom membership is mandatory. It is under the regulation of the Securities and Exchange Commission (SEC). It described its oversight report as “one of the tools a member firm can use to help inform the development and operation of its compliance program.” Crypto Asset Developments and Advertised Volume were new among the 26 topics covered.</p><p>The crypto section was targeted to firms that currently engage in crypto-related activities or intend to do so. FINRA’s membership application program approves firms to serve as an agency in private (non-public) placements, operate an alternative trading system for crypto asset securities and provide custody services. The report <a href=\"https://www.finra.org/rules-guidance/guidance/reports/2024-finra-annual-regulatory-oversight-report/crypto#_edn1\" target=\"_blank\" rel=\"noopener nofollow\">stated</a>:</p><p><a href=\"https://cointelegraph.com/news/finra-adds-crypto-assets-section-annual-oversight-report\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-09T21:20:00.000Z",
    "title": " AI tokens had 3rd highest returns of any category in 3 months — Binance ",
    "url": "https://cointelegraph.com/news/ai-tokens-3rd-highest-returns-any-category-3-months-binance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMGU5NmQ1MjctYzBjMC00MTA5LWJiZjktMWE1MTZkMzdlOTA2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The crypto exchange reported that AI tokens like Fetch, Ocean, and Oraichain outperformed most other sectors of the crypto market.</p>\n                    <p><p>Blockchain tokens associated with artificial intelligence (AI) <a href=\"https://www.binance.com/en/research/analysis/ai-x-crypto-latest-data-and-developments\" target=\"_blank\" rel=\"noopener nofollow\">saw</a> outsized gains in the three months leading up to Jan. 2, according to a report from Binance Research. </p><p>The tokens were the second-highest performing category behind Ethereum layer 2s when excluding memecoins. When memecoins are included, AI tokens were the third-best performing category. The Binance researchers cited a Dune Analytics dashboard from @Cryptokoryo_research as the source of their data.</p><p>The report categorized six coins as “AI tokens,” including SingularityNET (AGIX), Cortex (CTXC), Fetch (FET), Ocean Protocol (OCEAN), Oraichain (ORAI), and Render (RNDR). These coins saw price increases of 185% over the three months. </p><p><a href=\"https://cointelegraph.com/news/ai-tokens-3rd-highest-returns-any-category-3-months-binance\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-09T21:17:12.000Z",
    "title": " Spot Bitcoin ETFs secure landmark approval in the United States  ",
    "url": "https://cointelegraph.com/news/spot-bitcoin-etf-approval-united-states",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYzc4OTJiMTQtMjU1Mi00MDA5LWJjNDgtNzkzZDY2MTU4ZWU2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The United States Securities and Exchange Commission has given the green light to the first spot Bitcoin ETF in the country.</p>\n                    <p><p>The Securities and Exchange Commission (SEC) has finally approved the United States’ first regulated spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded funds (ETF) — a decade after it received the first application.</p><p>In a Jan. 9 post on X (formerly Twitter),<strong> </strong>the securities regulator <a href=\"https://twitter.com/secgov/status/1744829327294837236\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it had granted approval for Bitcoin ETFs, presumably through a rule change that allows a spot Bitcoin ETF to be listed and traded on U.S. exchanges. SEC chair Gary Gensler said the approval would allow investors “efficient access to digital asset investments within a regulated framework.”</p><p>The historic approval paves the way for the <a href=\"https://cointelegraph.com/learn/bitcoin-etfs-a-beginners-guide-to-exchange-traded-funds\">first regulated exchange-traded product</a> in the U.S. to give investors direct exposure to the price of Bitcoin without requiring them to buy it or worry about self-custody. Investors will instead buy shares in ETFs that hold Bitcoin as their underlying asset. </p><p><a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-approval-united-states\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-09T21:13:46.000Z",
    "title": " Why is Ethereum (ETH) price down today?  ",
    "url": "https://cointelegraph.com/news/why-is-ethereum-eth-price-down-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTIvNzY1MTY5ZjktYTBmMC00MTdlLTgwYTctZTQ2YzYyZDU4ZjI2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ether price is down today as rising Bitcoin dominance snatches the spotlight away from ETH and altcoins.</p>\n                    <p><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) price is down by 3.18% on Jan. 9 and the recent price correction comes amid reduced activity on the Ethereum network and investors choosing to focus on Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) with the <a href=\"https://cointelegraph.com/news/bitcoin-etf-approval-inevitable-sec-chair-former-jay-clayton\">looming spot ETF</a> decision. </p><p>Let’s investigate the reasons why Ether price is down today.</p><p>The Ether sell-off comes as Bitcoin continues to dominate the crypto markets with an expected spot BTC ETF approval likely on Jan. 10. While some analysts believe the spot Bitcoin ETF approval could <a href=\"https://cointelegraph.com/news/how-will-ethereum-price-react-to-bitcoin-etf-approval\">benefit Ether price</a> in the long run, the second largest digital asset is down 0.5% to begin 2024.</p><p><a href=\"https://cointelegraph.com/news/why-is-ethereum-eth-price-down-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-09T21:15:50.000Z",
    "title": "The SEC announces Twitter account was compromised and ETFs have not been approved",
    "url": "https://cryptoslate.com/the-sec-announces-twitter-account-was-compromised-and-etfs-have-not-been-approved/",
    "description": "<p>UPDATE: Gary Gensler announced on Twitter the SEC account was compromised and the ETFs have NOT been approved yet. The @SECGov twitter account was compromised, and an unauthorized tweet was posted. The SEC has not approved the listing and trading of spot bitcoin exchange-traded products. &#8212; Gary Gensler (@GaryGensler) January 9, 2024 &#160; The SEC [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/the-sec-announces-twitter-account-was-compromised-and-etfs-have-not-been-approved/\">The SEC announces Twitter account was compromised and ETFs have not been approved</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  }
]