[
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T05:46:00.000Z",
    "title": "Cardano Foundation Disputes SEC’s Security Classification; Robinhood Considers Delisting ADA",
    "url": "https://www.cryptopolitan.com/cardano-disputes-sec-robinhood-delisting-ada/",
    "description": "The cryptocurrency market is facing regulatory hurdles and compliance concerns in the United States, particularly impacting Cardano (ADA), Solana (SOL), and Polygon (MATIC). In a recent lawsuit against Binance, the United States Securities and Exchange Commission (SEC) classified several prominent cryptocurrencies, including Cardano, as securities. However, the Cardano Foundation&#8217;s CEO disagrees with this classification, highlighting ... <a title=\"Cardano Foundation Disputes SEC&#8217;s Security Classification; Robinhood Considers Delisting ADA\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-disputes-sec-robinhood-delisting-ada/\" aria-label=\"More on Cardano Foundation Disputes SEC&#8217;s Security Classification; Robinhood Considers Delisting ADA\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-08T05:56:50.000Z",
    "title": "$FLOKI Adoption Continues Rising Amid Unstable Market: AliExpress Association",
    "url": "https://nulltx.com/floki-adoption-continues-rising-amid-unstable-market-aliexpress-association/",
    "description": "In 2023, $Floki Inu had grown remarkably in popularity among cryptocurrency users, becoming a well-known memecoin. Its acceptance has been further accelerated by the recent addition of Floki Inu as a payment option on AliExpress through Shopping.io, which has important ramifications for its position going forward as a reliable investment among other prominent memecoins. AliExpress [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-08T05:53:54.000Z",
    "title": "Ethereum Price Analysis & Prediction (June 7th) – ETH Climbs Back Above $1800 in a Fresh Recovery After Losing 7% Yesterday",
    "url": "https://nulltx.com/ethereum-price-analysis-prediction-june-7th-eth-climbs-back-above-1800-in-a-fresh-recovery-after-losing-7-yesterday/",
    "description": "Following the current crypto market fall, Ethereum&#8216;s price decreased by 7% to $1,785 yesterday and remained on a downward slope. The price recovers quickly and shows signs of a possible reversal. Ethereum finally resumed bearish after breaking out of a descending resistance to retap the $1,900 level in the past week. The false breakout appeared [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-08T05:41:46.000Z",
    "title": "Spoiler Alert: How TMS Network (TMSN) Suddenly Outranked Avalanche (AVAX) and BNB (BNB)",
    "url": "https://nulltx.com/spoiler-alert-how-tms-network-tmsn-suddenly-outranked-avalanche-avax-and-bnb-bnb/",
    "description": "The TMS Network (TMSN) has been making waves in the crypto world, attracting investors from many other platforms. Avalanche (AVAX) and BNB (BNB) have also seen major dynamics, though they’re not quite positive. Let’s see how these three platforms and currencies have been doing recently.  TMS Network (TMSN) The TMS Network (TMSN) is an Ethereum-based [&#8230;]"
  }
]