[
  {
    "source": "NewsBTC",
    "date": "2023-11-19T19:00:22.000Z",
    "title": "Kronos Research Halts Operations After Losing $26 Million In Security Breach",
    "url": "https://www.newsbtc.com/news/kronos-research-halts-operations-after-losing-26-million-in-security-breach/",
    "description": "Kronos Research, a Taipei-based market maker, trading firm, and venture capital fund, witnessed the withdrawal of significant amounts of crypto assets due to a breach of its security system.  Kronos Breach: Investigation Underway On Sunday, November 19, Kronos Research disclosed &#8211; via a post on X (formerly Twitter) &#8211; a security incident that involved unauthorized access to its API keys. Consequently, the company lost a significant amount of crypto funds and has halted all trading operations in a bid to launch a full investigation into the incident. A map of funds outflow by on-chain sleuth ZachXBT summed Kronos’ losses to over $25 million in Ether. In a follow-up post on X, the company also confirmed that the losses are about $26 million in crypto assets. Funds outflow from Kronos Wallet &#124; Source: X/ZachXBT Related Reading: Yearn Finance Tumbles: Rug Pull Rumors Swirl As Token Takes A 45% Hit In its initial announcement, Kronos revealed that the potential losses are not a significant portion of its equity. Meanwhile, the trading firm said in its latest update that all losses will be covered internally, and no partners will be affected. Although Kronos has yet to provide an update on its resumption process, the company did say that it aims to resume trading as soon as possible. This $26 million attack on Kronos Research represents the third most significant crypto theft in November 2023. Before this latest incident, data from blockchain security firm Certik revealed that about $173 million had been lost to crypto attacks in November, with Poloniex’s $113 million hack being the most notable yet. How Did This Hack Affect WOO X? Interestingly, Kronos is not the only one affected by this security incident, as WOO X is another cryptocurrency entity that has had to pause its operations momentarily. WOO X is an exchange on which Kronos functions as the market maker for its spot and perpetual futures markets. In an address on the X platform, WOO X acknowledged Kronos’ security situation and announced a temporary pause on all trading to protect users&#8217; positions from a lack of liquidity. The exchange, however, emphasized that all customer funds are safe. Related Reading: Ethereum Whistleblower Reveals When Proof Of ETH Founders’ Fraud Will Be Released As of this writing, WOO X has resumed trading in both the spot and perpetual futures markets. Meanwhile, the exchange claims that clients can now make withdrawals for all assets. Nevertheless, the trading platform has faced some backlash from the online crypto community, with some people pointing to its unclear relationship with Kronos. Cryptocurrency total market cap on the daily timeframe &#124; Source: TOTAL chart on TradingView Featured image from iStock, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-19T19:01:25.000Z",
    "title": "ETH Breaks $2K Barrier: Potential for $2.5K and the Upcoming Prospects for SOL and $NUGX",
    "url": "https://www.crypto-news-flash.com/eth-breaks-2k-barrier-potential-for-2-5k-and-the-upcoming-prospects-for-sol-and-nugx/?utm_source=rss&utm_medium=rss&utm_campaign=eth-breaks-2k-barrier-potential-for-2-5k-and-the-upcoming-prospects-for-sol-and-nugx",
    "description": "<img width=\"512\" height=\"307\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-62.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-62.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-62-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-62-336x200.jpg 336w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Lookonchain&#8217;s November 14, 2023, report reveals significant whale activity in Ethereum (ETH). Notably, a whale at address &#8220;0xee47&#8221; increased holdings by 3,200 ETH, now totaling 183,742 ETH valued at $387.8 million. Another whale at &#8220;0x78D0&#8221; acquired 12,680 ETH with a $3.7 million profit, while &#8220;0xBf71&#8221; deposited 30,001 ETH ($62 million), resulting in a $183 million [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-19T18:45:09.000Z",
    "title": "Leading Crypto Investor Goes Bullish on These 4 Tokens",
    "url": "https://www.crypto-news-flash.com/leading-crypto-investor-goes-bullish-on-these-4-tokens/?utm_source=rss&utm_medium=rss&utm_campaign=leading-crypto-investor-goes-bullish-on-these-4-tokens",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-60.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-60.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-60-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-60-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />BlackRock has filed an S-1 form for an Ethereum ($ETH) Spot ETF following the registration of its trust. Institutional inflows into $BTC and $ETH are guaranteed this cycle, and professionals always look one step ahead. One leading investor has flipped bullish on these four tokens: Avalanche ($AVAX), Fantom ($FTM), Galaxy Fox ($GFOX), and Elrond ($EGLD): [...]"
  }
]