[
  {
    "source": "CoinDesk",
    "date": "2023-06-12T16:33:43.000Z",
    "title": "10 Ways Crypto and AI Can Make Each Other Better (or Maybe Worse)",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/12/10-ways-crypto-and-ai-can-make-each-other-better-or-maybe-worse/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The hype around artificial intelligence is drawing away capital and talent from Web3. But AI and and crypto are overlapping technologies, with potential for each to influence the other, says Jeff Wilser."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-12T16:25:02.000Z",
    "title": "Bitcoin and select altcoins show resilience even as the crypto market sell-off continues",
    "url": "https://cointelegraph.com/news/bitcoin-and-select-altcoins-show-resilience-even-as-the-crypto-market-sell-off-continues",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/1d1e372b-e48c-49ee-bbef-29137c29ca05.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Regulatory enforcement against the crypto sector has spooked investors, but the total crypto market capitalization continues to hold above $1 trillion.</p>\n                    <p><p>A bearish trend formation has been pressuring cryptocurrency prices for the past eight weeks, driving the total market capitalization to its lowest level in more than two months at $1.06 trillion, a 2.4% decline between June 4 and June 11.</p><p>This time, the move wasn’t driven by Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), as the leading cryptocurrency gained 0.8% during the 7-day period. The negative pressure came from a handful of altcoins that plunged over 15%, including <a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>, Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>), Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>), Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) and Polkadot (<a href=\"https://cointelegraph.com/polkadot-price-index\">DOT</a>).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/dbe0cf91-16c9-481f-a9d4-718cbb9cc38d.png\"  /><figcaption style=\"text-align: center;\"><em>Total crypto market cap in USD, 1-day. Source: TradingView</em></figcaption></figure><p>Notice that the downtrend initiated in mid-April has tested the support level in multiple instances, indicating that an eventual break to the upside would require an extra effort from the bulls. </p><p>The United States Securities and Exchange Commission (SEC) <a href=\"https://cointelegraph.com/news/sol-is-not-a-security-says-the-solana-foundation\">tagged multiple altcoins as securities</a> in separate lawsuits filed last week against crypto exchanges Binance and Coinbase.</p><p>Despite the worsening crypto regulatory environment, two derivatives metrics indicate that bulls are not yet throwing in the towel but will likely have a hard time breaking the bearish price formation to the upside.</p><h2>Crypto exchanges are under severe constraints in the U.S.</h2><p>Binance.US announced on June 9 the upcoming <a href=\"https://cointelegraph.com/news/binance-us-suspends-usd-deposits-warns-withdrawal-pause-incoming\">suspension of U.S. dollar deposits and withdrawal</a> channels, besides delisting USD trading pairs. The exchange added that it plans to transition to a crypto-only exchange but maintains a 1:1 ratio for customer assets. The SEC issued an emergency order on June 6 to <a href=\"https://cointelegraph.com/news/binance-us-user-funds-safe-amid-sec-injunction-freeze-assets\">freeze the assets of Binance.US</a>.</p><p>Also on June 9, Crypto.com exchange announced it would<a href=\"https://cointelegraph.com/news/crypto-com-suspends-us-institutional-exchange-service\"> no longer service institutional clients in the U.S.</a> Although the Singapore-based company alleged a lack of client demand, the curious timing matching the recent actions against Coinbase and Binance has raised suspicions, as pictured by UtilizeWeb3 founder, CryptoTea.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The SEC will likely sue Crypto .com<br><br>they sued Coinbase and Binance for selling securities<br><br>specifically naming Solana, Cardano, Sandbox, Matic, CHZ, BNB, Mana, Algo and more<br><br>crypto .com also sells ALL of these cryptos<br><br>plus they launched their own CRO coin<br>plus they offer… <a href=\"https://t.co/2nuqd5ljVY\">pic.twitter.com/2nuqd5ljVY</a></p>&mdash; Crypto Tea (@CryptoTea_) <a href=\"https://twitter.com/CryptoTea_/status/1666606658536058881?ref_src=twsrc%5Etfw\">June 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Despite being spared from the attacks coming from the SEC, the vice-leader Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) traded down 3.5% between June 4 and June 11 after co-founder Vitalik Buterin stated that the<a href=\"https://cointelegraph.com/news/vitalik-buterin-ethereum-fails-without-these-three-transitions\"> Ethereum network would \"fail\"</a> if scaling doesn’t go through. In a June 9 post via his personal blog, Buterin explained that the success of Ethereum depends on layer-2 scaling, wallet security, and privacy-preserving features.</p><h2>Derivatives markets show balanced leverage demand</h2><p>Perpetual contracts, also known as inverse swaps, have an embedded rate that is usually charged every eight hours.</p><p>A positive funding rate indicates that longs (buyers) demand more leverage. Still, the opposite situation occurs when shorts (sellers) require additional leverage, causing the funding rate to turn negative.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/6fb5fafa-102e-4b5c-af91-ce5cd0a75f3b.png\"  /><figcaption style=\"text-align: center;\"><em>Perpetual futures accumulated 7-day funding rate on June 11. Source: Coinglass</em></figcaption></figure><p>The seven-day funding rate for BTC and ETH was neutral, indicating balanced demand from leveraged longs (buyers) and shorts (sellers) using perpetual futures contracts. Curiously, BNB, Solana and Cardano displayed no excessive short demand <a href=\"https://cointelegraph.com/news/why-is-litecoin-price-up-today\">after</a> a 15% or higher weekly price decline.</p><h2>Tether demand in Asia shows modest resilience</h2><p>The Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) premium is a good gauge of China-based crypto retail trader demand. It measures the difference between China-based peer-to-peer trades and the United States dollar.</p><p>Excessive buying demand tends to pressure the indicator above fair value at 100%, and during bearish markets, Tether’s market offer is flooded, causing a 2% or higher discount.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/8bafa6b6-38a1-419b-8880-99e439d285e8.png\"  /><figcaption style=\"text-align: center;\"><em>Tether (USDT) peer-to-peer vs. USD/CNY. Source: OKX</em></figcaption></figure><p>Currently, the Tether premium at OKX stands at 99.8%, indicating a balanced demand from retail investors. Consequently, the indicator shows resilience considering the cryptocurrency markets dropped 17.7% over the last eight weeks to $1.06 trillion from $1.29 trillion.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/democrats-crypto-war-alienate-youth-voters-winklevoss\"><strong><em>Democrats’ ‘war on crypto’ will lose its key voters, Winklevoss twins</em></strong></a></p><p>Given the balanced demand according to the funding rate and stablecoin markets, bulls should be more than satisfied given that the recent regulatory FUD was unable to break the cryptocurrency market capitalization below $1 trillion.</p><p>It is unclear whether the market will be able to break from the bearish trend. Moreover, there is no apparent rationale for bulls to jump the gun and place bets on a V-shaped recovery, given the uncertainty in the regulatory environment. Ultimately, bears are in a comfortable place despite the resilience in derivatives and stablecoin metrics.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-12T16:15:00.000Z",
    "title": "Uwerx (WERX) Announces Upcoming Listing On Uniswap as Presale Winds Down",
    "url": "https://cryptodaily.co.uk/2023/06/uwerx-werx-announces-upcoming-listing-on-uniswap-as-presale-winds-down",
    "description": "<p>Uwerx is positioned to be the best freelance platform for all freelancers worldwide. Through the platform&rsquo;s unique features, freelancers will have a community that hears their needs and helps them grow. Uwerx&rsquo;s presale is coming to a quick close. In this article, we discuss why Uwerxwill be your best investment.</p>\nUwerx (WERX): The Hub of Freelancing Solutions\n<p>Freelancers all over the globe struggle with a plethora of challenges and obstacles on different freelancing platforms. From high flat fees to the inability to land gigs on these platforms, it has become a battle zone for freelancers seeking more gigs. Uwerx aims to solve these challenges and more.</p>\n<p>Uwerx aims to solve several problems that freelancers face in the cryptocurrency industry. This is why the platform offers users a 1% flat fee, a significant reduction compared to the 10% and 20% flat fees offered by freelancing platforms such as Upwork and Fiverr. </p>\n<p>Uwerx is growing beyond expectations. Within a few weeks of launching, the Uwerx platform has grown to over 6,000 signups. The social media platforms are not left out, as Uwerx&rsquo;s Twitter now has 1,627 followers, with Telegram boasting 1,456 subscribers. These numbers have only just begun to grow. With Uwerx&rsquo;s current listing on CoinSniper, and its scheduled listing on Uniswap by the 1st of August, these numbers are bound to quadruple in the coming months.</p>\n<p>Uwerx is here to stay. Uwerx communicates this message to its growing community by announcing a 25-year liquidity lock on its tokens. After 82.8% of Uwerx&rsquo;s users voted for the lock to happen imminently, unlike after the presale as planned, the Uwerx team will make this lock happen before the end of the presale. </p>\n<p>Uwerx has already exceeded all standards of the cryptocurrency industry. The platform proves this with its successful audit undergone by InterFi Network and SolidProof, both renowned authorities in the industry. Once Uwerx is launched on centralized exchanges, the Uwerx team will be renouncing contract ownership, thus ensuring transparency with the platform and reducing taxes to zero..</p>\n<p>The Uwerx Team is also taking steps to transition the platform from the Alpha platform to the Beta platform. Through the Beta platform, Uwerx users can test the platform for themselves, and they are encouraged to share all forms of feedback with the Uwerx team at feedback@uwerx.network. </p>\nThe Uwerx (WERX) Presale is Exceeding Expectations!\n<p>Due to the unexpectedly high demands for Uwerx, the Uwerx team has had to make essential token modifications to accommodate these demands. 98.2% of Uwerx users voted via a Twitter Poll for the Uwerx team to launch a Test Airdrop for the platform. This will be launched on the 31st of July, 2023. &nbsp;Uwerx itself will be launched on the 4th of August, 2023, opening freelancers and crypto investors up to a whole new world. </p>\n<p>The Uwerx team has also unveiled the Uwerx Vault. Through this vault, Uwerx users can store their WERX tokens for different periods and access rewards based on the variables within the platform. </p>\n<p>Uwerx&rsquo;s first presale stage was completed in only 17 days, while its second was completed within eight days. Uwerx is in its fifth presale stage, selling at $0.041 per token, with a 15% bonus on every purchase. Uwerx&rsquo;s hard-cap presale end date has been scheduled for the 31st of July, 2023.</p>\n<p>Are you ready to step into the future and unlock a 15% bonus on your purchases? Click on any of these links to join the Uwerx Presale:</p>\n<p>Presale: www.invest.uwerx.network</p>\n<p>Telegram: https://t.me/uwerx_network</p>\n<p>Twitter: https://twitter.com/uwerx_network</p>\n<p>Website: https://www.uwerx.network/</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T16:38:12.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years, and there is no stopping it anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. Various APE price highlights unfold in this ApeCoin Price Prediction. How much is ApeCoin ... <a title=\"ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T16:30:52.000Z",
    "title": "UBS completes takeover of Credit Suisse, imposing stricter regulations",
    "url": "https://www.cryptopolitan.com/ubs-completes-takeover-of-credit-suisse/",
    "description": "UBS has successfully concluded its emergency acquisition of troubled local rival Credit Suisse, establishing a colossal Swiss bank with a balance sheet worth $1.6 trillion. The merger is the largest banking deal since the 2008 global financial crisis, positioning UBS as a dominant force in wealth management and offering numerous opportunities for clients, employees, shareholders, ... <a title=\"UBS completes takeover of Credit Suisse, imposing stricter regulations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ubs-completes-takeover-of-credit-suisse/\" aria-label=\"More on UBS completes takeover of Credit Suisse, imposing stricter regulations\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-12T16:34:49.000Z",
    "title": "Tether CTO says $1b USDT minted on Ethereum reserved for chain swapping",
    "url": "https://crypto.news/tether-cto-says-1b-usdt-minted-on-ethereum-reserved-for-chain-swapping/",
    "description": "Tether recently minted another $1 billion worth of its Tether USDT stablecoin on the Ethereum blockchain, which is another big issuance within two months since its last minting on April 21."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-12T16:30:09.000Z",
    "title": "Data Reveals Short-Term Bitcoin Holders Refuse To Sell Despite SEC Crackdown",
    "url": "https://www.newsbtc.com/bitcoin-news/data-reveals-short-term-bitcoin-holders-refuse-to-sell/",
    "description": "Amid ongoing regulatory scrutiny and fear, uncertainty, and doubt (FUD) surrounding Bitcoin (BTC), short-term holders who are often known to be the first to sell off their assets when prices decline have displayed unusual resilience in the face of the current market challenges.  According to the latest data, these holders are bucking the trend and choosing to stay in the market, indicating their confidence in Bitcoin&#8217;s future profitability. Short-Term Holders Display Resilience Amid Regulatory Challenges According to an analysis from CryptoQuant, Bitcoin&#8217;s lackluster price performance within the $25,000-$30,000 range has not dampened the enthusiasm of short-term holders. The Short-Term Holder Spent Output Profit Ratio (SOPR) metric reveals their interest in remaining in the market and seeking profitability. Related Reading: Bitcoin Bearish Signal: Miners Sell At 3rd Largest Scale Ever The persistence of this metric over consecutive months, coupled with short-term holders&#8217; pocket value surpassing a specific threshold, indicates their commitment to staying invested. CryptoQuant further reveals this pattern mirrors previous price cycles, such as those witnessed in 2015 and 2019, where short-term holders maintained their positions and reaped long-term rewards. Notably, the current cycle&#8217;s profitability for both long-term and short-term holders has not yet reached levels that trigger significant selling pressure. This trend suggests that Bitcoin still has room for growth and the potential for another wave of demand. Despite ongoing regulatory challenges and negative market sentiment, short-term holders remain undeterred, holding on to their Bitcoin investments with optimism. Moreover, Glassnode data has further supported the resilience of short-term holders, revealing a recent uptick in hodling activity. According to the data, after a period of active selling in the previous month, short-term holders have shown a renewed commitment to retaining their Bitcoin holdings. This shift in sentiment indicates their belief in the future potential of Bitcoin, even in the face of regulatory uncertainties. Long-Term Holders Maintain Confidence In Bitcoin Meanwhile, long-term Bitcoin holders have also demonstrated confidence in the cryptocurrency, in addition to short-term holders being unfazed. These holders have shown minimal movement of their tokens to centralized exchanges, highlighting their commitment to holding their Bitcoin assets for the long term. By maintaining their positions and avoiding panic selling, long-term holders contribute to the overall stability of the market and reinforce the positive outlook for Bitcoin. Regardless, over the past week, Bitcoin has faced a significant price plunge, causing its market value to dip below $26,000, marking a decrease of 2.9%. Related Reading: Bitcoin (BTC) Dominance Trend Shifts Alongside Stablecoin Flows: Glassnode This downward trend can be attributed to the prevailing negative sentiment in the crypto market, which has been further intensified by the recent Securities and Exchange Commission (SEC) lawsuit against Binance and Coinbase, two of the world&#8217;s leading cryptocurrency exchanges. However, despite this decline, the largest cryptocurrency by market capitalization has shown a slight uptick of 0.2% in the last 24 hours. In contrast, BTC is trading at $25,826, reflecting a notable drop in value compared to its price of above $27,000 just a week ago. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T16:26:58.000Z",
    "title": "Bitcoin and Crypto Won’t Succumb to Operation Chokepoint 2.0; Moving Beyond US Borders: 50% of BTC on Exchanges Now Outside America",
    "url": "https://www.crypto-news-flash.com/bitcoin-and-crypto-wont-succumb-to-operation-chokepoint-2-0-moving-beyond-us-borders-50-of-btc-on-exchanges-now-outside-america/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-and-crypto-wont-succumb-to-operation-chokepoint-2-0-moving-beyond-us-borders-50-of-btc-on-exchanges-now-outside-america",
    "description": "Due to unclear regulations, US-based crypto companies have decreased by more than 50%.  A CryptoQuant research report shows that the number of crypto exchanges in the US has gone back to 2017 levels as others migrate to offshore and international exchanges. There is a rampant decrease in BTC reserves on US-based exchanges due to unclear [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-12T16:28:00.000Z",
    "title": "Coinbase Faces Regulatory Heat, Kevin O’Leary Calls Out CEO",
    "url": "https://coinedition.com/coinbase-faces-regulatory-heat-kevin-oleary-calls-out-ceo/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Kevin_OLeary_I_would_fire_Coinbases_CEO_if_he_worked_for_me-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Kevin_OLeary_I_would_fire_Coinbases_CEO_if_he_worked_for_me-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Kevin_OLeary_I_would_fire_Coinbases_CEO_if_he_worked_for_me-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Kevin_OLeary_I_would_fire_Coinbases_CEO_if_he_worked_for_me.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In a recent interview with Yahoo Finance, the renowned investor from Shark Tank, Kevin O&#8217;Leary expressed his criticism towards Coinbase CEO Brian Armstrong regarding the company&#8217;s confrontation with the U.S. Securities and Exchange Commission (SEC), accusing Armstrong of “butting heads.” The SEC recently filed a lawsuit against Coinbase, alleging that the firm operated as an [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coinbase-faces-regulatory-heat-kevin-oleary-calls-out-ceo/\">Coinbase Faces Regulatory Heat, Kevin O&#8217;Leary Calls Out CEO</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]