[
  {
    "source": "Cointelegraph",
    "date": "2024-02-28T14:30:00.000Z",
    "title": " How the digital yuan could change the world… for better or worse ",
    "url": "https://cointelegraph.com/magazine/digital-yuan-adoption-payments-regulation/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2024/02/magazine-Digital-Yuan-scaled.jpeg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>China’s digital yuan is probably the world’s leading central bank digital currency. In spite of its high level of development, it is not widely used.</p>\n                    <p><p>Table of contents:</p><p> <a href=\"#history\" rel=\"nofollow\" target=\"_self\">History of the digital yuan</a><br> <a href=\"#how\" rel=\"nofollow\" target=\"_self\">How is the digital yuan used in China?</a><br> <a href=\"#china\" rel=\"nofollow\" target=\"_self\">China is primed for digital yuan by Alipay</a><br> <a href=\"#abroad\" rel=\"nofollow\" target=\"_self\">The digital yuan abroad</a><br> <a href=\"#threat\" rel=\"nofollow\" target=\"_self\">Is the digital yuan a threat to the US dollar?</a><br> <a href=\"#brics\" rel=\"nofollow\" target=\"_self\">BRICS and de-dollarization</a><br> <a href=\"#swift\" rel=\"nofollow\" target=\"_self\">The digital yuan, SWIFT censorship and sanctions</a><br> <a href=\"#mbridge\" rel=\"nofollow\" target=\"_self\">The digital yuan and mBridge</a><br> <a href=\"#american\" rel=\"nofollow\" target=\"_self\">American politicians attempt to ban the digital yuan</a><br> <a href=\"#surveillance\" rel=\"nofollow\" target=\"_self\">Is the digital yuan a tool for surveillance?</a><br> <a href=\"#crypto\" rel=\"nofollow\" target=\"_self\">The digital yuan and crypto</a></p><p>Chinas central bank digital currency is known as the digital yuan, e-CNY or e-RMB and despite the hype, it represents a minuscule portion of the money supply and has only been used at any scale a few times internationally. </p><p><a href=\"https://cointelegraph.com/magazine/digital-yuan-adoption-payments-regulation/\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-28T14:26:03.000Z",
    "title": " Matrixport warns of market euphoria, correction after Bitcoin&#039;s $60K milestone ",
    "url": "https://cointelegraph.com/news/matrixport-warns-market-euphoria-bitcoin-60k-milestone",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZDYyMGIzM2EtZmVhYi00MTdjLTlkZmUtYTM2NDI5NmRkYTJhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The blockchain financial service firm argued in January that a spot Bitcoin ETF would not be approved by the U.S. Securities and Exchange Commission. </p>\n                    <p><p>Daniel Yan, co-founder of Singaporean crypto services firm Matrixport, says that a market correction is imminent after Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) reached its highest level since 2021.</p><p>\"The sentiment of the market has come to a level where I think we should be cautious,\" the co-founder wrote on February 28. \"I think we should see another healthy ~15% correction by end-April.\" In explaining his rationale, Yan said that the month of March is a \"tricky one\" from a macroeconomic perspective, pointing to examples such as the U.S. Federal Reserves meeting, Bitcoin halving, and the Ethereum Dencun upgrade. Yan stated:</p><p>On the same day, Bitcoin surpassed the $60,000 benchmark previously witnessed in the bull market of 2020 to 2021. Data from the Crypto Fear &amp; Greed Index currently <a href=\"https://alternative.me/crypto/fear-and-greed-index/\" target=\"_blank\" rel=\"noopener nofollow\">shows</a> a score of 82/100, indicating extreme greed. Investors have been in a frenzy since the U.S. Securities and Exchange Commission (SEC) approved several spot Bitcoin exchange-traded funds (ETFs) last month, with $7.5 billion worth of assets now managed by one such ETF, BlackRock's iShares Bitcoin Trust.</p><p><a href=\"https://cointelegraph.com/news/matrixport-warns-market-euphoria-bitcoin-60k-milestone\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2024-02-28T14:30:00.000Z",
    "title": " How the digital yuan could change the world… for better or worse ",
    "url": "https://cointelegraph.com/magazine/digital-yuan-adoption-payments-regulation/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2024/02/magazine-Digital-Yuan-scaled.jpeg\"></p><p>China’s digital yuan is probably the world’s leading central bank digital currency. In spite of its high level of development, it is not widely used.</p>\n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-28T14:37:26.000Z",
    "title": "ContributionDAO Raises $2.8 Million To Advance Staking Across SEA Region",
    "url": "https://cryptodaily.co.uk/2024/02/contributiondao-raises-28-million-to-advance-staking-across-sea-region",
    "description": "Decentralized contribution hub, ContributionDAO raised $2.8 million in a seed funding round led by Thailand’s largest bank, KASIKORN X Venture Capital (KXVC)."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-28T14:28:04.000Z",
    "title": "Whale Alert: New Altcoin Makes A Splash As Solana and USDC Holders Rush To Acquire Tokens",
    "url": "https://cryptodaily.co.uk/2024/02/whale-alert-new-altcoin-makes-a-splash-as-solana-and-usdc-holders-rush-to-acquire-tokens",
    "description": "After a significant rise in 2023, Solana’s growth has slowed. The altcoin has seen declines of over 10% in the last week, causing Solana’s daily trading volume to decline. As a result, Solana investors are now joining USDC holders to buy a thriving new altcoin that’s seen returns of 50% during its presale. Here’s why."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-28T14:21:28.000Z",
    "title": "Key Cryptos to Turn $10 into $10,000 as the Bull Run Begins",
    "url": "https://cryptodaily.co.uk/2024/02/key-cryptos-to-turn-10-into-10000-as-the-bull-run-begins",
    "description": "Exciting times ahead in the crypto world as Bitcoin and Ether soar, igniting a bull run that could turn $10 into $10,000! Don't miss out on the potential goldmine with a few selected altcoins showing massive gains. Get in on the action as these emerging tokens promise lucrative opportunities in this exhilarating market surge."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-28T14:20:20.000Z",
    "title": "Bitcoin Breaks $60K Barrier — On the Verge of Outranking Meta by Market Value",
    "url": "https://news.bitcoin.com/bitcoin-breaks-60k-barrier-on-the-verge-of-outranking-meta-by-market-value/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/60kkkkkssddf-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Breaks $60K Barrier — On the Verge of Outranking Meta by Market Value\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/60kkkkkssddf-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/60kkkkkssddf-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/60kkkkkssddf-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/60kkkkkssddf-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/60kkkkkssddf-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/60kkkkkssddf-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/60kkkkkssddf.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin broke through the critical $60,000 barrier at 8:30 a.m. Eastern Time on Wednesday, reaching a level last seen in November 2021. The leading cryptocurrency&#x2019;s market value is on the brink of overtaking Meta, positioning it as the ninth most valuable asset in the world by market capitalization. Bitcoin Climbs Past $60,000: A New Era [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-28T14:38:53.000Z",
    "title": "5ire Staking v2: Revolutionizing Blockchain Engagement on March 14",
    "url": "https://www.cryptopolitan.com/5ire-staking-v2-blockchain-on-march-14/",
    "description": "The blockchain community is poised for an exciting development as 5ire, a leader in blockchain innovation, announces the forthcoming launch of 5ire Staking version 2.0. Set to debut on March 14th. The update promises to significantly enhance the staking mechanism within Proof of Stake (PoS) blockchain networks, emphasizing improved network security, decentralization, and user participation. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-28T14:37:04.000Z",
    "title": "Europe faces economic security risks from places that will truly shock you",
    "url": "https://www.cryptopolitan.com/europe-faces-economic-security-risks/",
    "description": "Europe is at a crossroads, facing economic security threats from directions most wouldn’t even dare to guess. Gone are the days when the continent could bask in the luxury of peace and prosperity through open trade and borders. Now, the very markets that fueled its growth have turned into potential battlefields, with the European Union [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-28T14:32:54.000Z",
    "title": "Yellow.ai Launches AI-Powered Email Automation for Enhanced Customer Support",
    "url": "https://www.cryptopolitan.com/yellow-ai-launches-ai-email-automation/",
    "description": "In a significant move to redefine customer support dynamics, Yellow.ai, a frontrunner in generative AI-powered customer service automation, announced the launch of its Email Automation solution. This innovative offering is set to revolutionize how businesses handle email-based customer inquiries by autonomously managing 80% of incoming emails. The solution, which supports multiple languages, is integrated with [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-28T14:27:59.000Z",
    "title": "Finoa and Centrifuge forge partnership to revolutionize real-world asset custody",
    "url": "https://www.cryptopolitan.com/finoa-centrifuge-partnership-asset-custody/",
    "description": "In a landmark move set to redefine the landscape of institutional blockchain-based asset management, Finoa, a premier regulated crypto custodian, has unveiled its latest technical milestone through the integration of FinoaConnect with Centrifuge.&#160; The strategic alliance is poised to usher in a new era for the custody of investments in real-world assets (RWAs), leveraging Finoa&#8217;s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-28T14:18:07.000Z",
    "title": "HashKey OTC Gains Approval from Singapore’s Financial Authority",
    "url": "https://www.cryptopolitan.com/hashkey-otc-approval-singapore-authority/",
    "description": "In a significant development for the digital asset market in Singapore, HashKey Technology Services Pte. Ltd. (hereinafter referred to as &#8220;HashKey OTC&#8221;), an eminent entity within the HashKey Group specializing in over-the-counter (OTC) trading, has been granted in-principle approval for its Major Payment Institution licence by the Monetary Authority of Singapore (MAS).&#160; This preliminary nod [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-28T14:16:50.000Z",
    "title": "The White House is very angry with Bitcoin and Bitcoin miners",
    "url": "https://www.cryptopolitan.com/white-house-very-angry-with-bitcoin-miners/",
    "description": "The clash between the cryptocurrency industry and the powers-that-be in Washington has reached a boiling point, with the White House throwing a massive side-eye towards Bitcoin and its energy-hungry mining operations. As BTC&#8217;s price soars to heights unseen since 2021, reaching a whopping $60,400, it seems to have triggered more than just investor frenzy; it&#8217;s [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-28T14:23:17.000Z",
    "title": "DizzyHavoc token earns trader $225k on no trading volume",
    "url": "https://crypto.news/dizzyhavoc-trader-225k-token/",
    "description": "As users suspect insider trading, a trader earned several hundred thousand dollars on an unknown token called DizzyHavoc."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-28T14:14:00.000Z",
    "title": "Bitcoin hits $60k for first time since November 2021",
    "url": "https://crypto.news/bitcoin-60000-price-analysis/",
    "description": "The price of Bitcoin crossed the $60,000 mark for the first time since Nov. 21, 2021."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-28T14:29:38.000Z",
    "title": "Ethereum Price Primed To Hit $3.5K After Bitcoin Rallies Past $60K",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-primed-to-hit-3-5k/",
    "description": "Ethereum price climbed to a new multi-month high above $3,300. ETH is consolidating while Bitcoin is gaining pace above the $60,000 resistance. Ethereum extended its increase above the $3,300 resistance zone. The price is trading above $3,250 and the 100-hourly Simple Moving Average. There is a connecting bullish trend line forming with support at $3,320 on the hourly chart of ETH/USD (data feed via Kraken). The pair could extend its increase toward $3,420 or even $3,500 in the near term. Ethereum Price Underperforms Bitcoin Ethereum price started another steady increase from the $3,150 support zone. ETH cleared the $3,220 and $3,250 resistance levels to move further into a positive zone. However, Bitcoin performed better and rallied significantly above the $58,000 resistance. It surged over 10% and even cleared the $60,000 level. Ether also managed to pump above $3,300. A new multi-week high is formed near $3,368 and the price is now consolidating gains. It is trading above the 23.6% Fib retracement level of the upward wave from the $3,206 swing low to the $3,368 high. There is also a connecting bullish trend line forming with support at $3,320 on the hourly chart of ETH/USD. Ethereum is now trading above $3,250 and the 100-hourly Simple Moving Average. Immediate resistance on the upside is near the $3,365 level. The first major resistance is near the $3,420 level. The next major resistance is near $3,450, above which the price might gain bullish momentum. Source: ETHUSD on TradingView.com If there is a move above the $3,500 resistance, Ether could even rally toward the $3,650 resistance. Any more gains might call for a test of $3,800. Downside Correction In ETH? If Ethereum fails to clear the $3,365 resistance, it could start a downside correction. Initial support on the downside is near the $3,320 level. The first major support is near the $3,280 zone and the 61.8% Fib retracement level of the upward wave from the $3,206 swing low to the $3,368 high. The next key support could be the $3,160 zone. A clear move below the $3,160 support might send the price toward $3,120. Any more losses might send the price toward the $3,050 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $3,265 Major Resistance Level – $3,365"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-28T14:17:50.000Z",
    "title": "BREAKING: Bitcoin Price Smashes Above $60,000: Are New ATHs Ahead?",
    "url": "https://www.newsbtc.com/bitcoin-news/breaking-bitcoin-price-smashes-above-60000-are-new-aths-ahead/",
    "description": "Bitcoin price action continues to pick up steam following unprecedented institutional demand amidst an asset supply that&#8217;s on the brink of being slashed by 50%. Today, the BTCUSD trading pair has broken cleanly above $60,000. What does this mean for the top cryptocurrency by market cap? Are new all-time highs just ahead? Bitcoin Trades Above $60,000 For First Time Since 2021 Just one month ago, Bitcoin was still stuck below $50,000 and the launch of the first ever US spot BTC ETFs were considered a sell the news event. Now, with only a day left in February, Bitcoin price is showing serious strength with a more than 40% single month increase. Bullish momentum has pushed BTCUSD above $60,000 where it is trading currently. Bitcoin hits $60,000 on most exchanges &#124; BTCUSD on TradingView.com The bullish price action is due to the market front-running the halving now that the the impact of the introduction of the first meaningful Bitcoin ETFs are understood. ETF providers yesterday added as much as 9,000 BTC to holdings, while miners only managed to produce 900 BTC in the same timeframe. This amount is slashed by 50% at the halving in less than two months, potentially prompting institutional FOMO (fear of missing out). With Bitcoin now above $60,000 and around 13% away from all-time highs, new price records are within striking distance. After any cryptocurrency price takes out a current peak, price action moves into discovery due to a lack of sell orders in the order book. With no historical resistance to consider, Fibonacci ratios often help pinpoint there rallies will come to a conclusion. Related Reading: Why &#8220;Overbought&#8221; Bitcoin Could Trigger A 107% Rally According to the 1.272 Fibonacci, BTCUSD could begin finding psychological resistance around $94,000 per coin. The ultimate &#8220;top&#8221; of this rally could extend to the 1.618 Fibonacci, located at around $155,000 per BTC. Possible price targets &#124; BTCUSD on TradingView.com To hit $155,000 per coin, Bitcoin only needs a 161% advance from current levels. To put this into perspective, the top brass crypto asset is up more than 300% from the bottom set in 2022, and there wasn&#8217;t a bull market to speak of yet. With the bull market now undeniable, it isn&#8217;t unreasonable to assume BTCUSD could climb by 161% over the remainder of 2024. Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from Shutterstock, Charts from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-28T14:16:53.000Z",
    "title": "VeChain Unveils VeBetterDAO: Revolutionizing Sustainability on the Blockchain",
    "url": "https://www.crypto-news-flash.com/vechain-unveils-vebetterdao-revolutionizing-sustainability-on-the-blockchain/?utm_source=rss&utm_medium=rss&utm_campaign=vechain-unveils-vebetterdao-revolutionizing-sustainability-on-the-blockchain",
    "description": "<img width=\"1792\" height=\"1024\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-23-12.18.07-A-futuristic-digital-health-concept-representing-the-collaboration-between-VeChain-and-Inpersona-showcasing-the-Vyvo-Smart-Chain-with-a-focus-on-the-1-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"vechain\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-23-12.18.07-A-futuristic-digital-health-concept-representing-the-collaboration-between-VeChain-and-Inpersona-showcasing-the-Vyvo-Smart-Chain-with-a-focus-on-the-1-1.png 1792w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-23-12.18.07-A-futuristic-digital-health-concept-representing-the-collaboration-between-VeChain-and-Inpersona-showcasing-the-Vyvo-Smart-Chain-with-a-focus-on-the-1-1-300x171.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-23-12.18.07-A-futuristic-digital-health-concept-representing-the-collaboration-between-VeChain-and-Inpersona-showcasing-the-Vyvo-Smart-Chain-with-a-focus-on-the-1-1-1200x686.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-23-12.18.07-A-futuristic-digital-health-concept-representing-the-collaboration-between-VeChain-and-Inpersona-showcasing-the-Vyvo-Smart-Chain-with-a-focus-on-the-1-1-768x439.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-23-12.18.07-A-futuristic-digital-health-concept-representing-the-collaboration-between-VeChain-and-Inpersona-showcasing-the-Vyvo-Smart-Chain-with-a-focus-on-the-1-1-1536x878.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-23-12.18.07-A-futuristic-digital-health-concept-representing-the-collaboration-between-VeChain-and-Inpersona-showcasing-the-Vyvo-Smart-Chain-with-a-focus-on-the-1-1-150x86.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-23-12.18.07-A-futuristic-digital-health-concept-representing-the-collaboration-between-VeChain-and-Inpersona-showcasing-the-Vyvo-Smart-Chain-with-a-focus-on-the-1-1-450x257.png 450w\" sizes=\"(max-width: 1792px) 100vw, 1792px\" />VeBetterDAO aims to revolutionize Web3 with a sustainability-focused dApp ecosystem. Crypto analyst Mike Stoffer&#8217;s technical analysis predicts an upward trend for VET. VeChain has officially announced the launch of VeBetterDAO, marking a significant milestone in the VeChainThor ecosystem. This new addition is not just another component in the vast blockchain landscape; it is poised to [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-28T14:35:27.000Z",
    "title": "Top 3 AI Gems for a HUGE Crypto Portfolio",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-ai-gems-for-a-huge-crypto-portfolio/",
    "description": "<p>Let&#8217;s talk about regrets for a minute. You know, those moments when you kick yourself for not jumping on the bandwagon early enough? Yeah, we&#8217;ve all been there. Whether it&#8217;s SOL, ADA, ETH, or MATIC, the list goes on and on. But guess what? The crypto market is all about second chances and this time, [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-ai-gems-for-a-huge-crypto-portfolio/\">Top 3 AI Gems for a HUGE Crypto Portfolio</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-28T14:33:14.000Z",
    "title": "Wanchain Appoints Temujin Louie as New CEO",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/wanchain-appoints-temujin-louie-as-new-ceo/",
    "description": "<p>Wanchain has always been at the forefront in the bridging space. Jack Lu founded Wanchain back in 2017. Ever since, he has also been the CEO. However, it wasn&#8217;t until 2021 that the protocol launched its first bridge. That was the first decentralized Bitcoin — Ethereum bridge. Ever since, the team has been building. One [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/wanchain-appoints-temujin-louie-as-new-ceo/\">Wanchain Appoints Temujin Louie as New CEO</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-28T14:17:36.000Z",
    "title": "QORPO to Hold TGE on Feb. 29 Details",
    "url": "https://www.altcoinbuzz.io/product-release/qorpo-to-hold-tge-on-feb-29-details/",
    "description": "<p>Crypto gamers! It’s time to level up because the QORPO World&#8217;s Token Generation Event (TGE) is almost here, and let me tell you, it&#8217;s a big deal! So, what&#8217;s the buzz all about? Well, imagine your favorite game studio—yeah, the one behind those epic adventures in Citizen Conflict and the mind-bending world of Aneemate. That&#8217;s [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/product-release/qorpo-to-hold-tge-on-feb-29-details/\">QORPO to Hold TGE on Feb. 29 Details</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-28T14:30:00.000Z",
    "title": "Wanchain Appoints Temujin Louie as New CEO",
    "url": "https://coinedition.com/wanchain-appoints-temujin-louie-as-new-ceo/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/02/pr-1-191.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/02/pr-1-191.jpg 730w, https://coinedition.com/wp-content/uploads/2024/02/pr-1-191-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/02/pr-1-191-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/02/pr-1-191-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/02/pr-1-191-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/02/pr-1-191-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/02/pr-1-191-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/02/pr-1-191-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/02/pr-1-191-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/02/pr-1-191-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/02/pr-1-191-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/02/pr-1-191-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/02/pr-1-191-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/02/pr-1-191-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/02/pr-1-191-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/02/pr-1-191-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Wanchain, the longest-running blockchain interoperability solution, has appointed its current VP, Temujin Louie, as its new CEO. Temujin will succeed Jack Lu, the founder and outgoing CEO of Wanchain, who will transition to an active advisory role within the company. Jack and Temujin announced the change together during a community AMA, and the transition takes [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/wanchain-appoints-temujin-louie-as-new-ceo/\">Wanchain Appoints Temujin Louie as New CEO</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]