[
  {
    "source": "Cointelegraph",
    "date": "2023-09-01T21:53:33.000Z",
    "title": "Ripple legal team opposes SEC appeal over XRP decision",
    "url": "https://cointelegraph.com/news/ripple-legal-team-opposes-sec-appeal-over-xrp-decision",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/9c280585-a478-4f4b-9b16-5caa9fd0c065.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Lawyers argued the SEC’s grounds for an appeal was based on “dissatisfaction” with a July court decision that the XRP token did not largely qualify as a security.</p>\n                    <p><p>Lawyers representing Ripple in its lawsuit with the United States Securities and Exchange Commission (SEC) have suggested the regulator hasn’t met the requirements to request an appeal.</p><p>In a Sept. 1 filing with U.S. District Court for the Southern District of New York, Ripple’s legal team <a href=\"https://www.courtlistener.com/docket/19857399/913/securities-and-exchange-commission-v-ripple-labs-inc/\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the SEC’s grounds for an appeal largely rested on “dissatisfaction” with a judge’s decision that the XRP token <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">did not qualify</a> as a security for sales to retail investors. The lawyers said “exceptional circumstances required for interlocutory appeal” were absent in the case, and called on the judge to both deny any request for an appeal or stay.</p><p>“The SEC has not even attempted to meet the standard for a stay, even after the Individual Defendants identified that omission in their pre-motion letter,” said Ripple. “The Individual Defendants write separately to oppose the SEC’s request. Ripple joins that opposition.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/9b377f75-ea7b-41ef-b3ee-40e19deb411d.png\"  /><figcaption style=\"text-align: center;\"><em>Memo filed Sept. 1 in U.S. District Court for the Southern District of New York. Source: <a href=\"https://www.courtlistener.com/docket/19857399/913/securities-and-exchange-commission-v-ripple-labs-inc/\" target=\"_blank\" rel=\"noopener nofollow\">Courtlistener</a></em></figcaption></figure><p>In August, the commission <a href=\"https://cointelegraph.com/news/sec-seek-interlocutory-appeal-ripple-case\">moved to appeal</a> and stay a July court decision in which Judge Analisa Torres ruled XRP largely was not a security under SEC guidelines. At the time, the SEC argued there was “substantial ground for differences of opinion” on the laws at issue.</p><p>The SEC filed its lawsuit against Ripple, CEO Brad Garlinghouse and co-founder Chris Larsen in December 2020, prompting many exchanges to delist the XRP token to avoid possible legal entanglement. Following the Torres’ ruling, many of the same firms said they would relist the token or explore doing so in the future.</p><p>“It’s sad that so many in the US crypto community have to resort to the legal process to prove this SEC is out of control and consistently wrong on the facts and the law,” <a href=\"https://twitter.com/bgarlinghouse/status/1696602284115800274\" target=\"_blank\" rel=\"noopener nofollow\">said</a> Garlinghouse in an Aug. 29 X post.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-v-ripple-attorneys-leave-sec\"><strong><em>SEC v. Ripple: Attorneys leave SEC side, both groups add new lawyers</em></strong></a></p><p>The SEC has targeted a number of crypto firms in 2023 over allegations of securities violations, including Binance and Coinbase. On Aug. 29, asset manager Grayscale achieved a court victory against the SEC <a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\">following an appeal</a> ordering a review of its application for a spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund.</p><p>The civil lawsuit between the SEC and Ripple is ongoing. Torres <a href=\"https://cointelegraph.com/news/federal-judge-proposes-q2-2024-trial-sec-case-against-ripple-execs\">proposed a jury trial</a> for the case starting in the second quarter of 2024.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/money-back-crypto-litigation/\"><strong><em>Get your money back: The weird world of crypto litigation</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-01T21:50:16.000Z",
    "title": "The story of a crypto influencer’s attempt to bend reality",
    "url": "https://cointelegraph.com/news/carl-moon-runefelt-kasta-attempt-bend-reality",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/8b5f0523-b5e9-4b54-9d86-b02efec642a9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A bizarre tale about Carl ‘The Moon” Runefelt asking Cointelegraph to revise history on his behalf by concealing old claims that he co-founded a crypto app.</p>\n                    <p><p>In one of the weirder moments of my writing career, Carl “The Moon” Runefelt contacted me out of the blue seeking an “update to old information” in a <a href=\"https://cointelegraph.com/magazine/carl-the-moon-runefelt-created-lavish-reality-thinks-you-can-too/\">May 2022 article</a>. The article had touched on his involvement with the crypto payment platform Kasta, but Runefelt felt a pressing need a year later to get the copy changed to highlight the fact he was “not the co-founder of Kasta, only [an] investor.”</p><p>An unusual request after so long — especially considering he had already made extensive comments after reading a prepublication draft of the original article. He’d argued at one point that a mention in that article of “haters” who accused him of editing YouTube video titles in order to make past predictions appear accurate was “clearly unprofessional.” He suggested it was analogous to an article about SpaceX CEO Elon Musk’s rockets including comments from flat-earthers.</p><p>“I gotta focus on what’s real, what’s correct,” Runefelt said.</p><p>Runefelt is a crypto influencer known for showing off a lifestyle of private jets, supercars and million-dollar watches while making faces in YouTube videos purporting to offer crypto insights and market analysis. A high-school dropout who worked as a cashier in Sweden just a few years ago, Runefelt preaches “the law of attraction,” which essentially posits that one can bend reality by believing hard enough in one’s desired version of it.</p><p>Kasta, now called Ka.app, is the crypto app that Runefelt is apparently trying to distance himself from. As it turns out — despite his version of reality — Runefelt was indeed a co-founder.</p><p>First, let’s get back to Runefelt’s reality. He explained that the co-founder label  a result of confusion due to an online rumor. “People say many different things — people say I’m the billionaire, bla bla bla — something takes off, and then everyone just goes with it,” he remarked with annoyance.</p><blockquote>“Even though I never told people my net worth, the same with me being co-founder [of Kasta] — I’m just trying to clean this stuff.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/1fbc5a95-7a79-4fa1-b039-a0d21871491d.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">The price of KASTA fell about 98% between its January 2022 launch and September 2023. Source: CoinMarketCap</figcaption></figure><p>“There’s three co-founders, and you’ve never been one of them, right?” I asked, referring to the three names — CEO Carl Roegind, chief technology officer Sebastian Appelberg and chief product officer Hans-Herko Lusmägi — listed on the firm’s site. “Exactly,” Carl Runefelt replied, explaining that there was likely a mix-up of identity with the CEO, whose name is similar.</p><p>After I informed Runefelt that articles “aren’t edited after the fact unless there were mistakes at that time,” Runefelt made it clear he believed a journalistic error was made — and that it needed to be rectified.</p><p>I asked Runefelt to elaborate: “The theory is that I wrote ‘co-founder’ because maybe I read some third person’s account — that I didn’t have any first-person account, and I made an assumption. So, I made a mistake in doing that, is that what you figure?”</p><p>“Well yeah, but no worries, no worries,” Runefelt replied with what I understood to be a hint of sheepish hesitation.</p><p>But there was no mistake.</p><p>Reviewing our interview notes from when I visited his Dubai office in May 2022, it turned out Runefelt had clearly recounted how he co-founded Kasta.</p><p>“Me and my best friend, two years ago we came up with the idea,” Runefelt said, “[that crypto payments should be easy], that’s why we founded Kasta.” He explained that “we” had received media attention from both Yahoo Finance and Fox Business.</p><p>I confronted Runefelt by noting that the description of “co-founder” came not from online rumors but from his own statements. He admitted, “I did help out with some brainstorming, but I may have over-exaggerated my involvement at that stage… but co-founding it, it’s not accurate. I don’t have equity in it.”</p><blockquote>“‘Early advisor’ and ‘early investor’ — I would say that’s the most accurate thing I would say — I can’t come up with something more true than that.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/250aac94-91b3-4f75-a4c3-3a4d1d51f48d.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Runefelt is a fan of using exclamation marks and words like EMERGENCY, ALERT, and WARNING on his YouTube channel. Source: Screenshot</em></figcaption></figure><p>“What you say is you’ve never actually referred to yourself as co-founder or led people to believe that, which is just what I’m making sure,” I asked. “Exactly,” Runefelt replied.</p><p>Exactly?</p><p>He had done just that on both Yahoo Finance and Fox Business — the very media references he mentioned in our May 2022 office sit-down. Appearing on a Dec. 23, 2021 Yahoo Finance video clip titled “Crypto app Kasta aims to lower cost of small transactions,” Runefelt <a href=\"https://web.archive.org/web/20221020062145/https://finance.yahoo.com/video/crypto-app-kasta-aims-lower-190022265.html\" target=\"_blank\" rel=\"noopener nofollow\">delivered</a> this opening line after being introduced as Kasta’s co-founder: </p><blockquote>“Kasta is my company. I am a co-founder.”</blockquote><p>In the same video, he confirmed, “We’re four co-founders, in fact.” The statement received corroboration from an <a href=\"https://archive.ph/XGpq2\" target=\"_blank\" rel=\"noopener nofollow\">article</a> by Flaunt that referred to Runefelt as a co-founder “alongside Carl Roegind, Hans Lusmagi and Sebastian Appelberg.”</p><p>There was no mistaken identity, nor a one-off. Four co-founders, not three.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Somebody check on The Moon Carl, bro hasn’t shilled a scam in a while and is now losing his go damn mind. <a href=\"https://t.co/xjnDtnAxAN\">pic.twitter.com/xjnDtnAxAN</a></p>&mdash;   (@RomeoTrades) <a href=\"https://twitter.com/RomeoTrades/status/1631742510119747585?ref_src=twsrc%5Etfw\">March 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“In a Fox Business exclusive, we have the Kasta co-founder and YouTube star Carl ‘The Moon’ Runefelt,’” Fox Business host Liz Claman <a href=\"https://www.foxbusiness.com/video/6291668145001\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in an introduction for Runefelt three weeks later. The star again crowned himself with the title he now claims was a mere internet rumor:</p><blockquote>“That’s why I am, like you said, a co-founder and CMO of Kasta, where we’re going to make crypto easier to spend.”</blockquote><p>I surprised Runefelt with this video revelation. He attempted to take it in stride, saying “it was just confusion and marketing” because he was “not operational” within the company — despite his very operational role of appearing in the media. “I’m not actually a co-founder,” Runefelt said. “Nope. And they know it and they’re OK with it,” he said in reference to the three “real” co-founders.</p><p>“But you went on Yahoo Finance and Fox Business and said that you were a co-founder?” I asked incredulously, to which Runefelt replied, “Exactly. I guess I’m just changing the narrative.” </p><p>He said this matter-of-factly and without a hint of irony — as if Cointelegraph were his personal public relations agency and narratives are something changed by declaration. Not “trying” to change it — <em>changing </em>it.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/f7cde91a-a031-44a7-b61b-e4ab428e50b2.jpg\"  /><figcaption style=\"text-align: center;\"><em>Runefelt said that calling himself a founder of Kasta was a \"mistake I did.\" Source: Telegram screenshot by Elias Ahonen</em></figcaption></figure><p>“As I don’t own equity, I can’t say I’m a co-founder. Which is a mistake I did,” he said. “If you don’t have equity, how can you possibly be a co-founder?”</p><p>That view does not appear to have much to back it up.</p><p>Runefelt clearly said in the past that he participated in the early-stage brainstorming of the ideas on which Kasta was based and that he co-founded it with a friend. We’re happy to note this for the record, despite his attempts to visualize or mindset-shift inconvenient facts away.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Elias Ahonen</strong> is a Finnish-Canadian author based in Dubai who has worked around the world operating a small blockchain consultancy after buying his first Bitcoin in 2013. His book<em> Blockland</em> tells the story of the industry. He holds an MA in international and comparative law, and his thesis deals with NFT and metaverse regulation.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-01T21:40:25.000Z",
    "title": "New Russian malware, dubbed ‘Infamous Chisel,’ identified targeting Binance, Coinbase, and Trust wallets",
    "url": "https://cryptoslate.com/new-russian-malware-dubbed-infamous-chisel-identified-targeting-binance-coinbase-and-trust-wallets/",
    "description": "<p>Newly discovered malware dubbed &#8220;Infamous Chisel&#8221; targets crypto wallets and other Android apps, according to a U.K. government report on Sept. 1. The U.K.&#8217;s National Cyber Security Centre (NCSC) said that the malware works by scanning various directories on infected mobile devices and exfiltrating data. The malware is known to extract data from at least [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/new-russian-malware-dubbed-infamous-chisel-identified-targeting-binance-coinbase-and-trust-wallets/\">New Russian malware, dubbed &#8216;Infamous Chisel,&#8217; identified targeting Binance, Coinbase, and Trust wallets</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-01T22:00:19.000Z",
    "title": "Worldcoin Claims Signups Soar in Argentina: 9.5K Users Verified in a Single Day",
    "url": "https://news.bitcoin.com/worldcoin-claims-signups-soar-in-argentina-9-5k-users-verified-in-a-single-day/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2341850033-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Worldcoin Signups Soar in Argentina: 9.5K Users Get Verified in a Single Day\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2341850033-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2341850033-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2341850033-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2341850033-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2341850033-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2341850033-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2341850033.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The number of verifications for Worldcoin, the biometric digital ID and wallet project, has soared recently in Argentina, reaching a daily signup record in August. According to data provided by the project, Worldcoin verified 9,500 Argentine users in a single day, with only four verification stations in the country. Wordcoin Popularity Peaks in Argentina; Project [&#8230;]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-01T22:05:00.000Z",
    "title": "Crypto Donation Accepted in Relief Fund for Maui Wildfire Victims",
    "url": "https://coinedition.com/crypto-donation-accepted-in-relief-fund-for-maui-wildfire-victims/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/Maui-Wildfire-Victims.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Maui Wildfire Victims\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/Maui-Wildfire-Victims.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/Maui-Wildfire-Victims-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/Maui-Wildfire-Victims-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/Maui-Wildfire-Victims-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/Maui-Wildfire-Victims-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/Maui-Wildfire-Victims-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/Maui-Wildfire-Victims-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/Maui-Wildfire-Victims-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/Maui-Wildfire-Victims-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/Maui-Wildfire-Victims-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/Maui-Wildfire-Victims-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/Maui-Wildfire-Victims-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/Maui-Wildfire-Victims-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/Maui-Wildfire-Victims-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/Maui-Wildfire-Victims-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/Maui-Wildfire-Victims-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Maui community has found strong support from the crypto world, as a relief fund led by prominent celebrities Oprah Winfrey and Dwayne Johnson (The Rock) now welcomes donations in various cryptocurrencies, including Shiba Inu. In a recent tweet, Johnson, aka The Rock, made a heartfelt announcement regarding the launch of the People&#8217;s Fund of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-donation-accepted-in-relief-fund-for-maui-wildfire-victims/\">Crypto Donation Accepted in Relief Fund for Maui Wildfire Victims</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-01T22:01:14.000Z",
    "title": "Whales Move Over $730,000,000 in Bitcoin, Ethereum and XRP – Here’s Where the Crypto’s Headed",
    "url": "https://dailyhodl.com/2023/09/01/whales-move-over-730000000-in-bitcoin-ethereum-and-xrp-heres-where-the-cryptos-headed/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/05/btc-eth-xrp-targets.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/05/btc-eth-xrp-targets.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/05/btc-eth-xrp-targets.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/05/btc-eth-xrp-targets.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/05/btc-eth-xrp-targets.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/05/btc-eth-xrp-targets.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/05/btc-eth-xrp-targets.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Deep-pocketed crypto investors are moving hundreds of millions of dollars worth of digital assets into and from centralized crypto exchange platforms as the king crypto falls below $26,000. New data from whale-surveying platform Whale Alert reveals that high-net-worth traders have abruptly shifted over $730 million worth of Bitcoin (BTC), Ethereum (ETH), and XRP, the majority [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/01/whales-move-over-730000000-in-bitcoin-ethereum-and-xrp-heres-where-the-cryptos-headed/\">Whales Move Over $730,000,000 in Bitcoin, Ethereum and XRP – Here’s Where the Crypto’s Headed</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]