[
  {
    "source": "Cointelegraph",
    "date": "2023-08-10T19:45:00.000Z",
    "title": "Aave DAO opens voting on proposals to reduce CRV exposure",
    "url": "https://cointelegraph.com/news/aave-voting-proposals-reduce-crv-exposure",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/bb8d9a79-7ea1-4006-b9bc-7d4aa067e5d4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Aave tokenholders are voting on three proposals that could reshape the protocol’s exposure to the Curve DAO token.</p>\n                    <p><p>The Aave community is seeking to reduce its protocol exposure to the Curve DAO token, with two proposals open for voting on Aug. 10. The move comes in an attempt to limit the risk posed to the lending protocol by the large borrowing position held by Curve Finance founder Michael Egorov.</p><p>Curve DAO (CRV) is the native token of the decentralized finance (DeFi) protocol Curve Finance. Egorov deposited over 30% of CRV’s total market capitalization as collateral to take out nearly $60 million in loans on Aave v2. However, Curve’s hack on July 30 <a href=\"https://cointelegraph.com/news/curve-vyper-exploit-whole-story-so-far\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/curve-vyper-exploit-whole-story-so-far/amp\">impacted its token price</a>, making Egorov’s position vulnerable to liquidation. </p><p>Until Aug. 12, Aave tokenholders can vote on two proposals. One seeks to <a href=\"https://app.aave.com/governance/proposal/?proposalId=292\" target=\"_blank\" rel=\"noopener nofollow\">reduce</a> the liquidation threshold by 6% for CRV on Aave v2, which could result in user accounts becoming subject to liquidation upon approval. The second <a href=\"https://app.aave.com/governance/proposal/?proposalId=293\" target=\"_blank\" rel=\"noopener nofollow\">disables</a> borrowing of CRV on Ethereum and Polygon v3, thus disabling the ability to short CRV via the Aave protocol.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/ab175859-c74f-4c0d-9313-926540e2cd1a.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Proposal to reduce the liquidation threshold for CRV on Aave v2 on Ethereum. Source: Aave</em></figcaption></figure><p>At the time of writing, over 571,000 votes have been cast, with 100% of holders supporting limiting Aave’s exposure to CRV.</p><p>Amid fears of liquidation surrounding Egorov’s loans, the Aave community is also voting on a third proposal ending on Aug. 11. In the proposal, Aave Chan founder Marc Zeller <a href=\"https://cointelegraph.com/news/curve-aave-chan-founder-proposes-buying-2-m-crv-from-curve-founder\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/curve-aave-chan-founder-proposes-buying-2-m-crv-from-curve-founder/amp\">calls for the Aave Treasury to buy $2 million</a> worth of CRV tokens from Curve, claiming it would signal that DeFi players support the health of the ecosystem. At the time of writing, 62.91% of voters <a href=\"https://app.aave.com/governance/proposal/?proposalId=289\" target=\"_blank\" rel=\"noopener nofollow\">support</a> the purchase, while 37.09% are against it. </p><p>Curve’s attack <a href=\"https://cointelegraph.com/news/curve-vyper-exploit-whole-story-so-far\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/curve-vyper-exploit-whole-story-so-far/amp\">sparked fears of cascading effects</a> across the DeFi ecosystem. Behind the hack was a vulnerability on three versions of Vyper — a common programming language across DeFi protocols. The vulnerability triggered white hat and black hat hackers battling on-chain, fighting over exploit attempts and money recoveries. A portion of the funds has been returned by the attacker. Curve Finance <a href=\"https://cointelegraph.com/news/curve-finance-opens-bounty-after-exploiter-deadline-expires\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/curve-finance-opens-bounty-after-exploiter-deadline-expires/amp\">is offering a bug bounty</a> to anyone able to identify the thief. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\">How smart people invest in dumb memecoins — 3-point plan for success</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-10T20:01:30.000Z",
    "title": "Hong Kong’s SFC Warns Against Unlicensed Crypto Platforms",
    "url": "https://cryptodaily.co.uk/2023/08/hong-kongs-sfc-warns-against-unlicensed-crypto-platforms",
    "description": "<p>Hong Kong&rsquo;s Securities and Futures Commission (SFC) issued a warning addressing investors against crypto platforms &ldquo;engaging in improper practices.&rdquo; </p>\n<p>On Monday, Hong Kong regulators issued a warning to unlicensed crypto platforms &ldquo;engaging in improper practices.&rdquo; The Securities and Futures Commission (SFC) said some platforms are falsely claiming to have applied for registration. HashKey and OSL are the only two licensed exchanges in the city. &nbsp;</p>\nSFC Takes a &ldquo;Dim View&rdquo; of Non-Compliance\n<p>The SFC warned the unlicensed crypto platform advising investors to beware of these operations trading without the necessary registration. In a press release, the regulator said:</p>\n\n<p>&ldquo;The Securities and Futures Commission (SFC) has observed some unlicensed virtual asset trading platforms (VATPs) engaging in improper practices. This statement warns VATPs of the potential legal and regulatory consequences of these improper practices and reminds investors to be wary of the risks of trading virtual assets on unregulated VATPs.&rdquo;</p>\n\n<p>The regulator said it became aware of exchanges conducting business after falsely claiming to have applied to it for registration. The SFC noted such false claims aim to &ldquo;give the public a false sense of assurance&rdquo; with the goal of &ldquo;inducing another person to trade in virtual assets&rdquo; and are an offence under Hong Kong&rsquo;s Anti-Money Laundering and Counter-Terrorist Financing Ordinance.</p>\n<p>Hong Kong is doing everything possible to regulate the industry and introduce a new licensing regime for virtual asset service providers. On 1 June, the SFC introduced a new regulatory framework for platforms engaging in trading activities. Under the regulations, such providers can apply to the SFC for licenses to legitimise their operations. Hong Kong&rsquo;s approach to regulation aims to provide a structured environment for investors and traders. The Hashkey Exchange recently announced it obtained a license from the SFC, making it the first cryptocurrency platform allowed to offer services to retail users.</p>\n<p>The SFC further warned the public that some unlicensed platforms continue to launch new products and services under existing entities that do not comply with its regulatory requirements. The Commission explained:</p>\n\n<p>&ldquo;For example, they may, under new or existing entities, launch certain virtual assets for trading by retail clients, trading services in virtual asset derivatives, or arrangements involving virtual assets such as virtual asset &lsquo;deposits,&rsquo; &lsquo;savings&rsquo; or &lsquo;earnings&rsquo; which are not allowed under the new regime.&rdquo;</p>\n\n<p>The regulator advised investors trading on unregulated exchanges that they could risk &ldquo;losing their entire investment&rdquo; held on that exchange should they discontinue their operations, collapse, or are hacked.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T20:08:38.000Z",
    "title": "Six Steps to Enhance Business Growth Through Machine Learning",
    "url": "https://www.cryptopolitan.com/steps-to-businessthrough-machine-learning/",
    "description": "In today&#8217;s competitive business landscape, sustaining growth and fostering long-term success hinges on customer retention. While expanding the customer base is important, preventing customer churn remains the cornerstone of maintaining a thriving company. Zehra Cataltepe, the visionary CEO of TAZI.AI, an adaptive, explainable Machine Learning platform, with an impressive portfolio of over 100 ML-related papers ... <a title=\"Six Steps to Enhance Business Growth Through Machine Learning\" class=\"read-more\" href=\"https://www.cryptopolitan.com/steps-to-businessthrough-machine-learning/\" aria-label=\"More on Six Steps to Enhance Business Growth Through Machine Learning\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T20:03:13.000Z",
    "title": "Algorand Price Prediction 2023-2032: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices to consider when investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it ... <a title=\"Algorand Price Prediction 2023-2032: Resurgence possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Resurgence possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T20:00:07.000Z",
    "title": "Top Blockchain Development Companies in Central Asia: Innovative Solutions For Businesses",
    "url": "https://www.cryptopolitan.com/blockchain-development-companies-central-asia/",
    "description": "Central Asia is home to diverse and dynamic blockchain development companies pushing the boundaries of what is possible with this revolutionary technology. These companies offer various services, including blockchain consulting, smart contract development, decentralized application (dApp) development, and blockchain-based solution integration. The top blockchain development companies in Central Asia combine technical expertise, industry knowledge, and ... <a title=\"Top Blockchain Development Companies in Central Asia: Innovative Solutions For Businesses\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blockchain-development-companies-central-asia/\" aria-label=\"More on Top Blockchain Development Companies in Central Asia: Innovative Solutions For Businesses\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T19:53:25.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T19:47:40.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T19:47:23.000Z",
    "title": "Argentina opens investigation into Worldcoin amid the growing regulatory scrutiny",
    "url": "https://www.cryptopolitan.com/argentina-opens-investigation-into-worldcoin/",
    "description": "The government of Argentina has informed Worldcoin that it has launched an investigation into its data collection activities in the country. The Public Information Access Agency (AAIP), the country&#8217;s data regulator, sent a letter to the Worldcoin Foundation requesting information on how the organization handles the personal information of Wordcoin users. Argentina has had it ... <a title=\"Argentina opens investigation into Worldcoin amid the growing regulatory scrutiny\" class=\"read-more\" href=\"https://www.cryptopolitan.com/argentina-opens-investigation-into-worldcoin/\" aria-label=\"More on Argentina opens investigation into Worldcoin amid the growing regulatory scrutiny\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-08-10T20:03:19.000Z",
    "title": "Shiba Inu Gains Traction Due To Rising Volume",
    "url": "https://nulltx.com/shiba-inu-gains-traction-due-to-rising-volume/",
    "description": "In the current market landscape, altcoin prices have shown a slight upward trend today, but the struggle for mid and small cap coins to gain momentum on a weekly basis remains evident. Amidst this scenario, the spotlight seems to have shifted towards Shiba Inu (#SHIB), a memecoin that has emerged as one of the few [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-10T20:00:23.000Z",
    "title": "Solana (SOL) Leads Gains Among Top Coins, Is $30 Milestone Possible?",
    "url": "https://www.newsbtc.com/news/solana/solana-sol-leads-gains-among-top-coins-is-30-milestone/",
    "description": "The price of Solana (SOL) has fluctuated a lot in the past week, like many other cryptocurrencies in the market. SOL is currently trading above $24, gaining 8.01% in its price in the past 7 days with over $376 million in trading volume in the past 24 hours.   The coin&#8217;s movement has now sparked speculation among investors about the imminent breach of the $30 resistance threshold.  Factors That Could Influence SOL&#8217;s Price Solana has seen significant growth in terms of its total value locked (TVL). According to Data from Messari, Solana did better than other chains, with a 14% increase in the amount of funds locked in last month. Related Reading: Whale Purchases $10 Million stETH In The past Day, Here Are Possible Reasons Why Additionally, data from DeFi Llama shows that Solana is now the 9th biggest chain in terms of locked funds. It has around $320.07 million locked, a big jump from the $205.11 million it had at the start of the year. This surge in Solana’s Total Value Locked (TVL) could attract more people to buy SOL tokens. Importantly, with rising interest, the price of Solana&#8217;s tokens might increase due to higher demand.  However, if there&#8217;s suddenly bad news about Solana&#8217;s security or performance, even with a growing TVL, people might get worried and start selling their SOL tokens. This increased supply and decreased demand could cause the price to drop.  Can SOL Hit The $30 Milestone? The daily chart shows that the asset has traded positively in the past 24-hour market circle. The coin is trading above the Simple Moving Average (SMA) indicator and is bullish, signaling a potentially strong uptrend and a positive momentum in its price movement.  Additionally, it suggests that buyers are consistently active, pushing the price higher. This often indicates sustained demand and can potentially lead to further price appreciation. Meanwhile, the SMA can act as a support level if the price dips, preventing the price from falling too much.  However, while the SMA can act as support, it can also become a resistance level if the price moves significantly above it. This is because the Relative Strength Index (RSI) at 55 suggests the coin is balanced between overbought and oversold conditions.  The Moving Average Convergence Divergence (MACD) is also showing an attempt to cross over the signal line, indicated by the red histogram bar fading. This could signal a potential shift in momentum, with the upward movement gaining strength.  Related Reading: US Congresswoman Raises Concerns About Paypal Stablecoin In The Absence Of Regulation Considering the analysis, SOL could potentially hit the $30 threshold in a few weeks if the bulls sustain the current market sentiment. So traders can anticipate a bullish move but should consider other indicators and market context for a more accurate assessment of the coin&#8217;s direction. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-10T20:00:52.000Z",
    "title": "3 Top Cryptos For Retail Investors to 100x their Cryptocurrncy portfolio",
    "url": "https://www.crypto-news-flash.com/3-top-cryptos-for-retail-investors-to-100x-their-cryptocurrncy-portfolio/?utm_source=rss&utm_medium=rss&utm_campaign=3-top-cryptos-for-retail-investors-to-100x-their-cryptocurrncy-portfolio",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-3.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-3-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-3-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />With the bears still having the upper hand in the global crypto market,  the spotlight is shining brightly on some of the most promising tokens for the next bull run, including Polygon (MATIC) and Aave (AAVE), and Borroe ($ROE). With its groundbreaking approach to Web3 financing and a presale that promises to be a ticket [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-10T19:45:00.000Z",
    "title": "Ripple Prepares Response as SEC Appeals Judge’s Ruling on XRP",
    "url": "https://coinedition.com/ripple-prepares-response-as-sec-appeals-judges-ruling-on-xrp/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/SEC_Seeks_to_Appeal_Ruling_That_Ripple_XRP_Isnt_a_Security.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/SEC_Seeks_to_Appeal_Ruling_That_Ripple_XRP_Isnt_a_Security.png 730w, https://coinedition.com/wp-content/uploads/2023/08/SEC_Seeks_to_Appeal_Ruling_That_Ripple_XRP_Isnt_a_Security-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/08/SEC_Seeks_to_Appeal_Ruling_That_Ripple_XRP_Isnt_a_Security-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/08/SEC_Seeks_to_Appeal_Ruling_That_Ripple_XRP_Isnt_a_Security-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/08/SEC_Seeks_to_Appeal_Ruling_That_Ripple_XRP_Isnt_a_Security-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/08/SEC_Seeks_to_Appeal_Ruling_That_Ripple_XRP_Isnt_a_Security-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/08/SEC_Seeks_to_Appeal_Ruling_That_Ripple_XRP_Isnt_a_Security-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/08/SEC_Seeks_to_Appeal_Ruling_That_Ripple_XRP_Isnt_a_Security-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/08/SEC_Seeks_to_Appeal_Ruling_That_Ripple_XRP_Isnt_a_Security-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/08/SEC_Seeks_to_Appeal_Ruling_That_Ripple_XRP_Isnt_a_Security-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/08/SEC_Seeks_to_Appeal_Ruling_That_Ripple_XRP_Isnt_a_Security-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/08/SEC_Seeks_to_Appeal_Ruling_That_Ripple_XRP_Isnt_a_Security-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/08/SEC_Seeks_to_Appeal_Ruling_That_Ripple_XRP_Isnt_a_Security-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/08/SEC_Seeks_to_Appeal_Ruling_That_Ripple_XRP_Isnt_a_Security-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/08/SEC_Seeks_to_Appeal_Ruling_That_Ripple_XRP_Isnt_a_Security-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/08/SEC_Seeks_to_Appeal_Ruling_That_Ripple_XRP_Isnt_a_Security-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>As speculated by numerous experts in the field, the U.S. SEC is planning to appeal Judge Analisa Torres’ verdict that the Ripple XRP token is not a security. The SEC’s statement, in part, reads: the SEC seeks to certify the Court’s holding that Defendants’ “Programmatic” offers and sales to XRP buyers over crypto asset trading [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ripple-prepares-response-as-sec-appeals-judges-ruling-on-xrp/\">Ripple Prepares Response as SEC Appeals Judge&#8217;s Ruling on XRP</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-10T20:00:50.000Z",
    "title": "Here’s One Altcoin From the Ethereum Ecosystem Ready for Huge Growth, According to DeFi Veteran Arthur Cheong",
    "url": "https://dailyhodl.com/2023/08/10/heres-one-altcoin-from-the-ethereum-ecosystem-ready-for-huge-growth-according-to-defi-veteran-arthur-cheong/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/one-altcoin-ready-huge.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/one-altcoin-ready-huge.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/one-altcoin-ready-huge.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/one-altcoin-ready-huge.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/one-altcoin-ready-huge.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/one-altcoin-ready-huge.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/one-altcoin-ready-huge.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>One decentralized finance (DeFi) altcoin is setting the stage for significant growth, according to venture capitalist Arthur Cheong. Cheong, the founder of DeFiance Capital, tells his 149,600 X followers that crypto staking solution Lido (LDO) is undervalued at the moment and has great growth potential. Cheong says that the liquid staking market is seeing massive amounts [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/10/heres-one-altcoin-from-the-ethereum-ecosystem-ready-for-huge-growth-according-to-defi-veteran-arthur-cheong/\">Here’s One Altcoin From the Ethereum Ecosystem Ready for Huge Growth, According to DeFi Veteran Arthur Cheong</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-10T19:55:22.000Z",
    "title": "Crypto Trader Warns of Downtrend for Dogecoin and Chainlink, Says Bitcoin Experiencing ‘Strong Rejection’",
    "url": "https://dailyhodl.com/2023/08/10/crypto-trader-warns-of-downtrend-for-dogecoin-and-chainlink-says-bitcoin-experiencing-strong-rejection/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/02/warns-russia-using-crypto.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/02/warns-russia-using-crypto.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/02/warns-russia-using-crypto.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/02/warns-russia-using-crypto.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/02/warns-russia-using-crypto.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/02/warns-russia-using-crypto.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/02/warns-russia-using-crypto.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is updating his followers on the state of Dogecoin (DOGE), Chainlink (LINK) and Bitcoin (BTC). Pseudonymous crypto trader Rekt Capital tells his 349,600 Twitter followers that the Shiba Inu (SHIB) rival DOGE could see a downside continuation moving forward. &#8220;Arguments can be made for DOGE retracing into the lower regions of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/10/crypto-trader-warns-of-downtrend-for-dogecoin-and-chainlink-says-bitcoin-experiencing-strong-rejection/\">Crypto Trader Warns of Downtrend for Dogecoin and Chainlink, Says Bitcoin Experiencing ‘Strong Rejection’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]