[
  {
    "source": "Cointelegraph",
    "date": "2023-12-29T03:51:02.000Z",
    "title": " Solana retraces back to pre-Xmas prices as BNB retakes 4th spot ",
    "url": "https://cointelegraph.com/news/solana-price-falls-christmas-levels-binance-bnb-climbs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMjMzYWJlNDktYWJjZi00YWM0LTg3N2EtNTNjNTVhMTc2MmU5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Solana has sacrificed its place as the fourth-largest cryptocurrency by market cap, after being overtaken by BNB.</p>\n                    <p><p>The price of Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) cooled in the days following Christmas after an impressive 120% monthly rally in December that saw its market cap grow larger than that of Binance’s BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>).</p><p>The retrace saw Solana’s price fall below $100 before spending several hours at pre-holiday prices just above $101. </p><p>At the time of publication, Solana is changing hands for $105, still down roughly 14% from its yearly high of $123, which it notched on Dec. 26, per TradingView <a href=\"https://www.tradingview.com/symbols/SOLUSD/\" target=\"_blank\" rel=\"noopener nofollow\">data</a>.</p><p><a href=\"https://cointelegraph.com/news/solana-price-falls-christmas-levels-binance-bnb-climbs\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-29T04:00:30.000Z",
    "title": "Terra wins one summary judgment in SEC case, but sold unregistered securities",
    "url": "https://cryptoslate.com/terra-wins-one-summary-judgment-in-sec-case-but-sold-unregistered-securities/",
    "description": "<p>Terraform Labs obtained a partial victory on Dec. 28 within a case initiated by the U.S. Securities and Exchange Commission (SEC). Judge Jed Rakoff issued one summary judgment in Terraform Labs&#8217; favor and declared that the firm did not offer and effect transactions in security-based swaps. The judge said that mAssets offered on the Terra-based [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/terra-wins-one-summary-judgment-in-sec-case-but-sold-unregistered-securities/\">Terra wins one summary judgment in SEC case, but sold unregistered securities</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T03:59:35.000Z",
    "title": "The AI Text Tools Revolution – Unraveling the Powerhouses of 2023",
    "url": "https://www.cryptopolitan.com/the-ai-text-tools-powerhouses-of-2023/",
    "description": "In a world where Large Language Models (LLMs) have evolved from obscure technologies to digital confidants, creators, and even slaves in our everyday lives, the realm of AI text tools has reached unprecedented heights in 2023. The spotlight is on the most powerful and versatile LLMs, shaping the narrative of AI&#8217;s influence on our digital [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T03:56:35.000Z",
    "title": "Nigeria’s crypto industry expected to get a boost with CBN’s policy reversal",
    "url": "https://www.cryptopolitan.com/nigerias-crypto-industry-boost-cbns-policy/",
    "description": "The Central Bank of Nigeria (CBN) reversed its 2021 directive, lifting the ban on local banks and financial institutions serving cryptocurrency firms. According to experts, this move is poised to positively impact Nigeria&#8217;s crypto landscape, fostering a more regulated environment and encouraging collaboration between traditional financial institutions and digital asset providers. CBN&#8217;s reversal: A catalyst [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-29T03:58:43.000Z",
    "title": "Ethereum Price Retreats From Highs But Technicals Suggest Upside Continuation",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-retreats-2440/",
    "description": "Ethereum price is correcting gains from the $2,440 zone. ETH is correcting gains, but the bulls might remain active near the $2,300 and $2,240 support levels. Ethereum is correcting gains and trading below the $2,400 level. The price is trading above $2,320 and the 100-hourly Simple Moving Average. There is a bullish flag forming with resistance near $2,360 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if there is a close above the $2,400 level. Ethereum Price Remains Supported Ethereum price climbed higher above the $2,320 resistance zone. ETH even broke the $2,400 level before the bears appeared. A high was formed near $2,441 before the price started a downside correction, like Bitcoin. There was a move below the $2,400 and $2,380 levels. The price declined and tested the 50% Fib retracement level of the upward wave from the $2,180 swing low to the $2,441 high. The bulls seem to be active near the $2,320 support zone. Ethereum is now trading above $2,320 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $2,360 level. There is also a bullish flag forming with resistance near $2,360 on the hourly chart of ETH/USD. Source: ETHUSD on TradingView.com The first major resistance is now near $2,400. A close above the $2,400 resistance could send the price toward $2,440. The next key resistance is near $2,500. A clear move above the $2,500 zone could start another increase. The next resistance sits at $2,620, above which Ethereum might rally and test the $2,750 zone. More Losses in ETH? If Ethereum fails to clear the $2,400 resistance, it could continue to move down. Initial support on the downside is near the $2,320 level and the 100 hourly SMA. The first key support could be the $2,240 zone or the 76.4% Fib retracement level of the upward wave from the $2,180 swing low to the $2,441 high. A downside break and a close below $2,240 might start another major decline. In the stated case, Ether could test the $2,165 support. Any more losses might send the price toward the $2,120 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now near the 50 level. Major Support Level – $2,320 Major Resistance Level – $2,400"
  }
]