[
  {
    "source": "Cointelegraph",
    "date": "2024-03-26T02:57:07.000Z",
    "title": " Is Bitcoin’s pre-halving retrace over? 52K BTC accumulated on Sunday alone ",
    "url": "https://cointelegraph.com/news/bitcoin-pre-halving-retrace-over-huge-accumulation-day-weekend",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMGZmMDA5YWYtMDEyMi00MzY0LThiZGQtNjM4YjllODE4ZmY2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>BTC prices have rebounded to reclaim $71,000 in late trading on March 25.   </p>\n                    <p><p>Bitcoin’s pre-halving retrace may already be over following one of the largest accumulation days in years, which saw Bitcoin <a href=\"https://cointelegraph.com/news/btc-accumulation-restarted-coinbase-btc-supply-9-year-low\">reclaiming</a> the $71,000 price level.</p><p>On March 25, blockchain analytics firm Santiment <a href=\"https://twitter.com/santimentfeed/status/1772295815421362413\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that Bitcoin just “caught traders off guard” with a rebound as “key stakeholders” had a huge accumulation day over the weekend. </p><p>Wallets, which it terms ‘sharks’ and ‘whales’ holding between 10 and 10,000 coins, accumulated 51,959 <a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a> on March 24 worth around $3.4 billion at the time, the firm revealed. It added that this equates to 0.263% of the entire currently available supply being accumulated in one day.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-pre-halving-retrace-over-huge-accumulation-day-weekend\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-26T02:59:40.000Z",
    "title": "Arizona State University Introduces Groundbreaking AI Business Degree",
    "url": "https://www.cryptopolitan.com/arizona-state-university-ai-business-degree/",
    "description": "Find out how Arizona State University's W. P. Carey School of Business is changing business education with its new Master's program in AI for business. "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-26T02:44:14.000Z",
    "title": "Microsoft’s Leadership Shakeup – Pavan Davuluri to Lead Windows and Surface Teams",
    "url": "https://www.cryptopolitan.com/microsofts-davuluri-lead-windows-surface/",
    "description": "In a strategic move aimed at fortifying its leadership in key product divisions, Microsoft has announced the elevation of seasoned company veteran Pavan Davuluri to the helm of its Windows operating system and Surface devices teams. This significant development comes in the wake of a leadership transition prompted by the departure of Panos Panay last [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-26T03:00:52.000Z",
    "title": "Solana (SOL) Breaks Through Key Resistance, Analyst Forecasts $250 Price Target",
    "url": "https://www.newsbtc.com/news/solana/solana-sol-breaks-through-key-resistance-analyst-forecasts-250-price-target/",
    "description": "Solana (SOL) has experienced a notable resurgence in its bullish momentum, with a rebound of over 9% in the past 24 hours. This notable performance has outpaced the top 10 largest cryptocurrencies in terms of market capitalization. The latest surge in SOL&#8217;s price has allowed it to surpass its resistance level on the daily chart at $184. The remaining hurdle of $201 now stands as the final barrier to prevent further gains for the cryptocurrency.  However, industry experts and crypto analysts suggest that SOL&#8217;s price action indicates a potential continuation towards its previous all-time high of $259, achieved during the market&#8217;s bullish run in November 2021. SOL  Price Expected To Breakout And Target All-Time Highs One analyst, &#8220;Jelle,&#8221; highlights SOL&#8217;s successful transformation of the last significant resistance level into support, suggesting a positive outlook for the token&#8217;s future. The analyst predicts that the SOL price will continue to rise and potentially exceed $250 by the summer. Related Reading: Bitcoin is “Overheating” For The First Time Ever Before Halving Similarly, another analyst using the pseudonym Mikybull points out that SOL is currently consolidating within a symmetrical triangle pattern on a daily timeframe.  According to the analyst, a breakout from this pattern is expected to trigger an “explosive” price movement, aiming to reach its previous all-time high levels at around $255. Supporting SOL&#8217;s renewed bullish momentum, CoinGecko data reveals a significant increase in trading volume, with $4,514,426,127 traded in the last 24 hours. This represents a 74.20% surge compared to the previous day, indicating a notable surge in market activity.  Solana Metrics Demonstrate Growing Investor Interest  According to data from Token Terminal, Solana&#8217;s key metrics further highlight the use and adoption of its blockchain among investors. Starting with market capitalization, the fully diluted market capitalization is $99.32 billion. This figure represents the total market value if all tokens were in circulation. The fully diluted market capitalization over the past 30 days has increased by 70.0%.  On the other hand, the circulating market cap, which only considers the tokens currently in circulation, is valued at $77.05 billion. It has witnessed a 30-day growth of 71.3%. Examining fees generated through transactions on the Solana network, the 30-day fees amount to $51.46 million. This represents a notable surge of 220.7% within 30 days, highlighting increased network usage and demand. When annualized, the fees reach $626.15 million. Related Reading: 7 Days Of Crypto: Key Events That You Should Keep An Eye On This Week In terms of revenue, Solana has seen positive growth. The 30-day revenue is $25.73 million, reflecting a significant increase of 220.7% over the past month. When annualized, the revenue amounts to $313.08 million, showing the sustainable income generation within the Solana network. It remains to be seen if these metrics and bullish momentum will sustain SOL&#8217;s path to its current all-time highs. Featured image from Shutterstock, chart from TradingView.com"
  }
]