[
  {
    "source": "Cryptopolitan",
    "date": "2023-09-20T00:23:13.000Z",
    "title": "Yellen: It’s time for U.S. growth to hit the brakes",
    "url": "https://www.cryptopolitan.com/yellen-time-for-us-growth-to-hit-the-brakes/",
    "description": "Amidst the bustling agenda of climate events in the political heartland, Treasury Secretary Janet Yellen struck a distinct chord on the U.S. economy&#8217;s pace. As whispers of inflation and employment figures made rounds, Yellen candidly shed light on the U.S.&#8217;s hyperactive growth, signaling it&#8217;s time for moderation. Balancing Growth With Potential The growth figures for ... <a title=\"Yellen: It’s time for U.S. growth to hit the brakes\" class=\"read-more\" href=\"https://www.cryptopolitan.com/yellen-time-for-us-growth-to-hit-the-brakes/\" aria-label=\"More on Yellen: It’s time for U.S. growth to hit the brakes\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-20T00:18:09.000Z",
    "title": "Chamber of Digital Commerce unveils the Digital Power Network",
    "url": "https://www.cryptopolitan.com/chamber-of-digital-commerce-unveils-the-digital-power-network/",
    "description": "In a recent report by Washington, the Digital Power Network (DPN) emerges as the newest affiliate of the Chamber of Digital Commerce. With roots deeply embedded in the Chamber&#8217;s Mining Initiative, this coalition is positioned to give cryptocurrency miners a distinctive voice in the nation&#8217;s capital. DPN is no fledgling venture, boasting an impressive inaugural ... <a title=\"Chamber of Digital Commerce unveils the Digital Power Network\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chamber-of-digital-commerce-unveils-the-digital-power-network/\" aria-label=\"More on Chamber of Digital Commerce unveils the Digital Power Network\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-20T00:14:51.000Z",
    "title": "Elon Musk sues U.S. government – Here is why",
    "url": "https://www.cryptopolitan.com/elon-musk-sues-u-s-government-here-is-why/",
    "description": "The tug-of-war between visionary entrepreneur Elon Musk&#8217;s aerospace manufacturer, SpaceX, and the U.S. Government reached a tipping point as the rocket mogul filed a lawsuit in Texas. At the heart of this dramatic legal standoff lies an accusation that the U.S. Government, through its administrative avenues, is infringing upon constitutional rights—specifically, by questioning SpaceX&#8217;s hiring ... <a title=\"Elon Musk sues U.S. government &#8211; Here is why\" class=\"read-more\" href=\"https://www.cryptopolitan.com/elon-musk-sues-u-s-government-here-is-why/\" aria-label=\"More on Elon Musk sues U.S. government &#8211; Here is why\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-20T00:30:29.000Z",
    "title": "Hodlnaut Refuses OPNX’s $30 Million Offer After FLEX Token Declines By 90%",
    "url": "https://www.newsbtc.com/news/hodlnaut-refuses-opnxs-30-million-offer-after-flex-token-declines-by-90/",
    "description": "According to the latest report, the interim judicial managers of beleaguered crypto lender Hodlnaut have rejected the latest acquisition bid proposed by OPNX. The OPNX exchange, affiliated with the founders of collapsed hedge fund Three Arrows Capital (3AC), offered to buy a significant 75% ownership stake in troubled Hodlnaut in August 2023. Holdnaut, a Singapore-based crypto lender, was another of the numerous victims of the financial crisis that rocked the crypto space in 2022. The crypto company had to halt withdrawals after losing around $190 million to the Terra ecosystem’s crash. Hodlnaut Says $30 Million Offer Has “Speculative Value” According to a recent court filing reviewed by Bloomberg, Hodlnaut administrators have opted out of the acquisition deal of the crypto lending firm, arguing that the $30 million offer of FLEX tokens is “illiquid” and has “speculative value.” Meanwhile, most of the crypto lender’s creditors, who account for 60% of the total debt, supported this decision. In the report, Bloomberg alluded that the FLEX price has declined by more than 92% since OPNX made the acquisition bid in early August. According to CoinGecko data, the FLEX token was valued at roughly $7 at the time of the offer.  Related Reading: Bitcoin Rally Driven By Coinbase Users? Premium Would Say So The cryptocurrency has been subject to extreme volatility lately, prompting its rise to $2.48 on Monday, September 18. However, the FLEX Coin has since undergone a significant price correction, with its current value at $0.584586. FLEX is the native cryptocurrency of the CoinFLEX exchange, which stopped withdrawals and filed for restructuring in June 2022. OPNX was launched by CoinFLEX founders Mark Lamb and Sudhu Arumugam, explaining the connection between the OPNX exchange and the FLEX token. Other Reasons For Rejecting OPNX’s Takeover Bid Besides the concerns about the FLEX token and its “speculative value,” the Hodlnaut administrators put forward other questions on the OPNX’s $30 million offer. One of these issues is the “no injection of cash or assets with similar liquidity.” Bloomberg revealed that the administrators implied liquid tokens such as Bitcoin and Ether. The court-appointed interim managers also questioned the absence of “a timeline for repayment of creditors’ debt” and that there were “no details of payment beyond 30% of liabilities.”  Related Reading: Lawyer Involved In Cryptoqueen’s OneCoin Scam Receives Shocking Response From Court It is worth noting that the involvement of the embattled Three Arrows Capital founders, Kyle Davies and Su Zhu, in OPNX’s takeover bid has always been a source of worry. Davies and Zhu are in a legal battle with 3AC creditors in the United States. The Three Arrows Capital founders have also faced troubles outside the United States, with the Monetary Authority of Singapore (MAS) recently issuing a 9-year ban against them. This directive prohibits Davies and Zhu from engaging in regulated business activities in the Southeast Asian country. The cryptocurrency total market cap on the daily timeframe &#124; Source: TOTAL chart on TradingView Featured image from Medium, chart from TradingView"
  }
]