[
  {
    "source": "Cointelegraph",
    "date": "2024-02-08T08:29:45.000Z",
    "title": " Metaverse en route from ‘era of hype’ to ‘pillar’ in Middle East ",
    "url": "https://cointelegraph.com/news/metaverse-adoption-middle-east-governments-economy",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMTI0N2RmOGEtOTVhMi00ODAzLTkyYzQtY2QxZmNhN2VkOTM0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>LandVault CEO Samuel Huber explained that the \"era of hype\" back in 2021 was just a prototype of what the metaverse truly is. </p>\n                    <p><p>While the hype surrounding the metaverse may be away from its peak back in 2021, an executive believes it lives on, with governments in the Middle East capitalizing on the technology to boost their economies. </p><p>At the Arte Talks event held in the Theatre of Digital Art in Dubai, Cointelegraph spoke with Samuel Huber, the CEO of LandVault, a metaverse firm working with various government agencies in the Middle East. Huber spoke about the current interest in the metaverse and the biggest segment diving into the technology. </p><p>According to Huber, because the metaverse was the main narrative in 2021 and 2022, everyone jumped in. However, the executive said many who started metaverse projects pulled back. Huber explained that this was because many of the projects overestimated the metaverse’s impact in the short term and built things without any utility. He added: </p><p><a href=\"https://cointelegraph.com/news/metaverse-adoption-middle-east-governments-economy\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-08T08:30:06.000Z",
    "title": "Experimental ERC-404 Token Surges To $170M Market Cap",
    "url": "https://cryptodaily.co.uk/2024/02/experimental-erc-404-token-surges-to-170m-market-cap",
    "description": "ERC-404, a novel and experimental token standard on Ethereum combining the attributes of NFTs and cryptocurrencies, has rocketed to a $170M market cap, generating $87M in trades."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-08T08:31:41.000Z",
    "title": "Hacken uncovers links in Ripple chairman’s $112.5M XRP hack",
    "url": "https://www.cryptopolitan.com/hacken-uncovers-links-in-ripple-chairmans/",
    "description": "In a recent development that has sent ripples through the cryptocurrency community, Hacken, a blockchain analytics platform, has reported a significant security breach involving Chris Larsen, the co-founder and chairman of Ripple. On January 31, Larsen disclosed that his wallets were compromised, leading to a loss of 213 million XRP, valued at approximately $112.5 million [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-08T08:30:38.000Z",
    "title": "Bitcoin Price Targets $55,000 Following Bull Pennant Breakout",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-targets-55000-bull-pennant/",
    "description": "The Bitcoin price has experienced a notable increase of over 4% in the last 12 hours, marking a departure from the recent lull. This movement follows a bull pennant breakout, with the price of Bitcoin now aiming for the $55,000 mark. The 4-hour (BTC/USD) chart below shows Bitcoin trading at $44,609, having just breached the confines of a bullish pennant pattern—a bullish continuation signal frequently followed by an upward price trajectory. What This Means For Bitcoin Price The pennant, which is characterized by converging trend lines following a substantial price move, signifies a pause in trading before the market resumes its prior uptrend. The breakout from the pennant suggests a continuation of the bullish trend with a potential target that is often extrapolated from the length of the prior move, known as the flagpole, which initiated the pennant formation. Related Reading: Bitcoin Miner Reserves Drop To June 2021 Levels, What This Means For Price Looking at the moving averages, Bitcoin has displayed a golden cross pattern, with the 20-period EMA (currently at $43,389) ascending above the 50-period EMA (currently at $43,049) and the 100-period EMA (currently at $42,727). This cross underpins the bullish sentiment in the market. Volume, a key indicator of the strength behind price movements, has also shown an uptick as the breakout occurred, further validating the bullish scenario. The Fibonacci retracement tool, applied from the swing high at $49,092 to the swing low at $38,484, shows Bitcoin&#8217;s price breaking above the 0.5 ($43,788) retracement level. The next critical levels to watch are the 0.618 ($45,040) and the 0.786 ($46,822) Fibonacci levels, which may serve as resistances in the short term. Beyond that, the full 1.0 extension ($49,092) is on the horizon, with the 1.618 extension ($55,648) aligning closely with the target of $55,000, reinforcing its significance as a potential price objective. Related Reading: Ticking Time Bomb: Bitcoin Mega Squeeze Predicted In The Next 10 Days The RSI, at 73.47, indicates strong buying pressure but also suggests caution as the market approaches overbought conditions. However, it is important to note that Bitcoin price in its strongest moments tends to reach very high levels, exhibiting the massive momentum. Therefore, it is essential for traders to watch for any potential divergence that may signal a weakening of the current momentum. In conclusion, Bitcoin&#8217;s break above the bullish pennant pattern has set the stage for a possible rally towards the $55,000 mark. The intersection of the golden cross, increased volume, and the Fibonacci extension levels adds credence to the bullish outlook. However, traders should remain vigilant of the overbought conditions that could prompt a retest of key support levels. The most crucial support is found at the 0.5 Fibonacci level ($43,788), with further support levels at 0.382 ($42,536) and 0.236 ($40,988). A sustained move below these levels could challenge the bullish thesis and shift focus to the next significant support at $38,484. Featured image created with DALL·E, chart from TradingView.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-08T08:31:58.000Z",
    "title": "USDC Projections for 2024",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/usdc-projections-for-2024/",
    "description": "<p>As the #2 stablecoin, USDC is important to the crypto space. Today, we find out more about what the team behind USDC has in store for it in 2024.  To do this, we&#8217;ll be referencing the report here. Circle is the team behind the creation and operation of USDC. And, Circle is also the author of [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/usdc-projections-for-2024/\">USDC Projections for 2024</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]