[
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T05:53:59.000Z",
    "title": "Darknet bad actors work together to steal your crypto, here’s how — Binance CSO",
    "url": "https://cointelegraph.com/news/how-darknet-hackers-steal-crypto-binance-cso",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/6587acb3-c986-428d-ab93-0a3621e08b23.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Crypto hackers have turned their attention towards the crypto user and “security hygiene” is more important than ever, according to Binance’s Jimmy Su. </p>\n                    <p><p>Lurking in the shadiest corners of the dark web is a “well-established” ecosystem of hackers that target cryptocurrency users with poor “security hygiene,” according to Binance’s chief security officer.</p><p>Speaking to Cointelegraph, Binance CSO Jimmy Su said in recent years, hackers have shifted their gaze toward crypto end-users. </p><p>Su noted when Binance first opened in July 2017, the team saw plenty of hacking attempts on its internal network. However, as crypto exchanges continued to beef up their security, the focus has shifted. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Phishing scams are particularly prevalent in emails.<br><br>They are used as a way to collect your sensitive information by impersonating someone you trust.<br><br>Use the blog below to learn how to stay safe from them. <a href=\"https://t.co/UtKBvR52lX\">https://t.co/UtKBvR52lX</a></p>&mdash; Binance (@binance) <a href=\"https://twitter.com/binance/status/1676350277350313985?ref_src=twsrc%5Etfw\">July 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“Hackers always choose the lowest bar to achieve their goals, because for them it’s a business as well. The hacker community is a well-established ecosystem.”</p><p>According to Su, this ecosystem comprises four distinct layers — intelligence gatherers, data refiners, hackers and money launderers. </p><h3>Data gatherers</h3><p>The most upstream layer is what Su described as “threat intelligence.” Here, bad actors collect and collate ill-gotten intel about crypto users, creating entire spreadsheets filled with details about different users. </p><p>This could include crypto websites a user frequents, what emails they use, their name, and whether they’re on Telegram or social media.</p><p>“There is a market for this on the dark web where this information is sold [...] that describes the user,” explained Su in a May interview.</p><p>Su noted this information is usually gathered in bulk, such as previous <a href=\"https://cointelegraph.com/news/ledger-data-leak-a-simple-mistake-exposed-270k-crypto-wallet-buyers\">customer information leaks</a> or hacks targeting other vendors or platforms. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">An employee of our email vendor, <a href=\"https://t.co/6vM4WAcJal\">https://t.co/6vM4WAcJal</a>, misused their employee access to download &amp; share email addresses with an unauthorized external party. <br><br>Email addresses provided to OpenSea by users or newsletter subscribers were impacted.<a href=\"https://t.co/Osb6qqkqZZ\">https://t.co/Osb6qqkqZZ</a></p>&mdash; OpenSea (@opensea) <a href=\"https://twitter.com/opensea/status/1542338816551243776?ref_src=twsrc%5Etfw\">June 30, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In April, a research paper by Privacy Affairs revealed cybercriminals have been selling hacked crypto accounts <a href=\"https://cointelegraph.com/news/darknet-hackers-are-selling-crypto-accounts-for-as-low-as-30-a-pop\">for as little as $30 a pop</a>. Forged documentation, often used by hackers to open accounts on crypto trading sites can also be bought on the dark web.</p><h3>Data refiners</h3><p>According to Su, the data gathered is then sold downstream to another group — usually made up of data engineers that specialize in refining data.</p><p>“For example, there was a data set last year for Twitter users. [...] Based on the information there, they can further refine it to see based on the tweets to see which ones are actually crypto-related.”</p><p>These data engineers will then use “scripts and bots” to figure out which exchanges the crypto enthusiast may be registered with.</p><p>They do this by attempting to create an account with the user’s email address. If they get an error that says the address is already in use, then they’ll know if they use the exchange — this could be valuable information that could be used by more targeted scams, said Su. </p><h3>Hackers and phishers</h3><p>The third layer is usually what creates headlines. Phishing scammers or hackers will take the previously refined data to create “targeted” phishing attacks. </p><p>“Because now they know ‘Tommy’ is a user of exchange ‘X,’ they can just send an SMS saying, ‘Hey Tommy, we detected someone withdrew $5,000 from your account, please click this link and reach customer service if it wasn’t you.’”</p><p>In March, hardware wallet provider Trezor warned its users about a phishing attack <a href=\"https://cointelegraph.com/news/trezor-warns-users-of-new-phishing-attack\">designed to steal investors’ money</a> by making them enter the wallet’s recovery phrase on a fake Trezor website.</p><p>The phishing campaign involved attackers posing as Trezor and contacting victims via phone calls, texts, or emails claiming that there has been a security breach or suspicious activity on their Trezor account.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/7bb17273-afec-4c73-b8bf-31f1c6136daa.png\"  /><figcaption style=\"text-align: center;\">A screenshot from a phishing domain copying Trezor’s website. Source: Bleeping Computer</figcaption></figure><h3>Getting away with it</h3><p>Once the funds are stolen, the final step is getting away with the heist. Su explained this could involve leaving the funds dormant for years and then moving them to a crypto mixer such as Tornado Cash.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/arbitrum-based-jimbos-protocol-hacked-losing-7m-in-ethereum\"><strong><em>Arbitrum-based Jimbos Protocol hacked, losing $7.5M in Ether</em></strong></a></p><p>“There are groups that we know that may sit on their stolen gains for two, three years without any movement,” added Su. </p><p>While not much can stop crypto hackers, Su urges crypto users to practice better “security hygiene.”</p><p>This could involve revoking permissions for decentralized finance projects if they no longer use them, or ensuring communication channels such as email or SMS that are used for two-factor authentication are kept private. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\"><strong><em>Tornado Cash 2.0 — The race to build safe and legal coin mixers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-05T06:00:00.000Z",
    "title": "Decoding The Poly Network Exploit",
    "url": "https://cryptodaily.co.uk/2023/07/decoding-the-poly-network-exploit",
    "description": "<p class=\"md-end-block md-p md-focus\">Decoding the Poly Network Exploit: Key Lessons in Smart Contract Security</p>\n<p class=\"md-end-block md-p\">The DeFi world was rocked recently as Poly Network, a decentralized finance protocol that facilitates asset transfers across various blockchains, fell prey to its second major hack. This incident is a stark reminder of the critical role of smart contract security in the rapidly evolving DeFi and crypto industry.</p>\n<p class=\"md-end-block md-p\">On July 2nd, a breach affected Poly Network, with the exploit potentially impacting as many as 57 different asset types across 10 blockchains. According to security analysts, hackers allegedly leveraged a vulnerability in the smart contract system that allowed thgem to mint an unlimited amount of tokens. An estimated $42 billion worth of tokens were minted, although only about $5 million have been reportedly cashed out.</p>\n<p class=\"md-end-block md-p\">Poly Network isn't alone in its security woes. The DeFi and Web3 space has been marred by a series of similar exploits, with millions of dollars worth of digital assets lost to hackers. Many of these attacks, like the one against Poly Network, have leveraged vulnerabilities in smart contract systems. These programmable agreements, which execute transactions automatically when predetermined conditions are met, are a cornerstone of the DeFi ecosystem but also a prime target for cybercriminals.</p>\nSeverity of the Exploit: Understanding the Consequences\n<p class=\"md-end-block md-p\">The Poly Network hack underscores the severity and potential consequences of smart contract vulnerabilities. In the immediate aftermath, the total value locked on Poly Network plunged from $277 million to $176 million, a clear indication of the loss in user confidence. The ripple effects of such an incident can be wide-ranging, from an erosion of trust in the protocol to a broader negative impact on the DeFi market. </p>\n<p class=\"md-end-block md-p\">Such a hack also highlights the risks involved in the relatively new field of cross-chain transactions. As more DeFi platforms aim to enable seamless transactions across various blockchains, ensuring the security of these cross-chain protocols is a challenge that cannot be overlooked.</p>\nAnalyzing the Exploit: Unpacking the Technical Details\n<p class=\"md-end-block md-p\">The recent Poly Network exploit underpins the role of effective security measures in ensuring the integrity of blockchain networks, especially given the sophistication and complexity of the attack vectors involved. By forging proofs and potentially compromising private keys or executing a multi-signature service attack, the hacker was able to manipulate the LockProxy cross-chain bridge contract.</p>\n<p class=\"md-end-block md-p\">To begin with, the attacker used the lock function to lock a small amount of Lever Token. The subsequent transaction, viewed on the Poly Network explorer, indicated that the action had been validated through the relay chain. However, when the hacker moved to the BNB chain and initiated withdrawal operations via the verifyHeaderAndExecuteTx function, the withdrawal quantity did not match the originally locked amount. Further examination of the relay chain network did not show any records of this transaction.</p>\n<p class=\"md-end-block md-p\">At this point, two possibilities were considered: the leakage of signatures or the modification of keepers, entities responsible for signing user withdrawals. Controlling a keeper would allow the attacker to initiate withdrawals with forged signatures, leading to unauthorized transactions. Analyzing the attacker's use of the verifyHeaderAndExecuteTx function indicated that keepers had not been modified, directing the suspicion towards compromised keeper private keys or a multi-signature service attack.</p>\n<p class=\"md-end-block md-p\">Following the trail, three keepers were identified as potential compromise victims, underlining a significant security risk. If proven true, this would mean the attacker could initiate withdrawals and create seemingly valid transactions, bypassing the protocols' security measures.</p>\n<p class=\"md-end-block md-p\">Such an exploit demonstrates the need for advanced security strategies, including enhanced private key management and robust signature verification processes. If overlooked, these vulnerabilities can provide potential entry points for attackers to exploit and wreak havoc on blockchain networks, as illustrated by the Poly Network case. With the DeFi and crypto industry still at an early phase of developmental maturity, it's vital for protocol developers to continuously learn from such incidents, fortifying their systems against potential breaches, and upholding user trust.</p>\nAddressing Smart Contract Vulnerabilities\n<p class=\"md-end-block md-p\">Smart contract vulnerabilities can be mitigated, albeit not entirely eliminated. An effective approach involves a combination of preventive measures and reactive strategies.</p>\n<p class=\"md-end-block md-p\">Preventive measures include rigorous testing of smart contracts before deployment and regular audits by external security firms. These audits can help identify and rectify vulnerabilities before they can be exploited. Code review and bug bounty programs, where programmers are rewarded for discovering and reporting software bugs, can also be instrumental in fortifying smart contract security.</p>\n<p class=\"md-end-block md-p\">From a reactive standpoint, developers can use upgradeable smart contracts that allow for the modification of the contract's code post-deployment. This feature can be crucial for responding swiftly and effectively to discovered vulnerabilities.</p>\n<p class=\"md-end-block md-p\">Moving forward, it's clear that smart contract security must be at the forefront of DeFi protocol development. As the case of Poly Network demonstrates, the stakes are high, and the fallout from a breach can be devastating. By embracing rigorous security measures and continually learning from past incidents, the DeFi industry can help mitigate these risks and foster a more secure and resilient ecosystem.</p>\n<p class=\"md-end-block md-p\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T05:57:08.000Z",
    "title": "Meta’s Threads Challenges Twitter Dominance, Intensifying Duel Between Billionaires",
    "url": "https://www.cryptopolitan.com/metas-threads-challenges-twitters-dominance/",
    "description": "In a direct challenge to Twitter&#8217;s dominance, Meta, the parent company of Facebook and WhatsApp, will launch its highly anticipated Instagram Threads on Thursday. As controversies and service issues plague Elon Musk&#8217;s Twitter platform, users have been searching for alternatives. The personal competition between dueling billionaires, Mark Zuckerberg and Elon Musk intensifies with the impending ... <a title=\"Meta&#8217;s Threads Challenges Twitter Dominance, Intensifying Duel Between Billionaires\" class=\"read-more\" href=\"https://www.cryptopolitan.com/metas-threads-challenges-twitters-dominance/\" aria-label=\"More on Meta&#8217;s Threads Challenges Twitter Dominance, Intensifying Duel Between Billionaires\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-05T05:49:36.000Z",
    "title": "XRP Price Could Regain Strength Above This Key Resistance",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-could-regain-strength-0-496/",
    "description": "Ripple’s token price is moving higher from $0.4560 against the US Dollar. XRP price might gain bullish momentum if it clears the $0.4960 resistance zone. Ripple’s token price is moving higher toward the $0.4960 resistance against the US dollar. The price is now trading above $0.48 and the 100 simple moving average (4 hours). There is a key bullish trend line forming with support near $0.4860 on the 4-hour chart of the XRP/USD pair (data source from Kraken). The pair might continue to rise if it clears the $0.4960 resistance in the near term. Ripple’s Token Price Starts Fresh Increase This past week, Ripple’s XRP saw a downside correction from the $0.5265 resistance against the US Dollar. It dipped below the $0.500 support zone. The price even spiked below the $0.465 support. A low is formed near $0.4460 and the price is now rising, similar to Bitcoin and Ethereum. There was a move above the $0.455 and $0.465 resistance levels. XRP surpassed the 50% Fib retracement level of the downward move from the $0.5265 swing high to the $0.4460 low. XRP price is now trading above $0.480 and the 100 simple moving average (4 hours). There is also a key bullish trend line forming with support near $0.4860 on the 4-hour chart of the XRP/USD pair. Initial resistance on the upside is near the $0.4960 zone. It is close to the 61.8% Fib retracement level of the downward move from the $0.5265 swing high to the $0.4460 low. The next major resistance is near the $0.5050 level. Source: XRPUSD on TradingView.com A successful break above the $0.505 resistance level might send the price toward the $0.525 resistance. Any more gains might call for a test of the $0.550 resistance. Fresh Decline in XRP? If ripple fails to clear the $0.496 resistance zone, it could start another decline. Initial support on the downside is near the $0.486 zone and the trend line. The next major support is near $0.476. If there is a downside break and a close below the $0.476 level, XRP’s price could extend losses. In the stated case, the price could retest the $0.456 support zone. Technical Indicators 4-Hours MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $0.485, $0.476, and $0.456. Major Resistance Levels – $0.496, $0.505, and $0.525."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-05T05:53:02.000Z",
    "title": "Ethereum Price Inches Closer to $2K as Bullish Momentum Dominates Crypto Market",
    "url": "https://www.crypto-news-flash.com/ethereum-price-inches-closer-to-2k-as-bullish-momentum-dominates-crypto-market/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-price-inches-closer-to-2k-as-bullish-momentum-dominates-crypto-market",
    "description": "Institutional attention towards Ethereum has been growing fast with ETH investment products seeing major inflows over the last two weeks. Ethereum developers are working on an upgrade, called Cancun-Deneb, which will introduce a new feature called &#8220;blob-carrying transactions.&#8221; Along with Bitcoin and the broader cryptocurrency market, the world&#8217;s second-largest cryptocurrency Ethereum (ETH) has made strong [...]"
  }
]