[
  {
    "source": "CoinDesk",
    "date": "2023-05-31T15:30:00.000Z",
    "title": "5 Years After the $500,000 Ethereum Wager Between Joe Lubin and Jimmy Song, Who Won?",
    "url": "https://www.coindesk.com/tech/2023/05/31/5-years-after-the-500000-ethereum-wager-between-joe-lubin-and-jimmy-song-who-won/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The bet made at Consensus 2018 hinged on how far Ethereum adoption would get by now. Crypto analysts say the blockchain appears to have met a key threshold, or at least got very close."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-31T15:10:28.000Z",
    "title": "Web3 developer Magic raises $52M in funding led by PayPal Ventures",
    "url": "https://cointelegraph.com/news/magic-raises-52m-in-funding-round-led-by-paypal-ventures",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/dbf86014-0d4e-4abe-9c30-bf32bb614a2c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The company has raised $80 million for wallet development since its inception in 2020. </p>\n                    <p><p>On May 31, San Francisco-based wallet-as-a-service (WaaS) provider Magic <a href=\"https://www.prnewswire.com/news-releases/magic-announces-52m-strategic-funding-round-led-by-paypal-ventures-301838352.html\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that it had successfully raised $52 million in a strategic funding round led by PayPal Ventures. The funding round also saw participation from venture firms Cherubic, Synchrony, KX, Northzone, and Volt Capital, bringing Magic's total funds raised to over $80 million. </p><p>Magic's software is currently used by brands in retail, music, fashion, and gaming, including Mattel, Macy's, Xsolla, and Immutable. With the funding, Magic aims to increase adoption by providing authentic digital ownership opportunities and plans to expand functionality, enhance use cases, and deepen integration within the European Union and Asia-Pacific region.</p><p>By implementing Magic's software development kit (SDK), vendors can enable users to create wallets using existing email, social, SMS, or federated logins. The software provides an all-in-one package for user onboarding, which includes authentication, fiat on-ramps, nonfungible token (NFT) minting and NFT Checkout.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We&#39;re thrilled to announce our latest funding of $52M backed by <a href=\"https://twitter.com/PayPal?ref_src=twsrc%5Etfw\">@PayPal</a> <a href=\"https://twitter.com/cherubicvc?ref_src=twsrc%5Etfw\">@cherubicvc</a> <a href=\"https://twitter.com/synchrony?ref_src=twsrc%5Etfw\">@synchrony</a> <a href=\"https://twitter.com/northzoneVC?ref_src=twsrc%5Etfw\">@northzoneVC</a> <a href=\"https://twitter.com/VoltCapital?ref_src=twsrc%5Etfw\">@VoltCapital</a> <a href=\"https://twitter.com/kx?ref_src=twsrc%5Etfw\">@KX</a>. Magic is solving web3 onboarding and our mission is to give a wallet to every internet user.<br><br> Read more<a href=\"https://t.co/9tdZsH3lxH\">https://t.co/9tdZsH3lxH</a></p>&mdash; Magic (@magic_labs) <a href=\"https://twitter.com/magic_labs/status/1663909048922537987?ref_src=twsrc%5Etfw\">May 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The platform also says it complies with various regulations, such as SOC2 Type 2, CCPA, GDPR, HIPAA, and ISO. Founded in 2020, Magic has generated over 20 million unique wallets to date, with more than 130,000 developers utilizing its SDK. The company claims its proprietary technology can generate upwards of 2,000 wallets per second.</p><p>Crypto and Web3 wallet providers have attracted sizable funding rounds in recent years. In November 2021, Cointelegraph reported that ConsenSys, the Web3 software developer behind self-custodial wallet MetaMask, <a href=\"https://cointelegraph.com/news/blockchain-unicorn-consensys-valued-at-3-2b-following-200m-raise\">raised $200 million</a> at a $3.2 billion valuation. Similarly, on March 30, 2023, crypto wallet provider Ledger <a href=\"https://cointelegraph.com/news/crypto-wallet-ledger-raises-109m-as-demand-for-self-custody-soars\">raised $109 million</a> at a valuation of $1.4 billion after a surge in demand for self-custody. The same month, multichain wallet BitKeep announced that it raised <a href=\"https://cointelegraph.com/news/multi-chain-wallet-bitkeep-raises-30m-at-300m-valuation\">$30 million at a $300 million valuation</a>.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/account-abstraction-supercharges-ethereum-wallets-dummies-guide/\">‘Account abstraction’ supercharges Ethereum wallets: Dummies guide</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-31T15:20:26.000Z",
    "title": "NFT artist allegedly battling cancer revealed to be scam",
    "url": "https://cryptoslate.com/nft-artist-allegedly-battling-cancer-revealed-to-be-scam/",
    "description": "<p>Pixel Penguins, an NFT project allegedly created by an artist battling cancer, has been exposed as a scam using stolen art. How Pixel Penguins NFTs became popular On May 30, crypto influencer Andrew Wang wrote a Twitter thread detailing how the self-proclaimed pixel artist Hopeexist1 had been battling eye cancer and creating digital art for [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/nft-artist-allegedly-battling-cancer-revealed-to-be-scam/\">NFT artist allegedly battling cancer revealed to be scam</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-31T15:30:00.000Z",
    "title": "Tether (USDT) bought some Bitcoin, is Tradecurve a better bet for investors",
    "url": "https://cryptodaily.co.uk/2023/05/tether-usdt-bought-some-bitcoin-is-tradecurve-a-better-bet-for-investors",
    "description": "<p>Tether (USDT) announced a staggering $1.48 billion in profits in Q1 2023 and announced it would buy Bitcoin (BTC) regularly with 15% of net profits. Tether (USDT) has already added a whopping $1.5 billion of BTC to its reserves, and traders view this sustained buy pressure positively. With Tether (USDT) supporting Bitcoin (BTC), it allows the rest of the market to move upwards, and analysts have put the spotlight on Tradecruve (TCRV), a new AI-specialized trading platform they believe will surge 5,000% in the coming weeks.&nbsp;</p>\n<p></p>\n<p>Tradecurve (TCRV) Democtaziing Access to Financial MarketsTradecurve reimagines the trading experience and powers a futuristic experience, all while users maintain anonymity. No KYC is required to use the platform, and investors can begin trading with just an email account. The protocol blends the best of decentralized trading platforms (self-custody &amp; anonymity) with the best features of centralized trading platforms (institutional-level liquidity) to deliver the ultimate trading experience. Tradecurve goes beyond a regular derivatives service provider with an integrated Metaverse trading academy, social trading features such as copy trading, and its artificial intelligence trading algorithms. These features are unlockable through token ownership, causing analysts to forecast massive buy pressure for $TCRV. They further stated it could quickly 50X in the coming weeks before the presale closes.The platform will introduce Proof of Reserves to ensure legitimacy. And detailed in the whitepaper is a thorough plan for registering 100,000 traders within three months of operation. With 500:1 leverage, low latency trades, and access to multiple markets, including forex, commodities, stocks, and cryptos from a single interface, Tradecurve has democratized access to financial markets for millions of retail investors globally and will grow in line with this outstanding value proposition. A pioneering derivatives service provider and an investment opportunity investors would be foolish to miss.&nbsp;</p>\n<p></p>\n<p>Tether (USDT) Adds Bitcoin to its ReservesTether (USDT) initially launched in 2014 and is the crypto market&rsquo;s largest stablecoin ranked via market cap. Tether (USDT) was a beneficiary of the USDC depeg event as traders, users, and even whales rotated from USDC to Tether (USDT). Tether (USDT) has been doing excellent business as the FED has raised interest rates. Tether (USDT) holds billions and billions of dollars in short-dated treasury bills to back the value of Tether (USDT), which can be sold when investors want to exchange Tether (USDT) at a 1:1 ratio for dollars.As short-dated yields hit decade highs, Tether (USDT) has been clipping coupons and pocketing interest payments from the United States. Tether (USDT) has now decided to use some of this funding to buy Bitcoin (BTC), and this steady buy pressure should help markets rise. Seasoned investors realize that this buy pressure will bolster markets in general. Hence, the best strategy for high returns is to ignore Bitcoin (BTC) and focus on altcoins, especially those with solid fundamentals such as Tradecurve.&nbsp; Find out more about the Tradecurve presale here:</p>\n<p>Website: https://tradecurve.io/&nbsp;</p>\n<p>Presale:https://app.tradecurve.io/sign-up&nbsp;</p>\n<p>Telegram: https://t.me/tradecurve_official&nbsp;</p>\n<p>Twitter: https://twitter.com/Tradecurveapp&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-31T15:25:25.000Z",
    "title": "Huobi Joins HKVAC as First Member to Fuel Hong Kong's Ambition to be a Global Web3 Hub",
    "url": "https://cryptodaily.co.uk/2023/05/huobi-joins-hkvac-as-first-member-to-fuel-hong-kongs-ambition-to-be-a-global-web3-hub",
    "description": "<p>Singapore, Singapore, May 31st, 2023, Chainwire</p><p>Huobi announced that it became the first member of Hong Kong Virtual Asset Consortium (HKVAC). By joining HKVAC, an organization dedicated to providing credit ratings for crypto asset exchanges and trading products. Huobi aims to develop a venture capital database that caters to the needs of the market, actively engage in educating the public about crypto investments, and offer Hong Kong traders a \"one-stop\" crypto asset trading service. Ultimately, with Huobi Hong Kong (Huobi HK) as the pivot, Huobi is committed to supporting Hong Kong in its efforts to become a global Web3 hub.</p><p>HKVAC is said to be a collaboration of many crypto industry players, including exchanges, institutional investors, and Hong Kong-licensed rating agencies. It was established primarily to enhance the industry's capabilities in security risk management and to assist the Central Government and Hong Kong's local authorities in building a world-leading hub for virtual asset and digital finance. At the same time, it commits itself to creating a safe, open and transparent environment for crypto asset investments under the guidance of \"Hong Kong's new crypto regulations.&rdquo; It will also promote the acceptance and recognition of crypto assets by helping the public gain systematic, correct and secure knowledge about crypto investments.</p><p>As an exchange that always prioritizes \"global security and compliance operations\", Huobi has maintained the best industry record of 100% functionality and no security incidents for ten years since its inception. Huobi will bring its expertise in security technology and its compliant, standardized processes to HKVAC as a reference. Together they can provide risk management indicators to investors in the industry and set strict rating standards to evaluate existing exchanges, so that more crypto investors can have a clear understanding of the risk level of their investments. This will accelerate the creation of a safe and friendly crypto environment in Hong Kong.</p><p>In addition, as a pioneer in establishing itself as a Web3 gateway, Huobi will join hands with HKVAC to continuously pursue multi-dimensional collaborations and advancements in technology, data, and ecosystem development. Together, Huobi and HKVAC will facilitate the application of Web3 infrastructure and build a bridge between the real world and the realm of Web3 to encourage wider acceptance and participation in Web3. These endeavors will drive the development of Hong Kong's Web 3.0 industry and serve as the stepping stones on Hong Kong's way to becoming a global hub for Web 3.0 (the third-generation Internet).</p><p>As previously reported, Huobi will officially launch Huobi HK. Starting June 1, Huobi HK is expected to deliver unparalleled trading experiences to Web3 users through its wide range of products. Users can trade cryptocurrencies like BTC, ETH, TRX, LTC, BCH, DOGE, SHIB, BTT, SOL, ADA, and other major cryptocurrencies listed in the independent index on Huobi HK.</p><p>A Huobi representative said that joining HKVAC will boost Huobi's business in Hong Kong and lay the foundation for future operations that comply with laws and regulations. Meanwhile, Huobi intends to work with various parties in the industry to build the ecosystem of Web3 under the premise of policy compliance. It will start by establishing itself as a Web3 gateway to promote the development of Web3 in Hong Kong. Hopefully, Huobi will be granted a cryptocurrency trading license in Hong Kong in the near future, so that it can collaborate with the Hong Kong government, regulators, and other institutions to create a better crypto market in the region.</p><p>About Huobi</p><p>Founded in 2013, Huobi has evolved from a crypto exchange into a comprehensive ecosystem of blockchain businesses that span digital asset trading, financial derivatives, wallets, research, investment, incubation and other areas. Huobi serves millions of users worldwide, with a business presence covering over 160 countries and regions across five continents. Its three development strategies - \"global development, technology drives development, and technology for good\" - underpin its commitment to providing comprehensive services and values to global cryptocurrency enthusiasts.</p><p></p>ContactMichael Wangglo-media@huobi.com"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-31T15:22:44.000Z",
    "title": "Japan’s All Nippon Airways ventures into NFTs",
    "url": "https://crypto.news/japans-all-nippon-airways-ventures-into-nfts/",
    "description": "On May 30, All Nippon Airways (ANA), Japan's top airline, unveiled ANA GranWhale NFT, an aviation-themed non-fungible token (NFT) marketplace."
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-31T15:30:00.000Z",
    "title": "Ben Armstrong Criticizes US Senator Elizabeth Warren for Corrupt Act",
    "url": "https://coinedition.com/ben-armstrong-criticizes-us-senator-elizabeth-warren-for-corrupt-act/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Ben_Armstrong_Criticizes_US_Senator_Elizabeth_Warren_for_Corrupt-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Ben_Armstrong_Criticizes_US_Senator_Elizabeth_Warren_for_Corrupt-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Ben_Armstrong_Criticizes_US_Senator_Elizabeth_Warren_for_Corrupt-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Ben_Armstrong_Criticizes_US_Senator_Elizabeth_Warren_for_Corrupt-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Ben_Armstrong_Criticizes_US_Senator_Elizabeth_Warren_for_Corrupt-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Ben_Armstrong_Criticizes_US_Senator_Elizabeth_Warren_for_Corrupt-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Ben_Armstrong_Criticizes_US_Senator_Elizabeth_Warren_for_Corrupt.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Ben Armstrong, the famous crypto investor and host of the YouTube channel BitBoy Crypto, has criticized the senior US Senator Elizabeth Warren over her role in the crypto industry. Armstrong accuses Warren of perpetrating significant corruption against the cryptocurrency industry. In a video uploaded on YouTube, Armstrong described Warren as one of the most corrupt [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ben-armstrong-criticizes-us-senator-elizabeth-warren-for-corrupt-act/\">Ben Armstrong Criticizes US Senator Elizabeth Warren for Corrupt Act</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]