[
  {
    "source": "NewsBTC",
    "date": "2023-10-20T00:00:19.000Z",
    "title": "Lido Finance Fees Exploding, Should Comparatively Low Revenue Be A Concern?",
    "url": "https://www.newsbtc.com/news/defi/lido-finance-fees-exploding-low-revenue/",
    "description": "The total amount of Ethereum (ETH) staked on Lido Finance, one of the many liquidity staking protocols available, has risen steadily over the past few years. Surprisingly, revenue accrued by the platform (compared to staking rewards distributed) remains comparatively low.  Lido Finance Revenue Isn&#8217;t Growing As Fast As Expected Looking at Token Terminal data shared on October 19, the blockchain analytic platform observed that while staking rewards paid, counted as &#8220;fees&#8221; by Lido Finance grew from less than $10 million in early 2021 to over $60 million in June 2023, revenue has grown at a much slower pace. To illustrate, Lido Finance&#8217;s average revenue is roughly less than $5 million during this period. Overall, Lido Finance is a liquidity staking protocol that supports the staking of multiple proof-of-stake (PoS) coins like Ethereum (ETH) without necessarily locking them up. Users can concurrently earn staking rewards while accessing their hard-earned ETH&#8211;or any other coin supported. The protocol issues another derivative, stETH, for every ETH staked to achieve this. This token can be freely traded on exchanges. It can even be used as collateral for users keen on taking trustless loans on supported platforms. Related Reading: XRP Price Set For Massive Rally As BlackRock And JPMorgan Make Their Move Ethereum recently shifted to be a proof-of-stake blockchain to be greener and conserve the environment. This transition was a boon for protocols that supported the first smart contract platform to confirm transactions and remain secure, especially after the activation of Shanghai in April 2023.  The Shanghai upgrade allowed Ethereum validators to withdraw their staked ETH for the first time, permitting them to use alternatives, of which Lido Finance, looking at total value locked (TVL), was preferred. As of October 19, Lido Finance had a TVL of $13.913 billion, most of it being assets on Ethereum.  Ethereum Centralization Concerns: How Will This Be Addressed? Lido Finance makes staking more accessible to everyone while concurrently enhancing liquidity. However, the revenue generated appears low versus the amount of staking rewards distributed to stakers, most of whom are from Ethereum. Part of the revenue the network generates is also distributed to LDO holders and node operators. Whether the liquidity staking protocol plans to increase the 10% fee charged to increase revenue earned remains to be seen. Related Reading: Bitcoin ETF Approval Anticipated To Trigger Fiat Influx Of $24-50 Billion Presently, there are concerns that Lido Finance&#8217;s role on Ethereum could lead to centralization. Ethereum has been accused of being &#8220;centralized,&#8221; mainly in how it is built. Critics assert that the reliance on its co-founder, Vitalik Buterin, for endorsement and guidance could slow down development in the future. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-20T00:00:03.000Z",
    "title": "Ava Labs President John Wu Makes 2024 Crypto Predictions, Says Big Developments Coming for Avalanche Ecosystem",
    "url": "https://dailyhodl.com/2023/10/19/ava-labs-president-john-wu-makes-2024-crypto-predictions-says-big-developments-coming-for-avalanche-ecosystem/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/ava-labs-big-coming.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/ava-labs-big-coming.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/ava-labs-big-coming.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/ava-labs-big-coming.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/ava-labs-big-coming.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/ava-labs-big-coming.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/ava-labs-big-coming.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The president of the Avalanche (AVAX) development firm Ava Labs is issuing his crypto predictions for 2024. In the interview with CNBC, Ava Labs president John Wu talks up the Friend.tech challenger Stars Arena, a decentralized social finance application (SocialFi) that launched on the AVAX blockchain in late September. &#8220;We just talked about Stars Arena, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/19/ava-labs-president-john-wu-makes-2024-crypto-predictions-says-big-developments-coming-for-avalanche-ecosystem/\">Ava Labs President John Wu Makes 2024 Crypto Predictions, Says Big Developments Coming for Avalanche Ecosystem</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]