[
  {
    "source": "CoinDesk",
    "date": "2023-10-30T12:25:00.000Z",
    "title": "First Mover Americas: Bitcoin Ticks Along Above $34K",
    "url": "https://www.coindesk.com/markets/2023/10/30/first-mover-americas-bitcoin-ticks-along-above-34k/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for Oct. 30, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-30T12:23:53.000Z",
    "title": "Retail CBDC Could Add Unique Value, but Further Investigation Is Needed, Hong Kong Central Bank Says",
    "url": "https://www.coindesk.com/policy/2023/10/30/retail-cbdc-could-add-unique-value-but-further-investigation-is-needed-hong-kong-central-bank-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A retail central bank digital currency could add unique value to the existing payments ecosystem and enable new types of economic transactions, but further investigation is needed, Hong Kong's central bank said."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-30T12:10:07.000Z",
    "title": "DeFi Market Recovers From 30-Month Low as Volume Hits Highest Point Since March",
    "url": "https://www.coindesk.com/business/2023/10/30/defi-market-recovers-from-30-month-low-as-volume-hits-highest-point-since-march/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The total value of all assets locked on decentralized finance (DeFi) protocols has surged to a three-month high of $42 billion after being at its lowest point since February 2021 just two weeks ago."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-30T12:32:51.000Z",
    "title": "CME becomes second-largest Bitcoin futures exchange as open interest surges ",
    "url": "http://cointelegraph.com/news/cme-second-largest-bitcoin-futures-exchange-open-interest-surges",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/4eaf947f-6b5c-4b91-bcd2-d744600796c6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The surge in CME Bitcoin futures OI has helped the regulated derivatives platform attain a 25% market share in Bitcoin futures. </p>\n                    <p><p>The Chicago Mercantile Exchange (CME), a regulated Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) Futures exchange, now stands just behind Binance in terms of notional open interest (OI) to rank second in the list of BTC futures exchanges.</p><p>CME’s OI hit $3.58 billion earlier on Oct. 30, pushing the regulated derivatives exchange platform to jump two positions from the last week. CME overtook Bybit and OKX with $2.6 billion and $1.78 billion in OI, respectively, and is just a few million away from Binance’s OI of $3.9 billion.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/15b6acb1-8245-43a7-8f7a-c3e9c2508ec6.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Futures Exchange rankings by Open Interest. Source: Coinglass</em></figcaption></figure><p>The standard Bitcoin futures contract offered by CME is valued at five BTC, whilst the micro contract is worth a tenth of a Bitcoin. Perpetual futures, as opposed to ordinary futures contracts, are the main focus of open interest in offshore exchanges as they come without an expiration date and use the funding rate method to maintain their price parity with the market price.</p><p>Bitcoin open interest refers to the total number of outstanding Bitcoin futures or options contracts in the market. It is a measure of the amount of money invested in Bitcoin derivatives at any given time. The OI measures the capital flowing in and out of the market. If more capital flows to Bitcoin futures, the open interest will increase. However, if the capital flows out, the open interest will decline. Hence, increasing open interest reflects a bullish sentiment, whereas a declining OI indicates a growing bearish sentiment.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blockchain-bitcoin-congestion-transaction-queues-deter-nefarious-actors-study\"><strong><em>Blockchain congestion and transaction queues actually deter ‘nefarious actors’: Study</em></strong></a></p><p>CME’s rising OI not only helped the regulated futures exchange to climb to the second spot among futures crypto exchanges but also saw its cash-settled futures contracts exceed 100,000 BTC in volume. The rising interest of traders in the Bitcoin futures market has also propelled CME to gain 25% of the Bitcoin futures market share.</p><p>A majority chunk of investment into CME futures has come via standard futures contracts indicating an influx of institutional interest as Bitcoin registered a massive double-digit surge in October, helping it reach a new one-year high above $35,0000.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-30T12:25:01.000Z",
    "title": "Bitcoin builder climbs Africa's tallest mountain to raise awareness",
    "url": "http://cointelegraph.com/news/bitcoin-builder-climbs-kilimanjaro-raise-awareness",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/912e2567-0bcd-4645-8e28-7a7b7868b696.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Advocates for the Bitcoin Lightning Network and decentralized protocol NOSTR fueled Kweks' Kilimanjaro climb.</p>\n                    <p><p>A Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) educator based in Tanzania has scaled Africa’s highest peak, Kilimanjaro, sponsoring the entire trip through Bitcoin and Nostr donations.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/596220c6-fd6f-4d75-addd-6c32ac637534.jpeg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">Kweks poses with a Bitcoin and NOSTR Flag at Kilimanjaro summit. Source: X</figcaption></figure><p>Kweks, (not his real name) crowdfunded over $1,700 in Bitcoin (0.0018 BTC) to cover the costs of the hike, which doubled up as an announcement for a new Bitcoin education academy in Tanzania.</p><p>“Kweks” recently moved with his wife to a new city in Tanzania to open a learning center, the “Proof of Work Academy,” or POWA. Kweks told Cointelegraph that while POWA is a pun on Bitcoin’s consensus protocol, proof-of-work, it also refers to the Zwahili word “Poah,” which means fresh or cool. </p><p>To promote the new school and subtly hint at his affinity for decentralized protocols, including Bitcoin and <a href=\"https://cointelegraph.com/news/decentralized-twitter-alternative-goes-live-on-apple-s-app-store\">Nostr (Notes and Other Stuff Transmitted by Relay), </a>Kweks funded the ascent to nearly 6,000 meters in Satoshis or \"Sats\" (a satoshi is a unit of a bitcoin, equal to 100 millionth of a bitcoin).</p><p><a href=\"https://cointelegraph.com/learn/what-is-the-lightning-network-in-bitcoin-and-how-does-it-work\">Bitcoin Lightning Network</a> donations streamed in from all around the world <a href=\"https://cointelegraph.com/news/crowdfunding-gets-leg-up-from-lightning-addresses-on-bitcoin\">via crowdfunding on Geyser Fund</a> and through Zapraising, or Bitcoin Lightning Network crowdfunding via NOSTR, (<a href=\"https://cointelegraph.com/news/free-bitcoin-on-zaps-experiment-what-are-zaps\">also called Zaps.</a>) </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/25b76911-f43e-48bc-93ed-2fb17ad177d9.png\"  /><figcaption style=\"text-align: center;\">The moment Kweks reached the fundraising milestone. Source: X</figcaption></figure><p>Kweks carried and waved a giant Nostr flag while sharing status updates throughout the multi-day hike on X, Nostr and WhatsApp. Speaking from Tanzania, Kweks explained to Cointelegraph that while the money raised was meaningful to cover the costs of getting into the National Park, the impact was primarily educational: </p><blockquote>“I thought it [the ascent] would be a great case study to show what Bitcoin can do and then introduce some people to Bitcoin as well.”</blockquote><p>The ascent demonstrated to his local community that a global base of Nostriches (users of Nostr), and generous Bitcoin advocates around the world were happy to support Kweks’ climb and educational work on the ground in Tanzania. </p><p>Plus, Kweks received a tip from one of the guides leading the party to the summit of “Kili”, as it's known locally, showing that there is grassroots Bitcoin adoption in Tanzania.</p><p>There is, evidently, some understanding of Bitcoin in Tanzania, Kweks explained—but one of the key challenges is “offramps,” into local currency. The likes of Coinbase, Kraken, and Gemini do not operate in Tanzania, so swapping cash for Bitcoin and vice versa can be challenging. </p><p>Over the course of the hike, Kweks received questions and curious comments from Tanzanians about how he funded the adventure as well as the inevitable query, “What is Bitcoin?”.</p><p>Ultimately, Bitcoin adoption in Tanzania is very different from the United Kingdom, where Kweks spent 25 years of his life prior to moving to Tanzania. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/hashing-it-out-crypto-meets-fintech-innovation-africa\">Hashing It Out: What happens when crypto meets fintech in Africa?</a></em></strong></p><p>There is, he explains, more of a barter system in place in East Africa. It can be a challenge to explain money and hyperinflation and the reasons why a currency with a programmed inflation rate, such as Bitcoin could offer an alternative economic system to society.</p><blockquote>“When I arrived in Tanzania ten years ago, $1 was 1500 hundred Tanzanian Shillings. As of today, [$1 equals] 2600. That's ten years later. It's crazy!”</blockquote><p>Ultimately, the key to unlocking Bitcoin education is to use terms relevant to people: “I do speak to them about how much bread is going up and how much fuel is going up, and they understand that,” Kweks explained.</p><blockquote>“They see that it's harder to make ends meet. So with these concepts, they understand that Bitcoin the tool can help them—and that's the work. That's the work that needs to be shared and explored.”</blockquote><p>Kweks continues to post and share educational resources on Nostr and X, while the educational resource POWA offers free educational classes to Tanzanians based near Kilimanjaro.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-senegal-why-how-african-country-using-btc/\">Bitcoin in Senegal: Why is this African country using BTC?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-30T12:28:29.000Z",
    "title": "Binance and CME are in a neck-and-neck race for dominance in Bitcoin futures",
    "url": "https://cryptoslate.com/insights/binance-and-cme-are-in-a-neck-and-neck-race-for-dominance-in-bitcoin-futures/",
    "description": "<p>Quick Take The dynamics of Bitcoin futures open interest unveils an intriguing interplay between major exchange platforms, Binance and CME. The former, a global cryptocurrency exchange with a wide reach, currently holds a slightly larger piece of the pie at just over 28%. CME, primarily known for institutional trading, accounts for 26% of all futures [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/binance-and-cme-are-in-a-neck-and-neck-race-for-dominance-in-bitcoin-futures/\">Binance and CME are in a neck-and-neck race for dominance in Bitcoin futures</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-30T12:11:22.000Z",
    "title": "Uniswap Foundation moves more than $40M worth of UNI tokens to crypto exchanges",
    "url": "https://cryptoslate.com/uniswap-foundation-moves-more-than-40m-worth-of-uni-tokens-to-crypto-exchanges/",
    "description": "<p>Uniswap Foundation has dumped nearly 10 million UNI tokens, worth more than $40 million, to crypto exchanges over the past week, according to on-chain data. Blockchain analyst Lookonchain reported that the Foundation transferred 3.4M UNI tokens, valued at $14.1 million, to OKX, and 3 million UNI tokens, equivalent to $13 million, were sent to Kraken&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/uniswap-foundation-moves-more-than-40m-worth-of-uni-tokens-to-crypto-exchanges/\">Uniswap Foundation moves more than $40M worth of UNI tokens to crypto exchanges</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-30T12:30:39.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: ETH Moves Back Above $1,800, BTC Remains Near Recent Highs",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-eth-moves-back-above-1800-btc-remains-near-recent-highs/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2124116891-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"ETH Moves Back Above $1,800, BTC Remains Near Recent Highs\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2124116891-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2124116891-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2124116891-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2124116891-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2124116891-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2124116891-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2124116891.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Ethereum once again rallied above the $1,800 level on Monday, ahead of a highly significant week of U.S. economic data. Over the next few days consumer confidence, and nonfarm payrolls will be reported, ahead of a Federal Reserve policy meeting. Bitcoin continued to trade close to the $35,000 zone. Bitcoin On Monday, bitcoin remained near [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T12:14:05.000Z",
    "title": "Decoding the UK’s AI Safety Summit Chronicles – Exclusive Report",
    "url": "https://www.cryptopolitan.com/uks-ai-safety-summit-exclusive-report/",
    "description": "In a historic move, the UK government is set to host the inaugural AI Safety Summit at Bletchley Park, bringing together an unprecedented assembly of global leaders, tech industry luminaries, and academic experts. This two-day summit, spearheaded by Prime Minister Rishi Sunak, signals a pivotal moment in the discourse surrounding artificial intelligence, specifically the concerns ... <a title=\"Decoding the UK&#8217;s AI Safety Summit Chronicles &#8211; Exclusive Report\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uks-ai-safety-summit-exclusive-report/\" aria-label=\"More on Decoding the UK&#8217;s AI Safety Summit Chronicles &#8211; Exclusive Report\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-30T12:16:09.000Z",
    "title": "FTX’s Journey from Origins to Mistakes Made: SBF Shares Insights on the Stand",
    "url": "https://www.crypto-news-flash.com/ftxs-journey-from-origins-to-mistakes-made-sbf-shares-insights-on-the-stand/?utm_source=rss&utm_medium=rss&utm_campaign=ftxs-journey-from-origins-to-mistakes-made-sbf-shares-insights-on-the-stand",
    "description": "<img width=\"957\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/FTX.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/FTX.jpg 957w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/FTX-300x150.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/FTX-768x385.jpg 768w\" sizes=\"(max-width: 957px) 100vw, 957px\" />Sam Bankman-Fried (SBF), the co-founder of FTX, addressed the allegations of fraudulent fund transfers during his court testimony, emphasizing that he made mistakes but did not commit fraud. SBF distanced himself from the software aspects of FTX, highlighting his reliance on other executives for those decisions, while also detailing his journey from Jane Street to [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-30T12:39:00.000Z",
    "title": "DOGE’s Bullish Signs Emerge as TD Sequential Flashes ‘Buy Signal’",
    "url": "https://coinedition.com/doges-bullish-signs-emerge-as-td-sequential-flashes-buy-signal/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/doge7.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/doge7.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/doge7-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/doge7-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/doge7-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/doge7-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/doge7-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Dogecoin (DOGE) market in the last seven days has grabbed the market&#8217;s attention significantly. After months in a descending triangle pattern, it finally broke free, showcasing a potential change in trend on its weekly chart.  Analysts, enthusiasts, and traders alike keenly observe Dogecoin, as the TD Sequential indicator has flashed a &#8216;buy&#8217; signal, suggesting [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/doges-bullish-signs-emerge-as-td-sequential-flashes-buy-signal/\">DOGE’s Bullish Signs Emerge as TD Sequential Flashes &#8216;Buy Signal’</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-30T12:12:46.000Z",
    "title": "LINK Faces Bearish Signals After Large Whale Transfer To Binance",
    "url": "https://coinedition.com/link-faces-bearish-signals-after-large-whale-transfer-to-binance/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/10/LINK-8.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/10/LINK-8.jpg 730w, https://coinedition.com/wp-content/uploads/2023/10/LINK-8-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/10/LINK-8-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/10/LINK-8-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/10/LINK-8-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/10/LINK-8-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/10/LINK-8-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/10/LINK-8-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/10/LINK-8-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/10/LINK-8-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/10/LINK-8-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/10/LINK-8-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/10/LINK-8-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/10/LINK-8-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/10/LINK-8-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/10/LINK-8-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>After Chainlink’s (LINK) price success over the past few days, it seems like a whale might be planning to cash in their holdings. The whale tracking platform, Whale Alerts, shared a post on X earlier today warning traders that a whale transferred 671,878 LINK, worth about $7,379,274, from an unknown wallet to Binance. LINK has [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/link-faces-bearish-signals-after-large-whale-transfer-to-binance/\">LINK Faces Bearish Signals After Large Whale Transfer To Binance</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]