[
  {
    "source": "CryptoGlobe",
    "date": "2023-11-21T05:15:34.000Z",
    "title": "Veteran Macro Investor Dan Tapiero Foresees a Major Crypto Adoption Wave, Says Trillions of Dollars in Traditional Capital Poised to Enter",
    "url": "https://www.cryptoglobe.com/latest/2023/11/veteran-macro-investor-dan-tapiero-foresees-a-major-crypto-adoption-wave-says-trillions-of-dollars-in-traditional-capital-poised-to-enter/",
    "description": "Dan Tapiero, a renowned macro investor, has recently articulated a strong conviction regarding the imminent widespread adoption of cryptocurrency technologies. Tapiero is the Managing Partner and CEO at 10T Holdings, which is a growth equity fund focused on investing in mid-to-late-stage digital asset ecosystem (DAE) companies. Portfolio companies include Ledger, Nova Labs (which develops the […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-21T05:10:00.000Z",
    "title": "Bitcoin Transaction Fees Eclipse Ethereum’s Amid Ordinals Frenzy",
    "url": "https://www.cryptoglobe.com/latest/2023/11/bitcoin-transaction-fees-eclipse-ethereums-amid-ordinals-frenzy/",
    "description": "Ordinals, in the context of Bitcoin, refer to a recent development that allows for the inscription of unique, non-fungible data onto individual satoshis, the smallest unit of Bitcoin. This concept transforms these satoshis into one-of-a-kind digital artifacts akin to non-fungible tokens (NFTs) on other blockchain platforms. Each satoshi can be inscribed with content such as […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-21T05:10:00.000Z",
    "title": "SEC Charges Kraken With Illegal Operations, Accuses of Mixing Customer and Own Funds",
    "url": "https://www.cryptoglobe.com/latest/2023/11/sec-charges-kraken-with-illegal-operations-accuses-of-mixing-customer-and-own-funds/",
    "description": "SEC Charges Kraken for Operating as an Unregistered Securities Exchange, Broker, Dealer, and Clearing Agency On 20 November 2023, the U.S. Securities and Exchange Commission (SEC) announced that it had formally charged Payward Inc. and Payward Ventures Inc., collectively known as Kraken, for operating their cryptocurrency trading platform without proper registration. The SEC’s complaint, filed […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-21T05:37:56.000Z",
    "title": "AI Revolutionizes Elder Care: A New Era of Health Monitoring and Assistance",
    "url": "https://www.cryptopolitan.com/ai-in-elder-care-in-health-monitoring/",
    "description": "The healthcare sector is witnessing a groundbreaking shift with Artificial Intelligence (AI) integration, particularly in elder care. This technological advancement is transforming medical practices and enhancing the quality of life for the elderly, marking a significant milestone in healthcare technology. Transformative healthcare monitoring At the forefront of this revolution is a new AI-based system capable ... <a title=\"AI Revolutionizes Elder Care: A New Era of Health Monitoring and Assistance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-in-elder-care-in-health-monitoring/\" aria-label=\"More on AI Revolutionizes Elder Care: A New Era of Health Monitoring and Assistance\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-21T05:36:16.000Z",
    "title": "Why is Binance’s BNB and Bitcoin up today? Bulls be ready",
    "url": "https://www.cryptopolitan.com/why-is-binances-bnb-and-bitcoin-up-today/",
    "description": "Binance&#8217;s native crypto, BNB, rose 6.55% to $ 262.73 on reports of prospective settlement discussions between Binance Holdings Ltd. and the US Justice Department. This increase in value, which represents a three-month high, shows market optimism as Binance potentially gets closer to addressing long-standing regulatory issues.&#160; BNB hits a 90-day high According to Bloomberg, Binance ... <a title=\"Why is Binance’s BNB and Bitcoin up today? Bulls be ready\" class=\"read-more\" href=\"https://www.cryptopolitan.com/why-is-binances-bnb-and-bitcoin-up-today/\" aria-label=\"More on Why is Binance’s BNB and Bitcoin up today? Bulls be ready\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-21T05:23:46.000Z",
    "title": "Microsoft’s Stock See Mild Gains After Hiring Former OpenAI CEO Sam Altman",
    "url": "https://www.cryptopolitan.com/microsofts-stock-gains-after-hiring-altman/",
    "description": "Sam Altman is set to join Microsoft after he was unexpectedly fired from OpenAI on Friday.&#160; The CEO of Microsoft Satya Nadella confirmed on Monday that Altman will be joining the tech giant, which also owns a 49% stake in OpenAI, to lead a new advanced AI research team. Nadella noted that Greg Brockman and ... <a title=\"Microsoft&#8217;s Stock See Mild Gains After Hiring Former OpenAI CEO Sam Altman\" class=\"read-more\" href=\"https://www.cryptopolitan.com/microsofts-stock-gains-after-hiring-altman/\" aria-label=\"More on Microsoft&#8217;s Stock See Mild Gains After Hiring Former OpenAI CEO Sam Altman\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-21T05:19:01.000Z",
    "title": "OpenAI Leadership Shakeup: A Reflection on Nonprofit Governance Dynamics",
    "url": "https://www.cryptopolitan.com/openai-leadership-shakeup/",
    "description": "In a surprising turn of events, OpenAI&#8217;s board of directors has dismissed CEO Sam Altman, citing concerns about his openness with the board. This move, occurring amidst a period of intense scrutiny and growth for the artificial intelligence leader, marks a significant shift in the governance of one of the tech industry&#8217;s most influential companies. ... <a title=\"OpenAI Leadership Shakeup: A Reflection on Nonprofit Governance Dynamics\" class=\"read-more\" href=\"https://www.cryptopolitan.com/openai-leadership-shakeup/\" aria-label=\"More on OpenAI Leadership Shakeup: A Reflection on Nonprofit Governance Dynamics\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-21T05:12:04.000Z",
    "title": "Emerging Tech Summit – Saudi Arabia",
    "url": "https://www.cryptopolitan.com/emerging-tech-summit-saudi-arabia/",
    "description": "GBB proudly announces the success of the launch of Emerging Tech Summit – Saudi Arabia held on the 8th and 9th of November, 2023 at Voco Riyadh. The event, welcomed over 200, pre-qualified and by invitation only attendees bringing together decision makers, fostering a dynamic exchange of ideas and advancements in the information technology sector.&#160; ... <a title=\"Emerging Tech Summit – Saudi Arabia\" class=\"read-more\" href=\"https://www.cryptopolitan.com/emerging-tech-summit-saudi-arabia/\" aria-label=\"More on Emerging Tech Summit – Saudi Arabia\">Read more</a>"
  }
]