[
  {
    "source": "Decrypt",
    "date": "2023-12-13T01:04:56.000Z",
    "title": "Microsoft Packs Power Into Its New Small AI Model Phi-2",
    "url": "https://decrypt.co/209570/microsoft-phi-2-ai-small-language-model",
    "description": "Size isn’t everything in artificial intelligence language models, as Redmond’s latest release stands up to challengers 25 times its size."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-13T01:00:37.000Z",
    "title": "FTX And IRS Lock Horns Over $24 Billion Tax Bill, FTT’s Key Support Wavers",
    "url": "https://www.newsbtc.com/ftx/ftx-and-irs-lock-horns-over-24-billion-tax-bill-ftts-key-support-wavers/",
    "description": "In a striking turn of events, the Internal Revenue Service (IRS) in the United States has presented a staggering tax bill of $24 billion against the bankrupt cryptocurrency exchange FTX.  FTX Challenges IRS&#8217;s $24 Billion Tax Bill According to court filings and FTX&#8217;s response to the IRS&#8217;s claims, several key arguments challenge the basis of the tax bill. Firstly, FTX highlights that its operations spanned three years, never distributing dividends or earnings.  Secondly, the exchange’s defense attorneys claim that the company incurred substantial losses rather than generating income that could support the IRS&#8217;s “exorbitant” tax claim.  Thirdly, the lawyers argue that FTX is currently in liquidation and is not engaged in any ongoing business activities apart from those required for the liquidation process.  Finally, the company emphasizes that the recovery sought by the IRS would ultimately come at the expense of FTX&#8217;s victims, as the funds would be redirected away from their rightful recipients.  Related Reading: Cardano (ADA) 50% Rally Sets Stage For A Merry Christmas – Details As the court hearing approaches, FTX asserts that proceeding with a court-supervised estimation process would demonstrate the company&#8217;s significant losses during its operational period, rendering the IRS&#8217;s claim “baseless.”  FTX emphasizes that any forced payment would harm the victims of the FTX fraud, many of whom are already grappling with “profound losses.” FTX&#8217;s administrators have managed to recover approximately $7 billion in assets, including $3.4 billion in cryptocurrencies. These figures underscore the complex financial landscape surrounding the IRS&#8217;s claim against FTX. As the courtroom showdown ensues, the case outcome will undoubtedly have significant implications for the future of crypto taxation and the recovery prospects of FTX&#8217;s creditors.  FTT&#8217;s Bullish Trend Holds Strong As the cryptocurrency market experiences a significant correction following a bullish surge led by Bitcoin (BTC), FTX&#8217;s native token, FTT, has seen a decline of over 5% in the past 24 hours, adding to the company&#8217;s legal concerns. After a three-month accumulation phase that kept FTT trading in a range between $0.9 and $1.2 from September to the beginning of November, the token witnessed an impressive surge in the last month, reaching its highest price of the year at $6.042, a level not seen since November 2022. However, the token has retraced to its current price mark of $4.8, with the next support level at $4.45 in case of further downward movement. Related Reading: Helium Token Balloons To 85% For A Yearly High – What Drove The Price Up On a positive note, FTT is trading above key moving averages, including the 200-day and 50-day MA, which provide support and indicate the potential for further upward price action. Furthermore, since the beginning of November, FTT has consistently recorded higher highs and higher lows, forming an uptrend pattern. This trend has been observed three times, with the token experiencing an uptrend, followed by a pullback for a support test, and then a continuation to reach new highs. Assuming this trend continues and the legal developments do not have a significant impact on the price of the token, FTT may be poised for a significant rise in the coming months, given the remarkable uptrend pattern seen on the daily chart. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-13T01:00:18.000Z",
    "title": "Top Trader Predicts Parabolic Rally for Solana Competitor – Here’s His Upside Target",
    "url": "https://dailyhodl.com/2023/12/12/top-trader-predicts-parabolic-rally-for-solana-competitor-heres-his-upside-target/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/rally-for-solana-his.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/rally-for-solana-his.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/12/rally-for-solana-his.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/12/rally-for-solana-his.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/12/rally-for-solana-his.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/rally-for-solana-his.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/12/rally-for-solana-his.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A trader who accurately called Bitcoin&#8217;s (BTC) 2018 bear market price floor thinks that a steep rally is in sight for one Solana (SOL) challenger. Pseudonymous analyst Bluntz tells his 231,700 followers on the social media platform X that the smart contract platform Sui (SUI) looks ripe for rallies after breaking out of its accumulation [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/12/top-trader-predicts-parabolic-rally-for-solana-competitor-heres-his-upside-target/\">Top Trader Predicts Parabolic Rally for Solana Competitor – Here’s His Upside Target</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]