[
  {
    "source": "Decrypt",
    "date": "2024-03-26T00:48:10.000Z",
    "title": "'Notcoin' Game to End Mining on April 1—When Is the NOT Token Airdrop?",
    "url": "https://decrypt.co/223344/notcoin-game-end-mining-april-1-when-not-token-airdrop",
    "description": "Telegram-based game Notcoin is ending its coin-tapping \"mining phase\" in a week. Here's when to expect the NOT token airdrop."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-26T01:00:10.000Z",
    "title": "SWIFT completes second test phase of CBDC with smart contract, atomic settlement capability",
    "url": "https://cryptoslate.com/swift-completes-second-test-phase-of-cbdc-with-smart-contract-atomic-settlement-capability/",
    "description": "<p>SWIFT said on March 25 that it discovered several applications for its central bank digital currency (CBDC) solution following a successful six-month test. The company did not create its own CBDC but instead developed an interlinking solution for existing CBDCs — dubbed the SWIFT connector. The company wrote: &#8220;At the core of our solution is [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/swift-completes-second-test-phase-of-cbdc-with-smart-contract-atomic-settlement-capability/\">SWIFT completes second test phase of CBDC with smart contract, atomic settlement capability</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-26T01:00:45.000Z",
    "title": "Bitcoin and Ethereum ETNs to debut on London Stock Exchange in May",
    "url": "https://cryptobriefing.com/bitcoin-ethereum-etns-debut-london-stock-exchange/",
    "description": "The LSE confirms the debut of Bitcoin and Ethereum Crypto ETNs on 28 May, subject to FCA approval and issuer compliance."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-26T00:50:17.000Z",
    "title": "Detained Binance Executive Escapes Custody in Nigeria, Government to Request Interpol Assistance",
    "url": "https://news.bitcoin.com/detained-binance-executive-escapes-custody-in-nigeria-government-to-request-interpol-assistance/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_680970664-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_680970664-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_680970664-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_680970664-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_680970664-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_680970664-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_680970664-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_680970664.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A senior executive at Binance, who was detained by Nigerian authorities in late February, has since escaped from custody. The executive Nadeem Anjarwalla is believed to have left the country using a Kenyan passport. The Nigerian government confirmed Anjarwalla’s escape and said it would ask Interpol to issue an international arrest warrant. Binance Executive Departs [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-26T00:40:18.000Z",
    "title": "Roger Ver Rejects Blockstream CEO’s Invitation, Remains Loyal to Bitcoin Cash Over BTC",
    "url": "https://news.bitcoin.com/roger-ver-rejects-blockstream-ceos-invitation-remains-loyal-to-bitcoin-cash-over-btc/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/8_news_bytes-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/8_news_bytes-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/8_news_bytes-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/8_news_bytes-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/8_news_bytes-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/8_news_bytes-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/8_news_bytes-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/8_news_bytes.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Roger Ver, an early Bitcoin investor, has decided to continue supporting Bitcoin Cash (BCH) over Bitcoin (BTC) despite an invitation from Blockstream CEO Adam Back to rejoin the Bitcoin community. Ver criticizes layer two blockchain solutions, like Back&#x2019;s Liquid Network, as centralized or unreliable, maintaining that bitcoin cash more closely aligns with the original vision [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-26T01:00:00.000Z",
    "title": "AVAX Soars 9% As Avalanche And Chainlink Announce Partnership For Global Asset Circulation",
    "url": "https://www.newsbtc.com/avalanche/avax-soars-9-as-avalanche-and-chainlink-announce-partnership-for-global-asset-circulation/",
    "description": "According to a recent announcement from blockchain platform Avalanche (AVAX), Australia and New Zealand Banking Group (ANZ) has partnered with Chainlink (LINK) Labs to explore the potential of on-chain digital assets for global movement and settlement.  Using Chainlink&#8217;s Cross-Chain Interoperability Protocol (CCIP), the collaboration aims to connect the Avalanche and Ethereum (ETH) blockchains to enable uninterrupted delivery versus payment (DvP) settlement of tokenized assets across networks in multiple currencies. Tokenized Asset Transaction Across Avalanche And Ethereum Using Chainlink ANZ, a provider of banking products and services to millions of customers in nearly 30 markets, has reportedly taken an unusual approach to exploring the world of on-chain digital assets.  By leveraging Chainlink&#8217;s CCIP, ANZ is validating how customers can access, trade, and settle tokenized assets across multiple networks and currencies using Delivery vs. Payment. This approach aims to improve settlement efficiency and risk management for digital assets that fall under the classification of &#8220;securities&#8221; and their transactions. Related Reading: Social Media Storm Gives Dogecoin 14% Price Boost – Details According to Avalanche, Chainlink&#8217;s CCIP has been &#8220;crucial&#8221; in abstracting the complexities of moving tokenized assets across various blockchains, ensuring “atomic” cross-chain Delivery vs. Payment settlement.  Notably, within the collaboration, ANZ simulated a transaction where a customer used ANZ&#8217;s Digital Asset Services (DAS) portal to purchase tokenized ANZ-issued New Zealand dollar stablecoins (NZ$DC) on Avalanche.  Subsequently, the customer purchased tokenized Australian nature-based assets issued as non-fungible tokens (NFTs), denominated in tokenized ANZ-issued Australian dollar stablecoins (A$DC), on Ethereum.  Furthermore, ANZ facilitated the FX conversion between the two currencies, while CCIP provided the necessary infrastructure to transfer tokens and data between Ethereum and Avalanche. ANZ Harnesses Avalanche&#8217;s Evergreen Subnet Monday&#8217;s announcement also revealed that ANZ used its Avalanche Evergreen Subnet for the project, leveraging its Ethereum Virtual Machine (EVM) compatibility, permissioning, and custom gas token features.  The Evergreen Subnet allowed ANZ to explore new use cases and business models using customizable networks like Avalanche. ANZ&#8217;s collaboration with Chainlink and Avalanche showcases how traditional financial institutions embrace blockchain technology to enhance capital markets.  Ultimately, Avalanche revealed that the initial results of the test transactions were promising, and the initiative could change how the financial services industry approaches tokenized assets.  The next steps include deploying the solution on blockchain mainnets and extending the workflows to include communication between different blockchain networks for different use cases. AVAX Nears 22-Month High  At the time of writing, Avalanche&#8217;s token AVAX has been on a steady uptrend, resulting in a remarkable increase of over 60% in the last 30 days. Currently, the token is trading at $58.31, just below its 22-month high of $65 set on Monday the 18th. Within the last 24 hours, AVAX experienced a 9% increase after the announcement of the collaboration with Chainlink and ANZ Group. This surge allowed the token to break through the $55 resistance level. However, the $60 level is expected to be another obstacle that could lead to a consolidation period between $55 and $60 should the bullish momentum fade. Related Reading: Why Is The Price Of LUNC And USTC Up Today? Further demonstrating the interest in AVAX, the token&#8217;s trading volume in the last 24 hours reached $1,135,122,192, indicating a significant increase of 127.20% compared to the previous day.  Featured image from Shutterstock, chart from TradingView.com"
  }
]