[
  {
    "source": "Cointelegraph",
    "date": "2023-12-09T02:04:35.000Z",
    "title": " Fidelity and SEC meet to discuss spot Bitcoin ETF application ",
    "url": "https://cointelegraph.com/news/fidelity-sec-bitcoin-etf-application",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvZjQzZWRiNWMtZjU4Yi00ZDEzLTk1MmMtMzZiYjg0ZGYxYWYyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The United States SEC and Fidelity assembled to discuss Fidelity's Wise Bitcoin Origin Trust application, investigating operational logistics and functionality of the product.</p>\n                    <p><p>The United States Securities and Exchange Commission (SEC) recently met with Fidelity to seek additional clarity on its spot Bitcoin exchange-traded fund (ETF) application.</p><p>According to a filing published on December 7, two Cboe BZX Exchange <a href=\"https://www.sec.gov/comments/sr-cboebzx-2023-044/srcboebzx2023044-308919-795162.pdf\" target=\"_blank\" rel=\"noopener nofollow\">representatives</a>, along with six from the SEC and nine from Fidelity, discussed the workings of the Wise Origin Bitcoin Trust in the meeting.</p><p>The filing incorporated PowerPoint slides used during the meeting to illustrate the operational framework of the Bitcoin ETF.</p><p><a href=\"https://cointelegraph.com/news/fidelity-sec-bitcoin-etf-application\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2023-12-09T01:51:35.000Z",
    "title": "Optimism Has Spiked To 8-Month High At $2.188 As Kraken Introduces USDT On OP Mainnet",
    "url": "https://nulltx.com/optimism-has-spiked-to-8-month-high-at-2-188-as-kraken-introduces-usdt-on-op-mainnet/",
    "description": "Optimism has experienced a significant surge, reaching an 8-month high at $2.188, following Kraken&#8217;s announcement of Tether $USDT deposits and withdrawals now being available on Optimism through their platform. 👀 Kraken unleashing USDT on OP Mainnet https://t.co/CoJAkzZhRd &#8212; Optimism (✨🔴_🔴✨) (@optimismFND) December 7, 2023 The native governance token for Optimism, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-09T02:00:01.000Z",
    "title": "Chainlink Staking Program Exceeds Expectations, Drives LINK Price Up By 12%",
    "url": "https://www.newsbtc.com/chainlink-news/chainlink-staking-program-exceeds-expectations-drives-link-price-up-by-12/",
    "description": "In a significant development for the blockchain data-oracle project, Chainlink (LINK) has witnessed a significant response to its enhanced crypto-staking program, amassing over $632 million worth of its LINK tokens within a remarkably short period.  The company announced a recent press release highlighting the “overwhelming demand” during the early-access period, which filled the staking limit in just six hours. Chainlink Unveils Staking v0.2 Chainlink, recognized as the industry-standard decentralized computing platform, unveiled Chainlink Staking v0.2, the latest upgrade to the protocol&#8217;s native staking mechanism.  The Early Access phase has commenced, inviting eligible participants to stake up to 15,000 LINK tokens. This phase will last four days before transitioning into the General Access phase, enabling investors to stake up to 15,000 LINK tokens as long as the staking pool remains unfilled.  Per the announcement, the upgrade introduces an expanded pool size of 45,000,000 LINK tokens, equivalent to 8% of the current circulating supply. This enlargement aims to enhance the accessibility of Chainlink Staking, enabling a more diverse audience of LINK token holders to participate.  Related Reading: Bitcoin Has Been In A Class Of Its Own For The Last 10 Years, Top Expert Says Staking forms an integral part of Chainlink Economics 2.0, which brings an additional layer of cryptoeconomic security to the Chainlink Network. Specifically, Chainlink Staking empowers ecosystem participants, including node operators and community members, to support the performance of Oracle services by staking LINK tokens and earning rewards for contributing to network security. While v0.1 served as the initial phase of the Staking program, v0.2 has been restructured into a fully modular, extensible, and upgradable Staking platform. Building upon the lessons learned from the previous release, the v0.2 beta version focuses on several key objectives.  Chainlink is introducing several new features to enhance its staking program. These include a new unbinding mechanism that provides more flexibility for Community and Node Operator Stakers. Additionally, security guarantees for Oracle services are being reinforced by slashing node operator stakes. A modular architecture is being adopted to support future improvements and additions, and a dynamic rewards mechanism is being introduced to seamlessly accommodate new external sources of rewards in the future, such as user fees. Following the conclusion of the Early Access phase on December 11, 2023, the v0.2 staking pool will transition to General Access. At this stage, anyone will have the opportunity to stake up to 15,000 LINK tokens. LINK Surges To New Yearly High Given Chainlink’s successful upgrade, LINK, the native token of the decentralized computing platform, experienced a significant surge of 12%, reaching a price as high as $17.305.  This price level has not been seen since April 2022, signifying a new yearly high for the cryptocurrency. However, LINK has retraced slightly and is currently trading at $16.774. Crypto analyst Ali Martinez has highlighted a critical support zone for Chainlink. Martinez noted that over 17,000 addresses purchased 47 million LINK tokens from $14.4 to $14.8.  This accumulation by many addresses suggests strong buying interest in this price range, potentially acting as a support level for the token. Related Reading: Dogecoin Above $0.1? Crypto Analyst Lists Reasons Why DOGE Price Will Continue To Rally While the support zone may hold and trigger a rebound in the price of LINK, Martinez cautions that investors should remain vigilant. Any signs of weakness, such as a breach of the support zone or negative market sentiment, could prompt investors to sell their LINK holdings to avoid losses. It remains to be seen whether LINK can maintain its position above these critical levels and whether the broader cryptocurrency market will enter an accumulation phase or experience a retracement after the significant upward movement witnessed in recent weeks.  Such a retracement could potentially impact LINK&#8217;s price and lead to a test of the support above levels. On the other hand, the token faces immediate resistance at $17.483, $18.069, and $18.910. These represent the final hurdles to overcome before LINK reaches the $20 milestone. Featured image from Shutterstock, chart from TradingView.com "
  }
]