[
  {
    "source": "Cointelegraph",
    "date": "2023-10-27T20:29:14.000Z",
    "title": "Gemini sues Genesis over GBTC shares used as Earn collateral, now worth $1.6B ",
    "url": "http://cointelegraph.com/news/gemini-sues-genesis-over-gbtc-shares-used-earn-collateral",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/906775e2-6032-4292-9924-649a6a47ed7c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Genesis wants to use the shares’ initial value in claims and is not releasing additional collateral transferred by DCG, the suit claims.</p>\n                    <p><p>Cryptocurrency exchange Gemini filed an adversary proceeding against bankrupt crypto lender Genesis Global Holdco in the Southern District of New York Bankruptcy Court on Oct. 27. At issue is the fate of 62,086,586 shares of Grayscale Bitcoin Trust (GBTC). They were used as collateral to secure loans made by 232,000 Gemini users to Genesis through the Gemini Earn Program. That collateral is currently worth close to $1.6 billion.</p><p>According to the <a href=\"https://restructuring.ra.kroll.com/genesis/Home-DocketInfo\" target=\"_blank\" rel=\"noopener nofollow\">suit</a>, Gemini has received $284.3 million from foreclosing on the collateral for the benefit of Earn users, but Genesis has disputed the action, preventing Gemini from distributing the proceeds.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/98fab3f7-055c-4538-9f67-4d0c08dc2cf7.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>The suit filed Oct. 27 by Gemini. Source: Kroll Inc.</em></figcaption></figure><p>Genesis has also proposed using the initial value of the collateral, which was more than $800 million, to determine the Earn Users’ deficiency claim rather than the foreclosure value. As the foreclosure value was greater than the initial value, Genesis would thus free up hundreds of millions of dollars for distribution to other creditors:</p><blockquote>“But it was Gemini who bore the market risk related to the Initial Collateral for the benefit of Earn Users following the foreclosure; so it follows that only Earn Users are entitled to any gain resulting from Gemini taking on that risk.”</blockquote><p>In addition, the suit alleges that Genesis' parent company, Digital Currency Group (DCG), transferred additional collateral to Genesis “for the sole purpose of immediate onward distribution to Gemini for the benefit of Earn Users,” but Genesis is proposing to use the collateral for other purposes. Gemini argued:</p><blockquote>“A determination giving effect to the terms of the Security Agreement, confirming Gemini’s proper foreclosure on the Initial Collateral, and recognizing the Earn Users’ rights to the Additional Collateral would facilitate the return of more than $1 billion in digital assets that Genesis has wrongfully withheld from Earn Users for nearly a year.” </blockquote><p>Gemini Earn users comprise 99% of Genesis creditors, and their claims represent 28% of all claims by value, according to the suit.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/ftx-settlement-genesis-175-million-approved\">Court approves Genesis settlement of $175M to FTX, expunges billions in claims</a></em></strong></p><p>Genesis <a href=\"https://cointelegraph.com/news/crypto-lender-genesis-files-for-bankruptcy\">filed for bankruptcy in January</a>. It had suspended withdrawals in November 2022, which impacted the Gemini Earn program. Gemini <a href=\"https://cointelegraph.com/news/gemini-files-lawsuit-against-digital-currency-group-barry-silbert-genesis-earn-program\">sued DCG and its CEO Barry Silbert</a> for fraud in connection with the Earn program in July.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today, Gemini filed an Adversary Proceeding against Genesis in Bankruptcy Court seeking to recover $1.6 billion in value for the benefit of Earn Users. For the past 12 months, Genesis has been trying funnel this value away from Earn users to other creditors. With this value,…</p>&mdash; GeminiTrustCo (@GeminiTrustCo) <a href=\"https://twitter.com/GeminiTrustCo/status/1717987953006297127?ref_src=twsrc%5Etfw\">October 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The former partners <a href=\"https://cointelegraph.com/news/gemini-and-genesis-charged-by-sec-over-unregistered-securities\">are defendants in a case brought</a> by the United States Securities and Exchange Commission claiming that Gemini Earn offered unregistered securities. New York Attorney General Letitia James <a href=\"https://cointelegraph.com/news/gemini-genesis-dgc-sued-by-new-york-attorney-general-for-allegedly-defrauding-investors\">sued Gemini, Genesis and DCG</a>, claiming that the Earn program defrauded its users, who included 29,000 New Yorkers. James claimed that Gemini was aware that Genesis was in a risky financial condition. </p><p>Genesis Global Holdco did not respond to Cointelegraph inquiries by publication time. Grayscale is also owned by DCG.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\">Deposit risk: What do crypto exchanges really do with your money?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-27T20:33:39.000Z",
    "title": "Crypto Rand Binance Coin Prediction, Everlodge Price Rises 130%, Litecoin Projected to Dip to $12",
    "url": "https://cryptodaily.co.uk/2023/10/crypto-rand-binance-coin-prediction-everlodge-price-rises-130-litecoin-projected-to-dip-to-12",
    "description": "Top crypto analyst DonAlt has a bearish outlook for the Litecoin (LTC) crypto, indicating that it could soon dip by 80% in value. In addition, another crypto analyst, Crypto Rand, noted how Binance Coin (BNB) is consolidating nicely and has a proper volume increase"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-27T20:36:00.000Z",
    "title": "Bitcoin Miner Files Form S-3 to SEC; Plans To Raise $750 Million",
    "url": "https://coinedition.com/bitcoin-miner-files-form-s-3-to-sec-plans-to-raise-750-million/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/BTC-8-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin Miner Files Form S-3 to SEC\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/BTC-8-1.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/BTC-8-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/BTC-8-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/BTC-8-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/BTC-8-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/BTC-8-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Last week, Bitcoin surged beyond $34,000, marking a 106% increase for the year, following a challenging crypto winter in 2022. Simultaneously, Bitcoin miner Marathon Digital, trading as &#8220;MARA&#8221; on the Nasdaq stock market, experienced an increase in its stock price. According to a Form S-3 filing to the U.S. Securities and Exchange Commission, Marathon Digital [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-miner-files-form-s-3-to-sec-plans-to-raise-750-million/\">Bitcoin Miner Files Form S-3 to SEC; Plans To Raise $750 Million</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]