[
  {
    "source": "Bitcoin.com",
    "date": "2023-10-26T04:00:24.000Z",
    "title": "Ex-FTX Chief’s Defense Team Challenges FBI Interviews, Raises Questions About Witness Credibility",
    "url": "https://news.bitcoin.com/ftx-chiefs-defense-team-challenges-fbi-interviews-questions-witness-credibility/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/ftx55556666-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Ex-FTX Chief’s Defense Team Challenges FBI Interviews, Raises Questions About Witness Credibility\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/ftx55556666-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ftx55556666-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ftx55556666-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ftx55556666-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ftx55556666-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ftx55556666-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ftx55556666.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Wednesday, the defense team for the former FTX CEO Sam Bankman-Fried issued a letter to the judge seeking to question two FBI agents who interviewed Gary Wang, former chief technology officer of FTX, and Nishad Singh, former director of engineering at FTX. Lawyers allege the witnesses provided “inconsistent statements” that don’t match their original [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-26T04:08:52.000Z",
    "title": "A Novel AI Model Carves the Path for Reliable COVID-19 Diagnosis via Smartphone X-rays",
    "url": "https://www.cryptopolitan.com/ai-model-covid-19-diagnosis-smartphone/",
    "description": "In a groundbreaking stride towards refining the efficacy of smartphone-based COVID-19 diagnosis, a recent study published in Scientific Reports delves into the intricacies of AI-aided Diagnosis of X-ray images through messaging Applications (AIDXA). With the ever-increasing reliance on AI models for medical diagnostics, researchers unravel the limitations that have lurked in the shadows, particularly when ... <a title=\"A Novel AI Model Carves the Path for Reliable COVID-19 Diagnosis via Smartphone X-rays\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-model-covid-19-diagnosis-smartphone/\" aria-label=\"More on A Novel AI Model Carves the Path for Reliable COVID-19 Diagnosis via Smartphone X-rays\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-26T04:00:42.000Z",
    "title": "Solana Price Surge: Analysts Predict Target Zones Of $69 – $123 In Coming Months",
    "url": "https://www.newsbtc.com/news/solana/solana-price-surge-analysts-predict-target-zones-of-69-123-in-coming-months/",
    "description": "Solana price (SOL) has recently showcased an impressive performance, setting new records as it regains its bullish momentum.  After experiencing a significant decline since July 14, SOL has emerged as one of the top-performing cryptocurrencies, trailing only behind Pepecoin (PEPE) and Chainlink (LINK) in terms of gains in the past 24 hours.  With sustained upward movement, SOL has surged by 8.9% in the past day, 39% in the past week, a remarkable 51% in the last two weeks, and 68% in just 30 days. Solana Price Potential Unveiled The recent surge in Solana price has caught the attention of crypto enthusiasts and analysts alike. The 8.9% increase in the past 24 hours has propelled SOL to outperform most other cryptocurrencies in the top 100 list.  On this matter, renowned crypto analyst &#8220;Titan of Crypto&#8221; has shed light on the anticipated target zones for Solana in the months ahead.  According to the Titan of Crypto’s in-depth analysis, SOL has the potential to achieve a price range between $69 and $123. These projections reflect the optimistic outlook surrounding Solana&#8217;s future performance and market prospects. Related Reading: Bitcoin ETF Will Send BTC Back To $44,000, Why This Trading Firm Is Betting On This Scenario However, despite recently attaining a new yearly high for 2023 and surpassing its monthly resistance level, Solana&#8217;s price faces several obstacles that could impact the realization of these projections in the upcoming months.  It is important to note that Solana&#8217;s price has reached levels not witnessed since the collapse of the FTX crypto exchange back in November 2022. These factors contribute to the existing resistance that Solana needs to overcome for the anticipated scenario to materialize. SOL&#8217;s Next Resistance Level Presents 9% Upside Potential What is particularly encouraging for Solana bulls is the potential for further growth in the near term, despite the upcoming challenges that may lie ahead for the cryptocurrency&#8217;s price.  Currently, the next significant resistance level stands at $36.86. If the current bullish momentum continues, there is a possibility for another leg-up of approximately 9% once this resistance is breached. Related Reading: Will Ethereum Rally Continue? These Could Be The Factors To Watch Should Solana successfully surpass this hurdle, the subsequent obstacles for SOL are positioned at $37, $39, $43, and $46 in the months to come. However, for the token to solidify the breakout of its monthly resistance and sustain the upward trend, it is crucial to achieve a monthly close above the $32 mark. This emphasis on a monthly close above $32 serves as a key metric to confirm the bullish momentum and support the ongoing upward trajectory of Solana. Market participants will be closely monitoring these developments to assess the token&#8217;s ability to maintain its positive momentum and overcome potential challenges in the future. According to CoinGecko data, the current Solana price stands at $33.00. The trading volume for the past 24 hours amounts to $1,668,696,328.50. With a total supply of 420 million SOL tokens, Solana&#8217;s market capitalization is valued at $13,631,609,298.  Featured image from Shutterstock, chart from TradingView.com"
  }
]