[
  {
    "source": "Decrypt",
    "date": "2023-12-05T21:56:34.000Z",
    "title": "Send a Selfie to See Porn? UK Ponders Ways to Age-Gate Adult Sites",
    "url": "https://decrypt.co/208719/uk-ofcom-age-gate-porn-ai-selfie-evaluation",
    "description": "A European telecom regulator floats using AI to analyze selfies of web surfers to determine if they’re old enough to see stuff."
  },
  {
    "source": "Decrypt",
    "date": "2023-12-05T21:56:16.000Z",
    "title": "SEC Is Talking to Bitcoin ETF Contenders—Here’s What It's Likely Saying",
    "url": "https://decrypt.co/208717/sec-talking-bitcoin-etf-contenders-what-its-saying",
    "description": "What has the SEC been saying in discussions with Bitcoin ETF applicants? Recent changes in amended filings provide a few clues."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-05T21:58:53.000Z",
    "title": " Bitcoin price hit 2023 high, so why are retail traders waiting on the sidelines? ",
    "url": "https://cointelegraph.com/news/bitcoin-price-hit-2023-high-why-are-retail-traders-on-sidelines",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMzhhOTQ0NjktOTlmYS00NGY2LWI5ODItMTBlMzg5MWJmZTg4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin price keeps going up but retail traders are not piling in yet. Cointelegraph explores why. </p>\n                    <p><p >The total market capitalization of the cryptocurrency market surged past $1.55 trillion on Dec. 5, driven by remarkable weekly gains of 14.5% for Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and 11% for Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>). </p><p >Despite the recent bullish momentum, analysts have observed that retail demand remains relatively stagnant. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Retail investors aren&#39;t paying attention to <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcoin</a>.<br><br>They are more worried about whether or not they will be able to pay rent or put food on the table.<br><br>They will likely start paying attention near the next top (IMO sometime in 2025) and they will FOMO into a position before…</p>&mdash; Rajat Soni, CFA (@rajatsonifnance) <a href=\"https://twitter.com/rajatsonifnance/status/1730961151234576680?ref_src=twsrc%5Etfw\">December 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p >Numerous U.S. However, Ed Yardeni, an analyst, <a href=\"https://www.linkedin.com/pulse/did-santa-claus-come-early-year-wade-slome-cfa-cfp--ypptc/\" target=\"_blank\" rel=\"noopener nofollow\">suggests</a> that the \"Santa Claus rally\" might have already occurred earlier this year, with the S&amp;P 500 gaining 8.9% in November. </p><p >This rise reflected diminishing inflationary pressures and robust employment data. </p><h2 >Did retail traders miss Bitcoin and Ether’s recent gains?</h2><p >With no dependable indicator to track retail participation in cryptocurrencies, a comprehensive data set is necessary for making conclusions, beyond relying solely on Google Trends and crypto-related app download rankings. </p><p >The premium of USD Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) in China serves as a valuable gauge of retail demand in the crypto market. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-price-hit-2023-high-why-are-retail-traders-on-sidelines\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-05T21:45:58.000Z",
    "title": " Elon Musk’s xAI files with SEC for private sale of $1B in unregistered securities ",
    "url": "https://cointelegraph.com/news/elon-musk-xai-files-sec-form-d-private-sale-unregistered-securities",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvODM0YTZhN2MtNGQ0My00NWM3LTg3NjQtNTRjNGE4ODZmM2M2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>\"Spicy\" AI chatbot Grok hasn’t been seen by the public yet, but it’ll be worth plenty after this securities issue.</p>\n                    <p><p>Elon Musk’s X-linked AI modeler xAI has an agreement for the private sale of $865.3 million in unregistered equity securities, according to a filing with the United States Securities and Exchange Commission (SEC) made on Dec. </p><p>xAI filed the SEC’s Form D to allow it to engage in the private sale of securities without registration. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-12/6abf534d-697f-45c0-9a92-bec42eaca0a8.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Access to Grok is currently severely limited. Source: x.ai</em></figcaption></figure><p>The xAI Form D further clarifies that the securities will be sold to accredited investors with restrictions on their resale under Rule 506(b). </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/elon-musk-ai-memecoin-grok-falls-creator-scam-claim\" >Elon Musk AI project-inspired memecoin ‘Grok’ falls 74% on creator scam claim</a></em></strong></p><p>XAI’s product, a chatbot called Grok, has not yet made its public debut, although there is a waitlist to use the prototype. </p><blockquote>“A unique and fundamental advantage of Grok is that it has real-time knowledge of the world via the X [formerly Twitter] platform. It will also answer spicy questions that are rejected by most other AI systems.”</blockquote><p>Musk <a href=\"https://cointelegraph.com/news/elon-musk-kickstarts-new-ai-company-to-understand-the-universe\" >announced the launch of xAI</a> in July and claimed its goal was to “understand the universe.” He claimed Grok would perform better than ChatGPT and in November <a href=\"https://cointelegraph.com/news/elon-slings-ai-artificial-intelligence-generated-insults-gpt-4-open-ai-sam-altman-ceo-mocks-grok\" >got into an online squabble</a> over it with ChatGPT co-founder and CEO at the time Sam Altman. </p><p><a href=\"https://cointelegraph.com/news/elon-musk-xai-files-sec-form-d-private-sale-unregistered-securities\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-05T21:45:07.000Z",
    "title": "SEC extends comment period on Grayscale spot Ethereum ETF into 2024",
    "url": "https://cryptoslate.com/sec-extends-comment-period-on-grayscale-spot-ethereum-etf-into-2024/",
    "description": "<p>The Securities and Exchange Commission (SEC) has extended the 45-day comment period on a proposed rule change that would allow NYSE Arca to list and trade shares of the Grayscale Ethereum Trust as an exchange-traded fund (ETF), according to an SEC filing released on Dec. 5th. NYSE Arca originally submitted the proposed rule change to [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/sec-extends-comment-period-on-grayscale-spot-ethereum-etf-into-2024/\">SEC extends comment period on Grayscale spot Ethereum ETF into 2024</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-05T22:00:33.000Z",
    "title": "Brazil’s Banking Behemoth Itau Unibanco Debuts Cryptocurrency Trading Services",
    "url": "https://news.bitcoin.com/brazils-banking-behemoth-itau-unibanco-debuts-cryptocurrency-trading-services/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/e67a8e24-6d8c-4e67-b59f-44e3c3b9843a-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Brazil&#039;s Banking Behemoth Itau Unibanco Debuts Cryptocurrency Trading Services\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/e67a8e24-6d8c-4e67-b59f-44e3c3b9843a-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/e67a8e24-6d8c-4e67-b59f-44e3c3b9843a-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/e67a8e24-6d8c-4e67-b59f-44e3c3b9843a-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/e67a8e24-6d8c-4e67-b59f-44e3c3b9843a-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/e67a8e24-6d8c-4e67-b59f-44e3c3b9843a-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/e67a8e24-6d8c-4e67-b59f-44e3c3b9843a-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/e67a8e24-6d8c-4e67-b59f-44e3c3b9843a.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Itau Unibanco, the largest private bank in Brazil, has launched cryptocurrency trading services for its customers. Through Ion, its financial services platform, Itau will first offer access to two cryptocurrencies, ether and bitcoin, opening this feature gradually to all users. Itau Unibanco Opens Crypto Trading Services in Brazil Itau Unibanco, one of the largest banking [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-05T21:58:38.000Z",
    "title": "SEC postpones decision on Grayscale’s Ethereum Trust ETF conversion",
    "url": "https://www.cryptopolitan.com/sec-postpones-decision-grayscales-eth-trust-etf-conversion/",
    "description": "The U.S. Securities and Exchange Commission (SEC) has extended the decision-making period for Grayscale Investments&#8217; application to convert its Ethereum Trust into a spot exchange-traded fund (ETF) by 45 days to January 25, according to a Tuesday filing. This move by the SEC has injected a new wave of anticipation and speculation in the world ... <a title=\"SEC postpones decision on Grayscale&#8217;s Ethereum Trust ETF conversion\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-postpones-decision-grayscales-eth-trust-etf-conversion/\" aria-label=\"More on SEC postpones decision on Grayscale&#8217;s Ethereum Trust ETF conversion\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-05T21:53:27.000Z",
    "title": "Are Binance and France the newest couple in Crypto Town?",
    "url": "https://www.cryptopolitan.com/binance-france-newest-couple-crypto-town/",
    "description": "Cryptocurrency&#8217;s rapid ascension to the financial mainstage has seen various nations either embracing or cautiously side-eyeing the revolutionary industry. Among these, France stands out with its relationship dealings with Binance, the colossal crypto exchange. This liaison sparks questions about regulation, innovation, and the future of digital finance in Europe&#8217;s heartland, as well as my favorite; ... <a title=\"Are Binance and France the newest couple in Crypto Town?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-france-newest-couple-crypto-town/\" aria-label=\"More on Are Binance and France the newest couple in Crypto Town?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-12-05T21:54:35.000Z",
    "title": "Shiba Inu’s Burn Rate Surges Exponentially, Exceeding 7,686,774% In A Single Day",
    "url": "https://nulltx.com/shiba-inus-burn-rate-surges-exponentially-exceeding-7686774-in-a-single-day/",
    "description": "In the last 24 hours, Shiba Inu, the widely popular meme coin, witnessed a remarkable increase in its burn rate, with 8,241,856,589 SHIB tokens incinerated in a single transaction. The total Shiba Inu tokens burnt in this period reached 8,349,329,301, marking an astounding surge of over 7,686,774%. 🚨JUST IN: #ShibaInu&#39;s [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-05T21:54:10.000Z",
    "title": "Coinbase allows wallet users to send crypto via social media apps",
    "url": "https://crypto.news/coinbase-allows-wallet-users-to-send-crypto-via-social-media-apps/",
    "description": "Coinbase CEO Brian Armstrong’s crypto exchange is moving to simplify digital asset transactions and expand availability to several regions with three new features for Coinbase Wallet users."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-05T21:47:03.000Z",
    "title": "IBM unveils new crypto cold storage technology",
    "url": "https://crypto.news/ibm-unveils-new-crypto-cold-storage-technology/",
    "description": "IBM has announced a new crypto cold storage technology called the IBM Hyper Protect Offline Signing Orchestrator (OSO)."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-05T21:43:01.000Z",
    "title": "SEC seeks judicial ruling on crypto asset classification in Terraform Labs case",
    "url": "https://crypto.news/sec-seeks-judicial-ruling-on-crypto-asset-classification-in-terraform-labs-case/",
    "description": "The U.S. Securities and Exchange Commission (SEC) has requested a judge, rather than a jury, to determine whether certain cryptocurrencies involved in the Terraform Labs case are classified as securities."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-05T22:00:47.000Z",
    "title": "Solana’s BONK Climbs To 3rd Place In Dog Coin Market Cap, Leaving FLOKI Behind",
    "url": "https://www.newsbtc.com/news/solanas-bonk-climbs-to-3rd-place-in-dog-coin-market-cap-leaving-floki-behind/",
    "description": "In recent weeks, the Solana (SOL) blockchain has been making waves in the crypto world, with its native token SOL experiencing a remarkable uptrend of 46% over the past 30 days. Alongside this surge, Bonk Inu (BONK), the first Solana-based meme coin, has gained significant traction, solidifying its position as the third-largest dog coin by market capitalization, surpassing Floki Inu (FLOKI). BONK Rockets To New Heights With 845% Surge In 30 Days The staggering growth of Bonk Inu is evident in its recent performance, achieving an impressive 845% gain over the past 30 days. The meme coin&#8217;s remarkable ascent has propelled it to new yearly highs, while SOL experienced a slight pullback from its peak of $65 on December 2. Despite the temporary setback for SOL, the bullish momentum and renewed interest in Bonk Inu have caught the attention of market participants.  As of now, BONK is trading at $0.0000069712, outperforming the broader crypto market with a remarkable 22.4% uptrend in the past 24 hours, aligning with the positive sentiment surrounding Bitcoin (BTC) and the overall market. With a market capitalization of approximately $430 million, Bonk Inu currently sits in third place among dog coins, trailing behind the likes of Shiba Inu (SHIB) and Dogecoin (DOGE), which boast market caps of $5 billion and $12 billion, respectively. Related Reading: Warning Signals Flash As Bitcoin Surges: Expert Spotlights Potential $25,000 Liquidity Sweep CoinGecko data reveals that BONK has witnessed a significant 24-hour trading volume of $65,235,205.16, indicating strong investor interest and active participation in the market. The future trajectory of Bonk Inu&#8217;s uptrend and its potential for further gains remains uncertain. However, should BONK continue to attract investors, it has the potential to dethrone Pepecoin (PEPE) in terms of market capitalization. As of the latest update, PEPE has achieved a market cap of $592 million. However, it is important to note that Bonk Inu still has a significant gap to bridge to catch up with the largest dog coins in the market in terms of market capitalization, namely SHIB and DOGE. SHIB and DOGE have demonstrated substantial gains and already possess staggering market capitalizations. Dog Coins Make Strong Push For Year-End Gains The altcoin SHIB, built on the Ethereum platform and known for its Shiba Inu mascot, continues to demonstrate consistent gains across various time frames.  Notably, SHIB has seen a 14% increase over the past fourteen days and an 18% surge over the past thirty days. These positive trends have allowed the dog coin to achieve a slight year-to-date profit of 0.2% after experiencing a significant downturn in 2022. Presently, SHIB is trading at $0.00000946, representing a decline of more than 89% from its all-time high (ATH) of $0.00008616, reached in October 2021. Related Reading: Shiba Inu Burn Rate Surges With Over 8 Billion SHIB Burned, Here’s The Trigger Meanwhile, the meme coin DOGE, which has the backing of Elon Musk, is currently trading at $0.09058. It has witnessed an 18% rise over the past fourteen days and nearly 30% growth over the past thirty days, following a sustained upward trend that began on November 21.  However, in contrast to SHIB&#8217;s price action, DOGE has experienced a 12% decline year-to-date and an 87% drop from its ATH of $0.731578 reached in May 2021. It remains to be seen whether the dog coins will continue to experience further gains throughout the remainder of the year or if a healthy pullback will occur to surpass upper resistance levels for another upward movement. Featured image from Shutterstock, chart from TradingView.com "
  }
]