[
  {
    "source": "CoinDesk",
    "date": "2023-11-28T09:16:49.000Z",
    "title": "U.S. Treatment of CZ, Binance Is 'Absurd:' Arthur Hayes",
    "url": "https://www.coindesk.com/policy/2023/11/28/us-treatment-of-cz-binance-is-absurd-arthur-hayes/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The former BitMEX CEO said the record-breaking penalties against Binance represent an institutional bias against the transformative impact of cryptocurrency and blockchain technology."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-28T09:16:19.000Z",
    "title": "Amnesty International head says AI innovation vs regulation is 'false dichotomy'",
    "url": "http://cointelegraph.com/news/amnesty-international-head-ai-innovation-vs-regulation-false-dichotomy",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/446651e1-b552-4773-8f15-d21c4b09e9f6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Amnesty's secretary-general said the EU has a chance to lead with new AI regulations and member states shouldn’t “undermine” the forthcoming AI Act.  </p>\n                    <p><p>The Secretary-General of Amnesty International, Anges Callamard, released a <a href=\"https://www.amnesty.org/en/latest/news/2023/11/eu-france-germany-and-italy-risk-unravelling-landmark-ai-act-negotiations/\" target=\"_blank\" rel=\"noopener nofollow\">statement</a> on Nov. 27 in response to three European Union member states pushing back on regulating artificial intelligence (AI) models. </p><p>France, Germany and Italy reached an <a href=\"https://www.reuters.com/technology/germany-france-italy-reach-agreement-future-ai-regulation-2023-11-18/\" target=\"_blank\" rel=\"noopener nofollow\">agreement</a> that included not adopting such stringent regulations of foundation models AI, which is a core component of the EU’s <a href=\"https://cointelegraph.com/news/european-union-ai-act-passes-in-parliament\">forthcoming EU AI Act</a>. </p><p>This came after the EU received <a href=\"https://cointelegraph.com/news/eu-tech-coalition-warns-of-over-regulating-ai-prior-to-eu-ai-act-finalization\">multiple petitions from tech industry players</a> asking the regulators not to over-regulate the nascent industry. </p><p>However, Callamard said the region has an opportunity to show “international leadership” with robust regulation of AI and member states “must not undermine the AI Act by bowing to the tech industry’s claims that adoption of the AI Act will lead to heavy-handed regulation that would curb innovation.”</p><blockquote>“Let us not forget that ‘innovation versus regulation’ is a false dichotomy that has for years been peddled by tech companies to evade meaningful accountability and binding regulation.”</blockquote><p>She said this rhetoric from the tech industry highlights the “concentration of power” from a small group of tech companies who want to be in charge of the “AI rulebook.” </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/us-surveillance-facial-recognition-firm-clearview-ai-wins-gdpr-appeal-uk-court\"><strong><em>US surveillance and facial recognition firm Clearview AI wins GDPR appeal in UK court</em></strong></a></p><p>Amnesty International has been a member of a coalition of civil society organizations led by the European Digital Rights Network (EDRi) advocating for EU AI laws with human rights protections at the forefront.</p><p>Callamard said human rights abuse by AI is “well documented” and “states are using unregulated AI systems to assess welfare claims, monitor public spaces, or determine someone’s likelihood of committing a crime.”</p><blockquote>“It is imperative that France, Germany and Italy stop delaying the negotiations process and that EU lawmakers focus on making sure crucial human rights protections are coded in law before the end of the current EU mandate in 2024.” </blockquote><p>Recently, France, Germany and Italy were also part of <a href=\"https://cointelegraph.com/news/us-britain-countries-ink-ai-cybersecurity-guidelines-secure-by-design\">a new set of guidelines</a> developed by 15 countries and major tech companies, including OpenAI and Anthropic, which suggest cybersecurity practices for AI developers when designing, developing, launching and monitoring AI models.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-better-results-being-nice-to-chatgpt-ai-fake-child-porn-debate-amazons-ai-reviews/\"><strong><em>AI Eye: Get better results being nice to ChatGPT, AI fake child porn debate, Amazon’s AI reviews</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-28T09:12:00.000Z",
    "title": "What are sniper bots, and how to stop token sniping exploits?",
    "url": "http://cointelegraph.com/explained/what-are-sniper-bots-and-how-to-stop-token-sniping-exploits",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/ee40afd5100352a5168d8e1e34aabd1c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sniper bots are automated tools executing precise actions at specific moments in cryptocurrency and online activities, aiming for strategic advantage.</p>\n                    <p><div data-ct-widget=\"explained-block\" id=\"explained-block-120529-5\">            <h2 data-ct-widget=\"explained-block-title\">                What is a sniper bot?            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Sniper bots are automated software programmed for specific actions at predetermined times to find applications in online auctions, sales and crypto trading, ensuring precise market transactions.</em></p><p>In the context of online activities, an automated software or script programmed to carry out particular acts at predetermined times is called a sniper bot. A sniper bot is frequently used in the world of online sales and auctions to make purchases or submit bids in the closing seconds of a sale or auction with the goal of outbidding rivals. These bots are designed to operate in a split second before an auction ends to secure an item before others can react.</p><p>In the context of <a href=\"https://cointelegraph.com/learn/how-to-trade-cryptocurrencies-the-ultimate-beginners-guide\">cryptocurrency trading</a>, a sniper bot is an automated instrument that is developed to make transactions quickly in response to predetermined market conditions. The key <a href=\"https://cointelegraph.com/news/1-million-rock-nft-sells-for-a-penny-in-all-ore-nothing-error\">features of sniper bots</a> in the cryptocurrency sphere include precision in trade execution, which is determined by predetermined parameters to ensure favorable market entrance and exit positions.</p><p>They operate automatic traders and use pre-programmed algorithms to function, which could incorporate technical indicators, <a href=\"https://cointelegraph.com/explained/arbitrage-trading-in-crypto-explained\">arbitrage methods</a>, scalping tactics and precise <a href=\"https://cointelegraph.com/explained/long-and-short-positions-explained\">entry and exit points</a>. Their main objective is to profit from market swings by making quick decisions to purchase low and sell high, or vice versa.</p><p>However, the effectiveness of these bots depends on programming quality and market volatility. While they aim to reduce emotional bias in trading decisions, they’re not risk-free, as platforms may impose usage restrictions.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-120529-4\">            <h2 data-ct-widget=\"explained-block-title\">                How does a sniper bot work?            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Sniper bots are programmed with criteria; the bots monitor market data and execute trades swiftly, using algorithms to profit from favorable price movements like scalping or arbitrage.</em></p><p>To begin with, the user programs a sniper bot with particular characteristics and standards, like target prices or technical indicators. Then, the bot keeps an eye on real-time market data, searching for correlations between the parameters it has set and the state of the market at the time. The bot quickly completes transactions after locating a match, trying to enter or exit at the optimal time.</p><p>Buying or selling orders might be placed in milliseconds or less to take advantage of favorable price fluctuations. These bots frequently use complex algorithms to make quick, well-informed decisions without emotion.</p><p>For instance, sniper bots usually utilize lightning-fast scalping, swiftly entering and exiting trades within moments for small profit margins. Additionally, they engage in exchange-to-exchange arbitrage, exploiting price disparities across platforms for profit. </p><p>Nonetheless, their success depends on quick execution, underlying algorithms’ accuracy and favorable cryptocurrency markets, where earnings can be greatly impacted by speed and accuracy.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-120529-3\">            <h2 data-ct-widget=\"explained-block-title\">                Types of sniper bots            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Different types cater to distinct strategies, including entry/exit, scalping, arbitrage, technical indicator-based and artificial intelligence (AI)-powered bots.</em></p><p>In cryptocurrency trading, sniper bots come in various types, each designed for specific trading strategies:</p><h3>Entry/exit bots</h3><p>Bots that execute trades based on predetermined entry and exit points to achieve optimal buy and sell positions are known as entry/exit bots.</p><h3>Scalping bots</h3><p>These bots focus on quick trading, placing many small bets to profit from sudden price changes.</p><h3>Arbitrage bots</h3><p>Arbitrage bots take advantage of variations in pricing for the same coin on several exchanges by purchasing it at a discount on one and selling it at a premium on another.</p><h3>Technical indicator bots</h3><p>These automated trading bots use <a href=\"https://cointelegraph.com/learn/crypto-charts-101-how-to-read-cryptocurrency-charts\">technical indicators</a> such as <a href=\"https://cointelegraph.com/news/3-ways-traders-use-moving-averages-to-read-market-momentum\">moving averages</a>, <a href=\"https://cointelegraph.com/news/here-s-3-ways-the-relative-strength-index-rsi-can-be-used-as-a-sell-signal\">relative strength index</a> and <a href=\"https://cointelegraph.com/news/bollinger-bands-how-to-use-in-crypto-trading\">Bollinger Bands</a> to initiate trades in response to changes in the market.</p><h3>AI-powered bots</h3>These bots adjust and improve trading tactics in response to changing market data by utilizing <a href=\"https://cointelegraph.com/news/blockchain-ai-chatbots-developers\">machine learning and AI algorithms</a>.            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-120529-2\">            <h2 data-ct-widget=\"explained-block-title\">                Token sniping scams in crypto            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Rug pulls, pump-and-dump schemes, flash loan attacks and presale scams represent common exploitative practices causing financial harm to investors in the crypto space.</em></p><p>Token sniping exploit refers to fraudulent practices in the cryptocurrency space aimed at deceiving investors and causing financial harm. The <a href=\"https://cointelegraph.com/explained/crypto-rug-pulls-what-is-a-rug-pull-in-crypto-and-6-ways-to-spot-it\">rug pull, known as an exit scam</a>, is one of the most damaging and prevalent frauds in the cryptocurrency industry. In this scheme, developers launch tokens for projects that appear legitimate, enticing investors. However, they suddenly withdraw liquidity or sell off their tokens, causing the value to plummet and leaving investors with worthless holdings.</p><p><a href=\"https://cointelegraph.com/news/what-are-crypto-pump-and-dump-groups-are-they-legal\">Pump-and-dump schemes</a>, which are frequently observed in smaller, less well-known coins, <a href=\"https://cointelegraph.com/news/how-to-identify-and-avoid-a-crypto-pump-and-dump-scheme\">artificially raise prices</a> through concerted attempts within online groups and are often related to token-sniping exploits. These strategies cause quick losses by enticing unsuspecting investors into purchasing at exorbitant rates before the planned sell-off. They highlight the risks of believing hype without doing enough research and exercising prudence in the volatile cryptocurrency market.</p><p>Another example is a flash loan attack, in which attackers use <a href=\"https://cointelegraph.com/explained/what-are-flash-loans-in-defi\">flash loans</a> to exploit security holes in <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> protocols to control pricing, squander liquidity or take advantage of arbitrage opportunities.</p>There have also been <a href=\"https://cointelegraph.com/news/did-you-fall-for-it-13-ico-scams-that-fooled-thousands\">presale or initial coin offering scams</a>, in which dishonest projects promise investors exclusive access to presale tokens, then disappear after raising money, leaving investors with no tokens and no value.            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-120529-1\">            <h2 data-ct-widget=\"explained-block-title\">                Are sniper bots legal?            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>The legality of sniper bots in the context of online activities or cryptocurrency trading varies and frequently depends on the intended usage and terms of service of the platform. </em></p><p>Automated tools themselves are generally not unlawful, but using them may be against platform policies or local laws. Certain platforms allow automatic trading under certain guidelines, but others outright forbid using bots because they are worried about unfair advantages or market manipulation. </p><p>Sniper bot legality in crypto trading also intersects with broader financial regulations. Financial rules and regulations may be violated by using bots for market manipulation, insider trading or misleading tactics, which could have legal ramifications. It is, therefore, essential to comprehend and abide by the regulatory guidelines of the platform under consideration. </p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-120529-0\">            <h2 data-ct-widget=\"explained-block-title\">                How to detect and protect against sniper bots            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Monitoring market behavior, analyzing trade volumes and timing, and adapting trading approaches are various strategies to detect and safeguard against sniper bots, among other tactics.</em></p><p>For both <a href=\"https://cointelegraph.com/explained/crypto-trading-vs-crypto-investing-key-differences-explained\">traders and investors</a>, identifying and protecting against sniper bots in the cryptocurrency space continues to be complicated. A key strategy for maintaining vigilance is to closely observe market behavior. </p><p>This entails keeping an eye on abrupt and erratic pricing or trading patterns changes, particularly on frequent, large-volume transactions that are completed quickly. Extra attention is required because unusual price surges or regular patterns right before trade executions may be signs of automated bot activity.</p><p>Furthermore, examining trade volumes and their timing can provide information about possible bot activity. An abrupt and noticeable increase in <a href=\"https://cointelegraph.com/learn/on-chain-volume-vs-trading-volume-differences-explained\">trade volume</a> combined with exact timing could indicate the existence of automated bots. </p><p>Platforms with robust anti-bot mechanisms can offer another line of defense and protect against these attacks. To reduce the possibility of bot involvement, traders may also modify their strategy by putting strategic limit orders in place or refraining from trading during high-frequency, volatile market activity.</p><p>Interacting with the cryptocurrency community might be helpful because it can reveal suspicious bot activity through other traders’ insights and experiences. While there is no infallible way to altogether remove the possibility of manipulation connected to bots, being vigilant, conducting research and implementing strategic steps can significantly minimize exposure to possible risks.</p>            </p>        </div>    </p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-28T09:26:19.000Z",
    "title": "Vivek Ramaswamy says his crypto policy will ‘ensure economic freedom for Americans’",
    "url": "https://cryptoslate.com/vivek-ramaswamy-says-his-crypto-policy-will-ensure-economic-freedom-for-americans/",
    "description": "<p>U.S. Republican Presidential candidate Vivek Ramaswamy said his crypto policy guarantees a &#8220;vibrant future&#8221; for the emerging industry &#8220;to ensure economic freedom for Americans seeking an alternative to centralized finance,&#8221; according to a Nov. 27 post on social media platform X (formerly Twitter). Ramaswamy explained that U.S. taxpayers&#8217; funds were used to bail out traditional [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/vivek-ramaswamy-says-his-crypto-policy-will-ensure-economic-freedom-for-americans/\">Vivek Ramaswamy says his crypto policy will &#8216;ensure economic freedom for Americans&#8217;</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-28T09:23:48.000Z",
    "title": "Coinbase’s power play in Bitcoin ETFs – Is it game over for others?",
    "url": "https://www.cryptopolitan.com/coinbases-power-play-in-bitcoin-etfs/",
    "description": "Coinbase has evolved as a competitive player in the ever-changing cryptocurrency scene, always pushing the frontiers of innovation and altering the industry. One of Coinbase&#8217;s most recent power plays has sent shockwaves through the financial world: its entry into Bitcoin Exchange-Traded Funds (ETFs).&#160; As the cryptocurrency market evolves and regulatory frameworks evolve, the eagerly awaited ... <a title=\"Coinbase&#8217;s power play in Bitcoin ETFs &#8211; Is it game over for others?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbases-power-play-in-bitcoin-etfs/\" aria-label=\"More on Coinbase&#8217;s power play in Bitcoin ETFs &#8211; Is it game over for others?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-28T09:24:18.000Z",
    "title": "Oggy Inu up 40% as PEPE’s alternative, Nugget Rush, raises $600k in presale",
    "url": "https://crypto.news/oggy-inu-up-40-as-pepes-alternative-nugget-rush-raises-600k-in-presale/",
    "description": "Oggy Inu (OGGY) rose 40% in 24 hours. Nugget Rush (NUGX), an alternative to Pepe (PEPE), has also garnered attention by raising $600,000 in the ongoing presale"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-28T09:16:32.000Z",
    "title": "CTXC surges 25%, becomes top USDT trading pair on Binance",
    "url": "https://crypto.news/ctxc-surges-25-becomes-top-usdt-trading-pair-on-binance/",
    "description": "The native token of the Cortex blockchain, CTXC, gained bullish momentum as the asset became the top trading pair with USDT on the largest crypto exchange, Binance.&#160; CTXC is up by 25% in the past 24 hours and is trading&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-28T09:12:17.000Z",
    "title": "Code4arena X account compromised, used for Paradigm endorsed phishing scam",
    "url": "https://crypto.news/code4arena-x-account-compromised-used-for-paradigm-endorsed-phishing-scam/",
    "description": "A smart contract security marketplace Code4arena appears to be the latest victim of a SIM swap attack on X. An X account for Code4arena, a smart contract auditing platform, was compromised allowing a hacker to publish a scam post luring&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-28T09:24:19.000Z",
    "title": "Dogecoin’s Surge in Transactions Linked to Memecoin Experiment",
    "url": "https://www.crypto-news-flash.com/dogecoins-surge-in-transactions-linked-to-memecoin-experiment/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoins-surge-in-transactions-linked-to-memecoin-experiment",
    "description": "<img width=\"1200\" height=\"700\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Dogecoin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Data from Whale Alert indicates that an extremely old dogecoin address has suddenly shown signs of activity within the last 24 hours.\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Dogecoin.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Dogecoin-300x175.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Dogecoin-1024x597.jpg 1024w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />The founder of Dogecoin connects recent Doginals experiments to the increase in on-chain transaction volume.  DOGE continues to fight off bearish pressure as losses continue to outweigh gains despite the recent altcoin rallies.  Dogecoin has seen a surge in transaction volume over the last 3 months. According to the founder of Dogecoin, the upsurge in [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-28T09:14:38.000Z",
    "title": "USDC Takes Japan by Storm: Circle and Ripple (XRP) Partner SBI Holdings Join Forces for Web3 Revolution",
    "url": "https://www.crypto-news-flash.com/usdc-takes-japan-by-storm-circle-and-ripple-xrp-partner-sbi-holdings-join-forces-for-web3-revolution/?utm_source=rss&utm_medium=rss&utm_campaign=usdc-takes-japan-by-storm-circle-and-ripple-xrp-partner-sbi-holdings-join-forces-for-web3-revolution",
    "description": "<img width=\"1306\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/USDC_1666017094KC9UrWxcFL.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/USDC_1666017094KC9UrWxcFL.png 1306w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/USDC_1666017094KC9UrWxcFL-300x165.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/USDC_1666017094KC9UrWxcFL-1024x565.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/USDC_1666017094KC9UrWxcFL-768x423.png 768w\" sizes=\"(max-width: 1306px) 100vw, 1306px\" />The strategic partnership between Circle USDC and SBI Japan will significantly enhance Web3 development and adoption in Japan amid the ongoing crypto regulatory implementation. SBI Holdings is a major XRP holder thus making the partnership with Circle a huge deal for the longevity of Ripple as a cross-border blockchain company. In preparation for the mainstream [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-28T09:12:08.000Z",
    "title": "Frogscroll Airdrop Claim! How You Are Using Memecoins to Farm.",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/frogscroll-airdrop-claim-how-you-are-using-memecoins-to-farm/",
    "description": "<p>Anybody who has done our Scroll Tasks will be eligible for this little meme coin Airdrop. If you haven&#8217;t, you can subscribe to Altcoin Buzz Alpha and not miss another opportunity like this. Users can Now Claim Frog Tokens on Scroll Chain Currently, Users Who Bridge to $SCROLL can claim a total of 700,000,000 FROG [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/frogscroll-airdrop-claim-how-you-are-using-memecoins-to-farm/\">Frogscroll Airdrop Claim! How You Are Using Memecoins to Farm.</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]