[
  {
    "source": "Cointelegraph",
    "date": "2023-08-14T05:40:00.000Z",
    "title": "Nifty News: Coca-Cola gest Based, Reddit avatars reach 20M milestone and more",
    "url": "https://cointelegraph.com/news/nifty-news-coca-cola-nft-collection-coinbase-network-base",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/65924065-4eed-4ec9-a51e-959742413181.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Coca-Cola has chosen the newly-launched Coinbase layer-2 network Base to deploy its Masterpiece NFT collection.  </p>\n                    <p><p>The world’s largest soft drinks brand is delving deeper into the realm of non-fungible tokens, launching its first collection on the Coinbase layer-2 network Base.</p><p>On Aug. 13 Coinbase announced the new Coca-Cola collection as part of its “Onchain Summer” event.</p><p>“CocaCola is bringing their Global Masterpiece campaign onchain with iconic works from leading artists,” it stated. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/cdf67cf6-55bf-48a0-b777-d2859244a423.jpg\"  /><figcaption style=\"text-align: center;\"><em>\"The Scream\" by Edvard Munch. Source: onchainsummer.xyz</em></figcaption></figure><p>The Masterpiece collection brings together classic pieces such as “The Scream” by Edvard Munch along with new works from emerging talents, “all intertwined with the iconic CocaCola bottle.”</p><p>Coca-Cola's NFT entry is one of the larger consumer brands announced to be involved with Base so far. Other digital collectible projects expected to launch this month include Zora, Pixelmon, Showtime, and Indelible. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">ᴏɴᴄʜᴀɪɴ  ꜱᴜᴍᴍᴇʀ<a href=\"https://twitter.com/CocaCola?ref_src=twsrc%5Etfw\">@CocaCola</a> is bringing their Global Masterpiece campaign onchain with iconic works from leading artists.<br><br>Mint now: <a href=\"https://t.co/xTWyI3O7IW\">https://t.co/xTWyI3O7IW</a> <a href=\"https://t.co/9wxFgt8qOh\">pic.twitter.com/9wxFgt8qOh</a></p>&mdash; Coinbase ️ (@coinbase) <a href=\"https://twitter.com/coinbase/status/1690763490674503680?ref_src=twsrc%5Etfw\">August 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>Reddit Collectible Avatars hit 20M milestone</h3><p>Reddit NFTs minted on layer-2 network Polygon have surpassed the 20 million milestone, with the numerous collectible avatars spread over 16.3 million total holders. </p><p>According to <a href=\"https://dune.com/polygon_analytics/reddit-collectible-avatars\" target=\"_blank\" rel=\"noopener nofollow\">Dune Analytics</a>, the cumulative sales transaction volume of Reddit Collectible Avatars NFTs has exceeded $40 million.</p><p>Reddit’s Collectible Avatars Gen 4 release called “Retro Reimagined” launched on July 27, and Gen 3 has accumulated sales transactions of more than $3.4 million.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/d6aa3454-caa5-406e-9c28-96efffc23f2d.jpg\"  /><figcaption style=\"text-align: center;\"><em>Reddit Collectible Avatar stats. Source: Dune Analytics</em></figcaption></figure><p>On Aug. 13, Polygon founder Sandeep Nailwal <a href=\"https://twitter.com/sandeepnailwal/status/1690716331409027072\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the “Polygon ecosystem’s mainstream products are silently reaching “magic inflection points” of growth, be it Reddit Avatars, DraftKings NFTs or Nike dotSWOOSH.”</p><h3>New Bruce Lee anime has whiffs of NFTs</h3><p>A new anime project based on the late martial artist Bruce Lee has been announced, with speculation that there could be an NFT angle to it. </p><p>The new anime, named “House of Lee” is expected to come out in 2024. It is endorsed by Bruce Lee's daughter Shannon and the Bruce Lee Estate.</p><p>However, onlookers have noticed that the animation studio is Shockunit from China, known for NFT-based projects, while the animation artist is Emily Yang, a successful NFT animator, according to <a href=\"https://www.avclub.com/wait-is-this-bruce-lee-anime-his-familys-making-some-k-1850732893\" target=\"_blank\" rel=\"noopener nofollow\">reports</a> on Aug. 13.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/u-4mqqr4psE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>The producer, a company called Shibuya, also runs a platform for crowdfunding projects through NFT sales. In April, they minted an NFT collection called \"House of Lee: Genesis\" and sold 49,000 NFTs to raise over $700,000. </p><p>The animation aims to promote the collection which has seen prices fall from $15 to around $6 to $10, the report added. </p><p>The Enter the Dragon teaser trailer shows Bruce Lee animated in an old-school anime style, doing martial arts and turning into a dragon.</p><p>Cointelegraph reached out to Shannon at the Bruce Lee Family Company for further details but had yet to hear back at the time of publication. </p><h3>Grimes makes it big with NFTs</h3><p>Canadian musician, singer, songwriter, and record producer Claire Boucher also known professionally as Grimes said she has made more money selling NFTs than she has through her entire music career.</p><p>During the 2021 bull market and NFT bubble, Grimes sold her “War Nymph” NFTs on the Nifty marketplace earning roughly $6 million in revenue. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/nft-gas-usage-drops-bitcoin-ordinals-nonprofit-launches-nft-newsletter\"><strong><em>NFT gas usage drops, Ordinals nonprofit launches: Nifty Newsletter</em></strong></a></p><p>In an <a href=\"https://www.wired.com/story/grimes-big-interview/\" target=\"_blank\" rel=\"noopener nofollow\">interview</a> with Wired on Aug. 8, Grimes said that NFTs “changed her life” before adding, “I’m sad about what happened to NFTs and crypto because it got polluted fast with people trying to make as much money as possible.” </p><blockquote>“But I do want to think about compensating artists, especially digital artists. And I hope when the aggro niche dies down, we can come back.”</blockquote><h3>Other Nifty news</h3><p>According a to financial disclosure released last month, former U.S. President Donald Trump <a href=\"https://cointelegraph.com/news/what-happened-in-crypto-on-the-weekend\">holds $250,000 to $500,000 of assets</a> in a cryptocurrency wallet. The assets appear to be connected to a collection of self-styled NFTs he marketed after leaving the White House.</p><p>On Aug. 9, CBS Studios <a href=\"https://cointelegraph.com/news/star-trek-trademark-nfts-the-final-frontier\">applied</a> to use the name “Star Trek Continuum” for NFTs and digital collectibles. The collection is a series of NFTs featuring different customizable starships from the adventures in the popular science fiction universe.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/pfp-holders-doomed-grails-famed-nft-artists-amazon-prime-nfts/\">Grails’ lucky dip of famous NFT artists, new hope for PFP holders: NFT Collector</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  }
]