[
  {
    "source": "Decrypt",
    "date": "2023-11-22T21:01:51.000Z",
    "title": "Bitcoin Halving Is 5 Months Away and Hash Rate Just Hit an All-Time High",
    "url": "https://decrypt.co/207131/bitcoin-halving-hash-rate-all-time-high",
    "description": "Mining activity on the Bitcoin network is ramping up ahead of the halving next year."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-22T21:07:33.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "http://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Global asset manager BlackRock met with the United States Securities and Exchange Commission (SEC) to discuss the regulator's concerns about a spot Bitcoin exchange-traded fund (ETF). Meanwhile, OpenAI says it has reached an agreement in principle for Sam Altman to return as CEO, and Grayscale Investments met with the SEC about transforming its Grayscale Bitcoin Trust (GBTC) into a spot Bitcoin ETF.</p><h3>BlackRock met with SEC regarding spot Bitcoin ETF</h3><p><a href=\"https://cointelegraph.com/news/blackrock-sec-spot-bitcoin-etf-discussion\">Representatives from BlackRock</a> met with the United States Securities and Exchange Commission to discuss pathways for launching the country's first spot Bitcoin exchange-traded fund. </p><p>According to a recently released SEC memo, BlackRock provided the regulator with a presentation about potential redemption models for its proposed spot Bitcoin ETF. It's unclear whether the securities regulator responded to any of the proposed models. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Looks like <a href=\"https://twitter.com/BlackRock?ref_src=twsrc%5Etfw\">@BlackRock</a> also met with SEC! There’s a couple slides in relation to in-kind vs cash creation. Based on this it looks like BlackRock prefers in-kind for their <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcoin</a> ETF (makes sense as its probably cleanest structure for them &amp; end investors) <br>h/t <a href=\"https://twitter.com/btcNLNico?ref_src=twsrc%5Etfw\">@btcNLNico</a> <a href=\"https://t.co/AK0XspL4zJ\">https://t.co/AK0XspL4zJ</a> <a href=\"https://t.co/eeuUT9T5mn\">pic.twitter.com/eeuUT9T5mn</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1727341988436209903?ref_src=twsrc%5Etfw\">November 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>BlackRock is said to be the front-runner in the quest to launch the U.S.'s first spot Bitcoin ETF. The asset manager has a nearly perfect approval record for its various fund offerings. <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">BlackRock's initial application</a> was submitted to the SEC in June. </p><h3>OpenAI to rehire Sam Altman as CEO with new initial board members</h3><p>Two days after Microsoft CEO Satya Nadella hired former OpenAI CEO Sam Altman to lead a new advanced artificial intelligence (AI) research team, OpenAI backtracked its decision to fire its co-founder.</p><p>On Nov. 22, OpenAI announced a new agreement that would see Altman return as CEO. The company confirmed the agreement in a post on its official X (formerly Twitter) account.</p><p>According to OpenAI, the company and Altman “are collaborating to figure out the details.” Altman reciprocated his willingness to join OpenAI by reposting the announcement with a heart emoji.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">i love openai, and everything i’ve done over the past few days has been in service of keeping this team and its mission together. when i decided to join msft on sun evening, it was clear that was the best path for me and the team. with the new board and w satya’s support, i’m…</p>&mdash; Sam Altman (@sama) <a href=\"https://twitter.com/sama/status/1727207458324848883?ref_src=twsrc%5Etfw\">November 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Altman openly expressed his “love” for OpenAI as he decided to withdraw from his new role at Microsoft, adding, “I’m looking forward to returning to OpenAI, and building on our strong partnership with Microsoft.”</p><h3>Grayscale hashed out spot Bitcoin ETF details with SEC</h3><p>Grayscale executives, including CEO Michael Sonnenshein, <a href=\"https://cointelegraph.com/news/grayscale-meets-sec-to-discuss-bitcoin-trust\">met with the SEC</a> on Nov. 20 to discuss details of its flagship GBTC, which the asset manager wants to turn into a spot Bitcoin ETF.</p><p>The discussions “concerned NYSE Arca, Inc.’s proposed rule change to list and trade shares of the Grayscale Bitcoin Trust (BTC) under NYSE Arca Rule 8.201-E.”</p><p>Bloomberg ETF analyst James Seyffart shared that Grayscale entered a Transfer Agency and Service Agreement <a href=\"https://cointelegraph.com/news/us-banking-giant-bny-mellon-says-digital-assets-are-here-to-stay\">with BNY Mellon</a>, which will act as the agent for its GBTC, facilitating the issuance and redemption of shares and maintaining shareholder accounts. </p><p>Seyffart added Grayscale’s agreement with BNY Mellon was “likely something that was always going to be required at some point” and isn’t an indicator that the GBTC will soon be converted.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Since it feels like everyone is asking. Events of the last few days haven’t changed my &amp; <a href=\"https://twitter.com/EricBalchunas?ref_src=twsrc%5Etfw\">@EricBalchunas</a>’ odds. We can’t go any higher than 90% by Jan 10th. That said, things are continuing to move forward in our view.</p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1727112423042331030?ref_src=twsrc%5Etfw\">November 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The meeting follows a U.S. appellate court <a href=\"https://cointelegraph.com/news/court-mandate-grayscale-sec-spot-bitcoin-etf\">issuing a mandate</a> in October for the SEC to review its decision to deny Grayscale’s bid to convert the GBTC to a spot ETF.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-22T21:00:48.000Z",
    "title": "Binance Sees $1.7 Billion in Withdrawals Post DOJ Settlement, Nansen Reports Decline in Crypto Reserves",
    "url": "https://news.bitcoin.com/binance-sees-1-7-billion-in-withdrawals-post-doj-settlement-nansen-reports-decline-in-crypto-reserves/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/binanceesdf-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Binance Sees $1.7 Billion in Withdrawals Post DOJ Settlement, Nansen Reports Decline in Crypto Reserves\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/binanceesdf-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/binanceesdf-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/binanceesdf-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/binanceesdf-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/binanceesdf-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/binanceesdf-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/binanceesdf.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Following the settlement with the U.S. Department of Justice (DOJ), Binance, the world&#x2019;s leading crypto exchange by trading volume, has experienced a significant withdrawal of approximately $1.7 billion in digital assets, as reported by Nansen, a blockchain analysis company. This substantial outflow of funds from Binance occurred shortly after the settlement. As of the latest [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-22T21:00:28.000Z",
    "title": "Bitcoin Bulls Buckle Up: Seasonal Trends Point To $50,000 Target",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bulls-buckle-up-seasonal-trends-point-to-50000-target/",
    "description": "Bitcoin (BTC), the largest cryptocurrency on the market, has again failed to consolidate and reach the $38,000 level for the third time, as it is currently experiencing a 3% pullback. This has led the community to speculate that a significant retracement may occur before the bullish momentum resumes and the next uptrend begins.  However, renowned crypto analyst Adrian Zduńczyk has recently shed light on Bitcoin&#8217;s potential next target of $50,000. Zduńczyk&#8217;s analysis considers several crucial factors, including the prevailing bullish market sentiment, the ongoing uptrend, the short-term outlook, miner sentiment, and seasonal trends.  Evidence Of Dominant Bull Market Zduńczyk notes that the cryptocurrency industry is in a bull market, with Bitcoin reaching a new 52-week high close and experiencing the third wave of the bullish cycle. The correlation between Bitcoin and the S&#38;P 500 has risen, indicating a favorable environment for Bitcoin. High time frame trends are also rising. Zduńczyk identifies key macro support levels for Bitcoin at $29,000 and $27,000, highlighting growing demand fueled by the anticipation of the approval of spot Bitcoin exchange-traded funds (ETFs) and the upcoming halving event expected in April 2024. Related Reading: Solana Captures Institutional Investors’ Attention, Inflows Rise To $135 Million Notably, the daily chart for BTC remains in an uptrend, according to Zduńczyk. He points to a target of $40,000, supported by the appearance of a &#8220;golden cross&#8221; pattern. Furthermore, Zduńczyk believes that the rising Simple Moving Average (SMA) 200 serves as “irrefutable evidence” of a dominant bull market since January. These indicators suggest a continuation of the upward trajectory for Bitcoin. Zduńczyk also identifies key support levels at $35,000 to $35,800, emphasizing that a bullish sentiment prevails as long as Bitcoin remains above these levels.  Zduńczyk Eyes Bitcoin November Target Of $50,000 Currently, Bitcoin is ranging between $35,500 and $38,000, Zduńczyk notes that the momentum bands are widening, indicating an increase in volatility. The rising 50-day Average True Range (ATR) trend supports this observation. Fear &#38; Greed Index stands at 69, indicating a mixed sentiment among market participants. Miners, on average, are enjoying a profit increase of 23%. Zduńczyk maintains a positive outlook based on these factors.  Related Reading: Shiba Inu Sees A Whopping 48,000% Increase In The SHIB Burn Rate, What’s Next? Regarding seasonal trends, October demonstrated a gain of 27%, exceeding the average performance. Historically, November has been the best month for Bitcoin, which has an average gain of 43%, with a target of around $50,000. Notably, December typically adds 7% to November&#8217;s closing price. Currently, BTC is trading at $36,400, reflecting a 5% and 22% profit over the past fourteen and thirty days, respectively. The focus now shifts to whether BTC&#8217;s price can maintain its crucial support levels and sustain its bullish uptrend, potentially reaching the $50,000 milestone supported by historical patterns. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-22T21:00:18.000Z",
    "title": "Crypto Strategist Predicts Swift Bounce for Bitcoin, Says BTC in Accumulation Range Before Next Rally",
    "url": "https://dailyhodl.com/2023/11/22/crypto-strategist-predicts-swift-bounce-for-bitcoin-says-btc-in-accumulation-range-before-next-rally/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/bitcoin-alert-sell-off.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/bitcoin-alert-sell-off.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/bitcoin-alert-sell-off.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/bitcoin-alert-sell-off.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/bitcoin-alert-sell-off.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/bitcoin-alert-sell-off.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/bitcoin-alert-sell-off.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An analyst who continues to build a following for his timely Bitcoin (BTC) predictions believes that the crypto king is gearing up for an imminent burst to the upside. Pseudonymous analyst Credible Crypto tells his 353,400 followers on the social media platform X that Bitcoin is currently in a large re-accumulation zone which covers price [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/22/crypto-strategist-predicts-swift-bounce-for-bitcoin-says-btc-in-accumulation-range-before-next-rally/\">Crypto Strategist Predicts Swift Bounce for Bitcoin, Says BTC in Accumulation Range Before Next Rally</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-22T20:55:43.000Z",
    "title": "Pantera Capital’s Dan Morehead Forecasts Bitcoin Bull Market Cycle, Says Current Rally Should Last Till November 2025",
    "url": "https://dailyhodl.com/2023/11/22/pantera-capitals-dan-morehead-forecasts-bitcoin-bull-market-cycle-says-current-rally-should-last-till-november-2025/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/Get-Rich-off-Bitcoin-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/Get-Rich-off-Bitcoin-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/Get-Rich-off-Bitcoin-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/Get-Rich-off-Bitcoin-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/Get-Rich-off-Bitcoin-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/Get-Rich-off-Bitcoin-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/Get-Rich-off-Bitcoin-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto veteran Dan Morehead says Bitcoin (BTC) is in a bull market and is laying out a timeline for how long it could last. In a new open letter to investors, Morehead, who oversees $4.2 billion worth of assets at Pantera Capital, says that Bitcoin&#8217;s market cycles are nearly &#8220;alien&#8221; in their similarity. Morehead says [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/22/pantera-capitals-dan-morehead-forecasts-bitcoin-bull-market-cycle-says-current-rally-should-last-till-november-2025/\">Pantera Capital’s Dan Morehead Forecasts Bitcoin Bull Market Cycle, Says Current Rally Should Last Till November 2025</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]