[
  {
    "source": "CryptoGlobe",
    "date": "2023-11-23T01:00:00.000Z",
    "title": "Japanese Cryptocurrency Exchange Adds XRP and SHIB to Its Crypto Lending Program",
    "url": "https://www.cryptoglobe.com/latest/2023/11/japanese-cryptocurrency-exchange-adds-xrp-and-shib-to-its-crypto-lending-program/",
    "description": "Popular Japanese cryptocurrency trading platform BitTrade has announced that it’s adding two major cryptocurrencies to its lending program: the native token of the XRP Ledger, XRP, and the meme-inspired cryptocurrency Shiba Inu (SHIB). According to a recently published announcement, the firm is launching a “regular offering” of XRP and SHIB lending that allows its users […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-23T01:00:16.000Z",
    "title": "US Lawmaker Urges Congress to Focus on Attracting Crypto Opportunities to Bolster National Security",
    "url": "https://news.bitcoin.com/us-lawmaker-urges-congress-to-focus-on-attracting-crypto-opportunities-to-bolster-national-security/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/congress-tom-emmer-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"US Lawmaker Urges Congress to Focus on Attracting Crypto Opportunities to Bolster National Security\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/congress-tom-emmer-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/congress-tom-emmer-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/congress-tom-emmer-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/congress-tom-emmer-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/congress-tom-emmer-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/congress-tom-emmer-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/congress-tom-emmer.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A U.S. lawmaker has called on Congress to focus its efforts on bringing more crypto activity and opportunities to the United States in order to “bolster U.S. national security.” Citing the Department of Justice’s action against crypto exchange Binance, the lawmaker stressed that Congress does not need to rewrite laws that work in the crypto [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-23T01:00:58.000Z",
    "title": "Bitcoin Price Boost Ahead: CEO’s Bold Prediction Points To 10 US States Adopting Pro-BTC Laws In 2024",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-price-boost-ahead-ceos-bold-prediction-points-to-10-us-states-adopting-pro-btc-laws-in-2024/",
    "description": "In a recent statement, Dennis Porter, the co-founder and CEO of Satoshi Action Fund, expressed his belief that the year 2024 will mark a crucial turning point in the history of Bitcoin.  Porter&#8217;s remarks amidst growing anticipation surrounding the approval of spot Bitcoin exchange-traded funds (ETFs) and the highly anticipated halving event scheduled for April 2024.  According to Porter, these events, combined with the efforts of the Satoshi Action Fund, have the potential to impact the price and adoption of Bitcoin significantly. Satoshi’s Plan To Establish The US As Global Bitcoin Leader Satoshi Action Fund, a non-profit organization dedicated to informing policymakers and regulators about Bitcoin, has actively shifted the narrative surrounding the world&#8217;s leading cryptocurrency.  The fund aims to promote “hyper-Bitcoinization,” a term coined to describe the widespread adoption of Bitcoin as a global currency. One of the primary goals of the Satoshi Action Fund is to advocate for the passage of pro-Bitcoin legislation in 10 different US states by 2024. According to Porter, these proposed laws would protect individuals&#8217; rights to self-hold and mine Bitcoin, positioning the United States as a global leader in Bitcoin adoption and mining. Related Reading: Panic At Binance Following CZ’s Departure? Analyzing 24-Hour Inflow and Outflow Trends Interestingly, Porter envisions a future where bipartisan legislation empowers Bitcoin and fosters the growth of an emerging digital asset industry. Recent developments in the Bitcoin ecosystem further bolster Porter&#8217;s optimism. The halving event occurs approximately every four years and is anticipated to reduce the rate at which new Bitcoins are created, potentially leading to increased scarcity and upward price pressure.  Additionally, the long-awaited approval of Bitcoin ETFs by the Securities and Exchange Commission (SEC) has the potential to attract institutional investors and facilitate mainstream adoption. BTC’s Path To New Heights Renowned crypto expert Charles Edwards has boldly proclaimed that the recent liquidation of fear, uncertainty, and doubt (FUD) surrounding the crypto market will pave the way for a significant price rebound.  Edwards believes that the culmination of recent developments, particularly the Binance news, will eliminate sources of FUD accumulated over the past two years. The market has been gripped by panic triggered by headlines associating the term &#8220;guilty&#8221; with cryptocurrencies. However, Edwards suggests that the recent news concerning Binance should be viewed more as a settlement rather than a detrimental event.  Edwards points out that five years ago, exchanges were not compliant with know-your-customer (KYC) and anti-money laundering (AML) regulations, whereas now, they have implemented these practices. Consequently, Edwards believes that the lingering FUD surrounding Binance can finally be restored. Looking ahead, Edwards highlights several positive catalysts on the horizon for BTC. These include the potential approval of ETFs, the upcoming Bitcoin halving event, expectations of lower interest rates, and the possibility of a recession leading to increased quantitative easing (QE). Related Reading: Binance New CEO Affirms Strength In Company’s Fundamentals Edwards concludes by envisioning a &#8220;Bitcoin liquidity atomic bomb&#8221; waiting to explode. With the elimination of FUD and a series of positive triggers aligning, the market is poised for a substantial rebound.  The convergence of ETF approvals, the halving event, accommodative monetary policies, and a potential recession are expected to propel Bitcoin to new heights. At the time of writing, Bitcoin (BTC) is trading at $36,500, experiencing a slight decline of 2.2% over the past 24 hours.  Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-23T01:00:32.000Z",
    "title": "Altcoin That’s Up 200% in Three Months Could Push Up Even Further, Says Analytics Firm Santiment",
    "url": "https://dailyhodl.com/2023/11/22/altcoin-thats-up-200-in-three-months-could-push-up-even-further-says-analytics-firm-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/up-three-months-could.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/up-three-months-could.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/up-three-months-could.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/up-three-months-could.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/up-three-months-could.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/up-three-months-could.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/up-three-months-could.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto analytics platform Santiment says the token of an under-the-radar Ethereum (ETH) scaling solution has more upside potential even after recording triple-digit gains over the past couple of weeks. Santiment says that the Ethereum sidechain Skale Network (SKL) has more than tripled its market cap since mid-August amid an increase in the number of addresses. According [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/22/altcoin-thats-up-200-in-three-months-could-push-up-even-further-says-analytics-firm-santiment/\">Altcoin That’s Up 200% in Three Months Could Push Up Even Further, Says Analytics Firm Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]