[
  {
    "source": "NewsBTC",
    "date": "2023-09-21T04:00:22.000Z",
    "title": "CoinEx Update: Exchange Set To Resume Deposits And Withdrawals After Exploit",
    "url": "https://www.newsbtc.com/news/coinex-to-resume-deposits-and-withdrawals-after-exploit/",
    "description": "CoinEx, a cryptocurrency exchange, has announced plans to resume its deposit and withdrawal services. The crypto platform was forced to shut down operations after roughly $70 million worth of cryptocurrencies were drained from its hot wallets a week ago. On Saturday, September 16, the CoinEx team offered an update on their investigation, which showed that 18 different crypto assets, including BTC, ETH, XRP, and BCH, were stolen from the exchange. The exchange, however, asserted that assets in its cold wallets were not affected by the September 12 attack. Furthermore, CoinEx revealed that it is working with various blockchain security firms to trace the hackers’ addresses and recover the stolen assets. Interestingly, many security organizations and on-chain investigators have linked the attack to the North Korean hacker group Lazarus Group. CoinEx To Allow Deposit And Withdrawal Of These Cryptocurrencies In the latest update published on September 20, CoinEx disclosed its plans to resume deposit and withdrawal services for certain crypto assets on Thursday, September 21. Users will be able to interact with about ten cryptocurrencies, including Bitcoin (BTC), Ether (ETH), USDT (on the ERC20 and TRC20 networks), USDC (on the ERC20 network), Tron (TRX), Binance Coin (BNB), etc. Related Reading: Ethereum-Based Balancer Under Attack, Users Receive Warning As per the announcement, CoinEx will resume operations after implementing a new wallet system. During this process, the deposit addresses for certain tokens will be upgraded and new ones will be generated for all users. However, CoinEx warned users not to deposit into any old wallet addresses, as this could result in the permanent loss of transferred assets. The crypto exchange added: Please be sure to double-check that you are using the new address before depositing. After addressing that, CoinEx assured users that it will gradually resume deposits and withdrawals for other cryptocurrencies.  The crypto exchange also asked customers to exercise patience, as there may be many pending withdrawals over the next few days. Hence, processing all withdrawal requests for the available assets may take longer than usual. Will Users Be Able To Withdraw 100% Funds? CoinEx has maintained that users’ assets were not lost in this exploit. In the September 16 update, the company said that its User Asset Security Foundation would cover the financial losses from the incident. Moreover, CoinEx CEO Haipo Yang posted on X (formerly Twitter) two days after the attack, assuring “affected users” of 100% compensation. “Your assets with CoinEx remain safe. That’s our commitment to all of you,” Yang added. Related Reading: Hodlnaut Refuses OPNX’s $30 Million Offer After FLEX Token Declines By 90% CoinEx claims it has always implemented a 100% reserve policy to ensure user asset protection in the face of security threats. And the crypto exchange promised to improve its security infrastructure and invest more in its risk systems. The cryptocurrency total market cap on the daily timeframe &#124; Source: TOTAL chart on TradingView &#160; Featured image from Unsplash, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-21T03:40:34.000Z",
    "title": "Crypto Isn’t (Yet) Accessible for All",
    "url": "https://dailyhodl.com/2023/09/20/crypto-isnt-yet-accessible-for-all/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/matic-killer-layer-to.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/matic-killer-layer-to.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/matic-killer-layer-to.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/matic-killer-layer-to.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/matic-killer-layer-to.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/matic-killer-layer-to.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/matic-killer-layer-to.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>We intrinsically know that crypto investment and participation should be for everyone, but just how realistic is this? Crypto has been positioned as a groundbreaking financial innovation, promising financial inclusion and empowerment. Its adoption, however, remains uneven, with some significant barriers limiting access for many. This post explores three significant obstacles and how they can [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/20/crypto-isnt-yet-accessible-for-all/\">Crypto Isn’t (Yet) Accessible for All</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]