[
  {
    "source": "CoinDesk",
    "date": "2024-03-06T22:06:01.000Z",
    "title": "Protocol Village: Burnt Banksy Launches XION Blockchain, With USDC as Primary Currency",
    "url": "https://www.coindesk.com/tech/2024/03/06/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of March 7-March 13."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-06T22:00:00.000Z",
    "title": "How the SEC's Recent Win May Play in Its Coinbase, Binance Cases",
    "url": "https://www.coindesk.com/policy/2024/03/06/how-the-secs-recent-win-may-play-in-its-coinbase-binance-cases/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A federal judge ruled that secondary-market transactions for certain cryptocurrencies violated securities law. The catch: This was a default judgment. The defendant never showed up, and no one filed amicus briefs to oppose the Securities and Exchange Commission's motion for a default ruling."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-06T21:44:01.000Z",
    "title": "'Imagine the Smell': Binance Perfume Stunt Mocked, Denounced as Sexist",
    "url": "https://decrypt.co/220450/imagine-smell-binance-perfume-stunt-mocked-denounced-sexist",
    "description": "Meant to celebrate International Women’s Day, a female-focused ad campaign from crypto exchange Binance appears to have backfired."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-06T21:41:13.000Z",
    "title": "Arizona Senate considers Bitcoin and other digital asset ETFs for state pension investment",
    "url": "https://cryptobriefing.com/arizona-senate-considers-bitcoin-digital-asset-etfs-state-pension-investment/",
    "description": "Arizona is exploring the possibility of allowing its state pension systems to invest in Bitcoin and other digital assets."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-06T22:00:30.000Z",
    "title": "Ethereum price bullish despite $1b liquidations, SEC postponing ETH ETFs ",
    "url": "https://crypto.news/ethereum-price-sec-eth-etfs/",
    "description": "Ethereum market data analysis explores a show of conviction among speculative traders could drive ETH price above $4,000 in the days ahead. "
  },
  {
    "source": "BTCManager",
    "date": "2024-03-06T21:46:59.000Z",
    "title": "MakerDAO dominates Ethereum lending with 52% market share",
    "url": "https://crypto.news/makerdao-ethereum-lending/",
    "description": "MakerDAO, Ethereum's first defi lending protocol, has captured a 52% share in the ETH lending market."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-06T22:00:27.000Z",
    "title": "Bitcoin Short-Term Holders Panic Capitulate $2.6 Billion In BTC Crash",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-short-term-holders-2-6-btc-crash/",
    "description": "On-chain data shows that Bitcoin short-term holders have panic sold $2.6 billion worth of coins in the crash following the new all-time high. Bitcoin Short-Term Holders Have Sent Huge Volume In Loss To Exchanges As analyst James V. Straten explained in a new post on X, Bitcoin short-term holders have shown signs of capitulation during the latest drop in the cryptocurrency&#8217;s price. The &#8220;short-term holders&#8221; (STHs) refer to the BTC investors who bought their coins within the past 155 days. The STHs make up one of the two main divisions of the market, the other one being the &#8220;long-term holders&#8221; (LTHs). Related Reading: Solana Open Interest Plunges 20%: What It Means For Price Statistically, the longer an investor holds onto their coins, the less likely they are to sell at any point. This means that the STHs, who are relatively new hands, generally sell quickly whenever an asset crash or rally occurs. The LTHs, on the other hand, usually show resilience, only selling at specific points. One way to track whether either of these groups is selling is through the transfer volume they are sending to exchanges. First, here is a chart that shows the trend in the Bitcoin exchange inflow volume precisely for the STHs in loss: The value of the metric appears to have shot up in recent days &#124; Source: @jvs_btc on X As displayed in the above graph, the Bitcoin STHs have transferred around $2.6 billion worth of coins in loss to exchanges in the past day, implying that some members of this cohort have capitulated. This spike is huge, but it&#8217;s less than the loss-taking event that took place back during the price drawdown that followed the BTC spot exchange-traded fund (ETF) approval. These loss sellers would be those who FOMO&#8217;d into the rally that took BTC to a new all-time high beyond the $69,000 level, but their conviction wasn&#8217;t strong enough that they were able to hold past the sharp crash that BTC observed shortly after. The STHs aren&#8217;t the only ones who have exited the market in this latest price volatility; it would appear that the LTHs have also done some selling. The difference, however, is that these HODLers have made profits. The chart below shows how the exchange transfer volume for the LTHs in profit has looked like recently. Looks like the value of the metric has registered a sharp spike recently &#124; Source: jvs_btc on X The graph shows that the Bitcoin LTHs have participated in their largest profit-taking event since July 2021, transferring tokens worth $1.5 billion to exchanges. Related Reading: Bitcoin Sets New All-Time High Above $69,000 As Institutionals Show FOMO Thus, it would appear that this recent volatility has shaken up the conviction of even some of the diamond hands, although these HODLers have at least still been rewarded with profits. BTC Price At the time of writing, Bitcoin is trading around the $65,800 mark, up 8% in the past week. BTC has gone through a rollercoaster in the past couple of days &#124; Source: BTCUSD on TradingView Featured image from 愚木混株 cdd20 on Unsplash.com, Glassnode.com, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-06T21:42:06.000Z",
    "title": "Bitcoin Sees Over $1 Billion Liquidation Amid Decline to $61K",
    "url": "https://www.crypto-news-flash.com/bitcoin-sees-over-1-billion-liquidation-amid-decline-to-61k/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-sees-over-1-billion-liquidation-amid-decline-to-61k",
    "description": "<img width=\"1200\" height=\"675\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/34362.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/34362.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/34362-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/34362-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/34362-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/34362-450x253.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Bitcoin crash led to more than $1 billion in total liquidations. Industry experts believe this pullback is healthy and might be a precursor to further price growth. The crypto market experienced a dramatic Tuesday as Bitcoin&#8217;s price dipped to $61,000, triggering a cascade of over $1 billion in liquidations. This huge sell-off, marked by data [...]"
  }
]