[
  {
    "source": "Cointelegraph",
    "date": "2023-05-31T23:30:00.000Z",
    "title": "Stop shoving crypto ‘down people’s throats’ — Pudgy Penguins CEO on NFTs",
    "url": "https://cointelegraph.com/news/pudgy-penguins-ceo-nft-success-bear-market",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/d57f7ba3-fadb-4bf9-b1f4-83417c112336.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Luca Netz suggested that Pudgy Penguins is pushing for Web3/blockchain as a “back end not front end” approach, as it makes its IP as accessible as possible. </p>\n                    <p><p>The CEO of Pudgy Penguins — a nonfungible token project that recently launched a line of “phygitals” on Amazon despite the bear market — has offered one piece of sage advice to budding projects: Stop talking about crypto.</p><p>Speaking with Cointelegraph, 24-year-old entrepreneur Luca Netz said that many NFT projects overwhelm people with Web3 jargon and information, making it almost unapproachable for newcomers:</p><blockquote>“If you look at the other NFTs in the space, can everyone really get it? [...] I think they’re trying to drown crypto and Web3 down people’s throats. That’s not what people want. People want amazing products.”</blockquote><p>Since he took over Pudgy Penguins in April 2022, Netz stated that the project has opted for a Web3/blockchain as a “back end, not front end” approach. </p><p>This essentially boils down to bringing as much attention to the IP as possible, in an easily digestible way, he said, adding: </p><blockquote>“So our focus is really, how do we create a lovable character that everyone loves? And as the space evolves as the technology matures, you know, teach that user base that we're in NFTs.”</blockquote><p>“Everything that we do and everything that you'll see us do is ‘how do we get more familiarity and brand awareness around our characters?’ and that's really at the top of the totem pole for us,” he added. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We’re doing everything we said we would. The best part? We’re just getting started. <a href=\"https://t.co/iNEhoDkWvQ\">https://t.co/iNEhoDkWvQ</a></p>&mdash; Luca Netz  (@LucaNetz) <a href=\"https://twitter.com/LucaNetz/status/1660017493132423170?ref_src=twsrc%5Etfw\">May 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>Huggable Pudgy Penguins </h3><p>One of the key initiatives that Netz has introduced is the physical or “phygital” Pudgy Penguins collectibles, which are designed from the IP of around 16 different NFTs from the collection.</p><p>Each toy comes with a scannable code that people can use to unlock blockchain-based digital penguin customizations to make their own unique NFT. All in a user-friendly way.</p><p>In a Twitter Spaces in late May, Netz claimed that toys pulled in $500,000 worth of sales from around 20,000 units within two days of debut on Amazon on May 18.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Waking up to see Pudgy Penguins record breaking numbers on Amazon really makes all my losses in the Web3 space worth it. <br><br>If you didn’t know, the owner of these penguins will all be receiving royalties for these sales. <br><br>Utility. This is real utility. <a href=\"https://t.co/fbRGGig5Im\">pic.twitter.com/fbRGGig5Im</a></p>&mdash; Moose (@JoeyMooose) <a href=\"https://twitter.com/JoeyMooose/status/1659577213971251202?ref_src=twsrc%5Etfw\">May 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Notably, hodler’s of those specific NFTs get a cut of the revenue.</p><blockquote>“So for us, you know, my number one objective — watching the successes and failures in the space thus far — is how do I bring value to my NFT holder. I think if that's not your number one objective when running an NFT business, then you're unfortunately going to be in a tough spot.”</blockquote><p>“So we believe that when we make a product and we make content, that we want to pay our community for that and it's kind of how we're looking at it,” he added. </p><h3>From bear... to penguin</h3><p>In late 2021, Pudgy Penguins was essentially in tatters as the floor price was plummeting, while promised milestones on the roadmap such as blockchain games were nowhere in sight. </p><p>At the time, questions were being <a href=\"https://twitter.com/zachxbt/status/1425569462854500360\" target=\"_blank\" rel=\"noopener nofollow\">raised</a> about the past dealings of controversial founder Cole Villemain, who was ultimately voted out of the project by the community by January 2022. </p><p>A few months later, the project was subject to a <a href=\"https://cointelegraph.com/news/nifty-news-uk-royal-mint-nft-960k-billionaire-dog-rug-and-pudgy-penguins\">$2.5 million takeover</a>  by Netz, and since the announcement on April 3, 2022, the floor price for Pudgy Penguins NFTs has surged from around 1.3 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) to around 5.05 ETH at the time of writing.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/b580c886-a80b-4f67-9188-4a389b580dab.png\"  /><figcaption style=\"text-align: center;\"><em>Pudgy Penguins Floor price surge. Source: NFT Price Floor.</em></figcaption></figure><p>Adding to that, the Pudgy Penguins also recently closed a <a href=\"https://cointelegraph.com/news/nifty-news-assassin-s-creed-unveils-smart-collectibles-mechafightclub-winds-down-and-more\">$9 million seed funding round</a> in early May, along with signing a <a href=\"https://cointelegraph.com/news/nifty-news-pudgy-penguins-signs-with-wme-bitblox-to-make-web3-gambling-games-and-more\">Hollywood representation deal with WME</a> to expand the IP into areas such as TV, film and gaming. </p><h3>Revival under Luca Netz</h3><p>While it may have looked like another dead NFT project to some, Netz emphasized that he saw a diamond in the rough with a strong community that wanted to see the project thrive again:</p><blockquote><strong>“</strong>I think it had all of the ingredients to be the face of NFTs. And I felt like nobody [else] at the time had the same value proposition.”</blockquote><p>“I decided to buy it because I saw that it had those ingredients, and they just needed the right person to cook it.” he added. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Looking forward to spreading love across the Meta ❤️ <a href=\"https://t.co/ZBEF3W6XV2\">https://t.co/ZBEF3W6XV2</a></p>&mdash; Luca Netz  (@LucaNetz) <a href=\"https://twitter.com/LucaNetz/status/1510446474605256710?ref_src=twsrc%5Etfw\">April 3, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Explaining what he saw in Pudgy Penguins, Netz stated that he felt it had a culture that was “second to none,” along with a “universal IP” that was primed for growth. </p><p>“So what I mean, by universal, you know anyone, and everyone can understand a Pudgy Penguin, it doesn't matter what your ethnicity is, or your gender or your religion, like you all get and understand a Pudgy Penguin,” he said. </p><p><strong><em>Magazine: </em></strong><strong><em><a href=\"https://cointelegraph.com/magazine/rich-rekt-rich-again-nft-creator-trevor-jones-right-royal-nfts/\">NFT Creator: Top 10 crypto artist Trevor Jones on being rich, rekt and rich again</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-31T23:30:04.000Z",
    "title": "Central Banks Show ‘a Lot More Pessimism’ About US Dollar, Survey Shows",
    "url": "https://news.bitcoin.com/central-banks-show-a-lot-more-pessimism-about-us-dollar-survey-shows/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/gold-vs-us-dollar-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Central Banks Show Confidence in Gold, Less Optimistic About US Dollar: Survey\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/gold-vs-us-dollar-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/gold-vs-us-dollar-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/gold-vs-us-dollar-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/gold-vs-us-dollar-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/gold-vs-us-dollar-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/gold-vs-us-dollar-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/gold-vs-us-dollar.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The latest gold reserves survey by the World Gold Council shows that central banks are less optimistic about the future role of the U.S. dollar while their confidence in gold has risen. &#8220;There was basically a lot more pessimism about the U.S. dollar and a lot more optimism for gold,&#8221; said the council&#8217;s director of [&#8230;]"
  }
]