[
  {
    "source": "CoinDesk",
    "date": "2023-12-29T09:51:24.000Z",
    "title": "Indonesian Authorities Crack Down on Bitcoin Miners Stealing Electricity From National Grid",
    "url": "https://www.coindesk.com/policy/2023/12/29/indonesian-authorities-crack-down-on-bitcoin-miners-stealing-electricity-from-national-grid/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The thieves allegedly tapped into utility poles of a state-owned energy firm to power mining operations."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-29T09:42:26.000Z",
    "title": "Privacy Tokens DASH, ZCH, XMR Take Hit as OKX Says It Will Suspend Trading",
    "url": "https://www.coindesk.com/business/2023/12/29/privacy-tokens-dash-zch-xmr-take-hit-as-okx-says-it-will-suspend-trading/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "More than 20 trading pairs will be delisted next week as they no longer meet the crypto exchange's listing criteria."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-29T10:00:00.000Z",
    "title": " NFT predictions for 2024: Trends and challenges coming next year ",
    "url": "https://cointelegraph.com/news/nft-predictions-2024-web3-professionals-trends-and-challenges",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNjE4ODBhZTktOWEwYS00ZDRhLTliOGEtODdiNDdhN2JkM2Y0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Cointelegraph spoke with Web3 professionals to see what trends and challenges they predict the NFT space could face in 2024. </p>\n                    <p><p data-ct-non-breakable=\"true\">As 2023 closes its curtains, nonfungible tokens (NFTs) continue to be a big part of the Web3 space. Community members are looking to 2024 with bullish eyes, believing the future has a lot in store for the asset class. </p><p>From NFT gaming taking off to continued regulatory uncertainty, Cointelegraph spoke with various Web3 professionals, who shared their perspectives and predictions on which trends may continue into 2024, as well as what challenges NFTs may face in the year ahead.</p><p data-ct-non-breakable=\"true\">Professionals working in Web3 predict further development in the connection between digital and physical assets in 2024. The NFT space is set to play a part in this intersection, according to John Crain, co-founder and CEO of SuperRare Labs — the entity behind NFT marketplace SuperRare. </p><p><a href=\"https://cointelegraph.com/news/nft-predictions-2024-web3-professionals-trends-and-challenges\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-29T09:50:17.000Z",
    "title": "Financial markets on edge as Bitcoin spot ETF decision looms, ETF inflows surge",
    "url": "https://cryptoslate.com/insights/financial-markets-on-edge-as-bitcoin-spot-etf-decision-looms-etf-inflows-surge/",
    "description": "<p>Quick Take As we approach 2024, the financial market remains in suspense over the potential approval of a Bitcoin spot ETF, with the deadline for any amendments ending today, Dec. 29. According to Bloomberg ETF analyst Eric Balchunas, ETFs have seen significant inflows, which only bodes well for a potential Bitcoin spot ETF. ETFs flows [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/financial-markets-on-edge-as-bitcoin-spot-etf-decision-looms-etf-inflows-surge/\">Financial markets on edge as Bitcoin spot ETF decision looms, ETF inflows surge</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-29T09:49:22.000Z",
    "title": "Indian Government to Ban 9 Crypto Exchanges, Including Binance and Kraken",
    "url": "https://cryptodaily.co.uk/2023/12/indian-government-to-ban-9-crypto-exchanges-including-binance-and-kraken",
    "description": "India’s Financial Intelligence Unit (FIU) requested a ban on nine exchanges operating in the country. The exchanges include Binance, Kraken, and Bitfinex."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T10:08:38.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Cardano stands out as a project with remarkable potential beyond its role as a tradable asset. Rooted in scholarly peer-reviewed research, it has cultivated a robust community over time. Here, we delve into the essence of Cardano and offer a projection for the future value of ADA. How much is ADA [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T09:45:21.000Z",
    "title": "Rising Concerns Over Potential Anti-Technology Movement",
    "url": "https://www.cryptopolitan.com/concerns-over-anti-technology-movement/",
    "description": "In recent times, there has been a surge in skepticism and anti-technology movement regarding the potential capabilities of artificial intelligence (AI) and the impact of digital technology on human lives. While many hail these innovations as revolutionary, some are questioning their true potential and consequences.  The &#8220;Runaway AI&#8221; dilemma Critics argue that the concept of [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-29T09:54:01.000Z",
    "title": "Web 3 & AI Professionals Choose Dubai as New Home, But Why?",
    "url": "https://nulltx.com/web-3-ai-professionals-choose-dubai-as-new-home-but-why/",
    "description": "Dubai, UAE &#8211; January 10-11, 2024 &#8211;The broad spectrum of future technology is evolving fast. Lightning fast. As future tech companies have started to demand more from the cities they call home, investors also began to find themselves on an exhilarating journey. Seeking unparalleled opportunities that align with forward-thinking companies [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-29T10:00:00.000Z",
    "title": "Shiba Inu burning more tokens; Celestia and Borroe Finance remain bullish",
    "url": "https://crypto.news/shiba-inu-burning-more-tokens-celestia-and-borroe-finance-remain-bullish/",
    "description": "As Shiba Inu burns more SHIB, Celestia (TIA) and Borroe Finance (ROE) are preparing for what might be a transformative phase"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-29T09:58:45.000Z",
    "title": "XRP Whales Moves $47 Million To Exchange, As Price Dips",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-whales-moves-47-million-to-exchange-as-price-dips/",
    "description": "XRP whales are on the move again, as on-chain data reveals that the crypto asset has witnessed a massive whale activity in the past day, which has led investors and the crypto community to ponder on the reasons behind these large transactions. Whale Transfers 47 million XRP To Cryptocurrency Exchanges A report has shown that a whale has shifted approximately 47 million XRP tokens to crypto exchanges. Data from the on-chain tracker Whale Alert revealed the funds were moved to centralized exchanges (CEXs) in two distinct transfers.  Related Reading: XRP Whales Show Exchange Inflow Activity, Bad Sign For Price? The two whale transactions came in light of the token experiencing a price decline. The first transfer saw about 24,800,000 XRP tokens valued at $15,463,840 being moved to the crypto exchange Bitso. Data from the on-chain tracker shows that the unknown wallet address r4wf7enWPx…5XgwHh4Rzn made the move 11 hours ago. The second transaction shifted about 23,800,000 XRP which was valued at $14,840,298 at the time of transfer. Whale Alert reported that the same wallet address mentioned above also made the transfer to another crypto exchange Bitstamp. This is not a surprise as the stated wallet has been making such huge transfers to both Bitso and Bitstamp exchanges. On Wednesday, December 27, the same wallet address was reported moving over 49 million XRP to the centralized exchanges. The whale transaction also took place in two distinct transfers. The wallet address moved 22.90 million XRP valued at approximately $14 million to Bitstamp. Meanwhile, the second transaction was reported to have witnessed 16.50 million XRP worth about $10.43 million moved to the Mexican-based exchange Bitso. The movement of XRP to the stated CEXs via the same wallet address has become a regular occurrence in the cryptocurrency space.  This might be due to Ripple&#8216;s strategic partnership with Bitstamp and Bitso, in which the CEXs make use of Ripple&#8217;s payment services. Could The Price Of The Crypto Asset Reach $2,500? Crypto expert Egrag Crypto recently revealed an intriguing story of his conversation about the pricing of XRP with a prominent banker. The analyst shared the story with the entire crypto community on the social media platform X (formerly Twitter). Related Reading: Crypto Analyst Predicts XRP Price Will Explode 58,000% To $352 The conversation revolved around the token, as both figures examined how the altcoin might reach a value of $2,500 soon. The discussion arose when the banker challenged Egrag to clarify how 40,000 XRP could ultimately equal $100 million. Taking up the challenge, Egrag showed the banker how the asset would reach $2,500 using a chart he posted alongside. According to the chart, the token might reach this price level by 2029.  Due to this, the banker has considered the digital asset a long-term investment, as he believes it could result in enormous gains by then. Currently, the token&#8217;s price is sitting at $0.629, indicating a decline of about 1.60% in the past 24 hours. Its trading volume is also down by over 20%, while its market cap is down by 1.68%. Featured image from Shutterstock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-29T10:00:57.000Z",
    "title": "Prime Crypto Choices for the Upcoming Year: Spotlighting $ROE, LTC, and APT",
    "url": "https://www.crypto-news-flash.com/prime-crypto-choices-for-the-upcoming-year-spotlighting-roe-ltc-and-apt/?utm_source=rss&utm_medium=rss&utm_campaign=prime-crypto-choices-for-the-upcoming-year-spotlighting-roe-ltc-and-apt",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-29T102824.643.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-29T102824.643.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-29T102824.643-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-29T102824.643-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-29T102824.643-450x300.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Litecoin (LTC) recently crossed a mining milestone, and the blockchain expects a new influx of investors in 2024. Similarly, the Aptos (APT) Foundation released millions of tokens in early December and recorded a double-digit price surge. However, investors are focused on a hot new crypto token called Borroe Finance ($ROE). Keep reading to see expert [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-29T09:42:50.000Z",
    "title": "Legal Landmark: Judge Declares Terraform Labs’ LUNA and MIR Tokens as Securities",
    "url": "https://www.crypto-news-flash.com/legal-landmark-judge-declares-terraform-labs-luna-and-mir-tokens-as-securities/?utm_source=rss&utm_medium=rss&utm_campaign=legal-landmark-judge-declares-terraform-labs-luna-and-mir-tokens-as-securities",
    "description": "<img width=\"1600\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Terra\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f.png 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-1536x864.png 1536w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />MIR and LUNA have been categorized as securities by a U.S. federal judge.                                                                                   Terra (LUNA) [...]"
  }
]