[
  {
    "source": "Cointelegraph",
    "date": "2023-06-19T09:23:31.000Z",
    "title": "Most 'fear' in 3 months as $26.4K becomes key — 5 things to know in Bitcoin this week",
    "url": "https://cointelegraph.com/news/bitcoin-price-this-week-fear-26k-key-5-things",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/4f4c877e-b67f-466d-a71c-cde6c6190362.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin sentiment is clinging to any optimism it can get — just like BTC price performance — as a new week of volatility triggers begins.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) emerges from a hectic macro week to circle some classic trend lines near $26,000 — what could happen next?</p><p>After some brutal tests of traders' resolve over the past seven days, BTC price is still determined to hold familiar ground.</p><p>Market participants are in \"wait and see\" mode as a lack of clear direction characterizes the largest cryptocurrency at the start of a new week's trading.</p><p>United States holidays mean that traditional markets will only open on June 20, giving at least one day's grace before any surprises hit.</p><p>There are still plenty left to deal with from last week, however — including BlackRock filing for a Bitcoin spot exchange-traded fund (ETF). Rumors are now that Fidelity Investments might follow.</p><p>What will it take to inspire BTC price to adopt a trend? Cointelegraph takes a look at some of the major topics now under discussion among traders and analysts.</p><h2>No relief for nervous Bitcoin traders</h2><p>The latest weekly close for BTC/USD yielded little change over the past seven days.</p><p>At just above $26,000, “sideways” is the name of the game for the pair, which weathered a slew of potential volatility triggers over the week.</p><p>A trip to new three-month lows was short lived, however, and traders are now cautiously waiting for new cues on direction while not yet defaulting to a bearish view.</p><p>“I remain long while we show no signs of a reversal,” Crypto Tony <a href=\"https://twitter.com/CryptoTony__/status/1670683555897155587\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a summary of his position on the day. </p><blockquote>“Looking for that trend line test at $26,900, and following a flip of that we then have $27,300 to note then up and away. Step by step we move.”</blockquote><p>Fellow trader Koala argued that upside and downside extremes centered on a $4,000-wide corridor, with lows likely to get swept first before a return to $27,000.</p><p>“A set of equal highs and equal lows. I think we run the equal lows before the equal highs,” he <a href=\"https://twitter.com/trader_koala/status/1670627523103686658\" target=\"_blank\" rel=\"noopener nofollow\">argued</a>. </p><blockquote>“The demand area is where I'm interested in bidding for a run higher (invalidation is quite obvious) If demand holds, then 27k+. Otherwise, 23kish.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/202ca504-64f0-48d3-8dac-01623cfac81a.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Koala/Twitter</em></figcaption></figure><p>For Credible Crypto, the potential range was narrower, with $25,500 the lower boundary.</p><p>“It would not surprise me to see us chop around between the RED and GREEN regions below for another few weeks. Any move above 28.5k and we will have broken a key market structure level that would imply that our corrective structure has completed and we may have begun a new impulsive move,” he <a href=\"https://twitter.com/CredibleCrypto/status/1670284279241412610/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> in part of recent analysis alongside an explanatory chart. </p><blockquote>“A low timeframe move below GREEN is OK, because (as per previous posts), my HTF bias is bullish above 20k. That being said, I would only expect us to dip below GREEN due to some short term, fundamental/event driven volatility. Let's see what the next few weeks bring.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/950646e1-15be-4a6e-85ff-8acab428248c.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Credible Crypto/Twitter</em></figcaption></figure><p>Trader Pierre flagged two trend lines in the form of the 4-hour and 1-day as support and resistance levels, respectively.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Very elaborate analysis shared yesterday:<br>- Must hold = H4 trend<br>- Must break = D1 downtrend (same since +29.0k)<br>- Chopfest in between <a href=\"https://t.co/pIAFeLgFQ2\">https://t.co/pIAFeLgFQ2</a> <a href=\"https://t.co/h9lhnjKImH\">pic.twitter.com/h9lhnjKImH</a></p>&mdash; Pierre - I will never DM you first (@pierre_crypt0) <a href=\"https://twitter.com/pierre_crypt0/status/1670688819698450432?ref_src=twsrc%5Etfw\">June 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>BTC price additionally circled the classic 200-week moving average (MA) to start the week, this lying at $26,600, per data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a>. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/5629f0d2-dee2-48e3-b6fd-12a82b083dea.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-day candle chart on Bitstamp with 200-week MA. Source: TradingView</em></figcaption></figure><h2>Speculators in the spotlight</h2><p>In terms of where BTC price might fall to should downside momentum return, on-chain analysis offers a clearer vision of support.</p><p>For analytics firm Glassnode, recent price action has centered on a key breakeven point for Bitcoin’s more speculative investor cohort.</p><p>Dubbed “short-term holders (STHs),” these correspond to wallet entities, which have hodled coins for 155 days or less.</p><p>The aggregate cost basis (CB) for these entities — the price at which they purchased coins within that 155-day window — currently sits at $26,400, roughly matching the 200-week MA.</p><p>“The recent volatility in Bitcoin price action has been anchored around the Short-Term Holder Cost-Basis of $26.4K,” Glassnode <a href=\"https://twitter.com/glassnode/status/1670031788222103554/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">argued</a> in a Twitter post at the weekend.</p><blockquote>“This suggests the STH-CB remains a pivotal level in determining both the direction and momentum of the local trend.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/dd1cb7e6-fa1b-44d2-b9e9-d3e305cbe727.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin STH data annotated chart. Source: Glassnode/Twitter</em></figcaption></figure><p>Below $26,400, then, STHs begin to encounter unrealized losses on their investment, as shown by an accompanying chart.</p><p>Glassnode has <a href=\"https://cointelegraph.com/news/bitcoin-reaches-decision-point-4-btc-price-metrics-to-watch\">previously flagged</a> the significance of the STH-CB, this along with the equivalent for 155-day+ investors, known as long-term holders (LTHs), becoming a source of interest in particular after that November 2022 meltdown of exchange FTX.</p><h2>Macro cools after intense week</h2><p>With United States markets closed for the Martin Luther King Jr. holiday on June 19, macro catalysts for crypto markets lie in wait later in the week.</p><p>While not as <a href=\"https://cointelegraph.com/news/sec-cpi-and-a-strong-rebound-5-things-to-know-in-bitcoin-this-week\">numerous or significant</a> as the previous week’s set, these still have the potential to spark some surprise volatility.</p><p>The Federal Reserve is among them, with Chair Jerome Powell due to testify before Congress over two days from June 21.</p><p>After the Fed’s recent decision to pause interest rate hikes but leave the door open to resume them later, markets will be keenly analyzing Powell’s language for hints as to what might come next.</p><p>To cap off the week, June 22 will see the release of Purchasing Managers’ Index (PMI) data.</p><p>Among market participants, meanwhile, the focus is equally on Bitcoin’s correlation to traditional risk assets as it is on how macro triggers impact them.</p><p>“Not only has $BTC lost the positive correlation w/SPX and NDX, but we've also lost the inverse corr w/DXY,” trader Josh Olszewicz <a href=\"https://twitter.com/CarpeNoctom/status/1669360237411696640\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> last week, reference Bitcoin’s interaction with the S&amp;P 500, Nasdaq and U.S. dollar index, respectively.</p><p>Credible Crypto suggested that the recent disparity between BTC and SPX performance — sideways versus what various source have called a “bull market rally” — may yet resolve in bulls’ favor.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Been seeing quite a few comments lately on the &quot;weakness&quot; of <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> vs trad markets <a href=\"https://twitter.com/search?q=%24SPX&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$SPX</a> and how this is bad for crypto.<br><br>Don&#39;t mistake consolidation for weakness.<br><br>Like a student who gets a good nights sleep before a major exam- the more we rest before the big day the better we… <a href=\"https://t.co/FoCrvOskD1\">pic.twitter.com/FoCrvOskD1</a></p>&mdash; CrediBULL Crypto (@CredibleCrypto) <a href=\"https://twitter.com/CredibleCrypto/status/1670527873365557249?ref_src=twsrc%5Etfw\">June 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Cointelegraph has often reported on the ups and downs of Bitcoin’s macro correlations in recent years. A notable theme post-2020 has been strength during periods of Fed <a href=\"https://cointelegraph.com/news/fed-starts-stealth-qe-5-things-to-know-in-bitcoin-this-week\">liquidity injections</a> and vice versa.</p><h2>GBTC gets a BlackRock boost</h2><p>Bitcoin itself may be offering little inspiration, but one of its biggest investment vehicles is experiencing a resurgence in its own right.</p><p>The Grayscale Bitcoin Trust (GBTC) has begun a fresh attempt at narrowing its heavy discount versus the BTC spot price.</p><p>GBTC has traded at this discount — which is in fact a negative premium — since Bitcoin’s all-time highs in 2021. Since then, it has reached -50%.</p><p>Last week’s announcement of a Bitcoin spot price exchange-traded fund (ETF) filing by BlackRock appeared to induce a change of mood, and as of June 17, the premium had <a href=\"https://www.coinglass.com/Grayscale\" target=\"_blank\" rel=\"noopener nofollow\">decreased to -36.6%</a>.</p><p>As Cointelegraph <a href=\"https://cointelegraph.com/news/grayscale-bitcoin-trust-2023-high-blackrock-etf-filing-buyers\">reported</a>, the changes came despite arguments over the true status of BlackRock’s offering, with some claiming that it would not be a spot ETF, which remain banned in the U.S., at all.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/e2970897-d2b6-46e3-a88d-9648170f438c.png\"  /><figcaption style=\"text-align: center;\"><em>GBTC premium vs. asset holdings vs. BTC/USD chart (screenshot). Source: CoinGlass</em></figcaption></figure><p>That aside, GBTC’s recent performance remains impressive — 36.6% is within striking distance of new 2023 highs for the premium.</p><p>Buyers have also been making themselves known, leaving major client ARK Invest to react. ARK currently owns <a href=\"https://cathiesark.com/ark-combined-holdings-of-gbtc\" target=\"_blank\" rel=\"noopener nofollow\">more than 5.3 million GBTC shares</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/b68c1cb4-320e-4495-a311-d1647dbc8f06.png\"  /><figcaption style=\"text-align: center;\"><em>ARK Invest GBTC holdings chart (screenshot). Source: Cathie's ARK</em></figcaption></figure><p>This week, meanwhile, fresh speculation of an ETF offering focuses on asset manager Fidelity Investments, with details still forthcoming.</p><p>“I was long GBTC before this but this makes me more confident that it was the correct move,” investor Mike Alfred <a href=\"https://twitter.com/mikealfred/status/1670652736390721536\" target=\"_blank\" rel=\"noopener nofollow\">reacted</a>.</p><h2>Market optimism sees repeated tests </h2><p>Crypto market sentiment got spooked last week thanks to the combined ramifications of U.S. legal action against exchanges and macroeconomic policy changes.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-bulls-look-to-re-establish-control-will-bnb-ltc-okb-and-qnt-follow\">Bitcoin bulls look to re-establish control — Will BNB, LTC, OKB and QNT follow?</a></em></strong></p><p>A look at the <a href=\"https://alternative.me/crypto/fear-and-greed-index/\" target=\"_blank\" rel=\"noopener nofollow\">Crypto Fear &amp; Greed Index</a> shows how recent events have left their mark — June 15 saw the lowest score since mid-March.</p><p>While this suggests a more “fearful” environment than at any time since then, Fear &amp; Greed nonetheless remains surprisingly stable. Those lows came in at 41/100 — barely “fearful” at all and subsequently returning to the stable “neutral” range.</p><p>As of June 19, the Index measures 47/100.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/bfc38fad-1261-4051-b8d9-42ea4bc6b8eb.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto Fear &amp; Greed Index (screenshot). Source: Alternative.me</em></figcaption></figure><p>Continuing, research firm Santiment additionally cited the BlackRock ETF story as potential fuel for markets — specifically because some reactions were hostile.</p><p>For Santiment, “the more negativity surrounding this story, the stronger likelihood of a continued rise” in crypto markets, it <a href=\"https://twitter.com/santimentfeed/status/1669777042764886016\" target=\"_blank\" rel=\"noopener nofollow\">explained</a> last week.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/gary-genslers-job-at-risk-blackrocks-first-spot-bitcoin-etf-hodlers-digest-june-11-17/\">Gary Gensler’s job at risk, BlackRock’s first spot Bitcoin ETF and other news: Hodler’s Digest, June 11–17</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-19T09:10:17.000Z",
    "title": "Bitcoin prepares for lift off",
    "url": "https://cryptodaily.co.uk/2023/06/bitcoin-prepares-for-lift-off",
    "description": "<p>With the crypto market seemingly still in the grip of enforcement-induced fear perhaps Bitcoin is getting ready for an explosive move.</p>\nSideways and down\n<p>The crypto market is relatively quiet, as altcoins continue their bleed out due to the highly uncertain regulatory atmosphere, and bitcoin is still moving sideways and down in a descending channel.</p>\n<p>All quiet on the crypto front.</p>\n<p>It&rsquo;s at times like these that investors should be studying the tea leaves and watching the stars with far more avidity than normal because a sudden upheaval in the market would likely catch many unawares, and there are increasing signs that something big could be about to commence.</p>\n<p>With the SEC suing all and sundry, most retail investors have headed for the hills, convinced that they are not going to return until the outcomes from all of the enforcement actions are known, and it looks like it is safe to return.</p>\n<p>However, this is not how money is made. It is well known that the best time to invest is when there is blood in the streets, and there must surely be some of the red stuff washing over the kerb right now.</p>\nMajor players moving in\n<p>Big players are just getting ready to enter in the form of Blackrock and Fidelity and they don&rsquo;t get any bigger than this. Blackrock already filed its petition for a Bitcoin Spot ETF, and Fidelity is set to either file its own, or make a bid for the Grayscale Bitcoin Trust.</p>\n\n<p dir=\"ltr\" lang=\"en\">UPDATE: @DigitalAssets and @Fidelity is about to make a seismic move in crypto via both $BTC and $ETH. Sources expect Fidelity to either make a bid for @Grayscale or quickly launch their own spot #bitcoin ETF. One or both are coming, soon. **Blackrock and Fidelity will own&hellip;</p>\n&mdash; Andrew (@AP_Abacus) June 18, 2023\n<p>\n\n</p>\nJuicy technicals\n<p>Meanwhile, bitcoin is starting to look quite juicy from a technical chart perspective. A possible cup and handle is a long time in the making, with the cup starting in June of 2022, coming to a top last April, and now making its handle downwards. The measured move for this cup and handle could be in the region of $45,000.</p>\n<p>On the 5-day time frame the price is holding nicely at the top of the Gaussian Channel, and on the weekly time frame the Stochastic RSI, a good momentum indicator, is coming down nicely, to be followed by a cross up perhaps in the next 2 to 3 weeks.</p>\n<p>Of course, everything isn&rsquo;t just going to be upwards. Bitcoin may well sweep lower and test the support at $24,260 where it can also find trend line support plus the middle of the Gaussian Channel on the weekly time frame.</p>\n<p>Should all the above be wrong then a far more extensive bear market would come into play. Whatever happens, bitcoin is hard money you can own, spend and save without any government or bank say-so. That is certainly worth much consideration.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-19T09:29:36.000Z",
    "title": "Binance CEO Introduces Spot DCA Amidst Market Volatility: Empowering Users to Navigate Crypto Swings",
    "url": "https://www.crypto-news-flash.com/binance-ceo-introduces-spot-dca-amidst-market-volatility-empowering-users-to-navigate-crypto-swings/?utm_source=rss&utm_medium=rss&utm_campaign=binance-ceo-introduces-spot-dca-amidst-market-volatility-empowering-users-to-navigate-crypto-swings",
    "description": "Binance launches Spot DCA, enabling users to automate asset purchases and sales at predetermined price levels and frequencies, mitigating the effects of market volatility. Spot DCA allows users to capitalize on market dips and secure profits when prices exceed desired thresholds, supporting disciplined and strategic trading approaches. In the midst of ongoing regulatory challenges and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-19T09:27:50.000Z",
    "title": "Can SelfKey Compete With AltSignals? Which AI Crypto Could 10x in 2023?",
    "url": "https://www.crypto-news-flash.com/can-selfkey-compete-with-altsignals-which-ai-crypto-could-10x-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=can-selfkey-compete-with-altsignals-which-ai-crypto-could-10x-in-2023",
    "description": "Maintaining a diverse crypto portfolio is an excellent way of mitigating some of the volatility that crypto markets are renowned for. Investors are increasingly looking towards AI-powered platforms to diversify their portfolios, with the promise of excellent returns as the power of AI becomes integrated with blockchain technology. Two platforms embracing the potential of AI [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-19T09:21:12.000Z",
    "title": "BREAKING: BlackRock’s ETF Approval Streak: Only 1 Out of 576 ETF Applications with the SEC Was Dismissed – Billions of Dollars to Flow Into the Market – Are You Ready for a New ATH?",
    "url": "https://www.crypto-news-flash.com/breaking-blackrocks-etf-approval-streak-only-1-out-of-576-etf-applications-with-the-sec-was-dismissed-billions-of-dollars-to-flow-into-the-market-are-you-ready-for-a-new-ath/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-blackrocks-etf-approval-streak-only-1-out-of-576-etf-applications-with-the-sec-was-dismissed-billions-of-dollars-to-flow-into-the-market-are-you-ready-for-a-new-ath",
    "description": "BlackRock is said to have an incredible record in ETFs with 575 approved and one rejected application so far.  A Bloomberg analyst suspects that the company probably has a reason for applying at a point the SEC is likely to reject.  BlackRock, the world&#8217;s biggest asset manager, recently joined the likes of Grayscale and Ark [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-19T09:15:33.000Z",
    "title": "SEC Chair Gary Gensler Weaponizing Lack of Regulatory Clarity To Exert Jurisdiction Over Crypto: Ripple CEO",
    "url": "https://dailyhodl.com/2023/06/19/sec-chair-gary-gensler-weaponizing-lack-of-regulatory-clarity-to-exert-jurisdiction-over-crypto-ripple-ceo/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/of-Evidence-in-Ripple.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/of-Evidence-in-Ripple.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/of-Evidence-in-Ripple.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/of-Evidence-in-Ripple.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/of-Evidence-in-Ripple.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/of-Evidence-in-Ripple.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/of-Evidence-in-Ripple.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Ripple CEO Brad Garlinghouse is calling out the U.S. Securities and Exchange Commission (SEC), saying that the regulator has essentially weaponized a lack of regulatory clarity in crypto markets against the industry&#8217;s firms. In a video statement posted on Twitter, Garlinghouse comments on the recent reveal of internal emails relating to a 2018 speech delivered [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/19/sec-chair-gary-gensler-weaponizing-lack-of-regulatory-clarity-to-exert-jurisdiction-over-crypto-ripple-ceo/\">SEC Chair Gary Gensler Weaponizing Lack of Regulatory Clarity To Exert Jurisdiction Over Crypto: Ripple CEO</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]