[
  {
    "source": "Decrypt",
    "date": "2023-10-12T19:45:35.000Z",
    "title": "Melcogate: AI Blamed for Leaked Audio That Sparked Argentina Political Drama",
    "url": "https://decrypt.co/201268/melcogate-ai-blamed-for-leaked-audio-that-sparked-argentina-political-drama",
    "description": "Politicians in Argentina point fingers at AI for leaked audio used to allege a former central bank president of sexual harassment."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-12T20:04:36.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><h2>Trader swaps 131K stablecoins for $0 during USDR depeg</h2><p><a href=\"https://cointelegraph.com/news/usdr-stablecoin-depeg-liquid-dai-treasury-drain-redemption\">The USDR stablecoin depegged on Oct. 11</a> after users requested over 10 million stablecoins in redemptions. Despite being 100% backed, the majority of its assets were illiquid, tokenized real estate properties. This led to the coin’s depegging from the dollar and its decline to $0.53. </p><p>This surely represented a bad day for the USDR team and everyone holding the stablecoin, but one particular trader appears to have had a worse day than some. During the USDR depegging crisis, <a href=\"https://cointelegraph.com/news/trader-swaps-131k-stablecoins-0-during-usdr-depeg\">a trader appears to have swapped 131,350 USDR for exactly 0 USD Coin</a>. That’s a complete loss of investment and a contender for “worst-case-scenario” when it comes to panic-selling.</p><p>One unlucky trader swapped 131K stablecoins for $0 during the recent USDR depeg. Caroline Ellison, the star witness in the Sam “SBF” Bankman-Fried criminal trial, testified that the former FTX CEO tried to use identities linked to Thai sex workers to unfreeze funds before bribing Chinese officials for millions, as well as claiming he considered selling FTX equity to the crown prince of Saudi Arabia. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Due to the decoupling of the stablecoin USDR, this guy accidentally swapped 131,350 <a href=\"https://twitter.com/search?q=%24USDR&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USDR</a> for 0 <a href=\"https://twitter.com/search?q=%24USDC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USDC</a> while panic selling <a href=\"https://twitter.com/search?q=%24USDR&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USDR</a>.<br><br>And a MEV bot successfully arbitraged $107K.<a href=\"https://t.co/FHOJtaGcSD\">https://t.co/FHOJtaGcSD</a><a href=\"https://t.co/IYtoqar29N\">https://t.co/IYtoqar29N</a> <a href=\"https://t.co/USLF1qkVDK\">pic.twitter.com/USLF1qkVDK</a></p>&mdash; Lookonchain (@lookonchain) <a href=\"https://twitter.com/lookonchain/status/1712446623362760763?ref_src=twsrc%5Etfw\">October 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>Ellison testimony: SBF bribed Chinese officials for $150 million to unfreeze funds</h3><p>Ellison, SBF’s former romantic partner and former CEO of Alameda Research, claimed in her courtroom testimony that SBF bribed Chinese officials for millions of dollars to unfreeze funds locked in local exchanges. </p><p>Ellison said there was $1 billion in funds locked up in China and that to access them, Alameda paid a $150 million bribe to Chinese government officials.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">AUSA: How much was frozen in China?<br>Ellison: $1 billion. Sam wanted to find ways to address it. <br>AUSA: How were they unfrozen?<br>Ellison: Alameda paid a bribe to Chinese government officials<br>SBF: Objection, move to strike.<br>Judge Kaplan: I will strike that</p>&mdash; Inner City Press (@innercitypress) <a href=\"https://twitter.com/innercitypress/status/1712133691965636829?ref_src=twsrc%5Etfw\">October 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The funds, which belonged to Alameda Research, were frozen on the cryptocurrency exchanges Huobi and OKX following a 2021 money laundering probe opened by Chinese authorities.</p><p>Ellison testified that Bankman-Fried ordered her and other FTX employees to delete all related messages sent via the encrypted messaging app Signal.</p><p>However, before bribing Chinese officials, Ellison said they attempted to hire a local lawyer in China who could help with negotiations with the government.</p><p>After attempts with lawyers were unsuccessful, Ellison claimed that Bankman-Fried attempted to use wallets of “other people’s accounts” to unsuccessfully access the funds. This included what turned out to be Thai sex workers.</p><h3>DeFi not yet a “meaningful risk” to stability — EU market regulator </h3><p>(DeFi is <a href=\"https://cointelegraph.com/news/decentralized-finance-defi-meaningful-risk-financial-stability-eu-esma\">not yet a meaningful risk</a> to financial stability — but does need monitoring, says the European Securities and Markets Authority (ESMA).</p><p>In an Oct. 11 report, the regulator laid out the benefits and risks of DeFi but ultimately concluded it’s not currently a threat due to its small size and lack of correlation with other financial markets. </p><blockquote>“Crypto-assets markets, including DeFi, do not represent meaningful risks  to financial stability at this point, mainly because of their relatively small size and limited contagion channels between crypto and traditional financial markets.”</blockquote><p>The ESMA said the crypto market is about the same size as the European Union’s 12th-largest bank or just over 3% of the total assets held by EU banks.</p><p>The regulator claimed the crypto market blow-up in 2022, which saw multiple crypto firms and projects collapse, had “no meaningful impact on traditional markets.”</p><p>Despite investor DeFi exposure being small due to its “highly speculative nature,” there are still risks to investor protection, which ESMA warned may turn into systemic risks if DeFi gains traction or becomes more connected with traditional markets.</p><h2>SBF considered selling FTX equity to Saudi crown prince, says Caroline Ellison</h2><p>SBF considered asking for <a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-equity-saudi-crown-prince-mbs\">an investment from Saudi Crown Prince Mohammed bin Salman</a> in an attempt to raise equity for FTX, according to courtroom testimony from Ellison.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">One more Caroline Ellison courtroom sketch. <br><br>This one featuring SBF himself! <a href=\"https://t.co/q3O6xqxEhl\">https://t.co/q3O6xqxEhl</a> <a href=\"https://t.co/cQJbj5V1H7\">pic.twitter.com/cQJbj5V1H7</a></p>&mdash; Ariel Givner, Esq. (@GivnerAriel) <a href=\"https://twitter.com/GivnerAriel/status/1711915547074425195?ref_src=twsrc%5Etfw\">October 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>This testimony came during day six of the SBF’s criminal trial on Oct. 11. Ellison reportedly testified that she and the defendant discussed methods by which the two could hedge their investments in 2022. According to Ellison, the potential investment by Mohammed bin Salman was one of the notes mentioned in one of their online journals titled “Things Sam is Freaking Out About.”</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-12T20:00:00.000Z",
    "title": "Stars Arena recovers 90% of exploited funds after onchain negotiations",
    "url": "https://cointelegraph.com/news/stars-arena-recovers-90-exploited-funds-after-onchain-negotiations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/28c66f69-0fd6-42e2-ad91-825fe2c19551.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Stars Arena negotiated with the attacker over the course of four days, eventually recovering 90% of funds in exchange for an agreement not to prosecute.</p>\n                    <p><p>Social media app Stars Arena has <a href=\"https://twitter.com/starsarenacom/status/1712192197443883453\" target=\"_blank\" rel=\"noopener nofollow\">recovered</a> approximately 90% of the funds it lost after being exploited, according to an October 11 announcement from the team on X (formerly Twitter). The recovery occurred after four days of on-chain negotiations, blockchain data shows. The attacker was allowed to keep slightly more than 10% of the funds as a “white hat” bounty.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">UPDATE: <br> <br>We have recovered approximately 90% of the lost funds.<br><br>We reached an agreement with the individual responsible for the recent security breach.<br><br>The funds have been returned in exchange for a 10% bounty fee + 1000 AVAX that was lost in a bridge.<br><br>Total funds lost:…</p>— Stars Arena (@starsarenacom) <a href=\"https://twitter.com/starsarenacom/status/1712192197443883453?ref_src=twsrc%5Etfw\">October 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>StarsArena is a social media app on Avalanche that allows users to buy “shares” of their favorite content creators in exchange for exclusive content and other perks. It is often compared to Friend.tech, a similar app that runs on Base network.</p><p>Stars Arena <a href=\"https://cointelegraph.com/news/friend-tech-copycat-starsarena-patches-exploit-after-some-funds-drained\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/friend-tech-copycat-starsarena-patches-exploit-after-some-funds-drained/amp\">was exploited on October 5</a>. X user Lilitch.eth claimed that over $1 million was lost in the attack, while the developers of the app claimed that only around $2,000 worth of crypto was lost. The exploited smart contract was upgradeable, and the team patched the exploit and relaunched with new code on the day of the attack.</p><p>On October 7, address 0x96cefd23b3691d8cead413f2ec882e445fd0801e <a href=\"https://snowtrace.io/tx/0x13bd6ba51944120dd570ffdb2cd0c47993ba46b67a41237ccb1b26108a919d8d\" target=\"_blank\" rel=\"noopener nofollow\">sent</a> an onchain message to the attacker, stating “please return the funds to the contract address 0xA481B139a1A654cA19d2074F174f17D7534e8CeC we will give you 5% white hat bonus for doing that offer is valid until oct 10 only if you don't send we will have to take legal action against you.”</p><p>The address listed in the body of the message is the official Stars Arena: Shares contract, which seems to imply that the message was sent by the team. The attacker did not respond directly to this message. Instead, on October 11, they <a href=\"https://snowtrace.io/tx/0xec396c6eec19bb973351f6e327a441e2d8acf0a2184ca5ccfe2a16e89d2586ac\" target=\"_blank\" rel=\"noopener nofollow\">sent</a> a reply to a different address, stating “I would like to cooperate.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/339f1bad-8116-4730-9c9f-4b86585bcb16.png\"><figcaption style=\"text-align: center;\"><em>Message from Stars Arena exploiter, October 11. Source: SnowTrace.</em></figcaption></figure><p>A series of onchain messages occurred between the team and the attacker from this point forward. At one point, the team asked the attacker to respond using the Blockscan chat app, but the attacker <a href=\"https://snowtrace.io/tx/0x057ac16f024593b945db0011342b03ed99c33bd6784842f46e41fd00711e076c\" target=\"_blank\" rel=\"noopener nofollow\">replied</a> that the team had their antispam filter on and could not receive messages through Blockscan.</p><p>At 07:21 pm UTC, the team <a href=\"https://snowtrace.io/tx/0xa11ee12eb029c6584d5715f752ede192ab833cf1f0b2a3614b5129bc77327991\" target=\"_blank\" rel=\"noopener nofollow\">sent</a> a final message to the attacker. “We have agreed for a 10% bounty,” they stated. “The other half shall be sent, thus acknowledging this is a whitehat operation.” </p><p>At 7:43 pm UTC, the team announced on Twitter that the attacker had returned 90% of the stolen funds minus 1,000 Avalanche (AVAX) tokens that had been lost in a cross-chain bridge. According to the team’s post, 266,104 AVAX (approximately $2.4 million at today’s price) was originally drained from the app, but 239,493 AVAX (approximately $2.2 million) was recovered. This implies that more than 89.9% of stolen funds were recovered.</p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/700-m-loss-crypto-hacks-exploits-scams-q3-certik\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/700-m-loss-crypto-hacks-exploits-scams-q3-certik/amp\"><strong>Q3 2023 crowned most ‘damaging’ quarter for crypto amid $700M losses: Report</strong></a></p><p>Exploiters often drain funds from decentralized finance protocols, then return most of the funds in exchange for an agreement not to be prosecuted. Critics claim that these attacks <a href=\"https://cointelegraph.com/news/projects-would-rather-get-hacked-than-pay-bounties-web3-developer-claims\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/projects-would-rather-get-hacked-than-pay-bounties-web3-developer-claims/amp\">could be avoided</a> if protocols had more robust bug bounty programs with better payouts, as they say this could entice hackers into submitting legitimate bounties instead of attacking protocols. In September, blockchain security platform Immunefi <a href=\"https://cointelegraph.com/news/immunefi-launches-on-chain-bug-bounties-vaults-system\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/immunefi-launches-on-chain-bug-bounties-vaults-system/amp\">launched a ‘vaults’ bug-bounty program</a> in an effort to increase transparency, which it hopes will attract more hackers to legitimate bounty programs and away from illicit attacks.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-12T19:45:14.000Z",
    "title": "Voyager settles with FTC for $1.65B while CFTC charges former CEO with fraud",
    "url": "https://cryptoslate.com/voyager-settles-with-ftc-for-1-65b-while-cftc-charges-former-ceo-with-fraud/",
    "description": "<p>The U.S. Federal Trade Commission (FTC) announced on Oct. 12 that it has reached a settlement with the failed crypto lending company Voyager Digital. The FTC complained that Voyager falsely advertised U.S. dollar holdings as FDIC-insured, promised customers that their deposits were held safely, and offered incentives for converting crypto to USDC. However, Voyager&#8217;s customers [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/voyager-settles-with-ftc-for-1-65b-while-cftc-charges-former-ceo-with-fraud/\">Voyager settles with FTC for $1.65B while CFTC charges former CEO with fraud</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-10-12T19:48:57.000Z",
    "title": "MetaMask & Stripe Launch US Fiat On-Ramps",
    "url": "https://cryptobriefing.com/metamask-stripe-us-fiat-on-ramps/?utm_source=feed&utm_medium=rss",
    "description": "MetaMask partners with Stripe to offer US customers easy fiat-to-crypto purchases, expected to boost crypto adoption."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-12T19:50:00.000Z",
    "title": "Crypto Investors Trades 131,500 $USDR for Less Than 0.01 USDC as Real Estate Backed Crypto Depegs",
    "url": "https://www.cryptoglobe.com/latest/2023/10/crypto-investors-trades-131500-usdr-for-less-than-0-01-usdc-as-real-estate-backed-crypto-depegs/",
    "description": "A Polygon-based real estate-backed stablecoin called Real USD ($USDR) has lost over half of its value in a matter of hours after it was drained off of its liquid collateral, leaving only rental properties in the UK backing the cryptocurrency. According to on-chain data from the Tangible decentralized autonomous organization (DAO), the entity behind the […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-12T20:00:47.000Z",
    "title": "It ‘Felt Good’ to Come Clean — Caroline Ellison Reveals Intricacies of FTX Operations in Court Testimony",
    "url": "https://news.bitcoin.com/it-felt-good-to-come-clean-caroline-ellison-reveals-intricacies-of-ftx-operations-in-court-testimony/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/3amigosbw-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/3amigosbw-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/3amigosbw-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/3amigosbw-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/3amigosbw-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/3amigosbw-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/3amigosbw-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/3amigosbw.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a recent courtroom showdown, Caroline Ellison, the former CEO of Alameda Research, provided key insights into the operations of FTX and its alleged improprieties. Her revelations, documented by Inner City Press correspondent Matthew Russell Lee, could play a critical role in the ongoing fraud trial against Sam Bankman-Fried, the former CEO of FTX. Former [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-12T19:43:06.000Z",
    "title": "Parity Technologies decentralizes teams in Polkadot, refutes layoff rumors",
    "url": "https://crypto.news/parity-technologies-decentralizes-teams-in-polkadot-refutes-layoff-rumors/",
    "description": "Parity Technologies announces a strategic shift towards decentralization within the Polkadot ecosystem, dispelling rumors of laying off 300 employees. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-12T20:00:58.000Z",
    "title": "US Mega Bank JPMorgan Predicts Harsh Drop In This Bitcoin Metric",
    "url": "https://www.newsbtc.com/news/bitcoin/jpmorgan-drop-bitcoin-metric/",
    "description": "In a recent research report from JPMorgan, the financial firm has predicted a harsh drop for one Bitcoin metric, forecasting a potential decline of the Bitcoin Network Hash Rate by 20% leading up to the Bitcoin halving in April 2024. JPMorgan Expects Bitcoin Hash Rate To Drop In the report, JPMorgan stated that the Bitcoin mining industry is at a crucible stage leading all the way to the Bitcoin halving in April 2024 and beyond. This is because the approval of a Spot BTC exchange-traded fund (ETF) could spark a rally against the backdrop of record hash rates and the impending block reward halving that threatens the industry&#8217;s revenues and profitability. Related Reading: Bitcoin Supply Metric Touches New All-Time High, Time For Reversal? The report highlighted that the total four-year block reward opportunity is estimated at $20 billion, due to the current price of Bitcoin (BTC), which is 72% lower than its all-time high in 2021. This figure represents a significant drop from its peak of $73 billion in April 2021 and has fluctuated around $14 billion and $25 billion since the past year. As such, the financial firm expects the Bitcoin mining sector to see the predicted 20% hash rate drop at the next Bitcoin halving in April 2024. “We estimate as much as 80 EH/s (or 20% of the network hash rate) could be removed at the next halving (April ‘24) as less-efficient hardware is decommissioned,” the report reads. Bitcoin halving is an event that aims to control inflation and it involves the reduction of Bitcoin miners&#8217; rewards by half, and it takes place roughly every four years after miners solve 210,000 blocks.  BTC price still holding $26,800 &#124; Source: BTCUSD on Tradingview.com Analysts Reginald Smith and Charles Pearce noted in the report that the bank favors mining operators that can offer the best relative value in light of the existing hash rate, operational efficiency, power contracts, and more. JPMorgan chose Bitcoin mining company CleanSpark (CLSK) as its top pick among several companies listed by the firm, highlighting that the mining company offers the best balance of scale, growth potential, power costs, and relative value. In addition, the firm highlighted the significance of other mining firms it listed. These include Marathon Digital (MARA), Riot platforms (RIOT), and Cipher mining (CIFR). According to the firm, Marathon Digital is the largest mining operator, with the highest energy costs and lowest margins. Meanwhile, Riot has lower energy costs and liquidity, but Cipher has the lowest power costs with limited growth. Related Reading: XRP Price Prediction: Crypto CEO Delivers Bad News For The Altcoin The firm also included an outweight rating table and price targets of the mining operators in the report. The high cost of mining and the removal of inefficient hardware have been seen as some of the factors that tend to affect the Bitcoin mining industry. Large amounts of electricity are needed for mining, and at first, this makes it too expensive for miners to continue their operation. Nevertheless, many also tend to come back whenever the next bullish cycle drives Bitcoin&#8217;s price to unprecedented levels. Featured image from Shutterstock, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-12T20:00:32.000Z",
    "title": "Crypto Venture Firm Placeholder Capital Says Ethereum and Solana Are Like Android and iOS – Here’s Why",
    "url": "https://dailyhodl.com/2023/10/12/crypto-venture-firm-placeholder-capital-says-ethereum-and-solana-are-like-android-and-ios-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/venture-firm-ios.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/venture-firm-ios.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/venture-firm-ios.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/venture-firm-ios.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/venture-firm-ios.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/venture-firm-ios.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/venture-firm-ios.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A prominent crypto venture capital firm is comparing Ethereum (ETH) to the mobile operating system Android and Solana (SOL) to iOS. In a new blog post, Placeholder Capital makes a case for why Ethereum and Solana are comparable to the two different operating systems. “Ethereum and Solana are like Android and iOS. Android values modularity: [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/12/crypto-venture-firm-placeholder-capital-says-ethereum-and-solana-are-like-android-and-ios-heres-why/\">Crypto Venture Firm Placeholder Capital Says Ethereum and Solana Are Like Android and iOS – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-12T19:55:53.000Z",
    "title": "Trader Says Crypto Entering Final Stages of Bear Market, Examines a Weakening Bitcoin (BTC)",
    "url": "https://dailyhodl.com/2023/10/12/trader-says-crypto-entering-final-stages-of-bear-market-examines-a-weakening-bitcoin-btc/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/Bearish-Markets-To-Present.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/Bearish-Markets-To-Present.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/Bearish-Markets-To-Present.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/Bearish-Markets-To-Present.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/Bearish-Markets-To-Present.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/Bearish-Markets-To-Present.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/Bearish-Markets-To-Present.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader says digital assets are reaching the end of a bear market while breaking down Bitcoin (BTC). Crypto analyst Michaël van de Poppe tells his 668,300 followers on the social media platform X that the crypto markets might already be reversing. &#8220;The final stage of the bear market for crypto.  We might [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/12/trader-says-crypto-entering-final-stages-of-bear-market-examines-a-weakening-bitcoin-btc/\">Trader Says Crypto Entering Final Stages of Bear Market, Examines a Weakening Bitcoin (BTC)</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]