[
  {
    "source": "CoinDesk",
    "date": "2023-12-22T20:53:02.000Z",
    "title": "7 Real World Asset Trends in 2024 That Will Unlock the Future of Finance",
    "url": "https://www.coindesk.com/consensus-magazine/2023/12/22/7-real-world-asset-trends-in-2024-that-will-unlock-the-future-of-finance/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Stablecoins, tokenized treasuries, decentralized private credit, physical-backed NFTs, DeFi in climate and regenerative finance – these are just some of the trends set to remake capital markets in the coming year."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-22T20:44:50.000Z",
    "title": "The Unified Future of AI, Blockchain and Virtual Worlds in 2024",
    "url": "https://www.coindesk.com/consensus-magazine/2023/12/22/the-unified-future-of-ai-blockchain-and-virtual-worlds-in-2024/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Convergence is more than just a blending of technologies: It is a harmonization that enhances, expands, and redefines our experience of the digital world, says the co-founder of Decentraland Foundation."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-22T20:58:02.000Z",
    "title": " 2024 will be the year crypto investors get sophisticated with derivatives ",
    "url": "https://cointelegraph.com/news/2024-year-crypto-investors-get-sophisticated-derivatives",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMzUxYmI4ODktYTFkMS00ZTY5LTlkODItMDIyZjRkZWI2YjZhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Exotic options, structured products, and collateralized debt obligations will become increasingly lucrative options for crypto trading in 2024.</p>\n                    <p><p>During the 2017 bull run, <a href=\"https://cointelegraph.com/learn/initial-coin-offering\">initial coin offerings (ICOs)</a> were all the rage. The last bull market — in 2021 — was dominated by the growth of <a href=\"https://cointelegraph.com/defi-101/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> and yield farming. Now, as a fresh bull cycle gathers pace, 2024 will bring a breadth of more sophisticated financial products on-chain. From complex derivatives to structured products, big-boy instruments and traders will enter the digital-asset playground.</p><p>As we have seen with previous cycles, the crypto ecosystem tends to closely follow the traditional financial (TradFi) market. After all, Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) was first designed as an alternative payment system. ICOs even borrowed their name from TradFi's initial public offerings (IPOs), which date back to 1783. </p><p>Meanwhile, the DeFi ecosystem mimics traditional financial services, such as lending, borrowing, and yield generation, only in a decentralized manner. So it seems only natural that more complex financial vehicles should eventually get a Web3 makeover.</p><p><a href=\"https://cointelegraph.com/news/2024-year-crypto-investors-get-sophisticated-derivatives\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-22T20:46:58.000Z",
    "title": " Judge orders Craig Wright to pay over $1M, accepts new evidence over Satoshi’s identity  ",
    "url": "https://cointelegraph.com/news/judge-orders-craig-wright-pay-over-1-million-accepts-new-evidence-satoshi-identity",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvODVjNDk5NTktZGU5NC00MzRjLWE4NGItODk3ODdmN2YyYmZhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The trial between Craig Wright and Bitcoin Core developers was rescheduled for February following the discovery of new evidence.</p>\n                    <p><p>The legal battle over Satoshi Nakamoto’s identity and Bitcoin rights has taken another turn in recent days, with a British judge rescheduling the trial between Craig Wright and Bitcoin Core developers for Feb. 5.</p><p>In 2016, Wright claimed to be Satoshi Nakamoto, the inventor of Bitcoin (BTC), and sued 13 Bitcoin Core developers and a group of companies, including Blockstream, Coinbase, and Block, alleging violations of his copyright to Bitcoin's white paper, Bitcoin file format, and Bitcoin blockchain database. The group is represented in the case by the non-profit Cryptocurrency Open Patent Alliance (COPA).</p><p>On Dec. 15, during a pre-trial review, Justice Edward James Mellor allowed Wright to submit an additional 97 documents supporting his claim. The documents were allegedly found in two USB drives discovered in a drawer at his house in September, which included LaTex files — the open-source document preparation system used to draft the Bitcoin white paper.</p><p><a href=\"https://cointelegraph.com/news/judge-orders-craig-wright-pay-over-1-million-accepts-new-evidence-satoshi-identity\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-22T20:59:47.000Z",
    "title": "Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-22T21:00:14.000Z",
    "title": "Will Inscriptions On Polkadot Push DOT Prices Back Above $10?",
    "url": "https://www.newsbtc.com/altcoin/will-inscriptions-on-polkadot-push-dot-prices-back-above-10/",
    "description": "There has been a notable spike in the number of Polkadot transactions in recent days. The surge also coincides with DOT prices racing to new 2023 highs when writing on December 22. Taking to X, asynchronous rob noted that Polkadot is currently processing around 250,000 transactions per hour or 400-450 per block. Polkadot is a modern blockchain that aims to drive blockchain interoperability. Based on its design, relying on a Relay Chain and numerous Parachains, the network can process transactions cheaply, considering its high capacity. Polkadot Transactions Swelling: Blame Dota and Inscriptions The rapid expansion of transactions on Polkadot can be attributed to the recent launch of inscriptions, a new type of cross-chain asset developed by the Dota platform. Uniquely, Dota&#8217;s inscriptions aim to simplify the process of deploying and minting assets on Polkadot&#8217;s parachains.  Related Reading: Solana Flips BNB To Become 4th-Largest Crypto, Is Ethereum Next Though parachains operate independently as &#8220;chains&#8221; that rely on the Relay Chain for security, this design will eliminate the need for Cross-Chain Message Forma (XCM), which is needed for Polkadot parachains to communicate.  Usually, the XCM requires complex coding and can be time-consuming. Therefore, the simplicity of DOT-20 inscriptions by Dota directly explains why there is a surge in the number of transactions. According to Dota on X, inscriptions on Polkadot account for 98% of the recent transaction volume. Though there has been a change in the number of transactions processed, transaction fees on Polkadot remain low. At the same time, the network hasn&#8217;t &#8220;skipped a bit,&#8221; with capacity being around 10%.  By how Polkadot is designed, network fees will increase only once 25% of the total network capacity is changed. To reach this level, each block being confirmed on Polkadot must pack at least 1,250 transactions.  This will require even more inscriptions to be created via Dota, meaning despite the observed spike, Polkadot is technically underutilized from a bandwidth perspective. Will DOT Continue Rising In 2024? While the deluge of transactions also coincides with rising DOT prices, currently at 2023 highs, there have been concerns about inscriptions causing network congestion in a network like Bitcoin facing scaling challenges. Critics maintain that inscriptions, though defended by some, serve nothing more than spamming the network and discouraging use due to accompanying increases in transaction fees.  For now, it remains to be seen if inscriptions will be sustainable, helping onboard more users. So far, Polkadot, as mentioned, can handle the uptick in transactions. Related Reading: BONK Crashes 31% After A Solid Month – Is the Success Story Ending? Even so, if there is a 3X rise in transactions exceeding the 1,250 transactions per block threshold, the demand for DOT will rise. Subsequently, DOT will likely trend higher towards $10 and other critical resistance levels. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-22T21:00:00.000Z",
    "title": "South American Country of Nearly 46,000,000 Sanctions the Use of Bitcoin and Other Crypto Assets in Contracts",
    "url": "https://dailyhodl.com/2023/12/22/south-american-country-of-nearly-46000000-sanctions-the-use-of-bitcoin-and-other-crypto-assets-in-contracts/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/country-nearly-the-use.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/country-nearly-the-use.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/12/country-nearly-the-use.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/12/country-nearly-the-use.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/12/country-nearly-the-use.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/country-nearly-the-use.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/12/country-nearly-the-use.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A top official in Argentina says that the South American country will recognize contracts denominated in Bitcoin (BTC). According to Argentine Minister of Foreign Affairs, International Trade and Worship Diana Mondina, the law that sanctions the settlement of obligations in non-legal tender applies to the flagship cryptocurrency and other digital assets. “We ratify and confirm [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/22/south-american-country-of-nearly-46000000-sanctions-the-use-of-bitcoin-and-other-crypto-assets-in-contracts/\">South American Country of Nearly 46,000,000 Sanctions the Use of Bitcoin and Other Crypto Assets in Contracts</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-22T20:55:18.000Z",
    "title": "Crypto Trader Makes Bold Altcoin Market Cap Prediction, Breaks Down Polkadot (DOT) and Bitcoin (BTC)",
    "url": "https://dailyhodl.com/2023/12/22/crypto-trader-makes-bold-altcoin-market-cap-prediction-breaks-down-polkadot-dot-and-bitcoin-btc/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/04/altcoin-replacing-bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/04/altcoin-replacing-bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/04/altcoin-replacing-bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/04/altcoin-replacing-bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/04/altcoin-replacing-bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/04/altcoin-replacing-bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/04/altcoin-replacing-bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is diving deep into the altcoin markets, predicting what may lie ahead. Pseudonymous crypto trader Rekt Capital tells their 377,900 followers on the social media platform X that the market for all cryptocurrencies excluding the top 10 cryptos by market cap has seen obstacles in the past month. &#8220;Altcoin Market Cap [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/22/crypto-trader-makes-bold-altcoin-market-cap-prediction-breaks-down-polkadot-dot-and-bitcoin-btc/\">Crypto Trader Makes Bold Altcoin Market Cap Prediction, Breaks Down Polkadot (DOT) and Bitcoin (BTC)</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]