[
  {
    "source": "CryptoGlobe",
    "date": "2023-10-28T00:00:00.000Z",
    "title": "Bitcoin’s Fifth Bull Market Started and Could Take BTC’s Price to $125,000 by 2024, Matrixport Report Says",
    "url": "https://www.cryptoglobe.com/latest/2023/10/bitcoins-fifth-bull-market-started-and-could-take-btcs-price-to-125000-by-2024-matrixport-report-says/",
    "description": "A recently published report from Matricport suggests that the flagship cryptocurrency Bitcoin is now in its fifth bull cycle, and notably includes a BTC price prediction targeting $125,000 by the end of next year. Matrixport’s latest report details that the cryptocurrency has so far been through four bull market cycle, each driven by a new […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-28T00:00:41.000Z",
    "title": "SEC Considering 8-10 Spot Bitcoin ETF Applications, Says Chair Gary Gensler",
    "url": "https://news.bitcoin.com/sec-considering-8-10-spot-bitcoin-etf-applications-says-chair-gary-gensler/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/gensler-bitcoin-etfs-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SEC Considering 8-10 Spot Bitcoin ETF Applications, Says Chair Gensler\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/gensler-bitcoin-etfs-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/gensler-bitcoin-etfs-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/gensler-bitcoin-etfs-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/gensler-bitcoin-etfs-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/gensler-bitcoin-etfs-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/gensler-bitcoin-etfs-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/gensler-bitcoin-etfs.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.S. Securities and Exchange Commission (SEC) is currently considering between eight and 10 bitcoin exchange-traded fund (ETF) applications, according to SEC Chairman Gary Gensler. He insisted that &#8220;the vast majority of crypto assets likely meet the investment contract test, making them subject to the securities laws.&#8221; SEC Chair Gary Gensler on Spot Bitcoin ETFs [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-28T00:00:44.000Z",
    "title": "The Hidden Signals: Bitcoin’s On-Chain Data Points To Bullish Outlook, But There’s A Catch",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-on-chain-data-points-to-bullish-outlook-but-theres-a-catch/",
    "description": "Santiment, a leading blockchain intelligence platform, has recently provided insights pointing to a favorable short-term scenario for Bitcoin (BTC). However, according to other signals that seem &#8216;hidden,&#8217; there&#8217;s a catch. These on-chain metrics can serve as the north star for investors looking to strategize their next steps. However, according to another metric, though recent revelations by Santiment might hint at continued positive momentum for Bitcoin, there&#8217;s also a possible contrary move that could play out. Related Reading: Bitcoin’s Upcoming Leap? Analyst Predicts A Potential $45,500 Rise By November Bitcoin Sentiments Bullish On-Chain Indications Santiment&#8217;s recent post revealed a positive narrative for BTC&#8217;s immediate future. One of the key metrics supporting this bullish outlook is the significant number of active Bitcoin addresses. It is worth noting that an increase in active addresses can indicate enhanced adoption, investor interest, and overall network health. Furthermore, a surge in previously dormant tokens moving actively hints at a renewed trader interest. According to Santiment, such activity has often coincided with bullish trends, making this an essential metric to monitor. 👍 If you&#8217;re concerned about a #crypto retrace, note that #Bitcoin still maintains a high pace of active addresses. Additionally, the top market cap asset is seeing a high level of dormant tokens now moving, typically synonymous with #bullish conditions. https://t.co/bvjDL2Shga pic.twitter.com/NvxKkQpkg8 — Santiment (@santimentfeed) October 26, 2023 Given these disclosed metrics by Santiment, Bitcoin may still have more rallies to squeeze out. However, to add another layer of intrigue to the current market scenario is the behavior surrounding meme coins, especially PEPE. According to Onchain Capital co-founder and Crypto Banter host, Ran Neuner, meme coins, with their viral nature and swift price movements, sometimes act as a barometer for market sentiment, albeit unconventional. PEPE&#8217;s Performance: A Market Temperature Check? While Santiment&#8217;s report offers optimism, some market observers utilize unique indicators to sense potential market shifts. PEPE, a meme coin, has recently caught the attention of several prominent crypto figures. Ran Neuner recently mentioned that PEPE might act as an indicator of an overheated market. The logic? When traders and investors flock to such tokens, and they see significant price pumps, it might be a sign of excessive optimism in the market. An event to walk with caution. If you want to know when a pull back is coming, just watch $PEPE. It’s literally an index for when the market is getting overheated. When people are confident enough to go there and it pumps, that’s your sign to exit. Works every time. pic.twitter.com/vMcqiddHwp — Ran Neuner (@cryptomanran) October 26, 2023 Notably, PEPE has surged by more than 80% in the past week. The meme coin has soared from a low of $0.00000650 seen last Friday, to as high as $0.00000118 at the time of writing. Following the recent increase in price, PEPE is currently down 1.1% in the past 24 hours. Related Reading: PEPE Price Leaps 90% As Meme Coin Reaches Over 155,000 On-Chain Wallets Furthermore, in what seems to complement Neuner&#8217;s proposed indicator, Bitcoin has seen quite a notable retrace from its recent spike above $35,000. The asset currently trades at $33,620, at the time of writing down by 1.1% in the past hour. Featured image from ShutterStock, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-28T00:04:15.000Z",
    "title": "Major US Bank Refuses to Reimburse Customer After Criminal Caught on Camera Stealing Cash From Account: Report",
    "url": "https://dailyhodl.com/2023/10/27/major-us-bank-refuses-to-reimburse-customer-after-criminal-caught-on-camera-stealing-cash-from-account-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/dollar-bank-camera.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/dollar-bank-camera.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/dollar-bank-camera.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/dollar-bank-camera.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/dollar-bank-camera.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/dollar-bank-camera.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/dollar-bank-camera.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>One of the biggest banks in the US reportedly refused to reimburse a customer despite security footage showing a criminal stealing cash from an ATM. Then, the media got involved. Berkeley resident and Bank of America customer Kyle Fischer says he recently noticed money had mysteriously vanished from his account, and he promptly alerted the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/27/major-us-bank-refuses-to-reimburse-customer-after-criminal-caught-on-camera-stealing-cash-from-account-report/\">Major US Bank Refuses to Reimburse Customer After Criminal Caught on Camera Stealing Cash From Account: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-28T00:00:09.000Z",
    "title": "Pepe, Polygon, Fantom and Six Other Altcoin Rallies Could Continue, Says Analytics Firm Santiment – Here’s Why",
    "url": "https://dailyhodl.com/2023/10/27/pepe-polygon-fantom-and-six-other-altcoin-rallies-could-continue-says-analytics-firm-santiment-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/pepe-polygon-six-could.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/pepe-polygon-six-could.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/pepe-polygon-six-could.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/pepe-polygon-six-could.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/pepe-polygon-six-could.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/pepe-polygon-six-could.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/pepe-polygon-six-could.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A prominent market intelligence platform says that a handful of altcoins should continue to rally as traders continue to focus on Bitcoin (BTC) and Ethereum (ETH). In a new thread on the social media platform X, crypto analytics firm Santiment says that nine altcoins – including Polygon (MATIC), Decentraland (MANA), Fantom (FTM), and Pepe (PEPE) [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/27/pepe-polygon-fantom-and-six-other-altcoin-rallies-could-continue-says-analytics-firm-santiment-heres-why/\">Pepe, Polygon, Fantom and Six Other Altcoin Rallies Could Continue, Says Analytics Firm Santiment – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]