[
  {
    "source": "Cointelegraph",
    "date": "2023-06-30T06:18:01.000Z",
    "title": "Forget about price! Polkadot Decoded 2023 says bear markets are for building",
    "url": "https://cointelegraph.com/news/forget-about-price-polkadot-decoded-2023-says-bear-markets-are-for-building",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/a614576e-ca39-4f9f-9060-db1b1656a8a9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The mantra of this year’s Polkadot Decoded 2023 conference is to focus on building better products instead of worrying about token price. </p>\n                    <p><p>The Polkadot Decoded 2023 conference just wrapped up and this year more than 100 speakers and 100 blockchain projects were in attendance. </p><p>The beauty of crypto bear markets is they catalyze a realignment of perspectives and objectives. </p><p>All the hidden leverage is gone and most of the speculation is gone. </p><p>SBF is gone. </p><p>Do Kwon is gone. </p><p>Three Arrows Capital, Su Zhu, Kyle Davies and a handful of other hucksters and snake oil salesmen have been exiled.</p><p>And good riddance to all of them. Crypto doesn’t need hopium, messiahs, populists and dream peddlers. What we need are builders, fresh ideas, solutions that have product-to-market fit and some sort of realistic real world application. </p><p>That’s what I like about blockchain conferences. Especially during a bear market.</p><p>The buidl first mentality is the whole vibe of <a href=\"https://cointelegraph.com/press-releases/polkadot-decoded-showcases-boundless-innovation-and-visionary-leadership-throughout-the-ecosystem\">Polkadot Decoded</a>. For the past two days, a tightly knit community of ecosystem siblings composed of developers, investors, ambassadors and a few curious journalists such as myself rendezvoused at the Øksnehallen conference center which is tucked away from the bustling, cobblestoned streets of central Copenhagen, Denmark. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/5886f9cd-3f63-449d-baca-9b3ce1b46a13.png\"  /><figcaption style=\"text-align: center;\"><em>Polkadot Decoded 2023 at the Øksnehallen conference center. Source: Cointelegraph</em></figcaption></figure><p>The location is almost poetic given that it is a surprisingly quiet spot that is discreetly nestled within a thriving city center, and that ethos carried on through the conference events where the focus has been: </p><ul><li>Creating better interoperability between the projects in the Polkadot ecosystem;</li><li>Making the blockchain more welcoming to builders; and</li><li>Refining the cross-chain bridges that connect Polkadot to Ethereum, Cosmos and other blockchains. </li></ul><p>Hardly anyone is talking about airdrops, token prices, memecoins, Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) hitting a new all-time high or any of the general conversational fodder that forms the bulk of most crypto discussions. </p><h2>It’s bigger than a dollar sign</h2><p>Rather than price, panellists discussed the challenges and occasional successes of helping TradFi and Web2 companies transition into Web3, the steps being taken to make the VC funding of projects more transparent, and the need for all the crypto jargon and rigamarole to be placed on the backend of DApps and the frontend UX to be more seamless. </p><p>Many folks even suggested that “blockchain,” “crypto,” and “Web3” should not be mentioned on projects’ websites, apps, roadmaps and so on.</p><p>According to Public Pressure CEO Giulia Maresca:</p><blockquote>“I think it's not about talking about the technology because mass adoptees don’t know how the phone or Google maps or any technology is working. We need to create products that are really easy for the user, but given the benefit that they are built on Web3 tech. It should be really easy for the user; it shouldn’t be complicated. We shouldn’t talk about wallets, or bridging or doing complicated crypto things. People get scared the minute you start talking about wallets. It should be as easy as using Instagram.”</blockquote><p>Speaking of Web3 and the need for crypto to have a better product-to-market fit and connection to real-world assets, I moderated the opening panel at Polkadot Decoded, which focused on on-chain entertainment within music and film. It was an intriguing conversation, given that the general consensus among creators and builders is that music and film will be the most sticky when it comes to user growth, retention and mass application of NFTs within everyday life. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/4532628f-ece9-4772-b082-4606d5eb430f.jpg\"  /><figcaption style=\"text-align: center;\"><em>Polkadot Decoded panel on music and film in Web3. Source: Cointelegraph</em></figcaption></figure><p>During the panel, Maresca explained why she believes that there is a natural synergy between creative industries and Web3 ideology:</p><blockquote>“Web3 is a very socratic and creative space, and that aligns with the workflow and ideas of artists and creators.”</blockquote><p>Maresca also firmly believes that <a href=\"https://cointelegraph.com/explained/what-are-phygital-nfts-and-how-do-they-work#:~:text=Phygital%20NFTs%20allow%20buying%20and,customer%20retention%20for%20the%20business.\">phygital NFTs</a> and experiences will gain a firm foothold in the areas of fashion design, the film industry and all aspects of the music industry. </p><p>Providing a real-world example of how fashion labels like Diesel were making entry to the Web3 space,, Maresca explained: </p><blockquote>“Diesel would like to be more into Web3, so we’ve helped them to build a really strong concept using music at the center of their strategy, so Diesel acting like a discovery label, discovering emerging and breakthrough artists to give voice to their art. And they’ve done a few drops with us already which were really successful, but we’re planning a big drop at the beginning of September that is going to be a phygital drop. So, I think now a big part of the future is phygital; it is giving experience, utilities, what the community wants, which is to have a VIP experience. They want something from the brand, not only the garments. They want to be part of the Diesel family. It’s a long process and lots of education to the C-level, but there are a lot of opportunities for brands to work with the music community, to fans, and to new fans.” </blockquote><p>Ed Hill, senior vice president of media services at Beatport, emphasised that rather than being a mere buzzword, Web3 needs to become a tangible and actionable ideology within the corporate structure of the entertainment industry. </p><p>When asked about the disconnect between consumer desires, creators’ objectives and the products and experiences currently provided by the entertainment industry, Hill said: </p><blockquote>“That's a tough one to crack, but we have to go deeper and build better communities. If you look at YouTube and Facebook, those platforms are audience builders, and all anyone has cared about is views, and reach, and impressions and things like that. We have to go deeper into community building, and failure to do that is why younger audiences have been splitting away from traditional Web2 social media platforms, and I think, in time, if we build better, authentic communities from the ground up, that space between the corporate to creator to consumer gap begins to tighten.” </blockquote><p><em><strong>Related: <a href=\"https://cointelegraph.com/news/new-web3-id-app-lets-users-find-each-other-based-on-proven-interests\">New Web3 ID app lets users find each other based on proven interests</a></strong></em></p><h2>Community members are stakeholders, not just consumers</h2><p>From my vantage point, and that of most conference attendees, crypto is about community, and the most viable projects tend to have a very grassroots approach where community members are stakeholders and their desires factor into the direction of the project. Historically, every time the crypto sector strays from this ethos and falls victim to the whimsy of money chasers and demagogues, investors and community members are essentially robbed of their agency within the project. </p><p>In order for corporations to transition into Web3 in an authentic way that bears fruit, creators, consumers and community members have to be viewed as more than a simple proletariat within a system purely focused on spinning up revenue and co-opting culture and turning creator IP into corporate marketing trinkets. Crypto media should take note too, but I digress. </p><p>Similar sentiments, which culminated with an optimistic take on the future of Web3, were expressed by Define Creative founder Finn Martin, who said: </p><blockquote>“What gets me excited about Web3 is it offers all the tools and solutions to actually fix the problems that traditional Web2 has. By moving the assets on a chain, you can make it transparent for creators, you can give them direct revenue because, currently, the streaming model is broken. As a music creator, you own a fraction of a cent from each stream, and all of that can be addressed and solved via Web3.”</blockquote><h2>Blockchains should stop aspiring to be a jack of all trades </h2><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/aa930797-ced8-4cc4-addd-054e43d3d927.png\"  /><figcaption style=\"text-align: center;\"><em>Polkadot Decoded 2023 main stage. Source: Cointelegraph</em></figcaption></figure><p>Generally, vast blockchain ecosystems tend to have a disjointed feel where a multiplicity of objectives and philosophies have investors and advocates feeling lost at sea. These projects tend to struggle with clearly defining their purpose, and this has a knock-on effect of impacting market fit efficacy. </p><p>They basically still struggle with the age-old crypto problem, which entails creating solutions for problems that aren’t actually problems for normal people. What stands out most to me at Polkadot Decoded 2023 is a unified goal of making the chain easier to use for builders, investors and users. </p><p>Regardless of whether the project is an AMM, DEX, lending market, blockchain-gaming startup, IPFS storage solution or a cross-chain bridge, each panel has made some reference to the need for composability, interoperability and turning the concept of Web3 from a thought to reality by building our infrastructure for projects to thrive on. </p><p>Which is why I again emphasize the importance of getting out from behind the screen and TradingView token price action charts and into fellowship with the community at conferences. No man is an island, and there’s value in finding a safe space to socialize, ideate, test and refine one’s investment thesis and views on the evolution of blockchains. </p><p>Hat tip to Polkadot Decoded for having the right narrative on lock this year. </p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-30T06:17:08.000Z",
    "title": "Blockchain Australia CEO calls for unified efforts to stamp out crypto scams",
    "url": "https://cointelegraph.com/news/blockchain-australia-ceo-unified-efforts-combat-crypto-scams",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/4cfe51f7-cd2d-423a-a7f6-1600d6b6f0a1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Simon Callaghan said that efforts need to start on social media and telecommunication channels where most cryptocurrency scams originate.</p>\n                    <p><p>Blockchain Australia’s new CEO, Simon Callaghan, is urging Australia’s banks, the government and the crypto industry to come together to combat rising cryptocurrency scams.</p><p>Speaking on the final day of Australian Blockchain Week in Melbourne on June 30, Callaghan announced that the association will now be focused on helping prevent scams that involve crypto, <a href=\"https://cointelegraph.com/news/blockchain-australia-new-ceo-takes-aim-regulation-by-enforcement-united-states\">among its other efforts</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/85e93f4d-ce72-4e15-896d-96894adcc7da.jpg\"  /><figcaption style=\"text-align: center;\"><em>Simon Callaghan speaking at Australian Blockchain Week on June 30. Source: Cointelegraph</em></figcaption></figure><p>“We’re going to have to work with the banking sector. We’re going to have to work with the government,” the CEO said, stressing the need to protect consumers.</p><p>Callaghan however noted that <a href=\"https://cointelegraph.com/news/australian-banks-claim-40-percent-scams-touch-crypto\">scams often originate on social media</a> or through telecommunication channels — noting that policing efforts need to start from the point of first contact:</p><blockquote>“Crypto is either an exit point or minor piece in the lifecycle of the scam, the scam happens much further up the chain.”</blockquote><p>The CEO noted that few countries have managed to cooperate efficiently to combat cryptocurrency scams so far, but shared hopes Australia can break that barrier and set an example for other jurisdictions:</p><blockquote>“If we can take some leadership on that in Australia, I think we can certainly take that forward globally as well.”</blockquote><p>Cryptocurrency-related scams have been a headline issue in Australia over the past month. Since May, two of <a href=\"https://cointelegraph.com/news/commonwealth-bank-decline-limit-payments-to-high-risk-crypto-exchanges\">Australia’s largest banks</a> imposed restrictions or outright bans on certain payments made to cryptocurrency exchanges, citing the rising threat of scams. </p><p>The Australian government has also shown interest in tackling the issue, with the <a href=\"https://cointelegraph.com/news/australian-regulator-trials-auto-take-down-of-crypto-scam-sites\">Australian Competition and Consumer Commission</a> (ACCC) — the country’s consumer watchdog — set to open its National Anti-Scam Center on July 1.</p><p><a href=\"https://www.accc.gov.au/media-release/accc-welcomes-funding-to-establish-national-anti-scam-centre\" target=\"_blank\" rel=\"noopener nofollow\">According </a>to the ACCC, the NASC will collate expertise and resources to prevent scammers from making contact with Australians and to raise consumer awareness about how to avoid scams.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Blockchain Week Day 5 in Melbourne has kicked off with <a href=\"https://twitter.com/MikeBacina?ref_src=twsrc%5Etfw\">@MikeBacina</a>, Chair - Blockchain Australia. <a href=\"https://twitter.com/hashtag/BW2023?src=hash&amp;ref_src=twsrc%5Etfw\">#BW2023</a> <a href=\"https://t.co/sfD53BJyQJ\">pic.twitter.com/sfD53BJyQJ</a></p>&mdash; Blockchain Australia (@BlockchainAUS) <a href=\"https://twitter.com/BlockchainAUS/status/1674547041983410178?ref_src=twsrc%5Etfw\">June 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Trevor Power, an Australian Treasury assistant secretary, told Cointelegraph on June 26 that the Australian government is investing heavily into reducing scams and that cryptocurrency-related scams will be a focus for the NASC:</p><blockquote>“I think it has been pointed out that crypto at the moment is a significant vector for scams, and so obviously, it’s part of the center of their work; they will also be focusing on crypto.”</blockquote><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/crypto-debanking-could-drive-industry-underground-australia-treasury\"><strong>Crypto debanking could drive industry underground: Australian Treasury</strong></a></em></p><p>Earlier this week, Blockchain Australia <a href=\"https://blockchainaustralia.org/stopping-scams-blockchain-australia-roundtable/\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it planned on examining scam data collected from cryptocurrency exchanges and, from that, share the best practices for scam and fraud prevention. </p><p>Blockchain Australia is the peak industry body for blockchain in Australia. The body represents 111 blockchain-based firms operating in Australia, <a href=\"https://blockchainaustralia.org/memberslist/\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to the firm’s website.</p><p><em><strong>Magazine: </strong><a href=\"https://cointelegraph.com/magazine/inside-story-australias-proposed-world-leading-crypto-laws-crossroads/\"><strong>Australia’s world-leading crypto laws are at the crossroads: The inside story</strong></a></em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T06:31:14.000Z",
    "title": "Crypto market braces for weekend volatility with $5B BTC options set to expire",
    "url": "https://www.cryptopolitan.com/crypto-market-5b-btc-options-set-to-expire/",
    "description": "Historically, the crypto markets have suffered from weekend volatility. This weekend is no exception. A massive amount of Bitcoin options are slated to expire today, according to crypto market analysts, marking the largest bulk expiry in months. Derivatives trading fever has recently risen in response to many ETF registrations, but will speculators get burned? Crypto ... <a title=\"Crypto market braces for weekend volatility with $5B BTC options set to expire\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-market-5b-btc-options-set-to-expire/\" aria-label=\"More on Crypto market braces for weekend volatility with $5B BTC options set to expire\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-30T06:30:17.000Z",
    "title": "WebX Conference Welcomes Distinguished Guests: Japan PM, Yuga Labs CEO, Kabosu (Doge), Desdemona (AI Robot)",
    "url": "https://www.crypto-news-flash.com/webx-conference-welcomes-distinguished-guests-japan-pm-yuga-labs-ceo-kabosu-doge-desdemona-ai-robot/?utm_source=rss&utm_medium=rss&utm_campaign=webx-conference-welcomes-distinguished-guests-japan-pm-yuga-labs-ceo-kabosu-doge-desdemona-ai-robot",
    "description": " WebX, Asia&#8217;s leading Web3 conference (July 25-26), is thrilled to announce the participation of more esteemed guests at this year&#8217;s event: Japan prime minister Fumio Kishida, Yuga Labs CEO Daniel Alegre, the Dogecoin dog Kabosu, and the groundbreaking AI robot Desdemona (Made by Hanson Robotics, sister to Sophia the Robot). WebX is a conference dedicated [...]"
  }
]