[
  {
    "source": "CoinDesk",
    "date": "2023-06-08T14:57:00.000Z",
    "title": "Coinbase Shares Are Uninvestable in the Near Term: Berenberg",
    "url": "https://www.coindesk.com/markets/2023/06/08/coinbase-shares-are-uninvestable-in-the-near-term-berenberg/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The investment bank cut its price target on the stock to $39 from $55."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-08T14:49:07.000Z",
    "title": "Big Brands Exploring Web3 to ‘Scale Up Their Superfan Base’: SuperDuper Co-founder",
    "url": "https://decrypt.co/videos/live-events/he6UzJwz/big-brands-exploring-web3-to-scale-up-their-superfan-base-superduper-co-founder",
    "description": "Co-founder and co-CEO of Web3 media brand SuperDuper Dom Smith says big brands are eager to enter the space—they just don’t know how. Still, they all maintain a thesis of turning their communities into “super fans” that generate value for users as well as a firm’s bottom line."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T15:00:00.000Z",
    "title": "Subsocial chat program implements Ethereum usernames, Polygon donations",
    "url": "https://cointelegraph.com/news/subsocial-chat-program-implements-ethereum-usernames-polygon-donations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/b15698dd-d590-4758-9f93-5174c80ec85b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Despite running on a Polkadot parachain, Grill.chat lets users post using Ethereum wallets and send payments via Polygon.</p>\n                    <p><p>Grill.chat, a chat app based on the Subsocial network, has now implemented Ethereum Virtual Machine (EVM) wallet compatibility, allowing users to chat using their Ethereum identities and send crypto to each other via Polygon, according to a June 7 announcement.</p><p>Subsocial is a Polkadot parachain designed for social media applications. </p><p>Grill.chat allows users to participate in over 70 chat rooms focused on mostly crypto-related topics. The development team seeks to attract new Web3 projects to build their communities on the platform.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/20920762-f842-40c2-a215-04777da8ee31.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Polkadot Decoded chat room on Grill.chat. Source: Grill.chat</em></figcaption></figure><p>The integration means that users can now connect their Subsocial wallets to their EVM wallets by signing a transaction verifying that they are the wallet’s owner. This prevents them from needing to own SUB tokens to donate to other users, and it allows them to prove their Ethereum identities to users in chat rooms. In the future, the developers plan to use this integration to allow nonfungible token (NFT) collections to be shown to other users.</p><p>In a conversation with Cointelegraph, Subsocial CEO Zachary Edwards stated that Grill.chat is targeting crypto projects as potential sponsors of chat rooms. Currently, many crypto communities are built around Discord servers and Telegram channels. These channels cannot be integrated into the developer’s website, which means that users need to load a separate program to join the community or interact with it, creating what Edwards sees as unneeded friction for users.</p><p>By contrast, chat groups on Grill.chat can be integrated into a development team’s website or application interface. Edwards pointed to the example of Zeitgeist, a blockchain-based predictions market app. Its interface features a “chat” icon that opens directly into a Zeitgeist chat room on Grill.chat.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/20e5e8c1-f6da-4e92-884d-c1f4c856b904.png\"  /><figcaption style=\"text-align: center;\"><em>Zeitgeist user interface with Grill.chat window open. Source: Zeitgeist</em></figcaption></figure><p>However, the app’s users previously encountered friction from another source, Edwards said. Many of the biggest crypto projects are on EVM-based networks such as Ethereum, Polygon and Avalanche. Crypto users are accustomed to using wallets from these networks and don’t necessarily want to download a new wallet to use a chat app.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/magazine/decentralized-social-media-next-big-crypto-thing/\"><strong>Decentralized social media: The next big thing in crypto?</strong></a></em></p><p>To partially solve this problem, the team implemented a feature that lets users create a Subsocial wallet directly from the app’s interface. They also paid for users’ gas fees via a smart contract that can delegate signing privileges for a limited number of functions.</p><p>But this still didn’t completely solve the problem, as it siloed the user’s Ethereum identity from their Grill.chat posts. The team implemented EVM compatibility to make it easier for Ethereum users to switch to the app, Edwards explained.</p><p>“The cool thing is it's sort of using this off-chain signer technology because, at the end of the day, it’s all running on Substrate [Polkadot parachain technology], and EVM wallets aren’t compatible with Substrate,” Edwards stated. “But we can still connect those two accounts together so you can chat on the substrate chain, but your EVM account is linked, so you can have identity, donations, NFTs, all of this sort of stuff.”</p><p>Grill.chat isn’t the only social media app trying to entice crypto projects into building communities on it. OpenChat is a chat app on the Internet Computer network. Its team told Cointelegraph it’s working on a similar feature to show OpenChat chat rooms on a project’s website.</p><p>Web3 companies are racing to create a blockchain-based social media app that will see mass adoption. On April 26, the Polygon-based Lens network <a href=\"https://cointelegraph.com/news/web3-social-media-protocol-launches-layer-3-to-provide-instant-posts\">announced a new scaling solution</a> that it said would allow for “instant posts.” The same day, MeWe said it would <a href=\"https://cointelegraph.com/news/mewe-social-network-with-20m-users-to-integrate-with-polkadot-parachain\">move its 20 million users</a> to the Polkadot parachain network Frequency.</p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T15:06:14.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T15:02:14.000Z",
    "title": "ECB highlights dire economic consequences of biodiversity",
    "url": "https://www.cryptopolitan.com/ecb-dire-economic-consequences-biodiversity/",
    "description": "The European Central Bank (ECB) underscores the urgent economic implications of biodiversity degradation, far from the oft-criticized &#8220;flower power&#8221; pursuits. The direct correlation between economic sustainability and environmental conservation is the center of the discourse, according to ECB executive board member, Frank Elderson. Ecosystem Deterioration: A Threat to the Economy Elderson strongly counters the notion ... <a title=\"ECB highlights dire economic consequences of biodiversity\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ecb-dire-economic-consequences-biodiversity/\" aria-label=\"More on ECB highlights dire economic consequences of biodiversity\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T15:00:48.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T14:55:35.000Z",
    "title": "Social media giants face EU complaint over crypto ads",
    "url": "https://www.cryptopolitan.com/social-media-giants-face-eu-over-crypto-ads/",
    "description": "Under scrutiny, some of the world&#8217;s biggest social media platforms are on the brink of a showdown with the European Commission, spurred by a grievance lodged by the European consumer group, BEUC. Instagram, Twitter, TikTok, and YouTube, four giants in the industry, find themselves implicated in a dispute centered on accusations of deceptive advertising associated ... <a title=\"Social media giants face EU complaint over crypto ads\" class=\"read-more\" href=\"https://www.cryptopolitan.com/social-media-giants-face-eu-over-crypto-ads/\" aria-label=\"More on Social media giants face EU complaint over crypto ads\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T14:50:36.000Z",
    "title": "SEC’s selective justice takes hold on crypto – Gary Gensler on the deck",
    "url": "https://www.cryptopolitan.com/gary-gensler-on-crypto-selective-justice/",
    "description": "The SEC and its counterparts &#8211; particularly one man Gary Gensler, have proved to the financial world that reality is indeed stranger than fiction. Since the start of the crypto winter, the United States Securities and Exchange Commission (SEC) has had a visible hand in the crypto industry &#8211; and not in a positive light.&#160; ... <a title=\"SEC’s selective justice takes hold on crypto &#8211; Gary Gensler on the deck\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gary-gensler-on-crypto-selective-justice/\" aria-label=\"More on SEC’s selective justice takes hold on crypto &#8211; Gary Gensler on the deck\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T14:44:11.000Z",
    "title": "U.S government rejects Bitrex’s customer-repayment plan",
    "url": "https://www.cryptopolitan.com/u-s-government-rejects-bitrexs-customer-repayment-plan/",
    "description": "Bankrupt cryptocurrency exchange Bittrex finds itself entangled in a legal battle as it attempts to return customer funds in cash and cryptocurrency. The United States government, which is owed millions for sanctions violations, filed a court document opposing Bittrex&#8217;s proposal. The exchange&#8217;s U.S. arm filed for bankruptcy in May after facing allegations of operating an ... <a title=\"U.S government rejects Bitrex&#8217;s customer-repayment plan\" class=\"read-more\" href=\"https://www.cryptopolitan.com/u-s-government-rejects-bitrexs-customer-repayment-plan/\" aria-label=\"More on U.S government rejects Bitrex&#8217;s customer-repayment plan\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-08T15:02:40.000Z",
    "title": "SEC’s Continuous Irrelevant Move Against Crypto Could Hurt the United States",
    "url": "https://nulltx.com/secs-continuous-irrelevant-move-against-crypto-could-hurt-the-united-states/",
    "description": "In recent months, the SEC has filed lawsuits against several businesses, including Binance and Coinbase, as part of its tough stance against cryptocurrencies. This might have a negative influence on the United States in a number of ways. Ways SEC Can Hurt the U.S Via Its Attacks On The Cryptocurrency Space Hinder Innovation: It may [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-08T15:00:21.000Z",
    "title": "Chinese Crypto Market Heating Up, Quality ICOs See Investment Influx",
    "url": "https://nulltx.com/chinese-crypto-market-heating-up-quality-icos-see-investment-influx/",
    "description": "China has been among the global states that have rejected the crypto industry since its start. However, as time passed, the state agreed to ease restrictions on digital assets, although the government highly regulates them. Chinese Crypto Market Heat Up The Chinese environment hasn’t had an opportunistic time to have much of the crypto community [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-08T15:02:10.000Z",
    "title": "US judge revives crypto lawsuit against Kardashian and Mayweather",
    "url": "https://crypto.news/us-judge-revives-crypto-lawsuit-against-kardashian-and-mayweather/",
    "description": "Judge revives EMAX class action lawsuit against Kim Kardashian and Floyd Mayweather, accusing them of unlawful marketing in the cryptocurrency world.  The lawsuit had been dismissed just a while back."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-08T14:54:47.000Z",
    "title": "Australia’s largest bank suspends payments to crypto exchanges",
    "url": "https://crypto.news/australias-largest-bank-suspends-payments-to-crypto-exchanges/",
    "description": "Commonwealth Bank (CBA), the largest financial institution in Australia, has announced its decision to either halt or temporarily suspend payments to crypto exchanges due to the substantial risk of fraudulent activities. On June 8, CBA disclosed that it would reject&#8230;"
  },
  {
    "source": "Kraken Blog",
    "date": "2023-06-08T14:55:11.000Z",
    "title": "Kraken launches your gateway to the world of NFTs",
    "url": "https://blog.kraken.com/post/18898/kraken-launches-your-gateway-to-the-world-of-nfts/",
    "description": "<p>Since first opening Kraken NFT to beta testers, we’ve been building new features, adding more collections, and simplifying the NFT trading experience for all. Now, we’re pleased to announce that Kraken NFT is officially ready to launch. That’s right: we are no longer in Beta.&#8230;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.kraken.com/post/18898/kraken-launches-your-gateway-to-the-world-of-nfts/\">Kraken launches your gateway to the world of NFTs</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.kraken.com\">Kraken Blog</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-08T15:00:21.000Z",
    "title": "UK Financial Conduct Authority Clamps Down on Crypto Marketing",
    "url": "https://www.newsbtc.com/crypto/uk-fca-clamps-down-on-crypto-marketing/",
    "description": "The UK&#8217;s Financial Conduct Authority (FCA) recently proposed some strict new rules for how crypto companies can market their products and services to customers. If passed, the regulations would clamp down on misleading hype and unrealistic promises, requiring more transparency and balanced information.  According to a release by the FCA, the new rules, which will apply to first-time investors in the UK willing to purchase crypto assets, will require companies to introduce a cooling-off period from October 8, 2023. The FCA has also opened consultations regarding the matter until the 10th of August. New Rules For Firms Promoting Crypto Products Or Services Essentially, the FCA wants to treat cryptocurrencies as high-risk investments as part of its post-Brexit financial strategy revealed in February. In 2022 alone, the FCA forced firms to rectify 8,582 misleading promotions. The regulator is concerned that crypto newbies don&#8217;t fully understand the risks of these volatile, unregulated assets. With the value of major cryptocurrencies fluctuating wildly, those promoting crypto must also put in place clear risk warnings and ensure adverts are clear, fair, and not misleading.   Related Reading: Not Immune To FUD? Binance Sees $1.5 Billion In Outflows In 24 Hours According to the announcement, firms promoting crypto products or services will need to include a clear risk warning such as: ‘Don’t invest unless you’re prepared to lose all the money you invest. This is a high-risk investment and you should not expect to be protected if something goes wrong. Take 2 mins to learn more.’ A comprehensive set of guideline consultations will be published, and it will clarify the rules that companies must follow to make sure that advertisements regarding cryptocurrencies are not misleading. In addition, promotions that appear to attract crypto investors, such as ‘refer a friend’ programs, would no longer be allowed. The total market cap drops to $1.067 trillion &#124; Source: Crypto Total Market Cap on TradingView.com US Treasury Secretary Yellen Wants More Regulation Regulators from big powerful nations are continuing to look for legislation considering that there are no regulations in place to oversee the cryptocurrency industry. Despite this, there has been no significant development so far. Recently, Janet Yellen, the current Secretary of the United States Treasury and a former Chair of the Federal Reserve has voiced her concern over the lack of regulation in the cryptocurrency market. She contends that the United States Congress should be doing more to pass laws that will protect investors and curb illicit activity. Related Reading: Cardano (ADA) Declines As Market Recovers Amid Security Charges During an interview on CNBC&#8217;s Squawk Box, Yellen stated, &#8220;I see some holes in the system where additional regulation would be appropriate.&#8221; The era of unchecked crypto hype by companies may be coming to an end in the UK. While regulation could curb crypto crime and shield consumers, lawmakers need to be careful not to stifle innovation. The crypto market continues to grow rapidly, and many see digital assets as the future of finance. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-08T15:03:11.000Z",
    "title": "Solana’s Explosive Rise: Unleashing Web3’s Ambitious Messaging Platform ‘Dialect’ with SOL’s NFT Compression Power",
    "url": "https://www.crypto-news-flash.com/solanas-explosive-rise-unleashing-web3s-ambitious-messaging-platform-dialect-with-sols-nft-compression-power/?utm_source=rss&utm_medium=rss&utm_campaign=solanas-explosive-rise-unleashing-web3s-ambitious-messaging-platform-dialect-with-sols-nft-compression-power",
    "description": "<p>Dialect, a blockchain-based messaging service has rapidly garnered popularity on the Solana blockchain by capitalizing on the platform&#8217;s NFT compression capabilities.  Solana (SOL) is currently trading at $18.62, with a 24-hour decline of 7.01 percent. Solana implemented &#8220;state compression&#8221; on June 6 to enhance the storage of on-chain data, aiming for a more cost-effective and revolutionary [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/solanas-explosive-rise-unleashing-web3s-ambitious-messaging-platform-dialect-with-sols-nft-compression-power/\">Solana&#8217;s Explosive Rise: Unleashing Web3&#8217;s Ambitious Messaging Platform &#8216;Dialect&#8217; with SOL&#8217;s NFT Compression Power</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-08T14:39:33.000Z",
    "title": "SWIFT Partners with Chainlink in Billion-Dollar Market to Streamline Tokenized Asset Settlement",
    "url": "https://www.crypto-news-flash.com/swift-partners-with-chainlink-in-billion-dollar-market-to-streamline-tokenized-asset-settlement/?utm_source=rss&utm_medium=rss&utm_campaign=swift-partners-with-chainlink-in-billion-dollar-market-to-streamline-tokenized-asset-settlement",
    "description": "<p> Swift has announced that it will partner with prominent banks and Chainlink, to experiment with linking private and public permissionless blockchains. Chainlink will function as an enterprise abstraction layer to establish a connection between Swift and the Ethereum Sepolia networks. In a press statement released on Tuesday, the Society for Worldwide Interbank Financial Telecommunication (Swift) [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/swift-partners-with-chainlink-in-billion-dollar-market-to-streamline-tokenized-asset-settlement/\">SWIFT Partners with Chainlink in Billion-Dollar Market to Streamline Tokenized Asset Settlement</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-08T14:40:00.000Z",
    "title": "Short-Term Holders are Sending Their Bitcoins to Exchanges",
    "url": "https://coinedition.com/short-term-holders-are-sending-their-bitcoins-to-exchanges/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Holders-Sending-Bitcoins-to-Exchanges-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Holders Sending Bitcoins to Exchanges\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Holders-Sending-Bitcoins-to-Exchanges-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Holders-Sending-Bitcoins-to-Exchanges-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Holders-Sending-Bitcoins-to-Exchanges.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Glassnode data shows that more short-term holders are transferring their Bitcoins to exchanges. A Twitter post reveals that the current inflow metric on Glassnode recorded a 0.82% value. That is the highest it has reached since the beginning of April 2023. Despite the relatively high value of the metric, it remains low when compared with [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/short-term-holders-are-sending-their-bitcoins-to-exchanges/\">Short-Term Holders are Sending Their Bitcoins to Exchanges</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]