[
  {
    "source": "Cointelegraph",
    "date": "2024-03-13T02:02:35.000Z",
    "title": " Bitcoin price rollercoaster liquidates $360M from long and short sellers ",
    "url": "https://cointelegraph.com/news/bitcoin-price-swings-liquidate-360m-leverage-trades",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZmJhZWQ4YWYtYWNhNC00MzgyLTk0YTYtZGVjMTM5MDY1YmJkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>10x Research attributed the large liquidations to some traders anticipating a price correction, while others have fear of missing out (FOMO) that Bitcoin will keep rallying. </p>\n                    <p><p>Over $361 million worth of leveraged trades have been liquidated over the last 24 hours as Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) hit a new all-time high of $73,050 before falling back down below $70,000 on March 12.</p><p>The price swing mostly liquidated long positions — those betting it would rise — with $258 million erased, while short sellers were ousted a little over $103 million, <a href=\"https://www.coinglass.com/LiquidationData\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to data from crypto trading and information platform Coinglass.</p><p>It’s the largest long flush-out since March 5, when Bitcoin fell to $60,800 after notching its previous <a href=\"https://cointelegraph.com/news/bitcoin-price-sets-new-record-high-69k\">all-time high of around $69,000</a>.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-price-swings-liquidate-360m-leverage-trades\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-13T02:00:00.000Z",
    "title": " OKX gets in-principle approval for payment institution license in Singapore ",
    "url": "https://cointelegraph.com/news/okx-payment-license-approval-singapore-central-bank",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNzQ4NzBiMDItZGNkNC00NGEzLTg3Y2ItNDNiZTUzNmE0ZjcwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Major Payment Institution license will allow OKX to facilitate multiple payment services and exceed the transaction volume limitations set by Singapore’s financial regulator. </p>\n                    <p><p data-ct-non-breakable=\"true\">Crypto exchange OKX has acquired in-principle approval from Singapore’s financial watchdog for a Major Payment Institution (MPI) license through its local subsidiary, OKX SG. </p><p>In an announcement sent to Cointelegraph, OKX said it had already received the in-principle approval for the license. The MPI license is issued by the Monetary Authority of Singapore (MAS), the country’s principal financial regulator. After receiving the full license from MAS, OKX will be allowed to provide digital payment token services and cross-border transfers in the country. </p><p>OKX president Hong Fang said that Singapore was always a priority for the exchange in terms of its global strategy. The executive explained that Singapore attracts entrepreneurs venturing into new markets. “It’s a market of early adopters who are well-versed in technology.” Fang also described the country’s regulatory framework as “clear and thoughtful,” allowing businesses to “build better for the long-term.” </p><p><a href=\"https://cointelegraph.com/news/okx-payment-license-approval-singapore-central-bank\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-13T02:00:00.000Z",
    "title": "BlackRock’s iShares Bitcoin ETF Holdings Briefly Eclipse MicroStrategy’s Before Firm’s Latest 12,000 BTC Buy",
    "url": "https://www.cryptoglobe.com/latest/2024/03/blackrocks-ishares-bitcoin-etf-holdings-briefly-eclipse-microstrategys-before-firms-latest-12000-btc-buy/",
    "description": "BlackRock’s iShares Bitcoin ETF (IBIT), one of the spot Bitcoin exchange-traded funds approved by the SEC back in January, has seen its BTC holdings briefly surpass those of software firm MicroStrategy last week, before the Nasdaq-listed business intelligence firm bought more. According to a Friday disclosure, first reported on by ETF.com, IBIT now holds 195,985 […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-13T02:00:46.000Z",
    "title": "Washington Court Convicts Bitcoin Fog Founder of Aiding Darknet Drug Trade Money Laundering",
    "url": "https://www.newsbtc.com/bitcoin-news/washington-court-convicts-bitcoin-fog-founder-of-aiding-darknet-drug-trade-money-laundering/",
    "description": "In a recent development, the founder of “Bitcoin Fog,” a cryptocurrency-mixing service, was found guilty by a federal jury in Washington of helping to launder tens of millions of dollars from darknet markets notorious for illegal drug sales. Multi-Million Dollar Crypto Money Laundering Case According to a Bloomberg report, Roman Sterlingov, a 35-year-old Russian-Swiss national, was convicted by a jury on multiple counts, including conspiring to money launder, money laundering, and failing to register a money transmitting service. The prosecution argued that Bitcoin Fog facilitated over $400 million in untraceable transactions, with some funds originating from illicit markets. Related Reading: Crypto Institutional Investors Are Frontrunning Retail As Inflows Reach Record Highs The verdict not only marks another victory for the United States in its crackdown on crypto criminals but also sheds light on the role of Chainalysis, a Wall Street-backed firm utilized by the Justice Department and Treasury Department to trace cryptocurrency flows in money laundering cases. The defense raised concerns about the reliability of Chainalysis during the trial, questioning its methods and credibility. During the month-long trial, prosecutors presented evidence showing how they tracked the flow of crypto from darknet markets through Bitcoin Fog, which they claimed Sterlingov operated. The government also relied on testimony from other crypto criminals, including Ilya Lichtenstein and Larry Harmon, who testified about using mixers for money laundering purposes. Bitcoin Fog Founder Maintains Innocence Despite Conviction Sterlingov, who has consistently denied running Bitcoin Fog, testified that he allegedly worked in information technology and helped clients create domain names during his employment at a marketing and web firm.  Furthermore, Sterlingov claimed that he did not recall creating the Bitcoin Fog domain name or engaging in certain transactions referenced by the government. Defense attorney Tor Ekeland also claimed that there was no concrete evidence linking Sterlingov to the operation of Bitcoin Fog, emphasizing a lack of eyewitness accounts or server logs.  Ekeland also questioned the logic of using a secretive multi-step process to fund Bitcoin Fog when the initial transaction originated from an account registered in Sterlingov&#8217;s name. Sterlingov now faces a potential prison sentence of up to 20 years for the most serious charges.  Related Reading: Solana Demand Soars As Institutions Buy Up SOL At A Massive 870% Premium As of the latest update, Bitcoin, the largest cryptocurrency in the market, experienced a minor 2% correction, briefly dipping to $68,500 and temporarily falling below the significant $70,000 milestone. However, the cryptocurrency swiftly rebounded and is currently trading at $71,400 at the time of writing. Despite this temporary correction, Bitcoin has still exhibited notable gains of 11%, 25%, and 48% over the past seven, fourteen, and thirty days, respectively. These substantial increases propelled BTC to achieve its recent all-time high (ATH) of $73,000, which was reached on Monday. Featured image from Shutterstock, chart from TradingView.com "
  }
]