[
  {
    "source": "Decrypt",
    "date": "2023-11-21T23:01:10.000Z",
    "title": "What Will a Post-CZ Binance Look Like?",
    "url": "https://decrypt.co/206931/what-will-binance-be-like-without-ceo-cz",
    "description": "Market experts weigh in on how the embattled exchange moves forward—will Binance’s status fall without CZ at the helm?"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-21T22:42:00.000Z",
    "title": "Are Bitcoin ETFs good for adoption or ‘watered-down crypto’? Debate rages",
    "url": "http://cointelegraph.com/news/bitcoin-etf-adoption-or-watered-down-crypto-debate-rages",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/3d93cf16-6435-406f-8222-ee1a5c4f9a22.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>As hype builds for spot Bitcoin ETFs in the U.S., some are concerned the industry is moving away from the “core promise” of cryptocurrencies.</p>\n                    <p><p>CoinList founder Andy Bromberg believes that spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded funds (ETFs) are just “watered down crypto” and a sign the industry is heading in the wrong direction, amid growing hype over potential ETF approvals in the United States.</p><p>Bromberg — also CEO of payments-focused wallet app Beam — told Cointelegraph: “If a Bitcoin ETF is considered crypto, we’ve failed as an industry.”</p><p>He said a Bitcoin ETF would “absolutely” be a net positive for crypto adoption but asserted the space’s success comes from helping people self-custody assets and decouple from the traditional finance system — the antithesis of a TradFi ETF.</p><blockquote>“If crypto adoption happens mostly through ETFs and similar centralized financial instruments, then the core promises of the technology won’t be realized — decentralization and true ownership.”</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The rise of rollups &amp; account abstraction unlock the ability to build payment apps on Ethereum as good as — or better than  — web2 products.<br><br>Between self-custody&#39;s regulatory viability and that new tech, it&#39;s the right place to focus.<br><br>And it&#39;s what crypto is all about.</p>&mdash; Andy Bromberg (@andy_bromberg) <a href=\"https://twitter.com/andy_bromberg/status/1704574367345090930?ref_src=twsrc%5Etfw\">September 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Bromberg’s take is contrary to the prevailing sentiment of excitement around the potential for spot ETFs to bring in institutional money. Some predict ETFs could see <a href=\"https://cointelegraph.com/news/bitcoin-etfs-600-billion-tipping-point-crypto\">Bitcoin’s market capitalization double</a> and the price hit <a href=\"https://cointelegraph.com/news/bitcoin-btc-price-150k-after-halving-2024-prediction\">$150,000 by the end of 2024</a>. </p><p>CoinShares head of research James Butterfill told Cointelegraph that setting up a wallet for safe self-custody was still a daunting task for many non-tech-savvy institutional and retail investors. He believes an ETF will improve market access and will “help further democratize Bitcoin.”</p><p>“Self-custody simply isn’t possible for many institutional funds, as it steps outside the regulated framework they must operate in,” Butterfill said, adding that it’s also the case for some retail investors.</p><p>Matrixport research head and <em>Crypto Titans</em> author Markus Thielen agreed and argued the reason so much crypto remains on exchanges despite a string of collapses is because self-custody is “still problematic for most users and has clumsy interfaces.”</p><p>Bromberg conceded that self-custody has historically been a challenge but pointed to technology such as <a href=\"https://cointelegraph.com/learn/account-abstraction-guide-to-ethereums-erc-4337-standard\">account abstraction</a> — which allows for wallet creation without using a seed phrase and more recovery options if access is lost — as proof it was possible to make “mainstream-usable self-custody.”</p><h3>Institutional investors need legal clarity, not ETFs</h3><p>Bromberg thinks the real solution to giving institutional investors who want to hold crypto a way to do so lies in regulatory agencies providing legal clarity and the industry giving education on technology and products for institutions to comfortably self-custody.</p><p>“There are institutions that hold crypto on their balance sheet already, and others could follow,” Bromberg said.</p><p>Many public companies report crypto holdings, including <a href=\"https://cointelegraph.com/news/tesla-earnings-bitcoin-holdings-investment-ai-elon-musk\">car maker Tesla</a>, business intelligence <a href=\"https://cointelegraph.com/news/microstrategy-buys-5-4k-bitcoin-for-147million\">firm MicroStrategy</a> and a host of crypto miners — although it’s unknown what the custody arrangements are for most.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Whenever the spot bitcoin ETF is approved, we will see what the true global demand looks like for the investment asset.<br><br>Large institutions aren’t buying bitcoin for transactions, they will want exposure to the best store of value currently available.</p>&mdash; Pomp  (@APompliano) <a href=\"https://twitter.com/APompliano/status/1724059428163326318?ref_src=twsrc%5Etfw\">November 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Butterfill said ETF-based Bitcoin holdings would come under a regulatory purview that would “ensure high standards for custody.” He explained that some Bitcoin ETF providers could offer physical redemption, similar to some gold-backed ETFs.</p><h3>Wall Street suits won’t change Bitcoin</h3><p>Other Bitcoin advocates are concerned about the possible influence that massive asset managers such as BlackRock could have over the Bitcoin network. </p><p>In October, <a href=\"https://cointelegraph.com/magazine/peter-mccormack-twitter-regret-bitcoin-bedford-football/\">Bitcoiner Peter McCormack</a> <a href=\"https://www.youtube.com/watch?v=c3lihbLCWSs\" target=\"_blank\" rel=\"noopener nofollow\">told</a> Altcoin Daily that a BlackRock ETF would be “good for price but bad for Bitcoin” and expressed concern that it could end up the largest Bitcoin holder by way of its ETF.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The playbook:<br><br>1. BlackRock files for an ETF. <br><br>2. Retail buys <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> sending it higher in anticipation of being able to sell even higher to institutions who “gEt iN LaTe”.<br><br>3. BlackRock dumps on retail (you) after the pump.<br><br>4. BlackRock FUDs your bags back down so they can… <a href=\"https://t.co/SxBBKeAoI7\">https://t.co/SxBBKeAoI7</a></p>&mdash; SHELDON EVANS (@SheldonEvans) <a href=\"https://twitter.com/SheldonEvans/status/1724492520023892440?ref_src=twsrc%5Etfw\">November 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Butterfill said, however, that BlackRock would represent a “large and diverse set of clients” within a regulated structure, which is “very different to an individual or the control a government could exert if there were such a large holder.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/cantor-executives-crypto-lending-platform-tokenet-bitcoin-etf\"><strong><em>Ex-Cantor execs launch crypto lending platform in expectation of Bitcoin ETFs</em></strong></a></p><p>Trading volumes of existing Bitcoin exchange-traded products typically make up a maximum of 5% of total Bitcoin volumes daily, “so we have a very long way to go before ETPs could challenge the overall market,” he explained.</p><p>Thielen welcomed the possible new Bitcoin holders, saying BlackRock’s ETF would “open the door to thousands of institutional players” who he believes will use Bitcoin to replace “gold and other safe-haven assets such as Treasurys.”</p><p>He added that everybody has a right to own Bitcoin and that the cryptocurrency has become a speculative asset, mostly moving away from its peer-to-peer cash beginnings.</p><blockquote>“We should welcome ‘the suits’ from Wall Street to become promoters of Bitcoin. We can all benefit from it.”</blockquote><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/big-questions-did-the-nsa-create-bitcoin/\"><strong><em>Big Questions: Did the NSA create Bitcoin?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-21T22:53:00.000Z",
    "title": "Crypto Trader Turns $98 into a Staggering $1.1 Million in Just 90 Days",
    "url": "https://www.cryptoglobe.com/latest/2023/11/crypto-trader-turns-98-into-a-staggering-1-1-million-in-just-90-days/",
    "description": "A cryptocurrency trader that is being followed on-chain for its success has managed to turn around $98 worth of cryptocurrency into a massive $1.1 million in just over 90 days, an achievement that is verifiable on the blockchain and suggests deep market knowledge. The transformation of this trader’s wallet from a modest $98 to over […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-21T22:52:38.000Z",
    "title": "Binance Co-Founder CZ Announces Departure, Hands Reins to Richard Teng",
    "url": "https://www.cryptoglobe.com/latest/2023/11/binance-co-founder-cz-announces-departure-hands-reins-to-richard-teng/",
    "description": "In a move that shocked the crypto community earlier today, Binance co-founder Changpeng Zhao, widely known as “CZ,” stepped down as the company’s CEO, effective immediately. The decision comes as Binance navigates an increasingly complex regulatory landscape and seeks to further enhance its commitment to transparency and compliance. CZ, who has been at the helm […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-21T22:43:29.000Z",
    "title": "The crypto community reacts to CZ stepping down – He’s a LEGEND",
    "url": "https://www.cryptopolitan.com/crypto-reacts-to-cz-stepping-down-legendary/",
    "description": "Earlier today, Bloomberg published a report that Changpeng Zhao, alias CZ, the CEO of Binance, was looking to settle with the United States DOJ for $4 billion. Well, it is true. The US DOJ charged Binance, the world&#8217;s largest crypto exchange, for violating sanctions and money-transmitting laws. Binance has agreed to pay $4.3 billion to ... <a title=\"The crypto community reacts to CZ stepping down &#8211; He&#8217;s a LEGEND\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-reacts-to-cz-stepping-down-legendary/\" aria-label=\"More on The crypto community reacts to CZ stepping down &#8211; He&#8217;s a LEGEND\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-21T23:00:06.000Z",
    "title": "Did JPMorgan Secretly Buy 7.5 Million XRP? Here’s What We Know",
    "url": "https://www.newsbtc.com/analysis/xrp/jpmorgan-7-5-million-xrp/",
    "description": "The crypto rumor mills have been abuzz lately with talk of JPMorgan, a US megabank, secretly buying XRP tokens. This rumor has gained ground and in the course of its spread, has garnered the attention of the crypto community as they dissect it. JPMorgan Reportedly Buys 7.5 Million XRP The first reports of this rumor emerged after a news report citing a leaked report, claimed that the investment giant had actually bought 7.5 million XRP tokens. This rumor quickly made its way to social media where users on platforms such as X (formerly Twitter) have spread it widely. Related Reading: AVAX Open Interest Climbs 10.4% To $224 Million, Is $30 Possible? One of the most prominent reposts of the article includes that of Amelie, a German influencer with over 27,000 followers on X. As the rumors gain more popularity, it has also come under scrutiny due to its lack of evidence and the fact that the numbers do not add up. 🚨 JUST IN: BLACKROCK AND JPMORGAN PURCHASED OVER 7.5 MILLION #XRP https://t.co/dmQajvjhuk — 𝓐𝓶𝓮𝓵𝓲𝓮 🍭 (@_Crypto_Barbie) November 19, 2023 For example, one X user points out that the article says that the 7.5 million XRP reportedly bought by JPMorgan makes up 7.5% of its portfolio. However, this would mean that JPMorgan’s total portfolio would have to be worth $6.2 billion as opposed to its actual $440 billion value. Ludicrous. Look at this quote. &#8220;The leaked report, allegedly from an anonymous insider w/in JPM, reveals a significant revelation—the banking giant has quietly amassed over 7.5 M XRP, representing &#62;7.5% of its total wealth.&#8221; JPM is only worth $6.2B? It&#8217;s market cap is $440B — AgentSmith (@AgentSmithV3) November 19, 2023 There have also not been any official statements from JPMorgan about buying XRP or actually holding any cryptocurrency in their portfolio. Interestingly, JPMorgan actually launched its own JPM Coin which will reportedly be used to carry out $10 billion in daily transactions. Token price drops to $0.61 &#124; Source: XRPUSD on Tradingview.com Adding BlackRock To The Debate The rumors have also included BlackRock showing an interest in XRP but so far, there has been no indication that this is the case. The only time that BlackRock has been heavily mentioned around XRP communities is when a fake filing of a BlackRock XRP ETF showed up on the Delaware Corporation website. This fake filing has since been taken down and the Delaware authorities have reportedly begun their investigations to figure out the party or parties that were behind the fake filing. Related Reading: Cardano Falling Wedge Pattern: Analyst Predicts 100% Increase Following Breakout XRP influencer CryptoInsightUK also took to X (formerly Twitter) to debunk the rumors of BlackRock buying the token. He referred to it as a “stupid rumor” and that it is untrue, advising investors to not be distracted by the “noise.” Just FYI $XRP fam, there is a stupid rumour that Blackrock has bought 7.5 million $XRP. This is untrue. Focus up, things will get going again soon, don’t get dissuaded by noise. 🫡 — Cryptoinsightuk (@Cryptoinsightuk) November 20, 2023 Although JPMorgan and BlackRock are not going in on XRP, banks all around the world are reportedly trying to tap into the potential. A new report from the Basel Committee on Banking Supervision (BCBS) revealed that the token currently ranks third in the list of digital assets held by global banks. XRP reportedly makes up 2% of the 9.4 billion euros that these banks have invested in digital assets, meaning they hold around 188 million euros worth of XRP. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from InvestorsObserver, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-21T23:01:32.000Z",
    "title": "Circle Launches New ‘Bridged USDC Standard’ To Reduce Fragmentation Across Chains",
    "url": "https://dailyhodl.com/2023/11/21/circle-launches-new-bridged-usdc-standard-to-reduce-fragmentation-across-chains/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/executive-circle-asked-hearing.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/executive-circle-asked-hearing.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/executive-circle-asked-hearing.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/executive-circle-asked-hearing.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/executive-circle-asked-hearing.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/executive-circle-asked-hearing.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/executive-circle-asked-hearing.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The firm behind the second-largest dollar-pegged crypto asset by market cap is launching a new token standard for their stablecoin. According to a new announcement, Circle is introducing the Bridged USDC Standard, a new standard and process for deploying a bridged form of USDC on Ethereum Virtual Machine (EVM) blockchains. Circle says that the bridged USDC [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/21/circle-launches-new-bridged-usdc-standard-to-reduce-fragmentation-across-chains/\">Circle Launches New ‘Bridged USDC Standard’ To Reduce Fragmentation Across Chains</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]