[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T05:18:01.000Z",
    "title": "AI-Powered Traps Set to Revolutionize Predator-Free 2050 Mission in New Zealand",
    "url": "https://www.cryptopolitan.com/ai-powered-traps-predator-free-new-zealand/",
    "description": "In a pivotal step toward achieving the ambitious Predator Free 2050 goal, New Zealand is counting down 10,000 days to December 31, 2050, with a renewed vigor to eliminate the devastating predators threatening its native wildlife. Possums, mustelids (ferrets, stoats, weasels), and rats, collectively responsible for the loss of an estimated 25 million native birds ... <a title=\"AI-Powered Traps Set to Revolutionize Predator-Free 2050 Mission in New Zealand\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-powered-traps-predator-free-new-zealand/\" aria-label=\"More on AI-Powered Traps Set to Revolutionize Predator-Free 2050 Mission in New Zealand\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-15T05:34:24.000Z",
    "title": "Crypto scammers drained $3b from Australians in 2022",
    "url": "https://crypto.news/crypto-scammers-drained-3b-from-australians-in-2022/",
    "description": "The official report reveals that the hackers stole $3 billion from Australians in 2022 and over $38 million in June 2023 alone. According to an Australian Financial Crimes Exchange (AFCX) report, illicit actors and scammers funneled millions in stolen funds&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-15T05:29:25.000Z",
    "title": "Crypto Twitter doubts SBF’s ability to cope in jail",
    "url": "https://crypto.news/crypto-twitter-doubts-sbfs-ability-to-cope-in-jail/",
    "description": "Crypto Twitter is abuzz with speculations on how Sam Bankman-Fried would fare in jail. Recent buzz on Crypto Twitter has ignited speculation over how Sam Bankman-Fried (SBF), the founder of FTX, would handle potential incarceration. Adam Cochran took to his&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-15T05:18:28.000Z",
    "title": "XRP Price at Potentially Significant Turning Point, Key Support Nearby",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-turning-point-0-62/",
    "description": "Ripple’s token price is consolidating above $0.620 against the US Dollar. XRP price might start a decent increase if there is a clear move above $0.650. Ripple’s token price is moving lower from the $0.6650 resistance against the US dollar. The price is now trading below $0.65 and the 100 simple moving average (4 hours). There is a key bearish trend line forming with resistance near $0.628 on the 4-hour chart of the XRP/USD pair (data source from Kraken). The pair might continue to decline if there is no move above $0.63 and $0.65. Ripple’s Token Price Dips Again After a recovery wave, Ripple’s XRP struggled to clear the $0.6650 resistance against the US Dollar. A high was formed near $0.6654 before the price started a fresh decline, similar to Bitcoin and Ethereum. There was a move below the $0.650 pivot level. The price declined below the 50% Fib retracement level of the upward move from the $0.5926 swing low to the $0.6654 high. The price even declined below the $0.635 support zone. XRP is now trading below $0.65 and the 100 simple moving average (4 hours). There is also a key bearish trend line forming with resistance near $0.628 on the 4-hour chart of the XRP/USD pair. Initial resistance on the upside is near the $0.628 zone and the trend line. The next major resistance is near the $0.650 level and the 100 simple moving average (4 hours). The main resistance is now forming near the $0.6650 zone. Source: XRPUSD on TradingView.com A successful break above the $0.6650 resistance level might send the price toward the $0.70 resistance. Any more gains might call for a test of the $0.720 resistance. More Losses in XRP? If ripple fails to clear the $0.650 resistance zone, it could start another decline. Initial support on the downside is near the $0.620 zone and the 61.8% Fib retracement level of the upward move from the $0.5926 swing low to the $0.6654 high. The next major support is near $0.60. If there is a downside break and a close below the $0.60 level, XRP’s price could extend losses. In the stated case, the price could retest the $0.585 support zone. Technical Indicators 4-Hours MACD – The MACD for XRP/USD is now losing pace in the bearish zone. 4-Hours RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $0.62, $0.60, and $0.585. Major Resistance Levels – $0.628, $0.650, and $0.665."
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-15T05:27:46.000Z",
    "title": "AR, FIL Could Gain Big in the Next Bull Run, Predicts Analyst",
    "url": "https://coinedition.com/ar-fil-could-gain-big-in-the-next-bull-run-predicts-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/02-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"5 Tokens to Dominate the Altcoin Market in April: Crypto Analyst\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/02-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/02-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/02-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/02-3-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/02-3-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/02-3-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>An analyst from BitBoy Crypto by the name of AJ shared his predictions for Filecoin (FIL) and Arweave (AR) in a YouTube video uploaded over the past 24 hours. In the analysis, he predicted that FIL’s price could climb to between $36 and $55 in the next bull run, and also speculated that AR may [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ar-fil-could-gain-big-in-the-next-bull-run-predicts-analyst/\">AR, FIL Could Gain Big in the Next Bull Run, Predicts Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]