[
  {
    "source": "Decrypt",
    "date": "2023-06-07T19:18:41.000Z",
    "title": "SAG Head: AI Is a ‘Game Changer’ With Both Threats and Opportunities",
    "url": "https://decrypt.co/143723/sag-head-ai-is-a-game-changer-presenting-both-threats-and-opportunities",
    "description": "SAG-AFTRA members seek “informed consent and fair compensation” if AI is used to recreate an actor’s likeness."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-07T19:11:42.000Z",
    "title": "Price analysis 6/7: BTC, ETH, BNB, XRP, ADA, DOGE, MATIC, SOL, DOT, LTC",
    "url": "https://cointelegraph.com/news/price-analysis-6-7-btc-eth-bnb-xrp-ada-doge-matic-sol-dot-ltc",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/a43526a3-9066-496b-b0fd-f7e547ac518f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin and most major altcoins are facing selling at higher levels, but there are no signs of panic selling at the moment.</p>\n                    <p><p>Bitcoin and altcoins have been volatile in the past two days, as the cryptocurrency markets <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">come to terms with the actions</a> of the United States Securities and Exchange Commission (SEC) against <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">two of the biggest crypto exchanges</a>, Binance and Coinbase.</p><p>After the initial knee-jerk <a href=\"https://cointelegraph.com/news/bitcoin-og-keeps-faith-in-bull-market-as-btc-price-bounces-8\">reaction to the news and the subsequent rebound</a>, markets are likely to enter a range as traders reflect upon the uncertainty around the lawsuits. The initial response has been encouraging, as the markets have not collapsed, indicating the growing maturity of the crypto space.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/5ec1e477-062d-499d-915b-246568c31283.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><em>Coin360</em></figcaption></figure><p>Glassnode data shows a decline of 12,600 Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) from exchange balances on June 5 and 6, indicating that <a href=\"https://cointelegraph.com/news/what-asset-freeze-binance-btc-outflows-muted-as-users-shun-panic-selling\">traders kept their cool and did not panic</a> as they had done during the FTX episode in November.</p><p>What are the critical support levels to watch for on the downside? Will lower levels attract buyers? Let’s study the charts of the top 10 cryptocurrencies to find out.</p><h2>Bitcoin price analysis</h2><p>Bitcoin snapped back from the vital support at $25,250 on June 6, indicating that the bulls are trying to fiercely guard the level. However, the recovery is facing selling near the moving averages.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/45bf7f98-6880-4464-a2f4-d5d99e88c7c6.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bears will make another attempt to tug the price to $25,250. This remains the key level to keep an eye on because a break and close below it may open the doors for a potential fall to $20,000. Such a deep fall may delay the start of the next leg of the up move.</p><p>The bulls are expected to aggressively purchase the dips to the zone between $25,250 and the support line of the channel. On the upside, buyers will have to thrust the price above the resistance line of the channel to signal the end of the corrective phase. The BTC/USDT pair may then rally to $31,000.</p><h2>Ether price analysis</h2><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) dipped below the resistance line of the falling wedge pattern on June 5, but the bears could not build upon the strength. This shows demand at lower levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/8651e934-5e8f-4aec-b135-0feafffddb17.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bulls propelled the price back above the moving averages on June 6 but were met with heavy selling pressure from the bears. The sellers will again try to sink the price into the wedge. If they manage to do that, the ETH/USDT pair could extend the decline to the support line of the wedge.</p><p>On the contrary, if the price rebounds off the resistance line of the wedge, it will suggest that the bulls have flipped the line into support. Buyers will have to drive the price above $1,928 to start the northward march to $2,000 and subsequently to $2,200.</p><h2>BNB price analysis</h2><p>BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) plummeted sharply on June 5, which yanked the price below the strong support at $280. There was a meek attempt to start a recovery on June 6, but the bears did not allow the price to sustain above $280.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/53e94217-e0d9-408e-80e0-4a109826eab2.png\"  /><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The selling resumed on June 7, and the bears have dragged the price below the crucial support at $265. This is a negative sign, as it suggests the start of a new downward move to $240 and then to the vital support at $220.</p><p>If bulls want to make a comeback, they will have to push the price back above the breakdown level of $265. If they can pull it off, the BNB/USDT pair could pull back to $280 and later to the 20-day exponential moving average (EMA) of $299.</p><h2>XRP price analysis</h2><p>In an up move, traders generally buy the dip to the 20-day EMA ($0.49), and they did just that in XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) on June 5 and 6 as seen from the long tail on the candlesticks.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/b47bff18-7e00-4199-8d6d-dac8966faa8d.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: TradingView</em></figcaption></figure><p>However, the bears are not ready to give up easily. They continue to sell on rallies to the resistance zone between $0.56 and $0.59. If the price turns down sharply and breaks below the 20-day EMA, it will suggest that the bears want to keep the range between $0.30 and $0.56 intact.</p><p>Meanwhile, buyers are likely to have other plans. They will try to clear the overhead hurdle, and if they do that, it will indicate the start of a new uptrend. The XRP/USDT pair could rally to $0.60 and then to $0.80.</p><h2>Cardano price analysis</h2><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) tumbled below the uptrend line of the ascending triangle pattern on June 5, invalidating the bullish setup. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/243b6f2f-7245-43e2-b96b-f5655e321cc3.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bulls purchased the dip on June 5 but could not kick the price back inside the channel. This suggests that bears are trying to flip the uptrend line into resistance. The selling continued on June 7, and the bears yanked the price below $0.33. The ADA/USDT pair could descend to the strong support at $0.30.</p><p>On the upside, the first sign of strength will be a close inside the channel. Such a move will suggest that the break below the channel may have been a bear trap. The pair could attract strong buying above $0.39.</p><h2>Dogecoin price analysis</h2><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) broke below the immediate support at $0.07 on June 5 but rebounded sharply off the support near $0.06.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/b686f713-d3ed-42e1-852d-8908bccfff4f.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bulls tried to propel the price above the 20-day EMA ($0.07) on June 6, but the bears sold the rally. This indicates that the bears have not given up and they continue to sell near stiff resistance. The downsloping moving averages and the relative strength index in the negative territory indicate that bears have an edge. The bears will attempt to sink the price below $0.06.</p><p>If bulls want to make a comeback, they will have to push the price back above the 20-day EMA. The DOGE/USDT pair could then attempt a rally to $0.08.</p><h2>Polygon price analysis</h2><p>Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) slipped below the $0.82 support on June 6, but the bulls aggressively purchased the dip as seen from the long tail on the day’s candlestick.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/3017ce41-d663-4db6-9a3d-8c9936d9fdcf.png\"  /><figcaption style=\"text-align: center;\"><em>MATIC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>Buyers tried to sustain the price above the breakdown level of $0.82, but the bears had other plans. They sold aggressively on June 7 and pulled the price below the June 6 low of $0.79. This suggests the resumption of the downtrend. The MATIC/USDT pair could next drop to the strong support at $0.69.</p><p>If bears want to prevent the decline, they will have to quickly push the price back above $0.82. That may trap the aggressive bears, resulting in a short squeeze, which could push the price back toward $0.94. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ark-invest-buys-coinbase-shares-the-same-day-sec-serves-lawsuit\"><strong><em>ARK Invest buys Coinbase shares the same day SEC serves lawsuit</em></strong></a></p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) rebounded off the strong support at $18.70 on June 5 and 6 as seen from the long tail on the day’s candlesticks, but the bulls could not clear the hurdle at the 20-day EMA ($20.50).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/104932ce-6d41-4859-87d6-46813a8fd96d.png\"  /><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: TradingView</em></figcaption></figure><p>This indicates that the bears remain active at higher levels. If the price continues lower and breaks below the $18.70 support, the SOL/USDT pair may start a down move toward the next support at $15.28.</p><p>Alternatively, if the price rebounds off the current level or $15.28, it will indicate demand at lower levels. The bulls will then try to drive the price above $22.30. If they succeed, the pair may climb to $24 and later attempt a rally to $27.12.</p><h2>Polkadot price analysis</h2><p>Polkadot (<a href=\"https://cointelegraph.com/polkadot-price-index\">DOT</a>) collapsed below the crucial support of $5.15 on June 5 but bounced back sharply on June 6 and rose above the breakdown level.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/902c15cc-8c5b-447c-ad3a-d7110b56a921.png\"  /><figcaption style=\"text-align: center;\"><em>DOT/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bulls could not continue the recovery on June 7, as the bears sold the minor rally. Sellers will try to strengthen their position further by pulling the price below $4.90. If they manage to do that, the DOT/USDT pair may nosedive to $4.22.</p><p>On the upside, the first crucial resistance to watch out for is the 20-day EMA ($5.29). A rally above this level will be the first indication that the selling pressure may be reducing. The pair may pick up momentum above $5.56.</p><h2>Litecoin price analysis</h2><p>Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) plunged below the moving averages on June 5 and recovered sharply on June 6, but the bulls could not sustain the price above the 20-day EMA ($90). This suggests that bears are selling on rallies.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/acbec6ef-60b2-4cfe-9e37-51cad9e83fa7.png\"  /><figcaption style=\"text-align: center;\"><em>LTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bears will try to drag the price to the uptrend line. This is an important level for the bulls to defend because a break and close below it will signal the start of a potential downward move. The LTC/USDT pair could first fall to $75 and thereafter to $65.</p><p>Contrarily, if the price turns up from the current level or the uptrend line, it will suggest that the pair may remain stuck inside the triangle for a while longer. The bulls will have to catapult the price above the triangle to start the next leg of the up move.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-07T19:33:21.000Z",
    "title": "SEC filings reveal testimony of former Binance.US CEOs",
    "url": "https://cryptoslate.com/sec-filings-reveal-testimony-of-former-binance-us-ceos/",
    "description": "<p>The SEC&#8217;s complaint against Binance.US includes excerpts of testimony given to the regulator by two of the firm&#8217;s former CEOs, one of whom has been radio silent since stepping down in 2021. The filings contain portions of the testimony given by Catherine Coley and Brian Brooks about their experience in leading Binance.US and the main [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sec-filings-reveal-testimony-of-former-binance-us-ceos/\">SEC filings reveal testimony of former Binance.US CEOs</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-07T19:33:24.000Z",
    "title": "Litecoin (LTC) Price Watch: Daily Technical Analysis (LTC-USD) for 7 June 2023",
    "url": "https://www.cryptoglobe.com/latest/2023/06/litecoin-ltc-price-watch-daily-technical-analysis-ltc-usd-for-7-june-2023/",
    "description": "Introduction Litecoin (LTC) is a popular cryptocurrency known for its fast transaction confirmation times and low fees. In this daily technical analysis report, we will examine key indicators and interpret their values to provide insights into Litecoin’s potential price targets. Current Price: $88.6191 (as of 7:26 p.m. CT on 7 June 2023) Moving Averages Moving […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-07T19:10:51.000Z",
    "title": "Ethereum (ETH) Price Watch: Daily Technical Analysis Report for 7 June 2023",
    "url": "https://www.cryptoglobe.com/latest/2023/06/ethereum-eth-price-watch-daily-technical-analysis-report-for-7-june-2023/",
    "description": "Introduction Ethereum (ETH) is one of the leading cryptocurrencies, known for its smart contract functionality and decentralized applications. In this daily technical analysis report, we will examine key indicators and interpret their values to provide insights into Ethereum’s potential price targets. Current Price: $1,848.637 (as of 6:57 p.m. UTC on 7 June 2023) Moving Averages […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-07T19:30:16.000Z",
    "title": "The Bitcoin Rich List: An In-Depth Look at the Largest Bitcoin Wallets in Existence Since 2014",
    "url": "https://news.bitcoin.com/the-bitcoin-rich-list-an-in-depth-look-at-the-largest-bitcoin-wallets-in-existence-since-2014/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/btcwallet-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"The Bitcoin Rich List: An In-Depth Look at the Largest Bitcoin Wallets in Existence Since 2014\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/btcwallet-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/btcwallet-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/btcwallet-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/btcwallet-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/btcwallet-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/btcwallet-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/btcwallet.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Over the past decade, several bitcoin wallets have been named the largest in existence. However, since 2021, Binance has controlled the largest bitcoin address, which currently holds 248,597 BTC and is worth approximately $6.66 billion. Just over nine years ago, the largest wallet belonged to the U.S. government after it seized 144,342 BTC from the [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-07T19:32:22.000Z",
    "title": "Sequoia Capital to divide global business into multiple parts",
    "url": "https://crypto.news/sequoia-capital-to-divide-global-business-into-multiple-parts/",
    "description": "Sequoia Capital, a venture capital firm, revealed its plans for a upcoming split, where it will divide into three separate partnerships catering to the United States, China, and Asian markets."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-07T19:25:12.000Z",
    "title": "Shiba Inu Nears Massive Price Explosion as 338 Billion Tokens Accumulated, with Shibarium on the Horizon – Will SHIB Eliminate More Zeros? Report",
    "url": "https://www.crypto-news-flash.com/shiba-inu-nears-massive-price-explosion-as-338-billion-tokens-accumulated-with-shibarium-on-the-horizon-will-shib-eliminate-more-zeros-report/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-nears-massive-price-explosion-as-338-billion-tokens-accumulated-with-shibarium-on-the-horizon-will-shib-eliminate-more-zeros-report",
    "description": "<p>Shiba Inu remains the delight of big investors with accumulations topping 338 billion SHIB tokens. The sustained accumulation can help erase a zero in the mid to long-term. Shiba Inu (SHIB), the famous dog-inspired memecoin, is seeing a noticeable shift in market dynamics, with the tide appearing to be turning in favor of the Ethereum-based [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/shiba-inu-nears-massive-price-explosion-as-338-billion-tokens-accumulated-with-shibarium-on-the-horizon-will-shib-eliminate-more-zeros-report/\">Shiba Inu Nears Massive Price Explosion as 338 Billion Tokens Accumulated, with Shibarium on the Horizon &#8211; Will SHIB Eliminate More Zeros? Report</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-07T19:19:43.000Z",
    "title": "Blockchain Breakthrough: Tether (USDT) Ousts SWIFT for USD Transfers in Major Bank, Paving the Way for a New Era of Financial Revolution",
    "url": "https://www.crypto-news-flash.com/blockchain-breakthrough-tether-usdt-ousts-swift-for-usd-transfers-in-major-bank-paving-the-way-for-a-new-era-of-financial-revolution/?utm_source=rss&utm_medium=rss&utm_campaign=blockchain-breakthrough-tether-usdt-ousts-swift-for-usd-transfers-in-major-bank-paving-the-way-for-a-new-era-of-financial-revolution",
    "description": "<p>Xapo Bank has integrated Tether payment rails instead of SWIFT for funds transfer. The move is set to stir a new era of financial revolution. In a groundbreaking development, the world of finance has witnessed a shift as Tether (USDT), the popular stablecoin, has ousted SWIFT for USD transfers in Xapo Bank. Building on its [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/blockchain-breakthrough-tether-usdt-ousts-swift-for-usd-transfers-in-major-bank-paving-the-way-for-a-new-era-of-financial-revolution/\">Blockchain Breakthrough: Tether (USDT) Ousts SWIFT for USD Transfers in Major Bank, Paving the Way for a New Era of Financial Revolution</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]