[
  {
    "source": "Decrypt",
    "date": "2023-08-15T22:37:07.000Z",
    "title": "Google and iCAD to Harness AI in Cancer Detection and Care",
    "url": "https://decrypt.co/152630/google-health-icad-ai-cancer-profound-detection",
    "description": "Artificial intelligence can drastically increase the efficiency of cancer screening methods, sparking a joint effort between iCAD and Google."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-15T22:15:09.000Z",
    "title": "Illuvium's collapsing token represents the problems with GameFi",
    "url": "https://cointelegraph.com/news/illuvium-collapsing-token-problems-gamefi",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/2b974806-e9ac-49f4-a112-181a467584e8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>GameFi developers have been focused on raking in money — and they've forgotten that they need to make games fun in order to win over players.</p>\n                    <p><p>Blockchain games began as a means to effectively test technology’s true potential. However, making sure they reach that potential remains a challenge. While <a href=\"https://cointelegraph.com/learn/how-to-play-the-illuvium-ilv-game-a-beginners-guide\">Illuvium</a> was one of the most highly anticipated crypto game releases in history, the price of its ILV token has fallen significantly since 2021 — to the tune of 97%.</p><p>The project’s developers have not released anything substantial for quite some time. The immersive gameplay and impressive graphics are not enough to stop the game’s token from plummeting. The same can be said of most GameFi tokens.</p><p><a href=\"https://cointelegraph.com/learn/a-beginners-guide-to-the-gamefi-ecosystem\">Blockchain games</a> have been largely underwhelming to date because they do not focus enough on ensuring a quality user experience. Ultimately, the task of creating these games is underestimated. When GameFi emerged, it had a lot of potential, but it has been largely underwhelming. It’s not an easy task to build quality AAA games (those released by top publishers). It is a complex, expensive process with intense competition. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/2023-will-see-the-death-of-play-to-earn-gaming\"><strong><em>2023 will see the death of play-to-earn gaming</em></strong></a></p><p>Developers and publishers are now also engaging in many tired tropes and poor practices. Many games have been rushed or poorly designed. Some have featured no meaningful entertainment value, and the earning potential is the only reason people play them. This is usually due to a lack of budget or rushing out unfinished games. Additionally, some companies have released games that do not match the gameplay in the trailer, causing players to lose trust in the industry.</p><p>With all this in mind, it’s fair to say that many of these games may not prioritize their players. Audiences wait months for the arrival of new games — only to find that they are low quality, poorly designed and lacking in entertainment.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Illuvium: Overworld is still beautiful on the low settings of my laptop. <a href=\"https://twitter.com/illuviumio?ref_src=twsrc%5Etfw\">@illuviumio</a> <a href=\"https://twitter.com/hashtag/Illuvium?src=hash&amp;ref_src=twsrc%5Etfw\">#Illuvium</a> <a href=\"https://twitter.com/hashtag/web3game?src=hash&amp;ref_src=twsrc%5Etfw\">#web3game</a> <a href=\"https://t.co/6AGu5tcC2W\">pic.twitter.com/6AGu5tcC2W</a></p>&mdash; Gringo HodL // (@GringoHodl) <a href=\"https://twitter.com/GringoHodl/status/1691357741359439873?ref_src=twsrc%5Etfw\">August 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Illuvium raised funds by issuing its ILV token and selling land <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a> for <a href=\"https://cointelegraph.com/news/72m-illuvium-nft-land-dutch-auction-saves-buyers-thousands-on-gas-fees\">$72 million before the game’s launch</a>. Despite this, the public beta launch is being delayed. This highlights one major disadvantage of AAA games: Focusing on earning can potentially take the enjoyment out of the game. The very same issues occurring with Illuvium are happening with other AAA blockchain game projects. </p><p>Pixelmon stands out when discussing AAA blockchain game projects that did not meet the mark. The play-to-earn game inspired by Minecraft, Fortnite and Pokemon sold a collection of 10,000 NFTs in 2022, earning approximately $70 million simply from hype — but then the game’s launch <a href=\"https://cointelegraph.com/news/nifty-news-one-nft-per-human-in-existence-and-the-pixelmon-controversy\">failed all expectations from players</a>. Some characters were standard Unity models, and one user got an invisible character. This was not the sort of project that was worth $70 million. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/caf6e6e2-3433-4b5b-a2ca-28164d359855.jpg\"  /><figcaption style=\"text-align: center;\">Players weren't impressed by Pixelmon's $70 million valuation. Source: Twitter</figcaption></figure><p>Developers could prioritize unsustainable economic models over implementing features to create a more exciting experience for players. This has been a trend in the GameFi market, neglecting engaging gameplay.</p><p>In Illuvium’s tokenomics, 45% is set aside for the team and investors. Just 10% is assigned to game rewards, a minuscule figure compared with the investors’ share. All of the token investors’ allocations will be available and can be sold before the game’s launch, meaning the Illuvium team and investors have the benefit of an early exit. </p><p>With these kinds of games, there is a massive risk of losing money. Users might have to spend long periods in the game before they receive any significant monetary return. It should also be noted that token prices fluctuate rapidly.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/gamefi-investors-should-get-ready-for-a-big-us-crackdown\"><strong><em>GameFi developers could be facing big fines and hard time</em></strong></a></p><p>With blockchain gaming, there is also a high cost of entry — greatly hindering the mainstream adoption of GameFi. There must be additional value added other than a monetary return that takes significant time to build up. The user experience needs to be rectified. This factor not only turns off players but also investors. The ultimate purpose of token issuance is to increase its value with the team, investors and players.</p><p>However, with Illuvium, there is a risk for retail investors and players, given that 45% of the tokens could face selling pressure before the game even launches. Token investors have an incentive to sell when the demand for ILV rises, but this is at odds with game players, who are hoping for a decent return on investment from playing the game. </p><p>So far, Illuvium is profiting from the buzz generated by tokens and NFTs — and retail players and investors bought the excitement — but it has not yet shown real value. The game’s “token first, make the allocations available, and game later” strategy creates a situation where investors and players have diverging interests. The game was primarily made for investors rather than gamers.</p><p>While it has some impressive designs and ideas, the game is still missing a lot of features, and there is significant room for improvement.</p><p>Investors represent too many of the game’s users, making its success a product more of marketing than the quality of the game. Illuvium’s current nature is akin to an initial coin offering project, hyping the creation of an AAA blockchain title that hasn’t been delivered. Even if a $100 million title is successfully produced, the question remains: <em>Are there enough blockchain gamers to support it?</em></p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Takuya Tsuji</strong> is the founder of Eureka Entertainment Ltd, a gaming company set to release an upcoming blockchain game, Coin Musme. He previously founded Techcross Inc, a company he established in 2009 as a student at the University of Tokyo and grew to $70 million in annual sales. He also worked as a top developer on DMM Games, a gaming platform in Japan, and has been involved in the development of more than 50 game titles.</div></div><p class=\"post-content__disclaimer\"><em>The opinions expressed are the author’s alone and do not necessarily reflect the views of Cointelegraph. This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-15T22:30:22.000Z",
    "title": "Trove of evidence against Sam Bankman-Fried includes Caroline Ellison-authored document, ‘Things Sam is Freaking Out About’",
    "url": "https://cryptoslate.com/trove-of-evidence-against-sam-bankman-fried-includes-caroline-ellison-authored-document-things-sam-is-freaking-out-about/",
    "description": "<p>U.S. government prosecutors have moved to admit and exclude specific evidence in the case of former FTX CEO Sam-Bankman Fried in an Aug. 14 filing. Caroline Ellison&#8217;s statements could become evidence In the relevant filing, prosecutors asserted that communications from Bankman-Fried&#8217;s associates should not be excluded as hearsay. Notably, prosecutors plan to include a note [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/trove-of-evidence-against-sam-bankman-fried-includes-caroline-ellison-authored-document-things-sam-is-freaking-out-about/\">Trove of evidence against Sam Bankman-Fried includes Caroline Ellison-authored document, &#8216;Things Sam is Freaking Out About&#8217;</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-15T22:23:00.000Z",
    "title": "Bloomberg Analyst Explains the Hurdles for an $XRP ETF in the US",
    "url": "https://www.cryptoglobe.com/latest/2023/08/bloomberg-analyst-explains-the-hurdles-for-an-xrp-etf-in-the-us/",
    "description": "In a recent conversation on Tony Edward’s Thinking Crypto Podcast, James Seyffart, Bloomberg’s well-known exchange-traded fund (ETF) analyst, has suggested that before an $XRP ETF could materialize, he Chicago Mercantile Exchange (CME), one of the foremost derivatives exchanges globally, needs to list XRP futures. The move, he suggested, would pave the way for a smoother […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T22:43:03.000Z",
    "title": "Morocco officially submits application to join BRICS",
    "url": "https://www.cryptopolitan.com/morocco-submits-application-to-join-brics/",
    "description": "As the global economic stage buzzes with anticipation for the upcoming BRICS summit, Morocco has strategically positioned itself by tossing its hat into the ring. Eager to align with powerhouses like Brazil, Russia, India, China, and South Africa, the North African nation has formally expressed its interest to join the expanding economic alliance. But, as ... <a title=\"Morocco officially submits application to join BRICS\" class=\"read-more\" href=\"https://www.cryptopolitan.com/morocco-submits-application-to-join-brics/\" aria-label=\"More on Morocco officially submits application to join BRICS\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T22:33:48.000Z",
    "title": "Coinbase features lawmaker with ethics violations in initiative",
    "url": "https://www.cryptopolitan.com/coinbase-features-lawmaker-ethics-violations/",
    "description": "Coinbase, the well-known U.S.-based cryptocurrency exchange, made a perplexing choice recently. In their latest initiative, which seeks to embolden crypto enthusiasts to reach out to their legislative representatives, they&#8217;ve unwittingly thrown the spotlight on a congressman with a tainted reputation. The featured House of Representatives member, it turns out, previously owned up to not one, ... <a title=\"Coinbase features lawmaker with ethics violations in initiative\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-features-lawmaker-ethics-violations/\" aria-label=\"More on Coinbase features lawmaker with ethics violations in initiative\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T22:23:59.000Z",
    "title": "Supreme court doctrine: Crypto industry claims it halts SEC",
    "url": "https://www.cryptopolitan.com/supreme-court-doctrine-it-halts-sec/",
    "description": "Last month&#8217;s ruling regarding the crypto industry&#8217;s relationship with the U.S. Securities and Exchange Commission (SEC) has ruffled more than a few feathers. Crypto giants and their supporters are now challenging the SEC&#8217;s authority over their operations, all based on a theory rooted in the Supreme Court&#8217;s recent doctrines. This move illustrates how the evolving ... <a title=\"Supreme court doctrine: Crypto industry claims it halts SEC\" class=\"read-more\" href=\"https://www.cryptopolitan.com/supreme-court-doctrine-it-halts-sec/\" aria-label=\"More on Supreme court doctrine: Crypto industry claims it halts SEC\">Read more</a>"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-15T22:42:00.000Z",
    "title": "Worldcoin (WLD) Set To Undergo 900+% Emission Increase in the Next Year",
    "url": "https://coinedition.com/worldcoin-wld-set-to-undergo-900-emission-increase-in-the-next-year/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Worldcoin (WLD) Set To Undergo 900+% Emission Increase in the Next Year\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Worldcoin-WLD-Set-To-Undergo-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Worldcoin (WLD) token is set to undergo an astonishing 986.4% emission increase over the course of the next 365 days, according to a post from the tokenomics tracking platform Token Unlocks. This will result in the issuance of a staggering 1.22 billion new WLD tokens. Token Unlocks pointed out that this exponential surge in token [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/worldcoin-wld-set-to-undergo-900-emission-increase-in-the-next-year/\">Worldcoin (WLD) Set To Undergo 900+% Emission Increase in the Next Year</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]