[
  {
    "source": "Decrypt",
    "date": "2023-09-14T22:59:31.000Z",
    "title": "'Cast It Into the Fire': GOP Moves to Advance Bills That Ban CBDC",
    "url": "https://decrypt.co/156790/cast-it-into-the-fire-gop-bills-ban-cbdc",
    "description": "Republicans argue a CBDC would undermine existing stablecoins, and usher Americans down a slippery slope toward mass government surveillance."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-14T22:59:30.000Z",
    "title": "AI Defense Startup Helsing Raises $223 Million to 'Protect Democracies'",
    "url": "https://decrypt.co/156787/ai-defense-startup-helsing-raises-223-million-protect-democracies",
    "description": "With backing from Saab and General Catalyst, Helsing will focus on AI enhancements for the NATO Eurofighter and Future Combat Air System."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-14T22:45:22.000Z",
    "title": "ByBit denies earlier reports that the exchange will exit UK",
    "url": "https://cryptoslate.com/bybit-denies-earlier-reports-that-exchange-will-exit-uk/",
    "description": "<p>ByBit announced on Sept. 14  that it intends to continue operating its crypto exchange in the U.K., contradicting earlier reports that it would exit that country. On Twitter/X, a company spokesperson wrote: &#8220;We consider the UK to be a highly important market for the advancement of crypto and blockchain technologies. Our commitment to this market [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bybit-denies-earlier-reports-that-exchange-will-exit-uk/\">ByBit denies earlier reports that the exchange will exit UK</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-14T23:00:23.000Z",
    "title": "Litecoin Eliminates Pre-Halving Gains As Volume Drops, Is A Fall To $50 Coming?",
    "url": "https://www.newsbtc.com/analysis/ltc/litecoin-fall-to-50/",
    "description": "In the months leading up to the Litecoin halving in August, the price of the blockchain’s native LTC token was continuously on the rise. This renewed interest in investors who rushed back into the token and eventually pushed its price above $100. That is until the actual halving event rolled around, turning it into a “buy the rumor, sell the news” scenario. Since then, it has been a downward spiral for the token and the pain may not be over. Litecoin Volume Slumps Post-Halving Litecoin volume since the halving was completed has been less than expected. While investors expected rising demand for the LTC token with the diminished supply rate, the opposite has been the case. Instead, the daily trading volume of the cryptocurrency continued to slump. Related Reading: Bitcoin Wallet Activity Touches 5-Month High, Will BTC Price Follow? In the last day, the Litceoin daily trading volume fell another 23%. This brought its daily volume to $255 million, a significantly low figure compared to the $500 million daily volumes that the cryptocurrency was recording leading up to the halving. LTC daily volumes drops 23% &#124; Source: CoinMarketCap Just like the trading volume, the price of LTC has also plunged significantly. From its pre-halving peak of $112, the altcoin has fallen over 50% to its current level just above $60. This means that the asset has lost all of its gains accumulated between June and July 2023, just one month after the halving was completed. So rather than being a bullish event as initially expected, the halving has proven to be more bearish than most. It also did not help that it took place during the bear market and LTC has fallen rapidly alongside larger assets such as Bitcoin and Ethereum. LTC price returns to pre-halving levels &#124; Source: LTCUSD on Tradingview.com Will LTC Fall Continue To $50? At the current rate, the forecast does not look too good for the LTC price. Litecoin has understandably seen a 3% increase in the past day as Bitcoin recovered above $26,000. But this does not look sustainable by its current metric. The first indicator of this is that falling daily trading volume means that interest in the asset is waning. As investors move to other assets they believe provide better prospects, this will affect the LTC price and could trigger further downside from here. Add to this that the coin’s price is below its 50-day and 100-day moving averages and it spells a recipe for disaster. Related Reading: Institutional Investors Flee Ethereum Amid Plunge Toward $1,500 If LTC bulls are unable to hold support above $60 and it falls once again as it did on September 11, then $50 becomes a very possible landing point. Such a decline would put it back at November 2022 levels and signal a prolonged bear trend for the digital asset. At the time of writing, LTC price is still sitting above $62 but the tug-of-war for control between bulls and bears continues to rage on. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-14T22:55:00.000Z",
    "title": "Govt. Should Engage With AI to Support Innovation, Safeguards: Zuckerberg",
    "url": "https://coinedition.com/govt-should-engage-with-ai-to-support-innovation-safeguards-zuckerberg/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/US-Senators-Ask-Mark-Zuckerberg-To-Pause-Metaverse-App-Release.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Govt. Should Engage With AI to Support Innovation, Safeguards: Zuckerberg\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/US-Senators-Ask-Mark-Zuckerberg-To-Pause-Metaverse-App-Release.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/US-Senators-Ask-Mark-Zuckerberg-To-Pause-Metaverse-App-Release-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/US-Senators-Ask-Mark-Zuckerberg-To-Pause-Metaverse-App-Release-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/US-Senators-Ask-Mark-Zuckerberg-To-Pause-Metaverse-App-Release-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/US-Senators-Ask-Mark-Zuckerberg-To-Pause-Metaverse-App-Release-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/US-Senators-Ask-Mark-Zuckerberg-To-Pause-Metaverse-App-Release-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Global tech leaders met at Capitol Hill to discuss regulations on AI. Meta CEO Mark Zuckerberg believes that Congress should engage with AI to support innovation and safeguards. Senator Chuck Schumer stated that it was important to start working on regulations right away. Tech leaders from across the globe gathered to make important regulatory decisions [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/govt-should-engage-with-ai-to-support-innovation-safeguards-zuckerberg/\">Govt. Should Engage With AI to Support Innovation, Safeguards: Zuckerberg</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]