[
  {
    "source": "CoinDesk",
    "date": "2023-10-27T10:52:46.000Z",
    "title": "Crypto Assets Under Management Jump to $31.7B; SOL-Based Products Rise 74%: CCData",
    "url": "https://www.coindesk.com/business/2023/10/27/crypto-assets-under-management-jump-to-317b-sol-based-products-rise-74-ccdata/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bitcoin-based products have increased their market share to 73.3% from 70.5% amid optimism over the possible approval of a spot-price exchange-traded fund."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-27T11:00:07.000Z",
    "title": "Op-ed: Seeding may be the critical difference between human and AI generated content",
    "url": "https://cryptoslate.com/op-ed-seeding-may-be-the-critical-difference-between-human-and-ai-generated-content/",
    "description": "<p>As artificial intelligence continues to make strides in various industries, there is a growing debate about the capabilities of humans versus AI in creative endeavors. A particularly pertinent question is: Who seeds ideas better—humans or AI? This article explores the arguments for and against this theory before delving into the nuanced perspectives that blur the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/op-ed-seeding-may-be-the-critical-difference-between-human-and-ai-generated-content/\">Op-ed: Seeding may be the critical difference between human and AI generated content</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-27T10:51:18.000Z",
    "title": "Floki ($FLOKI) Unveils TokenFi, Aiming to Dominate the $16 Trillion Asset Tokenization Market by 20230",
    "url": "https://www.cryptoglobe.com/latest/2023/10/floki-floki-unveils-tokenfi-aiming-to-dominate-the-16-trillion-asset-tokenization-market-by-20230/",
    "description": "Floki ($FLOKI), a cryptocurrency project, has announced the launch of TokenFi, a platform focused on crypto and asset tokenization. The platform aims to become a global leader in the tokenization industry, which is expected to be worth $16 trillion by 2030. BlackRock, the world’s largest institutional investor, also sees significant growth potential in this sector, […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-27T11:04:46.000Z",
    "title": "Upbit rules South Korea’s crypto market with 80% share",
    "url": "https://www.cryptopolitan.com/upbit-rules-south-koreas-crypto-market/",
    "description": "Upbit is maintaining its stronghold in South Korea&#8217;s cryptocurrency exchange market. With an 80% market share, it stands as the unchallenged leader. Despite a temporary slip to 70% in August, the exchange bounced back robustly the subsequent month. Its closest competitors, including Bithumb, Coinone, and Korbit, trail significantly in terms of market influence. Bithumb, holding ... <a title=\"Upbit rules South Korea&#8217;s crypto market with 80% share\" class=\"read-more\" href=\"https://www.cryptopolitan.com/upbit-rules-south-koreas-crypto-market/\" aria-label=\"More on Upbit rules South Korea&#8217;s crypto market with 80% share\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-27T11:00:38.000Z",
    "title": "Chainlink (LINK) Rides Bullish Waves With 42% Gains In The Week, Is $15 Possible?",
    "url": "https://www.newsbtc.com/chainlink-news/chainlink-link-rides-bullish-waves-with-42-gains-in-the-week-is-15-possible/",
    "description": "LINK recorded impressive gains in the past week, with an over 43% seven-day price increase. However, the token’s price has slightly retraced in the last 24 hours, likely due to buyers taking profit after an aggressive accumulation phase for LINK tokens.  Chainlink’s notable uptick could be due to the ongoing bullish waves in the broader crypto market. Bitcoin, the flagship cryptocurrency, recorded a significant uptick, surging to nearly $35,000, the highest in over a year.  Related Reading: SEC Demands $700 Million Settlement From Ripple, Pro-XRP Lawyer Reveals Next Steps Bitcoin&#8217;s performance triggered a wave of optimism across the crypto market, causing most coins, including LINK, to soar. Moreover, Chainlink’s CCIP has recorded additional adoption and likely consolidated on LINK’s price gains.  But how far can the ongoing bullish momentum take LINK? Can it conquer prevailing resistance to reach $15? Let’s find out!  LINK Shows Signs Of Retracement, Is $15 Possible? LINK is in an uptrend after breaching the $6.99 support level as buyers re-entered the market and forced a rally to the $11.9 resistance level.  LINK’s rally began last week when it surged from $7.42 on October 16 to $10.41 on October 23. While the rally has stalled, the latest strides show that buyers are intent on facilitating further rallies to retest the $11.9 resistance A move above this level would empower LINK to target $15. Moreover, the higher high candlesticks on the chart imply that LINK will likely consolidate on its rally in the coming days.  Additionally, the Moving Average Convergence/Divergence (MACD) is above its signal line, displaying a strong buy signal. The green Histogram bars confirm this signal, which implies that LINK buyers are still active.  LINK trades at $11.003, with a 1.62% increase in the last 24 hours. Based on LINK’s trajectory, it will likely break above the $11.9 resistance to reach $15 in the coming weeks if buyers sustain their charge.  What Is Driving LINK’s Price Gains? Besides the general uptrend in the crypto market, Chainlink has recorded notable developments within its ecosystem, likely sustaining its price gains.   One such is the integration of Chainlink’s CCIP by DeFi provider Affine. The Chainlink CCIP is the new industry standard for secure cross-chain linking on Ethereum and Polygon mainnets.  Affine hopes to leverage the CCIP&#8217;s messaging abilities to create a cross-chain NFT bridging function for Affine Pass NFTs. It will ensure seamless and secure NFT transfers between supported blockchains.  According to Affine developers, they selected Chainlink to host the Affine NFTs due to its proven security and reliability track record.  More so, some experts forecast that there will be up to $5 trillion in tokenized digital securities by 2030. Chainlink will likely benefit from this expansion since it is a significant player in tokenized assets technology. Related Reading: PEPE Price Leaps 90% As Meme Coin Reaches Over 155,000 On-Chain Wallets With benefits such as fast transaction settlements, operational cost savings, and enhanced transparency, tokenization will likely boost Chainlink’s overall value.  These developments are likely sustaining the price gains for the LINK token in the past week. Although LINK trades slightly above $11 today, it will likely rise to $15 if market conditions remain favorable. Featured image from Shutterstock and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-27T10:51:48.000Z",
    "title": "Congress Targets Crypto Giants: Binance and Tether Under Fire",
    "url": "https://www.crypto-news-flash.com/congress-targets-crypto-giants-binance-and-tether-under-fire/?utm_source=rss&utm_medium=rss&utm_campaign=congress-targets-crypto-giants-binance-and-tether-under-fire",
    "description": "<img width=\"800\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-48x29.jpg 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" />U.S. lawmakers want the DOJ to investigate Binance and Tether over possible links to terrorism despite disputed reports. Both Republicans and Democrats support cracking down on crypto&#8217;s role in funding terrorism. In a bipartisan effort, U.S. lawmakers have urged the Department of Justice (DOJ) to initiate an investigation into major cryptocurrency platforms, Binance and Tether, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-27T10:47:00.000Z",
    "title": "Fantom Foundation Heist Highlights Needs in Blockchain Industry",
    "url": "https://coinedition.com/fantom-foundation-heist-highlights-needs-in-blockchain-industry/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Internal-Fantom-analysis.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Internal-Fantom-analysis.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/Internal-Fantom-analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Internal-Fantom-analysis-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Internal-Fantom-analysis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Internal-Fantom-analysis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/Internal-Fantom-analysis-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Guy Gotslak, co-founder and president of My Digital Money, thinks the recent crypto theft from a Fantom Foundation-linked wallet highlights needs in the blockchain industry. He spoke with Coin Edition about the impact of the unfortunate event on the crypto industry. According to Gotslak, there are pressing needs in two key areas of the crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/fantom-foundation-heist-highlights-needs-in-blockchain-industry/\">Fantom Foundation Heist Highlights Needs in Blockchain Industry</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]