[
  {
    "source": "Decrypt",
    "date": "2023-11-15T21:31:02.000Z",
    "title": "The Next Solar Storm Cycle Could Massively Disrupt Human Technology",
    "url": "https://decrypt.co/206229/solar-activity-2024-disrupt-tech-gps-telecommunications",
    "description": "Researchers from two universities are sounding the alarm over solar activity that could disrupt the internet and blockchain technology."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-15T21:10:58.000Z",
    "title": "Lawmakers press Biden, Yellen for detailed report on crypto activity linked to Hamas",
    "url": "https://cryptoslate.com/lawmakers-press-biden-yellen-for-detailed-report-on-crypto-activity-linked-to-hamas/",
    "description": "<p>Several U.S. lawmakers have approached the Biden administration, requesting an investigation into the alleged use of cryptocurrency by terrorist groups. This request came in the form of a letter dated Nov. 15. The letter refers to earlier reports alleging that crypto wallets linked to Hamas and the Palestinian Islamic Jihad have received upwards of $41 [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/lawmakers-press-biden-yellen-for-detailed-report-on-crypto-activity-linked-to-hamas/\">Lawmakers press Biden, Yellen for detailed report on crypto activity linked to Hamas</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-15T21:31:29.000Z",
    "title": "dYdX Chain’s beta trading launch powers 67% price surge",
    "url": "https://crypto.news/dydx-chains-beta-trading-launch-powers-67-price-surge/",
    "description": "DYDX token surged 21% in 24 hours and 67% in 7 days after dYdX Chain enabled live trading in the beta stage on November 13"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-15T21:29:14.000Z",
    "title": "Despite crash, crypto was best performing asset of 2023",
    "url": "https://crypto.news/despite-crash-crypto-was-best-performing-asset-of-2023/",
    "description": "Cryptocurrencies like Bitcoin Cash and Solana have staged triple-digit comebacks in 2023 after last year's crypto crash."
  }
]