[
  {
    "source": "Decrypt",
    "date": "2023-05-29T11:01:08.000Z",
    "title": "US Debt Ceiling Deal Blocks 30% Bitcoin Mining Tax: Congressman",
    "url": "https://decrypt.co/142711/us-debt-ceiling-deal-blocks-30-bitcoin-mining-tax-congressman",
    "description": "The proposed Digital Asset Mining Energy tax has reportedly been taken off the table, according to U.S. Congressman Warren Davidson."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-29T10:40:00.000Z",
    "title": "Tourists are unhappy with crypto payments ban in Bali",
    "url": "https://cointelegraph.com/news/bali-crypto-payments-ban-triggers-backlash-from-community",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/96adbd70-81ad-4545-94d8-991993a09e11.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The community expressed a range of opinions, with some individuals stating that the ban is reasonable, while others went as far as reconsidering their vacation plans. </p>\n                    <p><p>The government of Bali, Indonesia, recently cracked down on crypto payments for goods and services and reminded tourists that the Indonesian Rupiah is the only legal tender. Some tourists were dissatisfied with the decision, saying that they will not visit again. </p><p>On May 28, the Indonesian government affirmed that tourists who will use crypto for payments “will be dealt with firmly.” They could be <a href=\"https://cointelegraph.com/news/bali-governor-warns-on-crypto-payments\">subject to punishments</a> such as deportation, criminal penalties, and administrative sanctions. In addition, the businesses that would be caught accepting crypto could also be punished and forced to close their operations. </p><p>The community shared various responses with some saying that the ban “makes sense” and some threatening to not visit the tourist hotspot again. </p><p>On Reddit, a community member <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/13ul8y0/comment/jm19vhc/?utm_source=share&amp;utm_medium=web2x&amp;context=3\" target=\"_blank\" rel=\"noopener nofollow\">shared</a> their belief that the form of payment used \"should be up to businesses and customers.\" The Redditor said that if both of the parties are willing to accept the risks of using crypto as payment, they should be given permission to proceed with their transactions. </p><p>On the other hand, a Redditor <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/13ul8y0/comment/jm1a6ib/?utm_source=share&amp;utm_medium=web2x&amp;context=3\" target=\"_blank\" rel=\"noopener nofollow\">believes</a> that the ban “makes sense” for Indonesia. According to the community member, the country uses tourist money to “prop up their currency.” This allows the currency to hold its value. Despite this, the Redditor still expressed that they do not agree with the ban. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/indonesia-targets-launch-of-its-national-crypto-exchange-by-june\"><strong><em>Indonesia targets launch of its national crypto exchange by June</em></strong></a></p><p>While some offered arguments and perspectives on the issue, others chose to go with a simpler approach — reconsidering their plans to visit Bali. A community member <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/13uezao/comment/jm0cyri/?utm_source=share&amp;utm_medium=web2x&amp;context=3\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a>: </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/d91af3f6-f7b3-4bb7-95f2-d2b3652a722e.png\"  /><figcaption style=\"text-align: center;\"><em>Community member reconsiders vacation plans. Source: Reddit</em></figcaption></figure><p>While many were against the ban, some came to Indonesia's defense. According to a Redditor, they are just protecting their income. Taxes can only be applied when there are regulations. In this case, the community member believes that Indonesia does not have this yet. \"They see their cash cow running away and can do nothing to stop it. So there’s one thing to do: build fences,\" they <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/13ul8y0/comment/jm1ls5j/?utm_source=share&amp;utm_medium=web2x&amp;context=3\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a>. </p><p>Tourism is a very important sector that contributes to Bali's economy. Research <a href=\"https://journals.openedition.org/tourisme/1187?lang=en\" target=\"_blank\" rel=\"noopener nofollow\">shows</a> that the tourism sector makes up almost 28% of Bali's income. It helps the economy by creating opportunities and jobs for the locals. This suggests that if tourists stop visiting the country, it could potentially lead to a drop in income as well.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ftx-2-0-coming-up-multichain-fud-and-worldcoin-raises-six-figures-hodlers-digest-may-21-27/\"><strong><em>FTX 2.0 coming up, Multichain FUD and Worldcoin raises $115M: Hodler’s Digest, May 21-27</em></strong></a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-29T10:45:00.000Z",
    "title": "Dogecoin transaction volume flips Ethereum amid DRC-20 token fever",
    "url": "https://cryptoslate.com/dogecoin-transaction-volume-flips-ethereum-thanks-to-drc-20-tokens/",
    "description": "<p>Dogecoin (DOGE) recorded a significant surge in its network activity over the last two days, processing more than 4 million transactions between May 27 and 28, according to BitInfoCharts. The increase surpassed the number of transactions processed by its more storied rivals like Ethereum (ETH) and Bitcoin (BTC). ETH recorded 1.9 million transactions during the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/dogecoin-transaction-volume-flips-ethereum-thanks-to-drc-20-tokens/\">Dogecoin transaction volume flips Ethereum amid DRC-20 token fever</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-29T10:58:07.000Z",
    "title": "HK Police Launch “CyberDefender” To Combat Crime in the Metaverse",
    "url": "https://cryptodaily.co.uk/2023/05/hk-police-launch-cyberdefender-to-combat-crime-in-the-metaverse",
    "description": "<p>The Hong Kong police force has launched a new platform to promote crime prevention in the metaverse. </p>\n<p>The cybersecurity arm of the Hong Kong Police Force launched a platform to promote crime prevention in the metaverse. Dubbed &ldquo;CyberDefender,&rdquo; the platform aims to educate the public about the potential dangers emanating from the Web3 and metaverse space.</p>\n<p>In a May 27 statement, the Cyber Security and Technology Crime Bureau (CSTCB) of the Hong Kong Police Force warned that &ldquo;all crimes in the cyberspace could also happen in the metaverse.&rdquo;</p>\n<p>It added the platform is designed to prepare users for the &ldquo;challenges ahead in the digital age.&rdquo; &nbsp;</p>\n<p>Chief Inspector Ip Cheuk-yu of the CSTCB spoke at the event where CyberDefender was launched and where he discussed the dangers of the digital space.</p>\n<p>He said:</p>\n\n<p>The decentralized nature of virtual assets in Web3 may also increase the likelihood of cyber criminals targeting end point devices, virtual asset wallets and smart contracts.</p>\n\n<p>The Chief Inspector specifically referenced fraud, hacking, theft, and sexual offences, which can all occur in the metaverse, BeInCrypto reports.</p>\nVirtual Asset-Related Crimes Cost Victims $1.7 Billion in 2022\n<p>In the press statement, the Hong Kong police outlined what virtual asset-related crimes cost victims in 2022. 2336 virtual asset-related crimes were reported costing victims a total of $1.7 billion.</p>\n<p>Virtual asset-related crimes are also increasing significantly, with 663 such crimes reported in Q1 2023. Losses amounted to $570, representing a 75% increase compared to Q1 2022.</p>\n<p>The police force said its educational initiative would specifically raise awareness among &ldquo;the younger generation.&rdquo;</p>\n\n<p>Police will continue to organize public educational initiatives on different themes through the &lsquo;CyberDefender Metaverse&rsquo; platform, raise the awareness among teenagers regarding the latest advancements in information technology, potential pitfalls and the importance of preventing technology crimes.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-29T11:00:19.000Z",
    "title": "SquidGrow: The Evolution of Mastery",
    "url": "https://news.bitcoin.com/squidgrow-the-evolution-of-mastery/",
    "description": "<img width=\"768\" height=\"437\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/img_20230529_150053_919-768x437.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/img_20230529_150053_919-300x171.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/img_20230529_150053_919-1024x583.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/img_20230529_150053_919-768x437.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/img_20230529_150053_919-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/img_20230529_150053_919.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />&#160; In the cryptocurrency realm, there are thousands of projects born every year &#8211; each with aspirations to set the bar higher. The harsh reality is that most fail somewhere along the way, not for lack of passion or trying, but rather they lack the full list of ingredients required to create something truly great. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-29T10:40:43.000Z",
    "title": "Dubai watchdog warns of regulatory gaps threatening global market",
    "url": "https://www.cryptopolitan.com/dubai-watchdog-warns-of-regulatory-gaps/",
    "description": "Dubai&#8217;s Financial regulator has joined other regulators around the world as they debate how to regulate the crypto market. While Singapore seeks to restrict, the role of ordinary investors and the U.S. cracks down on crypto businesses due to previous market downturns, countries like Dubai and Hong Kong aim to entice investment. Dubai highlights concerns ... <a title=\"Dubai watchdog warns of regulatory gaps threatening global market\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dubai-watchdog-warns-of-regulatory-gaps/\" aria-label=\"More on Dubai watchdog warns of regulatory gaps threatening global market\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-29T11:00:22.000Z",
    "title": "Dogecoin Bounces Off $0.070 Mark, Awaits Breakthrough of Crucial Hurdle",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-bounces-off-0-070-mark-awaits-breakthrough-of-crucial-hurdle/",
    "description": "In recent trading sessions, the price of Dogecoin has experienced an upward trend, surpassing a significant resistance level. Over the past 24 hours, DOGE recorded a 1.2% increase, and within the last week, the coin appreciated by 2%. The technical analysis suggests the possibility of upcoming bullish momentum as buying strength attempts to recover. However, demand and accumulation indicators have not yet entered the positive zone. Related Reading: Bitcoin Bulls Push BTC Back Up To $28K Amid Surging Address Activity To establish bullish control in subsequent sessions, DOGE must surpass a crucial resistance level. The broader market&#8217;s recovery, including Bitcoin&#8217;s rise above $27,500, may also contribute to the DOGE upward price movement. The upcoming trading sessions will be crucial in determining whether bulls or bears will dictate the price action. However, the decline in the Dogecoin market capitalization indicates current seller dominance over the asset. Dogecoin Price Analysis: One-Day Chart At the time of writing, DOGE was trading at $0.073 and has shown gradual gains since surpassing the $0.070 resistance line. However, a potential price correction could occur if it fails to breach its overhead resistance. The immediate resistance level for DOGE is set at $0.075. Surpassing this level would likely trigger a rally toward the $0.078 mark, strengthening the position of the bulls. Conversely, if DOGE fails to hold its current price level, it may decline to $0.071 and potentially drop below $0.070. The recent trading session indicated weak buying strength, as the amount of Dogecoin traded was in the red. Technical Analysis Throughout May and even April, Dogecoin faced challenges in attracting positive demand. At the current moment, buying strength remains low despite the ongoing recovery. The Relative Strength Index (RSI) indicates that buyers still lack confidence in the asset, as it is below the half-line. Furthermore, the DOGE price has fallen below the 20-Simple Moving Average (SMA) line, indicating that sellers are driving the price momentum in the market. However, if Dogecoin manages to surpass the $0.070 price level, it will move above the 20-SMA line, indicating increased demand and potentially reversing the current trend. On the one-day chart, DOGE exhibited diminishing buy signals in line with other technical indicators. The Moving Average Convergence Divergence (MACD), which indicates price momentum and trend reversal, showed declining green histograms associated with buy signals. Additionally, the Bollinger Bands, which reflect price volatility and fluctuation, displayed significant narrowing. This suggests that DOGE may experience heightened price volatility and fluctuations in the upcoming trading sessions. Related Reading: Ethereum Correction: Key Level Break Can Shift Price Course Currently, DOGE is positioned at a critical price level, and the next trading sessions will determine whether the price will break out to the upside or downside. Featured Image From UnSplash, Charts From TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-29T10:51:05.000Z",
    "title": "TMS Network (TMSN) is a Guiding Crypto Beacon, Filecoin (FIL) and TRON (TRX) Clearly Adrift",
    "url": "https://www.crypto-news-flash.com/tms-network-tmsn-is-a-guiding-crypto-beacon-filecoin-fil-and-tron-trx-clearly-adrift/?utm_source=rss&utm_medium=rss&utm_campaign=tms-network-tmsn-is-a-guiding-crypto-beacon-filecoin-fil-and-tron-trx-clearly-adrift",
    "description": "<p>TMS Network (TMSN) token price marked an impressive 2000% jump into stage 4 of its presale event. It’s a guiding crypto beacon to platforms like Filecoin (FIL) and TRON (TRX), having raised a remarkable $6 million in its seed funding event. This article discusses the TMS Network (TMSN) and outlines how it’s a better investment [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/tms-network-tmsn-is-a-guiding-crypto-beacon-filecoin-fil-and-tron-trx-clearly-adrift/\">TMS Network (TMSN) is a Guiding Crypto Beacon, Filecoin (FIL) and TRON (TRX) Clearly Adrift</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-29T10:50:00.000Z",
    "title": "Crypto Analyst Predicts Potential Breakouts for BTC and ADA",
    "url": "https://coinedition.com/crypto-analyst-predicts-potential-breakouts-for-btc-and-ada/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Not_sure_if_you_have_noticed_but_Im_very_hype_about_what_is_happening-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BTC and ADA\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Not_sure_if_you_have_noticed_but_Im_very_hype_about_what_is_happening-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Not_sure_if_you_have_noticed_but_Im_very_hype_about_what_is_happening-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Not_sure_if_you_have_noticed_but_Im_very_hype_about_what_is_happening-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Not_sure_if_you_have_noticed_but_Im_very_hype_about_what_is_happening-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Not_sure_if_you_have_noticed_but_Im_very_hype_about_what_is_happening-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Not_sure_if_you_have_noticed_but_Im_very_hype_about_what_is_happening.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In a recent video, the analyst and crypto trader Dan Gambardello expressed his bullish sentiment towards Bitcoin (BTC) and Cardano (ADA), stating that he sees tremendous opportunities in both cryptos. He emphasized that his confidence lies not only in the prices of BTC and ADA, but also in the overall crypto ecosystem and its developments. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-analyst-predicts-potential-breakouts-for-btc-and-ada/\">Crypto Analyst Predicts Potential Breakouts for BTC and ADA</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]