[
  {
    "source": "Cointelegraph",
    "date": "2023-06-27T18:30:00.000Z",
    "title": "Yield Protocol declares full recovery from Euler hack, awaits user token exchange ",
    "url": "https://cointelegraph.com/news/yield-protocol-declares-full-recovery-from-euler-hack-awaits-user-token-exchange",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/e63bff2f-27e3-4fca-90e5-15eb28a125a2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The permissionless, collateralized fixed-rate borrowing and lending market restored operations in May and will now switch out user tokens worth $1.5 million.</p>\n                    <p><p>Yield Protocol announced on June 27 that it had fully recovered from the Euler flash loan attack. Liquidity providers can now update their strategy tokens, the protocol <a href=\"https://twitter.com/yield/status/1673690015073796099\" target=\"_blank\" rel=\"noopener nofollow\">said</a> on Twitter. That was the last step to protocol restoration after “a long journey.”</p><p>Yield Protocol was one of the 11 decentralized finance protocols that <a href=\"https://cointelegraph.com/news/euler-attack-causes-locked-tokens-losses-in-11-defi-protocols-including-balancer\">suffered losses after the attack</a> on the noncustodial lending protocol Euler Finance. It paused mainnet borrowing after the hack on March 13 and claimed losses from its liquidity pools were under $1.5 million. Euler <a href=\"https://cointelegraph.com/news/euler-finance-hacked-for-over-195m-in-a-flash-loan-attack\">lost over $195 million</a> in the attack.</p><p>On May 18, Yield Protocol <a href=\"https://twitter.com/yield/status/1659225422993793026\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that it was “back in full swing” and users could borrow and lend for the June and September series. It said at that time that it would take “about a week” for users to be able to claim replacement tokens.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/euler-finance-attack-how-it-happened-and-what-can-be-learned\">Euler Finance attack: How it happened, and what can be learned</a></em></strong></p><p>Yield Protocol worked with Euler on the return of the funds after Euler <a href=\"https://cointelegraph.com/news/euler-finance-opens-redemptions-after-hacker-returns-funds\">recovered most of its losses</a> <a href=\"https://cointelegraph.com/news/euler-labs-hacker-returns-all-of-the-recoverable-funds-timeline\">from the hackers</a> in April, it <a href=\"https://yield-protocol.medium.com/restoring-the-yield-protocol-aa0b7f5f9a7c\" target=\"_blank\" rel=\"noopener nofollow\">recounted</a> in a blog post. Then it went through the complex process of deploying 26 new contracts and executing about 300 permissioned calls to reset the fixed-yield token maturities and restore the protocol. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Protocol restoration on Mainnet is complete! We have now fully recovered the protocol from the Euler hack and the liquidity provider bug.<br><br>LPs are once again earning fees. To withdraw, LPs need to first upgrade their strategy tokens. View instructions here <a href=\"https://t.co/wVbPXrJKsy\">https://t.co/wVbPXrJKsy</a></p>&mdash; Yield Protocol (@yield) <a href=\"https://twitter.com/yield/status/1673690015073796099?ref_src=twsrc%5Etfw\">June 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Swapping their liquidity provider tokens for new ones minted during the restoration process will make users whole. The bloggers commented:</p><blockquote>“We are fortunate that the outcome of this hack will not result in losses to the Yield community. Nevertheless, it has been a very long journey back to full protocol restoration.”</blockquote><p>Also in May, Yield Protocol weathered the discovery of a bug in its strategy contracts that <a href=\"https://medium.com/yield-protocol/strategy-v2-burn-bug-post-mortem-51003ebcae5a\" target=\"_blank\" rel=\"noopener nofollow\">required</a> it to pause the protocol for two weeks. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/deflation-dumb-way-approach-tokenomics/\">‘Deflation’ is a dumb way to approach tokenomics… and other sacred cows</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-27T18:24:39.000Z",
    "title": "Robinhood lays off 7% of workforce on same day as Cardano, Polygon, and Solana delisting",
    "url": "https://cryptoslate.com/robinhood-lays-off-7-of-workforce-on-same-day-as-cardano-polygon-and-solana-delisting/",
    "description": "<p>Robinhood is slashing about 7% of its full-time employees, marking the company&#8217;s third wave of layoffs in just over a year. The decision comes as the company faces dwindling customer trading activity and follows the controversial delisting of three major cryptocurrencies, according to the original report from The Wall Street Journal. Roughly 150 employees are [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/robinhood-lays-off-7-of-workforce-on-same-day-as-cardano-polygon-and-solana-delisting/\">Robinhood lays off 7% of workforce on same day as Cardano, Polygon, and Solana delisting</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-27T18:10:55.000Z",
    "title": "Bitcoin could be the refuge as bond market faces negative returns",
    "url": "https://cryptoslate.com/insights/bitcoin-could-be-the-refuge-as-bond-market-faces-negative-returns/",
    "description": "<p>Quick Take One of the most robust markets globally is the bond market, which, according to Visual Capitalist, was estimated to be worth $133 trillion in 2022. This colossal market has seen consistent growth over the last four decades, primarily driven by government debt increases due to interest rate reductions during each recession and the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-could-be-the-refuge-as-bond-market-faces-negative-returns/\">Bitcoin could be the refuge as bond market faces negative returns</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-27T18:25:34.000Z",
    "title": "Disney (DIS) Is Now Available for Trading on LBank Exchange",
    "url": "https://cryptodaily.co.uk/2023/06/disney-dis-is-now-available-for-trading-on-lbank-exchange",
    "description": "<p>Road Town, BVI, June 27th, 2023, Chainwire</p><p>LBank Exchange, a global digital asset trading platform, listed Disney (DIS) on June 27, 2023. For all users of LBank Exchange, the DIS/USDT trading pair is now officially available for trading.</p><p>Disney (DIS) is a meme token issued by the relevant communities of blockchain, cryptocurrency, and mining.</p><p>Introducing Disney</p><p>LBank Exchange is thrilled to announce the upcoming listing of Disney (DIS), a meme token that was initiated by Miningtw Technology Co., Ltd., a collaborative team based in Hong Kong and Taiwan. This token was issued by various communities involved in blockchain, cryptocurrency, and mining. The token is intended for use in various capacities such as interactive activities, event rewards, gifts, charitable endeavors, and aspirational purposes. With an economic model in which 50% of its circulating supply is committed to pledge mining for a period exceeding 5 years, users are rewarded proportionately per second based on the total amount of their pledges. The goal is to create a value that is worth holding and collecting over the long term. However, it's worth noting that DIS has no association with Walt Disney and their similar names are purely coincidental. Despite sharing a similar name, they operate in distinct domains and scopes, with the meme tokens existing purely for the sake of amusement and enjoyment.</p><p>DIS token is a meme cryptocurrency, created with the intention of fostering fun and innovation. It is committed to building a democratic, transparent, and equitable community grounded on blockchain technology. The token was conceived by DaddyPig, a Hong Kong native who immigrated to Taiwan in search of democratic freedoms. In collaboration with Taiwan, DaddyPig established Miningtw Technology Co., Ltd. Starting off as a cryptocurrency miner, the company branched out to construct large mining facilities, dedicating itself to the development of several blockchain projects. These projects include the creation of a decentralized exchange (DEX) and several other blockchain ecosystem initiatives. DaddyPig has actively participated in blockchain development endeavors, such as Ethereum's PoS fork, the maintenance of EthereumFair (ETHF) under a PoW consensus mechanism, and the fork of DogeCoin from the Scrypt algorithm to the ETHASH algorithm, resulting in DogeW. Upholding the principle of decentralization, DaddyPig has invested significant resources in anticipation of the potential and future prospects of Web3.</p><p>About DIS Token</p><p>Based on BEP-20, DIS has a total supply of 100 million (i.e. 100,000,000). In a move to incentivize DIS token holders, a five-year liquidity mining program has been launched, dedicating 50 million tokens, or half of the total issuance, to the staking mining reward pool. Approximately 27,397 DIS tokens will be distributed daily, or around 0.317 DIS per second, based on the total number of staked tokens. Additionally, 10% of the total DIS issuance, which equates to 10 million DIS tokens, will be locked for staking over a five-year span, with economic model and deflation mechanism, please refer to the white paper for details. It was listed on LBank Exchange at 9:00 UTC on June 27, 2023, investors who are interested in DIS can easily buy and sell it on LBank Exchange now. The listing of DIS token on LBank Exchange will undoubtedly help it further expand its business and draw more attention in the market.</p><p>Learn More about DIS Token:</p><p>Official Website: https://distoken.xyz/</p><p>Twitter: https://twitter.com/distoken_xyz</p><p>Telegram: https://t.me/miningtwxyz</p><p>Contract: https://bscscan.com/token/0xe2ecc66e14efa96e9c55945f79564f468882d24c</p><p>About LBank</p><p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge growing platform that ensures the integrity of users' funds and aims to contribute to the global adoption of cryptocurrencies.</p><p>Start Trading Now: lbank.com</p><p>Community &amp; Social Media:&nbsp;</p><p>Telegram l&nbsp;Twitter l&nbsp;Facebook l&nbsp;LinkedIn l&nbsp;Instagram l&nbsp;YouTube</p><p>Press contact:&nbsp;</p><p>press@lbank.info</p><p>Business Contact:</p><p>LBK Blockchain Co. Limited</p><p>business@lbank.info</p><p></p><p></p><p></p>ContactLBK Blockchain Co. Limitedmarketing@lbank.info"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-27T18:15:00.000Z",
    "title": "Plynk & Kucoin Offer Warm Welcome As Caged Beasts Coin Joins Top Passive Income Cryptos",
    "url": "https://cryptodaily.co.uk/2023/06/plynk-kucoin-offer-warm-welcome-as-caged-beasts-coin-joins-top-passive-income-cryptos",
    "description": "<p>Cryptocurrency is not merely about acquiring and holding altcoins; its potential for passive income cannot be overlooked. Picture yourself earning revenue effortlessly, without having to lift a finger. Moreover, crypto exchange platforms are upping the ante with their enticing welcome rewards. Among these are KuCoin and Plynk, but a newcomer is making waves: Caged Beasts Coin has joined the rank of Top passive income cryptos. Unlock the secrets of these offerings and maximise your profits.</p>\nPlynk Has &ldquo;$50 For You&rdquo;\n<p>Plynk is an SEC-regulated trading app designed for US investors. It provides a user-friendly platform where beginners can trade various instruments like stocks, fractional shares, mutual funds, and ETFs. In collaboration with Paxos Trust Co., Plynk introduced crypto trading in 2022. Users can trade and hold popular coins such as Bitcoin (BTC), Ethereum (ETH), Litecoin (LTC), and Bitcoin Cash (BCH) through Paxos. Existing Plynk app users can apply for a crypto account offered by Paxos.&nbsp;</p>\n<p>Currently, Plynk is offering a $50 promotion. To qualify, open a new account on the app and link a bank account. You receive a $10 bonus just for signing up. When you&nbsp; deposit at least $25 within 15 calendar days of linking their eligible bank account,&nbsp; $50 will be credited to your account within 30 days of the Qualification Period, which starts when the bank account is linked.</p>\nAvail KuCoin&rsquo;s New User Rewards\n<p>The crypto exchange Kucoin offers great advantages such as high liquidity, low fees, and fast withdrawals. It was established in 2017 by Leon Kuensingh, who observed a shift of traders from Binance to Coinbase due to the recent ban on crypto trading on US exchanges.</p>\n<p>New users who register on KuCoin can enjoy rewards of up to $100 USDT. These rewards are earned when users complete their first deposit or crypto purchase, make their first trade, and engage in pro trading. The rewards include USDT and valuable coupons, which can add up to a total worth of 3200 USDT. To receive these rewards, users need to fulfil the designated tasks within 60 days of signing up for their KuCoin account. It's important to note that each user can only receive each reward once.</p>\nCaged Beasts&rsquo;s 20% USDT Commission\n<p></p>\n<p>Caged Beasts Coin (BEASTS) is no ordinary cryptocurrency. Aiming to overthrow the dominance of a privileged few and redistribute financial power to the masses, the BEASTS are out to start the DeFi Revolution and here&rsquo;s why they might just do it.</p>\n<p>Community is at the heart of the BEASTS ecosystem. The referral scheme, for example, allows holders to bag a 20% USDT commission instantly. All you have to do is visit the website, select the 'Earn USDT' option, connect your wallet and generate a referral code to share. Each user can earn a generous 20% of any deposits made by their referrals, which is automatically added to their wallet. That&rsquo;s not all: the user who uses the referral code also receives a 20% share.</p>\n<p>The token tells the tale of Rabbit 4001, who embarks on a quest to gather a group of rebels. During the token's presale journey, Rabbit 4001 bestows young animals with mutagens and cybernetic enhancements, symbolising the growth and accumulation of locked funds over time. The name itself, Caged Beasts, is a clever take on the concept of Caged Liquidity. The referral system aims to cultivate a united and expanding community that rewards its members, while the project as a whole thrives through active involvement and contributions from individuals.&nbsp;</p>\n<p></p>\nThe Takeaway\n<p>With their respective welcome bonuses, KuCoin &amp; Plynk are top-notch platforms to consider for trading crypto. However, in the quest for the top passive income cryptos, Caged Beasts Coin emerges as a contender. Brace yourself for the imminent DeFi Revolution, spearheaded by none other than the mighty BEASTS.</p>\n<p>Join the Caged Beasts Coin (BEASTS) RevolutionWebsite: https://cagedbeasts.com&nbsp;</p>\n<p>Twitter: https://twitter.com/CAGED_BEASTS&nbsp;</p>\n<p>Telegram: https://t.me/CAGEDBEASTS</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-27T18:10:00.000Z",
    "title": "Circle Launches Cross-Chain Transfer Protocol On Arbitrum $ARB",
    "url": "https://cryptodaily.co.uk/2023/06/circle-launches-cross-chain-transfer-protocol-on-arbitrum-arb",
    "description": "<p class=\"md-end-block md-p\">Circle, the issuer of the USD Coin (USDC) stablecoin, has announced the operationalization of its Cross-Chain Transfer Protocol (CCTP) on Arbitrum, a Layer 2 scaling solution for the Ethereum network.</p>\n<p class=\"md-end-block md-p\">This integration enables faster and more secure transfers of USDC across several blockchain networks, including Ethereum, Avalanche, and now Arbitrum.</p>\nEnhanced Functionality with CCTP\n<p class=\"md-end-block md-p md-focus\">CCTP facilitates the movement of USDC across different blockchain networks by employing a burn-and-mint mechanism. Native USDC tokens on the original chain are burnt, and an equivalent amount is minted on the receiving chain. This mechanism enhances the efficiency and security of USDC transfers.</p>\n<p class=\"md-end-block md-p\">Arbitrum is the third chain to support CCTP, and the protocol is live on the official Arbitrum Bridge. The addition of CCTP to Arbitrum follows Circle's recent announcement of a native version of its stablecoin on the Arbitrum network.</p>\nIntegration with Other Protocols\n<p class=\"md-end-block md-p\">Several other bridge projects and interoperability-centric protocols, such as Celer Network, Li.Fi, Wormhole, O3 Labs, Wanchain, and Router Protocol, have incorporated CCTP into their systems. These integrations enable USDC transfers via their respective platforms.</p>\n<p class=\"md-end-block md-p\">Notably, the integration of CCTP with Arbitrum is expected to replace the traditional \"lock-and-mint\" bridging process typically used for transferring tokens between chains. This conventional mechanism has been associated with security issues in the past. Using CCTP instead can expedite bridge transfers, improving efficiency and security.</p>\nThe Growth of USDC\n<p class=\"md-end-block md-p\">USDC is currently the second-largest centralized stablecoin in the market after USD Tether, boasting a supply close to $28 billion. Its increasing adoption and the integration with Arbitrum underline the significant role it plays in the crypto landscape.</p>\n<p class=\"md-end-block md-p\">Circle expressed its enthusiasm for the CCTP integration with Arbitrum in a series of tweets. The company highlighted that the integration simplified the process of moving USDC natively to Arbitrum, enabling direct transfers to and from Ethereum and Avalanche.</p>\n<p class=\"md-end-block md-p\">As a many-to-many messaging protocol, CCTP can now burn and mint USDC through six unique routes between its three supported chains. Each new chain added automatically connects to all existing CCTP chains.</p>\n<p class=\"md-end-block md-p\">Users receive native USDC with CCTP, eliminating the need for lock-and-mint bridging. This development brings added security and capital efficiency to the process of sending USDC across supported chains.</p>\n<p class=\"md-end-block md-p\">The protocol also allows for a swift return of USDC to Ethereum, bypassing withdrawal delays when moving liquidity from Layer 2 solutions to Layer 1.</p>\n<p class=\"md-end-block md-p\">Circle's CCTP offers developers the opportunity to build applications offering native cross-chain deposits, swaps, purchases, and more. As such, the integration promises significant improvements to the cross-chain capabilities of the ecosystem.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T18:13:03.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. Various APE price highlights unfold in this ApeCoin Price Prediction. How much is ApeCoin (APE) worth? ... <a title=\"ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-27T18:20:59.000Z",
    "title": "Cardano community concerned over Robinhood and Celsius selling ADA",
    "url": "https://crypto.news/cardano-community-concerned-over-robinhood-and-celsius-selling-ada/",
    "description": "Recent discourse in the Cardano community revolves around the potential significant liquidation of ADA by Robinhood and Celsius."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-27T18:10:09.000Z",
    "title": "Avalanche partners with Pixion Games, facilitating $5.5m seed round for web3 gaming studio",
    "url": "https://crypto.news/avalanche-partners-with-pixion-games-facilitating-5-5m-seed-round-for-web3-gaming-studio/",
    "description": "Avalanche-Backed web3 gaming studio Pixion Games has successfully concluded its seed funding round, raising $5.5 million. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-27T18:30:03.000Z",
    "title": "BLUR Up By 11% Following This Announcement",
    "url": "https://www.newsbtc.com/nft/blur-up-by-11-following-this-announcement/",
    "description": "BLUR, the native token of the Blur NFT marketplace, saw a recent boost in its market price following a particular announcement.  According to data by CoinMarketCap, BLUR has gained by 11.75% in the last 24 hours, emerging as one of the top gainers in today’s market.  Looking at its price overview,  BLUR has shown a rather mixed price movement in the last seven days, although resulting in an overall price gain of 12.43% However, the token’s monthly chart data tells a different story, with BLUR losing over 26% of its value in the last 30 days. During this period, BLUR  fell to its lowest price this year, trading as low as $0.297.  Listing Announcement Causes BLUR Market Surge BLUR experienced a sudden hike in its price this morning, leading to the token trading around $0.43 for the first time since the beginning of the month. Related Reading: Bitcoin Holders Expect Retrace, Will BTC Move Against Crowd Once Again? Analyzing BLUR’s price action, on-chain analytics platform Lookonchain has noted that BLUR’s price gain appears to be due to a recent listing by a crypto exchange. According to Lookonchain’s report, BLUR’s market price surged by over 27% after popular Asian exchange Upbit announced plans to list the token on its KRW market in the early hours of today.  Upbit is well-known as the first licensed digital exchange in South Korea.  Established in 2017, the exchange serves over 10 million users, accounting for over 80% of the Korean exchange market. That said, it is worth noting that BLUR’s price peaked at $0.43 following the announcement but has since been on a downtrend, losing about 12% of its value in the last seven hours.  At the time of writing, BLUR is currently exchanging hands at a price of $0.38 based on data from CoinMarketCap. Meanwhile, its daily trading volume hovers around $277 million, having gone up by 11.83%.  BLUR Trading At $0.380 &#124; Source: BLURUSD Chart On Tradingview.com Money Maker Conducts Puzzling Transactions Amidst BLUR’s Price Boost In other news, Lookonchain also spotted a rather “unusual market behavior” from prominent DeFi market maker Wintermute amidst the recent price boost in the BLUR market.  Related Reading: Robinhood To Lay Off 7% of Full-Time Staff In Latest Restructuring Wintermute reportedly received 10 million BLUR tokens &#8211; valued at $4.2 million &#8211; from Coinbase custody wallet and deposited these tokens on the Kraken exchange several hours before the BLUR’s price hike occurred. The on-chain analytics platform also noted the market maker deposited 2.1 million BLUR &#8211; valued then at $895,000 &#8211; on Coinbase; however, after the price surge had happened. For now, Wintermute’s intention following these transactions is unknown but appears to be drawing much attention, perhaps to the company’s recent troubles. Three days ago, creditors of the defunct lending platform Celsius raised allegations against Wintermute, stating the market maker collaborated with Celsius executives in a wash trading deal. Featured Image: NEWSVERGE, Chart From Tradingview."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T18:37:04.000Z",
    "title": "$4.9T Bank HSBC Enables Customers to Buy and Sell Bitcoin and Ethereum ETFs, Anticipating Billions of Dollars to Flow into the Market",
    "url": "https://www.crypto-news-flash.com/4-9t-bank-hsbc-enables-customers-to-buy-and-sell-bitcoin-and-ethereum-etfs-anticipating-billions-of-dollars-to-flow-into-the-market/?utm_source=rss&utm_medium=rss&utm_campaign=4-9t-bank-hsbc-enables-customers-to-buy-and-sell-bitcoin-and-ethereum-etfs-anticipating-billions-of-dollars-to-flow-into-the-market",
    "description": "The three Bitcoin and Ethereum futures offered by CSOP and Samsung will trade on the Hong Kong Stock Exchange. The development comes as Hong Kong regulators urged banking institutions to serve crypto clients. HSBC, the largest bank in Hong Kong, announced that it would allow its customers to trade Bitcoin and Ethereum futures Exchange Traded [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T18:25:38.000Z",
    "title": "Disney (DIS) Is Now Available for Trading on LBank Exchange",
    "url": "https://www.crypto-news-flash.com/disney-dis-is-now-available-for-trading-on-lbank-exchange/?utm_source=rss&utm_medium=rss&utm_campaign=disney-dis-is-now-available-for-trading-on-lbank-exchange",
    "description": "Road Town, BVI, June 27th, 2023, Chainwire LBank Exchange, a global digital asset trading platform, listed Disney (DIS) on June 27, 2023. For all users of LBank Exchange, the DIS/USDT trading pair is now officially available for trading. Disney (DIS) is a meme token issued by the relevant communities of blockchain, cryptocurrency, and mining. Introducing [...]"
  }
]