[
  {
    "source": "Cointelegraph",
    "date": "2024-01-15T06:07:54.000Z",
    "title": " Michael Saylor has been removing 80 deep fake videos of himself daily ",
    "url": "https://cointelegraph.com/news/microstrategy-michael-saylor-removing-80-ai-scam-videos-daily",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvM2Y4NDE4NjAtNzMyNi00ZjE4LWIxNjMtZGM1ODg0OWEyZGFkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>MicroStrategy executive chairman Michael Saylor reveals his team takes down 80 scam videos featuring his likeness every day, but they keep coming back.</p>\n                    <p><p>MicroStrategy executive chairman Michael Saylor reveals his team works to remove around 80 AI-generated fake videos of him daily — all of which tout some Bitcoin-related scam. </p><p>In a Jan. 13 post on X, Saylor warned his 3.2 million X followers about the large swathe of deep fake videos found on YouTube, warning that “the scammers keep launching more.”</p><p>“There is no risk-free way to double your #bitcoin, and @MicroStrategy doesn't give away $BTC to those who scan a barcode,” he reiterated.</p><p><a href=\"https://cointelegraph.com/news/microstrategy-michael-saylor-removing-80-ai-scam-videos-daily\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-15T06:04:00.000Z",
    "title": "Ukraine’s AI Drones Revolutionize Warfare, Posing a Formidable Challenge to Russia",
    "url": "https://www.cryptopolitan.com/ukraines-ai-drones-revolutionize-warfare/",
    "description": "In a groundbreaking development that could reshape the course of the ongoing conflict, Ukraine has turned to artificial intelligence (AI) to enhance the capabilities of its drone fleet. The use of self-teaching targeting algorithms in nimble quadcopter drones has become a critical response to Russia&#8217;s deployment of electronic warfare (E.W.) equipment, threatening Ukraine&#8217;s drone operations. [&#8230;]"
  }
]