[
  {
    "source": "Cointelegraph",
    "date": "2023-08-28T23:56:40.000Z",
    "title": "Friend.tech threatens to punish users if they use copycat apps",
    "url": "https://cointelegraph.com/news/friend-tech-threatens-users-for-competitor-apps",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/c5b2b599-c89c-4393-9f39-41bfd76a0079.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Friend.tech warned users who choose to jump ship to “forks and copies” will see their existing points forfeited.</p>\n                    <p><p>Crypto’s newest decentralized social media (DeSo) app friend.tech has been met with intense criticism over a decision to punish users who opt in to forks or copycat versions of its tokenized social media platform. </p><p>“To make sure loyal users are rewarded fairly during our beta, users moving to forks and copies will automatically opt out of earning Points and forfeit existing points,” wrote the official friend.tech X account in an Aug. 28 tweet. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We expect <a href=\"https://twitter.com/friendtech?ref_src=twsrc%5Etfw\">@friendtech</a> clones and other types of copies will emerge. <br><br>To make sure loyal users are rewarded fairly during our beta, users moving to forks and copies will automatically opt out of earning Points and forfeit existing points. They will be able to use the app normally <a href=\"https://t.co/C1rTEQQr17\">pic.twitter.com/C1rTEQQr17</a></p>&mdash; friend.tech (@friendtech) <a href=\"https://twitter.com/friendtech/status/1696280326027558994?ref_src=twsrc%5Etfw\">August 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>While Friend.tech did not make mention to any specific competitors, and number of X users in the reply <a href=\"https://twitter.com/RuneCrypto_/status/1696285988622840310\" target=\"_blank\" rel=\"noopener nofollow\">pointed</a> to a new DeSo or “SocialFi” application called Shares which is scheduled to go live to public beta on Aug. 31. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Shares <a href=\"https://twitter.com/hashtag/roadmap?src=hash&amp;ref_src=twsrc%5Etfw\">#roadmap</a> for the following week.<br><br>We&#39;ll be sharing daily dev logs on Medium about updates. We started building the <a href=\"https://twitter.com/search?q=%24SHARES&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$SHARES</a> platform&#39;s backend a couple of weeks ago, and started with our frontend this weekend - so far, it&#39;s been a huge progress! <a href=\"https://t.co/oLEYMlhIcF\">pic.twitter.com/oLEYMlhIcF</a></p>&mdash; shares.finance (@SharesFinance) <a href=\"https://twitter.com/SharesFinance/status/1693767728551669778?ref_src=twsrc%5Etfw\">August 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Friend.tech has been airdropping “reward points” to its beta testers every week, which will total a distribution of 100 million points over 6 months. </p><p>The team has not yet shared what the points will be ultimately used for, only <a href=\"https://twitter.com/friendtech\" target=\"_blank\" rel=\"noopener nofollow\">mentioning</a> on Aug. 15 it “will have a special purpose when the app enters official release status.” </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We just did our first Friday Points Airdrop to 44k users. <br><br>Some reminders:<br>- 100M points will be distributed during the six month beta period<br>- Airdrops happen on Fridays<br>- Points are recorded off-chain<br>- Points will have a special purpose once the beta period ends</p>&mdash; friend.tech (@friendtech) <a href=\"https://twitter.com/friendtech/status/1692671761794687310?ref_src=twsrc%5Etfw\">August 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Some expect it to translate to tokens to friend.tech governance, while others believe it could have some financial significance for users. Others <a href=\"https://twitter.com/TrustlessState/status/1692611042629611838\" target=\"_blank\" rel=\"noopener nofollow\">believe</a> that due to the seed round <a href=\"https://twitter.com/friendtech/status/1692588652172640666\" target=\"_blank\" rel=\"noopener nofollow\">investment</a> from Paradigm, there will likely be a friend.tech native token airdrop in the future. </p><p>Friend.tech’s announcement did not go down well with members of the crypto community.</p><p>Within the first hour of the announcement being posted — it attracted hundreds of negative comments and reposts that derided the app for its anti-competitive move. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/fb208e07-1843-42f7-aff9-5ef75e3cd4fe.PNG\"  /><figcaption style=\"text-align: center;\"><em>Another reaction from an X user over the recent announcement. Source: X (Twitter)</em></figcaption></figure><p>“Threatening / penalizing users for trialing other platforms is completely against everything this industry stands for,” <a href=\"https://twitter.com/CryptoKaleo/status/1696300189689037179\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> pseudonymous trader CryptoKaleo in response to the announcement. </p><p>“This is a prime example of how not to handle competition in Web3 lol — excited to read the apology in a few hours” <a href=\"https://twitter.com/Phin_totten/status/1696286545047666927\" target=\"_blank\" rel=\"noopener nofollow\">said</a> another. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/friendtech-denies-report-leaked-user-data\"><strong><em>Friend.tech denies report that database of over 100K users was leaked</em></strong></a></p><p>The announcement comes less than three weeks after its public launch of Aug. 11. Meanwhile, Friend.tech has seen a <a href=\"https://cointelegraph.com/news/friendtech-pronounced-dead-inflows-activity-declines\">drop in key metrics</a> such as activity, inflows and volume over the past few days. </p><p>At the time of publication transactions on Friend.tech have declined more than 90% from its peak of nearly 525,000 transactions on Aug. 21, with less than 50,000 cumulative transactions on Aug. 28, according to <a href=\"https://dune.com/cryptokoryo/friendtech\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from Dune Analytics.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-games-decentralized-lattice-starknet-cartridge/\"><strong><em>Blockchain games aren’t really decentralized… but that’s about to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-29T00:00:35.000Z",
    "title": "SEC Commissioners Peirce, Uyeda push back against SEC’s NFT enforcement action",
    "url": "https://cryptoslate.com/sec-commissioners-peirce-uyeda-push-back-against-secs-nft-enforcement-action/",
    "description": "<p>SEC Commissioners Hester Peirce and  Mark T. Uyeda have vocalized their disagreement over the Commission&#8217;s handling of its enforcement action against Impact Theory, marking the first enforcement action of the SEC against a non-fungible token (NFT). The concerns, articulated in a public statement, highlight the complexities surrounding the regulation of NFTs, a rapidly evolving asset [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sec-commissioners-peirce-uyeda-push-back-against-secs-nft-enforcement-action/\">SEC Commissioners Peirce, Uyeda push back against SEC’s NFT enforcement action</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-29T00:00:36.000Z",
    "title": "Bitcoin Miner Revenue Rapidly Falling, What Happens Next?",
    "url": "https://www.newsbtc.com/news/bitcoin-miner-revenue-rapidly-falling-what-happens-next/",
    "description": "Bitcoin miners are churning less in revenue, looking at trackers on August 28. According to Hashrate Index data, a platform that tracks the correlation between hash rate and revenue accrued by miners over time, income generated from Bitcoin mining operations is at near record lows. Bitcoin Miner Revenue Declining At $0.059 per Tera Hash (TH) daily, the trend doesn’t look exciting for Bitcoin miners as it is cents away from $0.056, a level recorded in late November 2022. At the depth of last year’s crypto winter when prices fell, cracking below $16,000, hash price, which measures the potential revenue expected from deploying 1 Tera Hash of hash rate to the Bitcoin network per day, crumbled to the lowest point in three years. While BTC supporters are optimistic, expecting prices to recover in the second half of 2023, miners must contend with lower revenue. How this impacts their operations is yet to be seen because miners depend on income generated from deploying hash rate to cater for operational expenses and sometimes pay shareholders.  On May 8, the hash price rose to $0.095, the highest level in 2023, but has since contracted, dropping by over 40%. As the hash price falls, it could mean miners are having a hard time competing. The trend, as it is visible, comes when the hash rate has been rising to record levels as more miners power up their mining rigs.  Related Reading: Binance Will Halt These 39 Liquidity Mining Pools This Week Throughout 2023, the total Bitcoin hash rate, a metric measuring the computing power channeled to the network, rose from 269 EH/s in early January 2023 to 465 EH/s in early July 2023. The hash rate has since dropped around 329 EH/s, a level that’s still higher than 2022 highs.  More Rigs, Higher Hash Rate With a rising hash rate, the Bitcoin network automatically adjusted the mining difficulty to the highest level last week. Trackers show the network’s difficulty is now at 55.62 T, following a 6% increment. For the better part of the year, difficulty levels have been rising amid an increase in hash rate. As prices recovered in January and the hash rate rose, the network increased difficulty levels by 10%, the highest spike this year. Related Reading: OnlyFans Parent Company Buys $20 Million Worth of Ethereum – A Boost To ETH Price? Hash rate will likely continue rising in the months ahead. Tether Energy, an affiliate of Tether Holdings, issues USDT, plans to connect their rigs in Latin America. Their launch translates to more competition for existing miners, including Riot Blockchain.  Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-29T00:00:52.000Z",
    "title": "Ex-Goldman Sachs Executive Explains Bullish Crypto Thesis, Says Markets Will Likely Outperform Tech Stocks",
    "url": "https://dailyhodl.com/2023/08/28/ex-goldman-sachs-executive-explains-bullish-crypto-thesis-says-markets-will-likely-outperform-tech-stocks/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Donations-Have-Flowed-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Donations-Have-Flowed-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Donations-Have-Flowed-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Donations-Have-Flowed-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Donations-Have-Flowed-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Donations-Have-Flowed-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Donations-Have-Flowed-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Former Goldman Sachs executive and Real Vision CEO Raoul Pal is explaining his bullish stance on crypto assets. In a new Ask Me Anything (AMA) session on YouTube, the macro guru says blockchain gives users and investors a chance to own and operate pieces of a network, as opposed to other systems where most people [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/28/ex-goldman-sachs-executive-explains-bullish-crypto-thesis-says-markets-will-likely-outperform-tech-stocks/\">Ex-Goldman Sachs Executive Explains Bullish Crypto Thesis, Says Markets Will Likely Outperform Tech Stocks</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]