[
  {
    "source": "Cointelegraph",
    "date": "2023-09-21T09:02:25.000Z",
    "title": "NFTs are 'totally worthless' says mainstream media, community responds",
    "url": "https://cointelegraph.com/news/nfts-totally-worthless-mainstream-media-says-community-responds",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/4f333e0e-8536-49d7-9b8e-0422f679d68a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A community member highlights the drastic shift in mainstream media narrative, sharing a previous article promoting the Bored Ape Yacht Club NFT collection.  </p>\n                    <p><p>Mainstream media outlet Rolling Stone has <a href=\"https://www.rollingstone.com/culture/culture-news/nfts-worthless-researchers-find-1234828767/\" target=\"_blank\" rel=\"noopener nofollow\">declared</a> that nonfungible tokens (NFTs) are “finally totally worthless,” citing the results of a dappGambl <a href=\"https://dappgambl.com/nfts/dead-nfts/\" target=\"_blank\" rel=\"noopener nofollow\">study </a>on the \"evolving landscape' of NFTs. The study found that as many as 95% of NFTs (owned by more than 23 million investors) have no value at all. </p><p>The response from community has been varied, with some agreeing with the report and others linking previous reports from the outlet that supported the same NFTs they’ve now called out. </p><p>In a Reddit thread, most of the comments agree with the report. Some <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/16o7idk/comment/k1j17pj/?utm_source=share&amp;utm_medium=web2x&amp;context=3\" target=\"_blank\" rel=\"noopener nofollow\">called</a> NFTs the \"worst things to emerge from crypto\" and others <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/16o7idk/comment/k1j2h0t/?utm_source=share&amp;utm_medium=web2x&amp;context=3\" target=\"_blank\" rel=\"noopener nofollow\">claim</a> that they were \"worthless ages ago.” Despite this, a community member believes that while they may be worthless now, this may change in the future. \"Some will make a comeback. Some will go up 1000% because bull. People will get mad again that pixels are worth millions,\" they <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/16o7idk/comment/k1j26mz/?utm_source=share&amp;utm_medium=web2x&amp;context=3\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a>. </p><p>On Twitter, a community member <a href=\"https://twitter.com/juwanthewriter/status/1704674327449231560\" target=\"_blank\" rel=\"noopener nofollow\">shared</a> a previous Rolling Stone article promoting the Bored Ape Yacht Club (BAYC) NFT collection in an attempt to highlight the change in narrative within the media outlet. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/f0944a85-39f9-4d98-a79f-77b935d0a74f.png\"  /><figcaption style=\"text-align: center;\"><em>Community member sharing a previous report from the outlet. Source: X</em></figcaption></figure><p>Meanwhile, another community member <a href=\"https://twitter.com/DayTrader888/status/1704760131731271926\" target=\"_blank\" rel=\"noopener nofollow\">believes</a> that when mainstream media shares these types of posts, a “reversal” is bound to happen, while another <a href=\"https://twitter.com/iamandyholt/status/1704647966794174569\" target=\"_blank\" rel=\"noopener nofollow\">backed</a> up the statement saying that “now is the time to buy.” </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ronaldo-teases-nft-plans-while-on-a-lie-detector-test\"><strong><em>Ronaldo teases NFT plans while on a lie detector test</em></strong></a></p><p>On Aug. 3, Ethereum gas usage for NFTs fell significantly, signaling a potential <a href=\"https://cointelegraph.com/news/nft-gas-usage-shows-downward-trend-signals-shift-in-landscape\">shift in NFT usage</a>, with users holding on to their assets instead of actively trading. In 2021, NFTs were on the top in terms of gas usage in the Ethereum network, showing that the NFT holders were actively trading and moving their assets. Two years later, NFT marketplaces that once dominated the gas usage charts have now fallen off the list. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/nft-collector-ai-art-tomorrowland/\"><strong><em>NFT Collector: Creative AI art, Tomorrowland sells tomorrow’s future</em></strong></a><strong><em> </em></strong></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-21T08:47:47.000Z",
    "title": "Crypto payment firm Alchemy Pay wins money transmitter license in US",
    "url": "https://cointelegraph.com/news/crypto-payment-firm-alchemy-pay-arkansas-license",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/262f172c-6adb-4a92-9504-9f0f9a2e1195.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Alchemy Pay has joined the ranks of crypto firms like Coinbase and Jack Dorsey’s Block in securing a Money Transmitter License in Arkansas.</p>\n                    <p><p>Cryptocurrency payment gateway Alchemy Pay is expanding its global presence after securing a major payment license in the United States.</p><p>Alchemy Pay has obtained a Money Transmitter License in the state of Arkansas, the firm announced to Cointelegraph on Sept. 20.</p><p><a href=\"https://nmlsconsumeraccess.org/EntityDetails.aspx/COMPANY/2449570\" target=\"_blank\" rel=\"noopener nofollow\">Granted</a> by the Arkansas Securities Department, the license officially enables Alchemy Pay to operate services like selling or issuing payment instruments, stored value and prepaid access, as well as receiving money, digital currency or monetary value for transmission.</p><p>In receiving the Money Transmitter License, Alchemy Pay joins the ranks of many cryptocurrency firms that are authorized to provide crypto-to-fiat transactions in Arkansas, including Coinbase, <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/jack-dorsey\">Jack Dorsey</a>’s Block, MoonPay, bitFlyer exchange and others.</p><p>The license marks a significant milestone in Alchemy Pay’s efforts to secure local regulatory approvals in crucial global markets. The firm has also previously obtained licenses in its <a href=\"https://cointelegraph.com/news/crypto-gateway-alchemy-pay-scores-license-in-indonesia\">operating markets like Indonesia</a> and Lithuania.</p><p>According to the announcement, Alchemy Pay is currently in the process of obtaining Money Transmitter Licenses in other states across the United States.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/paypal-rolls-out-pyusd-stablecoin-venmo\"><strong><em>PayPal rolls out PYUSD stablecoin to Venmo users</em></strong></a></p><p>“With a strong dedication to compliance, our team had invested substantial time and effort into securing licenses across various countries and regions,” Alchemy Pay’s ecosystem lead Robert McCraken said, adding:</p><blockquote>“The company now prepares to expand its presence, aims to expand its services to users in the United States, and further contribute to our mission, bridging the fiat and crypto global economies.\"</blockquote><p>Founded in 2018 in Singapore, Alchemy Pay operates a crypto-to-fiat payment platform allowing transactions between fiat currencies like the U.S. dollar or euro and cryptocurrencies like Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) or Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>). According to the Alchemy Pay website, the platform supports payments in 173 countries at the time of writing, <a href=\"https://intercom.help/alchemy-pay/en/articles/6642356-which-countries-and-regions-alchemy-pay-support\" target=\"_blank\" rel=\"noopener nofollow\">including</a> jurisdictions and regions Australia, Canada, Hong Kong, the United Arab Emirates, India and others.</p><p>The news comes shortly after Alchemy Pay <a href=\"https://alchemypay.org/news-and-press/alchemy-pay-listed-as-mastercard-service-provider-2\" target=\"_blank\" rel=\"noopener nofollow\">became</a> one of the compliant service providers within the Site Data Protection program by the global payment giant Mastercard in June 2023. Previously, Alchemy Pay ​​was officially <a href=\"https://alchemypay.medium.com/visa-lists-alchemy-pay-as-official-service-provider-10118e3da72e\" target=\"_blank\" rel=\"noopener nofollow\">listed</a> as an official service provider by Visa in January 2023.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Magazine: Crypto regulation — Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-21T09:10:06.000Z",
    "title": "Australian regulator sues Kraken provider Bit Trade for $13M in user losses",
    "url": "https://cryptoslate.com/australian-regulator-sues-krakens-provider-bit-trade-for-13m-in-user-losses/",
    "description": "<p>The Australian Securities and Investments Commission (ASIC) alleged that Kraken Crypto Exchange&#8217;s provider, Bit Trade Pty Ltd, caused Australians losses of roughly $12.95 million due to non-compliance with local laws. Due to this, the financial regulator has filed a lawsuit against Bit Trade, highlighting how its margin trading product failed to comply with the design [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/australian-regulator-sues-krakens-provider-bit-trade-for-13m-in-user-losses/\">Australian regulator sues Kraken provider Bit Trade for $13M in user losses</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-21T08:48:26.000Z",
    "title": "Coinbase Flags 51% Risk On Zcash Amidst ViaBTC Control",
    "url": "https://cryptodaily.co.uk/2023/09/coinbase-flags-51-risk-on-zcash-amidst-viabtc-control",
    "description": "The Electric Coin Company (ECC), the entity behind Zcash, has responded to Coinbase and its preventive measures, stating it is aware of the issue."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T09:12:23.000Z",
    "title": "Optimism announces private sale of $160M in OP tokens to select buyers",
    "url": "https://www.cryptopolitan.com/optimism-announces-private-sale-of-160m/",
    "description": "In a noteworthy development, the Ethereum layer-2 scaling solution, Optimism, recently declared its intention to orchestrate a private sale of a staggering 116 million OP tokens to a select group of seven buyers. The intent behind this move is primarily focused on treasury management. The impending transaction, valued at approximately $159 million considering the current ... <a title=\"Optimism announces private sale of $160M in OP tokens to select buyers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-announces-private-sale-of-160m/\" aria-label=\"More on Optimism announces private sale of $160M in OP tokens to select buyers\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T09:07:14.000Z",
    "title": "U.K. Parliament greenlights online safety bill, extending regulations to the metaverse",
    "url": "https://www.cryptopolitan.com/u-k-parliament-greenlights-online-safety-bill/",
    "description": "On Tuesday, the U.K. Parliament passed the Online Safety Bill, a comprehensive framework designed to protect internet users from encountering illegal or harmful content.&#160; Notably, the bill has been extended to cover the metaverse, a collective of virtual worlds that has gained significant traction following Facebook&#8217;s rebranding to Meta. The legislation mandates companies to assess ... <a title=\"U.K. Parliament greenlights online safety bill, extending regulations to the metaverse\" class=\"read-more\" href=\"https://www.cryptopolitan.com/u-k-parliament-greenlights-online-safety-bill/\" aria-label=\"More on U.K. Parliament greenlights online safety bill, extending regulations to the metaverse\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T08:44:16.000Z",
    "title": "Web3 platforms gain traction amidst payment and censorship concerns for content creators",
    "url": "https://www.cryptopolitan.com/web3-platforms-traction-censorship-concerns/",
    "description": "With the recent disruptions in traditional platforms like Patreon and OnlyFans, creators are now turning to Web3 for greater autonomy over their content and to evade the risk of censorship. Decentralized platforms promise not only better financial independence but also a safeguard against being arbitrarily removed from platforms due to controversial content. Power shift from ... <a title=\"Web3 platforms gain traction amidst payment and censorship concerns for content creators\" class=\"read-more\" href=\"https://www.cryptopolitan.com/web3-platforms-traction-censorship-concerns/\" aria-label=\"More on Web3 platforms gain traction amidst payment and censorship concerns for content creators\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T08:43:14.000Z",
    "title": "Turkey shifts to conventional economic policies amid rising inflation and falling lira",
    "url": "https://www.cryptopolitan.com/turkey-shifts-conventional-economic-policies/",
    "description": "Turkey&#8217;s central bank is anticipated to significantly increase its key interest rate for the second consecutive month, marking a shift towards more conventional economic policies under President Recep Tayyip Erdogan. However, economists remain concerned that Turkey may still be on a risky path, as interest rates are considerably lower than the levels needed to counteract ... <a title=\"Turkey shifts to conventional economic policies amid rising inflation and falling lira\" class=\"read-more\" href=\"https://www.cryptopolitan.com/turkey-shifts-conventional-economic-policies/\" aria-label=\"More on Turkey shifts to conventional economic policies amid rising inflation and falling lira\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-21T08:45:54.000Z",
    "title": "Crypto Analyst Predicts More Trouble Ahead For Bitcoin Price, Here’s Why",
    "url": "https://www.newsbtc.com/news/bitcoin/trouble-for-bitcoin-price/",
    "description": "Crypto analyst Nicholas Merten has given an insight into the future trajectory of the Bitcoin price, suggesting that the flagship cryptocurrency may experience turbulent times ahead.  The Calm Before The Storm For Bitcoin In a recent episode of his YouTube channel DataDash, Merton mentioned that Bitcoin, other altcoins, and the broader asset market were on the brink of a major move as several macro factors were coming together. He further went ahead to discuss how these different “dominos”  could “potentially cause a lot of pain in the economy.” Related Reading: Bearish Signal? Bitcoin Whale Wakes Up From 6-Year Slumber And Transfers $56 Million The first macro factor he mentioned was equities. According to him, the direction of equities and the broader assets are going to have a “direct impact” on Bitcoin. He showed a direct relation between the equity market and the crypto market as coins began to pick up at the beginning of the year, right around when the former was on a high. However, he pointed out that the equity market has been relatively quiet as the narratives that are meant to push it higher haven’t done the job. As such, he believes that if stocks like Apple’s, Microsoft’s, and Fang’s (basically the stocks of major tech companies) don’t start picking up, then there could be a “really big problem” (most likely in reference to the crypto market). Re-Inflation On The Rise Another factor that he emphasized was the inflation data. Merton seemed to suggest that the Fed wasn’t doing enough to curb inflation and bring it down to the target of 2%. According to him, the Fed could have taken a more stringent approach by raising the rates by 75 basis points or even 100.  The inflation rate is known to have a significant impact on the crypto market, as a higher rate means that investors may have little or nothing to spend in the crypto market. Merton noted that it is evident that the Fed isn’t doing enough as the prices of several goods and services (including energy) seem to be re-inflating.  He made a comparison to the ‘70s when inflation was also at an all-time high and stated that if this time is nearly similar to then or if there is a trend, then it could be a “huge problem.” Related Reading: Is $10,000 Possible For XRP Price? Crypto Analysts Weigh In Some may argue that the ‘70s were extreme times, especially with the oil embargo, which makes it different from this period. However, Merton noted that there isn’t much difference as we have the situation with BRICS, which suggests that the world is de-globalizing and nations are less trusting of one another.  This would invariably affect trade deals and foreign relations, something which Merton believes would have “inflationary pressures,” and the Fed is well aware of this. He stated that the major reason we are experiencing this re-inflation is because supply and demand aren’t balanced.  According to him, there is excess money in the system due to the “excess printing of money” which people got rich off and the stimulus checks during the COVID era. As such, there is so much purchasing power without there being enough supply to meet these demands. BTC price drops below $27,000 once again &#124; Source: BTCUSD on Tradingview.com Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-21T09:16:25.000Z",
    "title": "Will BlackRock Apply for an XRP Spot ETF as the Next Step? All Rumors Regarding the Bitcoin to XRP Shift and Their Implications Unveiled",
    "url": "https://www.crypto-news-flash.com/will-blackrock-apply-for-an-xrp-spot-etf-as-the-next-step-all-rumors-regarding-the-bitcoin-to-xrp-shift-and-their-implications-unveiled/?utm_source=rss&utm_medium=rss&utm_campaign=will-blackrock-apply-for-an-xrp-spot-etf-as-the-next-step-all-rumors-regarding-the-bitcoin-to-xrp-shift-and-their-implications-unveiled",
    "description": "<img width=\"721\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/blackrock-f.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/blackrock-f.jpg 721w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/blackrock-f-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/blackrock-f-104x69.jpg 104w\" sizes=\"(max-width: 721px) 100vw, 721px\" />Market players shut down rumors claiming that BackRock might be ditching Bitcoin for XRP.  On the other hand, Ripple is strengthening its position in the market by establishing a new partnership with Tranglo &#38; SBI Remit. Rumors have been circulating that leading asset manager Blackrock is shifting from Bitcoin and opting for a Ripple-backed digital [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-21T09:00:36.000Z",
    "title": "Dogecoin Is Oversold: $DOMI Takes Over $DOGE and $SOL This September?",
    "url": "https://www.crypto-news-flash.com/dogecoin-is-oversold-domi-takes-over-doge-and-sol-this-september/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-is-oversold-domi-takes-over-doge-and-sol-this-september",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-130.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-130.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-130-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-130-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the current bear market, meme coins have taken an especially hard hit. Dogecoin ($DOGE) has been one of the biggest casualties, but on-chain data suggests that it might be oversold. Amid the bearishness, the revolutionary NFT marketplace, Domini.art ($DOMI) has grabbed investors attention. And even crypto big-wigs like Solana ($SOL) are lagging behind. Let’s [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-21T08:46:56.000Z",
    "title": "3 EXPLOSIVE AI Altcoins to Buy RIGHT NOW",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/3-explosive-ai-altcoins-to-buy-right-now/",
    "description": "<p>YOU ARE EARLY! Experts expect AI to grow 250% in the next 5 years. A significant part of this growth will flow into crypto. So, a crypto AI gem is a must-have in your blockchain portfolio. In this article, I will be talking about 3 great crypto AI altcoins. One of these has recently made [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/3-explosive-ai-altcoins-to-buy-right-now/\">3 EXPLOSIVE AI Altcoins to Buy RIGHT NOW</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-21T08:48:00.000Z",
    "title": "Tether Makes U-Turn on USDT Loan Issuance, Adds $200M to Portfolio",
    "url": "https://coinedition.com/tether-makes-u-turn-on-usdt-loan-issuance-adds-200m-to-portfolio/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/usdt-5.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/usdt-5.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/usdt-5-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/usdt-5-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/usdt-5-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/usdt-5-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/usdt-5-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/usdt-5-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/usdt-5-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/usdt-5-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/usdt-5-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/usdt-5-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/usdt-5-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/usdt-5-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/usdt-5-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/usdt-5-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/usdt-5-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to a recent report from The Wall Street Journal (WSJ), Tether Holdings, the issuer of stablecoin USDT, has resumed lending its coins to customers. The report cited that the move comes less than a year after Tether had announced its intention to wind down the practice. WSJ highlighted that a spokeswoman for Tether confirmed [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/tether-makes-u-turn-on-usdt-loan-issuance-adds-200m-to-portfolio/\">Tether Makes U-Turn on USDT Loan Issuance, Adds $200M to Portfolio</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-21T09:15:03.000Z",
    "title": "Trader Issues Warning on Ethereum-Based Altcoin That’s Soared Over 300% in a Month, Updates Outlook on Bitcoin",
    "url": "https://dailyhodl.com/2023/09/21/trader-issues-warning-on-ethereum-based-altcoin-thats-soared-over-300-in-a-month-updates-outlook-on-bitcoin/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/altcoin-over-30.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/altcoin-over-30.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/altcoin-over-30.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/altcoin-over-30.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/altcoin-over-30.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/altcoin-over-30.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/altcoin-over-30.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is putting traders on notice regarding one Ethereum (ETH)-based Chainlink (LINK) rival. The analyst and trader pseudonymously known as Altcoin Sherpa tells his 196,400 followers on the social media platform X that the decentralized oracle protocol Tellor Tributes (TRB) is setting up for a correction after rallying by slightly over [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/21/trader-issues-warning-on-ethereum-based-altcoin-thats-soared-over-300-in-a-month-updates-outlook-on-bitcoin/\">Trader Issues Warning on Ethereum-Based Altcoin That’s Soared Over 300% in a Month, Updates Outlook on Bitcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]