[
  {
    "source": "CoinDesk",
    "date": "2023-06-16T15:11:07.000Z",
    "title": "Tether’s Banking Relationships, Commercial Paper Exposure Detailed in Newly Released Legal Documents",
    "url": "https://www.coindesk.com/policy/2023/06/16/tethers-banking-relationships-commercial-paper-exposure-detailed-in-newly-released-legal-documents/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Tether's banking relationships were detailed in a rare but limited window into the reserves behind USDT, the crypto market’s largest stablecoin, in documents obtained by CoinDesk under a Freedom of Information Law request."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-16T15:29:15.000Z",
    "title": "BlackRock spot Bitcoin ETF ‘not happening,’ application politically motivated, says Noelle Acheson",
    "url": "https://cryptoslate.com/blackrock-spot-bitcoin-etf-not-happening-application-politically-motivated-says-noelle-acheson/",
    "description": "<p>Noelle Acheson of the Crypto is Macro Now newsletter poured cold water on the possibility of the U.S. Securities Exchange Commission approving BlackRock&#8217;s Bitcoin ETF application, saying, &#8220;It&#8217;s not going to happen.&#8221; The Bitcoin community largely took the news of the ETF application positively. For example, Peter McCormack pondered whether its approval would spark a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/blackrock-spot-bitcoin-etf-not-happening-application-politically-motivated-says-noelle-acheson/\">BlackRock spot Bitcoin ETF &#8216;not happening,&#8217; application politically motivated, says Noelle Acheson</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-16T15:29:25.000Z",
    "title": "Jack Dorsey’s $5M Pledge to Boost Bitcoin Development",
    "url": "https://www.cryptoglobe.com/latest/2023/06/jack-dorseys-5m-pledge-to-boost-bitcoin-development/",
    "description": "Twitter and Square CEO Jack Dorsey has pledged $5 million to Brink, a leading funder of open-source Bitcoin developers, according to a report by Alisa Hertig for Decrypt. The donation, to be disbursed over five years, will be made through Dorsey’s Start Small initiative, originally established in 2020 for COVID-19 relief efforts. The Decrypt report […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-16T15:15:00.000Z",
    "title": "Bitcoin Price Analysis:  25604 Selling Pressure - 17 June 2023",
    "url": "https://cryptodaily.co.uk/2023/06/bitcoin-price-analysis-25604-selling-pressure-17-june-2023",
    "description": "<p>BTC/USD 25604 Selling Pressure:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 17 June 2023</p>\n<p>Bitcoin (BTC/USD) encountered selling pressure early in the Asian session as the pair tumbled to the 25143.24 area after technical selling pressure emerged around the 25604.52 level, a previous downside price objective linked to selling pressure in mid-May.&nbsp; &nbsp;The pair&rsquo;s depreciation slowed when BTC/USD tested the 61.8% retracement of the recent short-term appreciating range from 24750 to 25749.99.&nbsp; Large Stops are cited below the 24660 and 24568 levels, and bears are eyeing the 23196.08 area as a significant downside price objective.&nbsp; Above the market, Stops are cited above the 26544, 26912, 27281, 27737, and 27805 levels.&nbsp; &nbsp;Below the market, downside price objectives include the 25323.24 and 24680.87 levels.&nbsp; Notably, the 25309.26 area represents the 50% retracement of the appreciating range from 19568.52 to 30825.30.&nbsp; Stops are also cited below major retracement levels linked to the 19568.52 and 15460 levels, including the 25094, 23954, 23255, 22278, 22025, 21415, 19139, and 18796 areas.</p>\n<p>Additional downside price objectives include the 24440, 23208, and 22769 levels.&nbsp; Following recent price activity, areas of technical resistance and potential selling pressure include the 27528, 27737, 27805, 28200, 28473, and 28873 levels.&nbsp; Upside retracement levels in recent depreciating ranges include the 28700, 28741, 28868, 29243, 29299, and 29284 levels.&nbsp; Above the market, upside price objectives include the 30420.74, 31237.11, 31477.37, 32501.23, 32556.73, 32989.19, 34583.96, 34658.69, 35222.66, 37765.28, and 38403.97 levels.&nbsp; &nbsp;Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 100-bar MA (hourly) and below the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 25915.19 and the&nbsp;50-bar MA&nbsp;(Hourly) at 25347.23.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-16T15:30:10.000Z",
    "title": "Biggest Movers: SHIB Remains Close to 21-Month Low, Following Recent Bear Run",
    "url": "https://news.bitcoin.com/biggest-movers-shib-remains-close-to-21-month-low-following-recent-bear-run/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2076099265-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SHIB Remains Close to 21-Month Low, Following Recent Bear Run\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2076099265-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2076099265-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2076099265-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2076099265-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2076099265-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2076099265-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2076099265-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Despite a slight rebound in price, shiba inu remained near its lowest level in 21 months during Friday&#x2019;s session. Overall, the global cryptocurrency market cap was marginally higher, climbing by 1% as of writing. XRP was an exception, dropping to a three-week low today. Shiba Inu (SHIB) Shiba inu (SHIB) moved away from its lowest [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T15:36:40.000Z",
    "title": "ISO 20022 Crypto: List of Compliant Coins in 2023",
    "url": "https://www.cryptopolitan.com/iso-20022-compliant-crypto-list/",
    "description": "The ISO 20022 crypto-list is a collection of compliant digital coins and tokens that satisfy the standards of the International Organization for Standardization (ISO) standards 20022.&#160;There are many cryptocurrencies that will be integrated into this&#160;new financial system, referred to as&#160;ISO 20022-compliant cryptocurrencies&#160;and there is much speculation these cryptocurrencies will soar in price once the standard ... <a title=\"ISO 20022 Crypto: List of Compliant Coins in 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/iso-20022-compliant-crypto-list/\" aria-label=\"More on ISO 20022 Crypto: List of Compliant Coins in 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T15:25:23.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 While the crypto market navigated the fallout from the&#160;collapse&#160;of FTX in late 2022, Ava Labs says it dodged the bullet. Ava Labs founder and CEO Emin Gün Sirer assure its stakeholders that FTX impacts very little the companies and projects operating in the Avalanche ecosystem. The company had an account on ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T15:18:01.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-16T15:30:44.000Z",
    "title": "Curve (CRV) Observes 7% Bounce As Short Squeeze Occurs",
    "url": "https://www.newsbtc.com/altcoin/curve-crv-observes-7-bounce-as-short-squeeze-occurs/",
    "description": "Curve DAO token (CRV) has observed a 7% bounce during the last 24 hours as mass liquidations of short traders have occurred in the market. Curve Funding Rates Turned Extremely Negative Following Price Decline According to data from the on-chain analytics firm Santiment, an extreme amount of shorts had accumulated on the cryptocurrency exchange Binance recently. The relevant indicator here is the &#8220;funding rate,&#8221; which keeps track of the periodic fee that Curve perpetual contract traders on a specific exchange are paying each other right now. When the value of this metric is positive, it means that the long contract holders are willing to pay a premium to the short contract holders in order to keep their position currently. Such a trend implies that bullish sentiment is held by the majority of investors. On the other hand, negative values suggest that a bearish mentality is the dominant force in the market at the moment as the shorts are paying a fee to the longs. Now, here is a chart that shows the trend in the Curve funding rates on the cryptocurrency exchange Binance over the past month or so: The value of the metric seems to have been quite red not too long ago &#124; Source: Santiment on Twitter As displayed in the above graph, the Curve Binance funding rate had assumed negative values recently as the cryptocurrency&#8217;s price had continued to head downwards. The decline in the asset&#8217;s price came in part because of all the FUD in the wider cryptocurrency sector, like the SEC charges against Binance and Coinbase, or the Fed interest rates decision, while the other factor was CRV-specific uncertainty. The root cause of this FUD is the fact that the Curve Finance founder has taken up a large loan against a wallet that currently holds around 30% of the entire circulating supply of the token. As the price of the asset has taken a hit recently, concerns about this position getting liquidated have grown in the market. Since the wallet holds such a significant part of the cryptocurrency&#8217;s supply (288.7 million tokens to be precise), a potential liquidation could have wide-reaching consequences for the project. From the graph, it&#8217;s visible that the Binance funding rate had become extremely red as this FUD spread around. This means that the sentiment on the exchange had become quite bearish. Related Reading: Bitcoin Holders Show No Panic Loss Selling, What Does It Mean? Historically, whenever the traders have leaned too hard into any particular direction, the market has tended to actually show a sharp move in the opposite direction. The reason behind this is an event called a squeeze, which takes place whenever a sudden swing in the price occurs and causes a mass amount of liquidations to go off at once. These liquidations only end up fueling said price swing further, leading to even more liquidations happening in the market. In this way, liquidations can sort of waterfall together during a squeeze. Related Reading: What Happens To Bitcoin Price If Spot ETF Is Approved? Gold ETF Story Reveals In the graph, it&#8217;s visible that after the funding rate had turned very negative, the indicator suddenly started going the other way, and it has now already turned very slightly positive. This suggests that a short squeeze has taken place in the market, as the shorts that had accumulated have all been washed away. The Curve price has jumped off this squeeze, registering a rise of about 7%. CRV Price At the time of writing, the Curve DAO token is trading around $0.61, down 20% in the last week. Looks like the asset has seen some recovery &#124; Source: CRVUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-16T15:30:56.000Z",
    "title": "Institutional DeFi Project Chooses IOTA for Development, Citing Tangle’s MiCA and Law Compliance as Key Factors",
    "url": "https://www.crypto-news-flash.com/institutional-defi-project-chooses-iota-for-development-citing-tangles-mica-and-law-compliance-as-key-factors/?utm_source=rss&utm_medium=rss&utm_campaign=institutional-defi-project-chooses-iota-for-development-citing-tangles-mica-and-law-compliance-as-key-factors",
    "description": "IOTA co-founder said that an institutional DeFi project is looking to work with IOTA due to its strong regulatory focus. IOTA is actively collaborating with European lawmakers to comply with the MiCA rules which are setting global standards for crypto regulations. The IOTA Foundation has been making important developments with respect to building its IOTA [...]"
  }
]