[
  {
    "source": "CryptoSlate",
    "date": "2023-07-17T03:00:09.000Z",
    "title": "Could Bitcoin feel the BlackRock effect?",
    "url": "https://cryptoslate.com/market-reports/could-bitcoin-feel-the-blackrock-effect/",
    "description": "<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/market-reports/could-bitcoin-feel-the-blackrock-effect/\">Could Bitcoin feel the BlackRock effect?</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-17T02:54:17.000Z",
    "title": "Bitcoin Price Aims Fresh Increase To $31K, This Support Is The Key",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-aims-31k/",
    "description": "Bitcoin price failed to surpass $31,800 and corrected most of its gains. BTC is now attempting a fresh increase from the $29,950 support zone. Bitcoin is consolidating losses above the $30,000 support zone. The price is trading below $30,500 and the 100 hourly Simple moving average. There is a key bearish trend line forming with resistance near $30,320 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could gain bullish momentum if there is a close above $30,400. Bitcoin Price Holds Key Support Bitcoin price rallied above the $31,400 resistance but there was no follow-up move. BTC struggled to clear the $31,800 level and stayed below $32,000. A high was formed near $31,790 before there was a sharp decline. There was a move below the $31,000 and $30,400 levels. The price even spiked below $30,000. A low is formed near $29,950 and the price is now consolidating losses. Bitcoin is now trading below $30,500 and the 100 hourly Simple moving average. There is also a key bearish trend line forming with resistance near $30,320 on the hourly chart of the BTC/USD pair. Immediate resistance is near the $30,300 level and the trend line. The first major resistance is near $30,400. It is near the 23.6% Fib retracement level of the downward move from the $31,790 swing high to the $29,950 low, above which the price could gain bullish momentum. Source: BTCUSD on TradingView.com In the stated case, BTC might rise toward the $30,850 resistance. It is close to the 50% Fib retracement level of the downward move from the $31,790 swing high to the $29,950 low. The next major resistance is near the $31,150 level. Any more gains could open the doors for a move toward the $31,80 resistance zone. More Losses in BTC? If Bitcoin fails to clear the $30,380 resistance, it could start a downside correction. Immediate support on the downside is near the $30,200 level. The next major support is near the $30,000 level, below which there could be a drop toward the $29,750 support zone. Any more losses might send the price toward the $29,350 level in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now near the 50 level. Major Support Levels – $30,200, followed by $30,000. Major Resistance Levels – $30,380, $30,850, and $31,150."
  }
]