[
  {
    "source": "Cointelegraph",
    "date": "2024-03-11T03:56:37.000Z",
    "title": " Crypto phishers stole $47M last month, impersonators on X to blame ",
    "url": "https://cointelegraph.com/news/crypto-phishers-stole-47-million-february-fake-x-accounts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNjA3NTkwNTQtMDE1MS00YTM5LWE1YjMtMzdjMjNiMTNlNWMzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Most victims were lured to phishing websites from comments posted by impersonator accounts on X. </p>\n                    <p><p>Fake accounts on social media platform X were the leading cause for over 57,000 victims of crypto phishing scams in February.</p><p>In its latest crypto phishing report, Scam Sniffer <a href=\"https://twitter.com/realscamsniffer/status/1766758144020217933\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> that over $46.8 million was lost to crypto phishing scams last month, noting that: “Most victims were lured to phishing websites through phishing comments from impersonated Twitter accounts.”</p><p>Scam Sniffer found that Ethereum mainnet accounted for 78% of the total thefts, with ERC-20 tokens being the main assets stolen, accounting for 86% of all assets stolen.</p><p><a href=\"https://cointelegraph.com/news/crypto-phishers-stole-47-million-february-fake-x-accounts\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-11T04:05:22.000Z",
    "title": "Arbitrum DAO cancels proposal for donation to Tornado Cash developers",
    "url": "https://cryptobriefing.com/arbitrum-dao-tornado-cash-donation-withdrawal/",
    "description": "Arbitrum DAO pulls back its million-dollar donation proposal for Tornado Cash devs due to legal risk concerns."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-11T03:39:50.000Z",
    "title": "Will Microsoft’s AI Filters Transform Your Video Experience?",
    "url": "https://www.cryptopolitan.com/microsofts-ai-filters-transform-your-video/",
    "description": "In the realm of technological innovation, Microsoft stands at the forefront, continuously pushing the boundaries of what&#8217;s possible. With the eagerly awaited Build 2024 conference on the horizon, whispers and speculations abound regarding the tech giant&#8217;s next move. Amidst the buzz, a fascinating revelation has emerged concerning Microsoft&#8217;s potential plans to integrate AI-powered video filters [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-11T03:47:25.000Z",
    "title": "FLOKI Sees Surge In Value Amidst Profit-Taking By Whales",
    "url": "https://nulltx.com/floki-sees-surge-in-value-amidst-profit-taking-by-whales/",
    "description": "The digital currency market recently witnessed a significant surge in the value of FLOKI, a meme-based cryptocurrency that has garnered considerable attention from investors. This upswing in FLOKI&#8217;s value has translated into substantial profits for large investors, signaling a positive sentiment among market participants. Yesterday, the price of $FLOKI experienced [&#8230;]"
  }
]