[
  {
    "source": "CoinDesk",
    "date": "2024-02-22T00:01:41.000Z",
    "title": "Risk Manager Gauntlet Terminates Relationship with Aave, Citing DAO Dysfunction",
    "url": "https://www.coindesk.com/tech/2024/02/22/risk-manager-gauntlet-terminates-relationship-with-aave-citing-dao-dysfunction/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Gauntlet co-founder John Morrow said his team \"found it difficult to navigate the inconsistent guidelines and unwritten objectives\" of Aave's \"largest stakeholders.\""
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-21T23:50:48.000Z",
    "title": " BAYC co-creator Greg Solana takes up reins as Yuga Labs CEO ",
    "url": "https://cointelegraph.com/news/greg-solana-appointed-yuga-labs-ceo-daniel-algere-steps-down",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvOWE4NmViMjAtMThlNy00OTU5LWFiMDMtY2RmYzUzNzQ5MWY5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Solano said he wants to prioritize the utility of Bored Ape Yacht Club NFTs and recreate a space for the “magic and crazy shit” that first made it popular.</p>\n                    <p><p>Greg Solano, one of the creators behind the Bored Ape Yacht Club (BAYC) nonfungible token (NFT) collection, has become the new CEO of Yuga Labs.</p><p>Solano, one of the firm’s founders, will replace Daniel Alegre, who <a href=\"https://cointelegraph.com/news/former-activision-blizzard-executive-joins-yuga-labs-as-ceo\">commenced his roleas CEO</a> last April.</p><p>“I am stepping back in as CEO of Yuga Labs,” Solano confirmed in a Feb. 21 X post, adding that he’s “reinvigorated to be taking the reins for our next chapter.”</p><p><a href=\"https://cointelegraph.com/news/greg-solana-appointed-yuga-labs-ceo-daniel-algere-steps-down\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-22T00:05:37.000Z",
    "title": "Bitcoin Holds Above $50,000 Despite Nasty Drop, Crypto Expert Says Local Top Not In",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-holds-above-50000/",
    "description": "The cryptocurrency space has been subject to high volatility after Bitcoin finally surged to $53,000. After hitting this level, the cryptocurrency faced notable declines in its value. However, a crypto analyst has predicted that the price might continue to surge, highlighting the enduring strength of Bitcoin’s upward momentum.  BTC Price Needs To Hold Steady Despite the recent bearish trends seen in the last few days, a prominent crypto analyst, Michael van de Poppe, has maintained an optimistic outlook on Bitcoin’s price. Sharing a BTC price chart, the crypto analyst emphasized Bitcoin’s current position above $50,000, which shows strength.  Related Reading: Dogecoin Begins Massive Recovery Trend, But Can These Factors Drive A Rally To $0.2? However, he revealed that there is the potential for a more extensive price correction if Bitcoin fails to hold its current resistance area. Reassuring the crypto community, Poppe clarified that although price corrections can be sharp and “nasty,” they typically prove short-lived. The analyst also disclosed that despite the success of the Spot Bitcoin ETF market, relying solely on ETF inflows will not be enough to propel the price of Bitcoin to $100,000 within two months. He affirmed that Bitcoin’s price trend is still very bullish, noting that surges are more likely to unfold gradually over time, rather than in a single rapid moment. Analyst Projects Bitcoin Surge To $58,000 In his X posts, Poppe highlighted two potential scenarios for Bitcoin’s price movements. The analyst suggested a possible inclination towards a downward trend, emphasizing the critical zones to watch within the $48,000 to $49,500 price ranges.  Related Reading: XRP Refuses To Back Down As Crypto Analyst Identifies When Price Will Rally To $2 On the flip side, Poppe revealed that the price of Bitcoin could also experience a surge to new highs. He explained that if Bitcoin successfully breaches certain high levels, then the cryptocurrency could achieve a local top of $54,000 to $58,000.  Furthermore, the crypto analyst presented a Bitcoin price chart, which illustrated a substantial uptrend for Bitcoin. He anticipated a short-term correction for the cryptocurrency, followed by a potential price surge to levels close to $60,000.  “I&#8217;m expecting a short-term correction before a final push to $54-58K and then we&#8217;re likely done with this current pre-halving run,” Poppe stated.  BTC price recovers above $51,000 &#124; Source: BTCUSD on Tradingview.com Featured image from Bookings Institutional, chart from Tradingview.com"
  }
]