[
  {
    "source": "CoinDesk",
    "date": "2023-09-05T21:19:26.000Z",
    "title": "Buy Ether Instead of Bitcoin to Ride ETF Momentum, Crypto Research Firm Says",
    "url": "https://www.coindesk.com/markets/2023/09/05/buy-ether-instead-of-bitcoin-to-ride-etf-momentum-crypto-research-firm-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "There’s a high probability of approval on or before the SEC’s final deadline in mid-October for a decision on the first ether futures ETF in the U.S."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-05T21:11:01.000Z",
    "title": "MetaMask Introduces Bank and PayPal Cash-Out Options",
    "url": "https://decrypt.co/155039/metamask-sell-transfer-withdraw-cash-out-paypal",
    "description": "\"Ensuring a way for users to enter and exit crypto freely is important,\" the company said."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-05T21:27:50.000Z",
    "title": "Report suggests 6 billionaire crypto traders earned their fortunes from Bitcoin",
    "url": "https://cointelegraph.com/news/report-suggests-billionaire-crypto-traders-earned-fortunes-bitcoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/027722eb-4948-4ecb-b197-dd5c6072c717.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The firm behind the ‘Crypto Wealth Report’ said it received a spike in the number of crypto-related enquiries by millionaires in the last 6 months.</p>\n                    <p><p>A report released by London-based investment migration consultancy firm Henley &amp; Partners suggests there were more than 40,000 crypto millionaires in the world holding Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). </p><p>According to the ‘Crypto Wealth Report’ published on Sept. 5, Henley &amp; Partners <a href=\"https://www.henleyglobal.com/newsroom/press-releases/crypto-wealth-report-2023\" target=\"_blank\" rel=\"noopener nofollow\">said</a> there were roughly 88,200 millionaires worldwide with crypto holdings, with 40,500 holding BTC. The report suggested that of 182 individuals who held more than $100 million worth of crypto, 78 were Bitcoiners. In addition, 6 out of 22 crypto traders who held more than $1 billion “amassed their fortunes from trading Bitcoin”.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/1b7c49e1-ed2f-422c-b0af-e8338a4f5174.png\"  /><figcaption style=\"text-align: center;\"><em>Source: <a href=\"https://www.henleyglobal.com/publications/crypto-wealth-report\" target=\"_blank\" rel=\"noopener nofollow\">Henley &amp; Partners</a></em></figcaption></figure><p>Fortunly <a href=\"https://fortunly.com/statistics/millionaire-statistics/\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> there were roughly 56.1 million millionaires on Earth as of July 2023, suggesting less than 0.2% had significant crypto holdings. The CEO of Henley &amp; Partners, Dr. Juerg Steffen, said the firm had received a spike in the number of crypto-related enquiries by millionaires in the last 6 months as part of efforts “to protect themselves against any potential future bans on the trading or use of cryptocurrencies in their countries” as well as “allay the risks of aggressive fiscal policies that tax digital assets at source”.</p><p>“The leadership of an increasing number of jurisdictions understand the legitimate nature of [crypto-based] wealth and have produced mechanisms for it to be stored securely, with soft infrastructure that renders it treated in the same manner as almost any other tangible or intangible asset class,” said cybersecurity specialist Ali Khan. “But there are still a number of jurisdictions that are yet to bite.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/millionaires-flock-to-crypto-82-sought-investment-advice-in-2022\"><strong><em>Millionaires flock to crypto: 82% sought investment advice in 2022</em></strong></a></p><p>The report did not explicitly mention the names of the crypto millionaires and billionaires. Among those well known in the space include Digital Currency Group founder and CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/barry-silbert\">Barry Silbert</a>, Gemini co-founders <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/winklevoss-twins\">Cameron and Tyler Winklevoss</a>, Binance CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/changpeng-zhao\">Changpeng Zhao</a>, Coinbase CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/brian-armstrong\">Brian Armstrong</a>, Ripple co-founder Chris Larsen, and MicroStrategy executive chair <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/michael-saylor\">Michael Saylor</a>.</p><p>Amid the crypto market crash of 2022, the number of crypto wallet addresses <a href=\"https://cointelegraph.com/news/80-000-bitcoin-millionaires-wiped-out-in-the-great-crypto-crash-of-2022\">holding the equivalent</a> of more than $1 million dropped by roughly 80,000. Forbes reported in December 2022 that many major players in the industry <a href=\"https://cointelegraph.com/news/crypto-billionaires-lost-116m-since-march-report\">lost more than $116 billion</a> following bankruptcies of exchanges and the bear market.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/manzi-the-magnificent-from-millionaire-at-16-to-incredible-iot-inventor/\"><strong><em>Manzi the magnificent: From millionaire at 16 to incredible IoT inventor</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-05T21:20:35.000Z",
    "title": "Ethereum price risks losing the $1.6K support as multiple ETH price metrics decline",
    "url": "https://cointelegraph.com/news/ethereum-price-risks-losing-the-1600-support-as-multiple-metrics-decline",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/7dd0f06a-a2a9-43e3-bcc9-04abe2b623f1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A lack of network activity and ground lost to competitors could eventually play a role in ETH losing the $1,600 support.</p>\n                    <p><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) price surged by 31.3% from March 10 to March 18, coinciding with the U.S. Federal Reserve's injection of $300 billion to address the<a href=\"https://cointelegraph.com/news/silicon-valley-bank-collapse-how-svb-stock-price-performed-in-5-years\"> insolvency of Silicon Valley Bank</a>.. Since then, Ether’s price consistently maintained a daily closing price above $1,600. </p><p>However, investors are now casting doubt on Ether's ability to sustain this support level, given the prevailing bearish sentiment in the cryptocurrency space and declining metrics on the Ethereum network.</p><p>Over the past six months, the cryptocurrency sector has been plagued by negative developments. Notably, the Digital Currency Group (DCG), the owner of Grayscale mutual fund manager, <a href=\"https://cointelegraph.com/news/new-york-probes-transactions-genesis-ties-with-barry-silbert\">has faced financial troubles</a>. Concerns are mounting that a portion of the $4.8 billion worth of ETH deposits held in the Grayscale Ethereum Trust could be liquidated to address DCG's debts.</p><p>Furthermore, two major global exchanges, <a href=\"https://cointelegraph.com/news/why-is-the-crypto-market-down-this-week\">Binance and Coinbase, are currently facing legal action</a> from the U.S. Securities and Exchange Commission (SEC). Additionally, investors initially expressed excitement when several requests for <a href=\"https://cointelegraph.com/news/sec-to-approve-ethererum-eth-futures-etf\">futures-based Ether exchange-traded funds (ETFs)</a> surfaced in early August. However, it's important to note that these instruments, unlike spot ETFs, would not involve actual ETH coins if approved.</p><h2>On-chain metrics point to declining demand</h2><p>Aside from a handful of unfavorable market conditions, Ethereum's on-chain metrics point to a stagnation in demand, both in terms of ETH investments and smart contract transactions.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/c85efaaa-a1c4-47a0-8d72-d2c57a79ea6e.png\"  /><figcaption style=\"text-align: center;\"><em>Number of Ethereum addresses with ETH minimum $1,000 deposits. Source: CoinMetrics</em></figcaption></figure><p>Notably, the number of Ethereum addresses holding a minimum of $1,000 worth of ETH deposits has reached its lowest level in nearly six months. This is concerning, considering that Ether's price reached a peak of $2,130 in mid-April, which should have attracted new investors.</p><p>Part of the lack of investor interest can be attributed to the fact that Ethereum's average transaction fee has remained above $4 for the past six months. Consequently, despite fluctuations in network staking metrics, there appears to be no increase in the total number of investors when using the $1,000 threshold as a proxy.</p><p>Moreover, data on decentralized application (DApps) activity on the Ethereum network corroborates the notion of a dearth of new users. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/d12038a6-44df-4138-bfea-38ffd2ea19c0.png\"  /><figcaption style=\"text-align: center;\"><em>Ethereum network top DApps, 30 day active addresses. Souce: DappRadar</em></figcaption></figure><p>Even excluding the significant 60% decline in the Uniswap NFT Aggregator, the average number of active addresses across the top Ethereum network DApps decreased by 4% compared to the previous month.</p><p>From cryptocurrency games to decentralized exchanges, NFT marketplaces, and Web3 services, every sector has witnessed a decline in the number of active users, according to DappRadar. Regarding token activity on the network, with the exception of stablecoins and wrapped ETH, no project has recorded more than 13,000 unique receiver addresses over the past week.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/d69d5ea4-f83b-4676-8aae-e70931b076b7.png\"  /><figcaption style=\"text-align: center;\"><em>Top token by unique receivers, last 7 days. Source: Etherscan.io</em></figcaption></figure><p>This analysis underscores the fact that Ethereum's network is currently constrained by its relatively high transaction fees, which limits the number of active users. Without an uptick in network activity, the catalysts for a price recovery are lacking, such as potential network upgrades and implementations that could lead to lower costs or enhanced user privacy.</p><h2>Competitors are benefiting from the stablecoin volumes</h2><p>In the meantime, recent developments have left Ethereum enthusiasts somewhat disappointed. Visa, the payment processor, has<a href=\"https://cointelegraph.com/news/visa-taps-into-solana-to-widen-usdc-payment-capability\"> incorporated Solana blockchain settlement</a> capabilities, following Circle USD (USDC) introducing <a href=\"https://cointelegraph.com/news/usd-coin-expands-base-optimism-networks\">native accounts and transfers on the Base chain</a>. In response, Coinbase exchange promptly announced its intention to assist partners in converting old, bridged versions of USDC to the new format.</p><p>Furthermore, Rune Christensen, co-founder of MakerDAO, has put forth a proposal to develop the decentralized finance<a href=\"https://cointelegraph.com/news/maker-dao-co-founder-proposes-solana-codebase-fork-native-chain\"> project's upcoming native chain based on Solana's</a> codebase, despite its longstanding affiliation with Ethereum.</p><p>In light of the prevailing bearish sentiment in the cryptocurrency market, which includes exchanges facing legal challenges from the SEC and diminishing interest in cryptocurrencies, as indicated by the<a href=\"https://cointelegraph.com/news/bitcoin-withdraws-from-exchanges-is-not-inherently-bullish-for-crypto\"> latest Google Trends data</a>, the likelihood of Ether's price dipping below the $1,600 support level has increased.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-05T21:30:47.000Z",
    "title": "Marathon Digital Bitcoin mining production down 9% in August; CEO cites Texas heatwaves as contributing factor",
    "url": "https://cryptoslate.com/marathon-bitcoin-mining-production-down-9-in-august-ceo-cites-texas-heatwaves-as-contributing-factor/",
    "description": "<p>Marathon Digital Holdings reported a 9% drop in Bitcoin (BTC) production in August 2023, with the company mainly attributing the decrease to increased shutdown activity in Texas due to record-high temperatures. This comes despite the company securing miners for an additional 5 EH/s hash rate and producing a significant 1,072 BTC last month, according to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/marathon-bitcoin-mining-production-down-9-in-august-ceo-cites-texas-heatwaves-as-contributing-factor/\">Marathon Digital Bitcoin mining production down 9% in August; CEO cites Texas heatwaves as contributing factor</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-05T21:30:45.000Z",
    "title": "Martin Shkreli Details Sam Bankman-Fried’s Life in Prison",
    "url": "https://news.bitcoin.com/martin-shkreli-details-sam-bankman-frieds-life-in-prison/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1979241752-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Martin Shkreli Details Sam Bankman Fried&#039;s Life In Prison\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1979241752-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1979241752-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1979241752-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1979241752-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1979241752-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1979241752-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1979241752.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Martin Shkreli, the former CEO of several hedge funds and pharmaceutical companies, offered updates about the life of Sam Bankman-Fried in prison. Jeremy Lorenzo (aka Flacco Poops), Shkreli&#8217;s source on MDC Brooklyn, the center in which Bankman-Fried is being held, stated that he has been facing some troubles due to inmates believing he was a [&#8230;]"
  }
]