[
  {
    "source": "Cointelegraph",
    "date": "2024-01-03T09:26:13.000Z",
    "title": " Bitcoin Birthday: 15 years after Satoshi Nakamoto mined genesis block ",
    "url": "https://cointelegraph.com/news/bitcoin-birthday-15-years-satoshi-nakamoto-genesis-block-mine",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYjg5ZGM1NjAtYmUzOC00YjY2LTkzM2MtMDE1ZTFlNjBjNWQwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Fifteen years after the first block of Bitcoin was mined, the original cryptocurrency has battled critics, haters and agitators, and emerged victorious - and is now ranked as one of the top ten most valuable assets in the world. </p>\n                    <p><p>While many celebrate Oct. 31, 2008 — <a href=\"https://cointelegraph.com/news/bitcoin-btc-whitepaper-turns-15-satoshi-nakamoto\">the release of the Bitcoin whitepaper</a> — as Bitcoin’s original birthday, others take a more technical approach to determining the true age of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). For the latter, Jan. 3 is the actual date Bitcoin materialized as a store of value and transferable currency.</p><p>The genesis block, a.k.a. the first Bitcoin block, was mined on Jan. 3, 2009, by its <a href=\"https://cointelegraph.com/learn/who-is-satoshi-nakamoto-the-creator-of-bitcoin\">mysterious creator Satoshi Nakamoto</a>. What followed was years of triumph versus naysayers that included critics, mainstream media, politicians and governments worldwide. On the occasion of Bitcoin’s 15th birthday, we take a bird’s eye view of the Bitcoin ecosystem.</p><p>Bitcoin ATMs were first conceived nearly five years after the first block was mined, with historical <a href=\"https://coinatmradar.com/charts/growth/\" target=\"_blank\" rel=\"noopener nofollow\">data</a> confirming that the first ATM went live in October 2013. The motive was to provide another avenue for people to exchange their local fiat currencies for Bitcoin.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-birthday-15-years-satoshi-nakamoto-genesis-block-mine\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-03T09:11:43.000Z",
    "title": "Radiant Capital suspends DeFi lending on Arbitrum after $4.5 million ETH exploit",
    "url": "https://cryptoslate.com/radiant-capital-suspends-defi-lending-on-arbitrum-after-4-5-million-eth-exploit/",
    "description": "<p>Decentralized finance (DeFi) lending protocol Radiant Capital temporarily paused its operations on the Ethereum layer2 network Arbitrum after it was exploited for 1,900 ETH, or $4.5 million. In a Jan. 3 post on social media platform X (formerly Twitter), the cross-chain lending protocol confirmed that it received a report of an issue with its newly [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/radiant-capital-suspends-defi-lending-on-arbitrum-after-4-5-million-eth-exploit/\">Radiant Capital suspends DeFi lending on Arbitrum after $4.5 million ETH exploit</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-03T09:38:27.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-03T09:35:21.000Z",
    "title": "Worldcoin Price Prediction 2024 – 2033: How High Will WLD Go?",
    "url": "https://www.cryptopolitan.com/worldcoin-price-prediction/",
    "description": "Worldcoin Price Prediction 2024- up to $8.32 Worldcoin Price Prediction 2027-up to $17.21 Worldcoin Price Prediction 2030- up to $28.33 Worldcoin Price Prediction 2033- up to $73.74 Worldcoin, spearheaded by OpenAI chief Sam Altman,&#160;launched&#160;on Monday, 24 July 2023, after years in development, promising to verify users’ identity by iris-scanning and potentially solving one of the [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-03T09:30:25.000Z",
    "title": "Bullish on Chainlink? Here’s Why Market Watchers Are Eyeing New Opportunities",
    "url": "https://nulltx.com/bullish-on-chainlink-heres-why-market-watchers-are-eyeing-new-opportunities/",
    "description": "TLDR: Chainlink (LINK) is expected to continue correction and drop below $15.  Near Protocol (NEAR) is predicted to leave accumulation and surge above $5.  Rebel Satoshi ($RBLZ) aims for a $100 million market cap with 100% already during the presale.  With one of the top altcoins, Chainlink (LINK), making a [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-03T09:26:32.000Z",
    "title": "Crypto Favorites: Spotlight on NuggetRush, and Litecoin",
    "url": "https://nulltx.com/crypto-favorites-spotlight-on-nuggetrush-and-litecoin/",
    "description": "TLDR: NuggetRush (NUGX) is a play-to-earn gaming platform merging gold mining, cryptocurrency, and support for real-world miners in developing nations. Users earn rewards during gameplay, driving demand. With deflationary features and a robust roadmap, NUGX has gained investor popularity. Litecoin (LTC) witnessed a substantial surge in new addresses on December [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-03T09:24:23.000Z",
    "title": "Grayscale’s Vision: A $30 Trillion Bitcoin Bull Market; New Investors Flock to Litecoin & Borroe Finance",
    "url": "https://nulltx.com/grayscales-vision-a-30-trillion-bitcoin-bull-market-new-investors-flock-to-litecoin-borroe-finance/",
    "description": "Grayscale Investments, a big name in handling assets, is pulling off some major moves. Their CEO, Michael Sonnenshein, has this exciting idea that if they get the thumbs up for Bitcoin exchange-traded funds (ETFs), a jaw-dropping $30 trillion could flood into the crypto industry. Grayscale isn&#8217;t just in the game; [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-03T09:22:40.000Z",
    "title": "Investors Take Notice as Bitcoin Encounters Resistance, Slipping Below $43,000; InQubeta Increasingly on Whales’ Radar",
    "url": "https://nulltx.com/investors-take-notice-as-bitcoin-encounters-resistance-slipping-below-43000-inqubeta-increasingly-on-whales-radar/",
    "description": "In the ever-shifting landscape of cryptocurrency, where Bitcoin rules as the OG, investors are on high alert as the digital behemoth encounters resistance, slipping below the crucial $43,000 mark. But fear not, as we delve into the market dynamics and explore an altcoin that’s been steadily gaining traction—InQubeta. Strap in [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-03T09:16:18.000Z",
    "title": "Analyst Says TRON (TRX) Is Banking the Unbanked – Meme Moguls (MGLS) to Dominate the $6.1B Market by 2025",
    "url": "https://nulltx.com/analyst-says-tron-trx-is-banking-the-unbanked-meme-moguls-mgls-to-dominate-the-6-1b-market-by-2025/",
    "description": "TRON (TRX) has overtaken Bitcoin, Ethereum, and Solana as the cryptocurrency network that&#8217;s accelerating the most financial inclusion on a global scale. The founder, Justin Sun, plans to eventually serve eight billion people on a global scale. Meme Moguls (MGLS) is an upcoming platform that introduces an innovative approach with [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-03T09:14:28.000Z",
    "title": "Investor Frenzy: Pullix (PLX) Rivals Attention With Tezos (XTZ) and Compound (COMP) in Bullish Markets",
    "url": "https://nulltx.com/investor-frenzy-pullix-plx-rivals-attention-with-tezos-xtz-and-compound-comp-in-bullish-markets/",
    "description": "In the DeFi market, Pullix (PLX) emerges as a contender battling for investor attention alongside Tezos (XTZ) and Compound (COMP). As bullish sentiments sweep the market, these altcoins spark investor frenzy, with PLX standing out. Some experts even foresee this Stage 5 presale star becoming the next 100x token in [&#8230;]"
  }
]