[
  {
    "source": "Cointelegraph",
    "date": "2023-10-20T01:43:12.000Z",
    "title": "Metaverse tech gets US greenlight to use speedier 6GHz frequency",
    "url": "https://cointelegraph.com/news/metaverse-virtual-reality-devices-regulator-approval-wifi-frequency",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/e08d0600-fd2d-43ed-b140-551cb98599e1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The United States Federal Communications Commission made the decision amid a flurry of mixed reality devices that are hitting the market. </p>\n                    <p><p>Low-power wearable technology, including virtual and augmented reality devices crucial to the metaverse, will be permitted to tap into the 6 GHz frequency band following a rule change from the United States communications regulator. </p><p>In an Oct. 19 press <a href=\"https://docs.fcc.gov/public/attachments/DOC-397829A1.pdf\" target=\"_blank\" rel=\"noopener nofollow\">release</a>, the Federal Communications Commission said it opened up the 6 GHz frequency band to “very low power devices” without needing a license, permitting a total of 850 megahertz of spectrum.</p><p>The band boasts faster speeds, more bandwidth and lower lag — or “latency” in technical terms.</p><p>“These rules will spur an eco-system of cutting-edge applications, including wearable technologies and augmented and virtual reality,” it said in a statement.</p><p>The 6 GHz band is, as the FCC claims, “important for next-generation Wi-Fi operations” and was first opened for use for some devices by the regulator in late 2020.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The Commission has adopted new rules to allow very low power devices to operate in the 6 GHz band alongside other Wi-Fi-enabled devices: <a href=\"https://t.co/HFaf2Hbh4M\">https://t.co/HFaf2Hbh4M</a></p>&mdash; The FCC (@FCC) <a href=\"https://twitter.com/FCC/status/1715065237890556230?ref_src=twsrc%5Etfw\">October 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The FCC said its decision would “enrich consumer experiences and bolster the nation’s economy.”</p><p>Meta, Apple and Google have been working on AR or VR wearables — the latest to drop was Meta’s Quest 3 in early October, while Apple’s <a href=\"https://cointelegraph.com/news/apple-vision-pro-mixed-reality-redefine-experiences-metaverse\">Vision Pro</a> is expected to ship in early 2024.</p><p>Meta also <a href=\"https://about.fb.com/news/2023/09/new-ray-ban-meta-smart-glasses/\" target=\"_blank\" rel=\"noopener nofollow\">released</a> a second version of its Rayban-partnered AR glasses in September. According to a Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2023-09-27/google-meta-and-apple-poised-to-win-us-approval-for-vr-devices?sref=ExbtjcSG\" target=\"_blank\" rel=\"noopener nofollow\">report</a> at the time, Apple and Google are also working on AR-enabled glasses.</p><p>The three Big Tech players first <a href=\"https://www.fcc.gov/ecfs/document/1030997893391/1\" target=\"_blank\" rel=\"noopener nofollow\">petitioned</a> the FCC in early 2020 to open up the frequency spectrum so they could use it for very low-power devices such as their wearables.</p><p>Uses for the 6GHz band highlighted by Bloomberg included connecting AR/VR devices to a smartphone or sharing navigation data with a vehicle.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/multiverse-x-eyes-metaverse-scalability-ceo-spatial-computing\"><strong><em>MultiversX eyes metaverse scalability as CEO sheds light on spatial computing</em></strong></a></p><p>In its statement, the FCC said the new rules were careful to limit permitted devices to very low power levels subject to other requirements that would allow their operation across the country while protecting licensed services that operate on the same band.</p><p>The 6 GHz band is also used by services that manage the U.S. electric grids, long-distance phone services, and backhaul — the links between core and subnetworks — hence the need for FCC oversight.</p><p>The regulator also proposed expanding the low-power devices to use the remaining 6 Ghz band and the ability to use higher power levels if they are geofenced to stop interference with licensed operations on the same band.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/web3-gamer-apple-gaming-sec-hates-metaverse-tokens-logan-paul-trolled-on-steam/\"><strong><em>Web3 Gamer: Apple to fix gaming? SEC hates Metaverse, Logan Paul trolled on Steam</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]