[
  {
    "source": "Decrypt",
    "date": "2023-11-10T16:52:16.000Z",
    "title": "Solana Touches $50 Per Coin While Tron and Optimism See Gains",
    "url": "https://decrypt.co/205495/solana-touches-50-tron-optimism-see-gains",
    "description": "SOL is up 128% over the past 30 days and not far from overtaking USDC's market cap. "
  },
  {
    "source": "BTCManager",
    "date": "2023-11-10T16:46:47.000Z",
    "title": "Justin Sun offers 5% bounty as Poloniex losses cross $100 million",
    "url": "https://crypto.news/justin-sun-offers-5-bounty-as-poloniex-losses-cross-100-million/",
    "description": "The Tron founder said Poloniex hackers have seven days to return a bulk of the funds in exchange for a white hat bounty or law enforcement would be engaged for a remedy."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-10T17:00:28.000Z",
    "title": "Is A Bearish Reversal Coming For Bitcoin? This Metric May Warn So",
    "url": "https://www.newsbtc.com/bitcoin-news/bearish-reversal-coming-bitcoin-metric-warn-so/",
    "description": "The latest trend in the Bitcoin taker buy-sell ratio could suggest a bearish reversal may be coming soon for the cryptocurrency. Bitcoin Taker Buy Sell Ratio 100-Day EMA Has Encountered Resistance An analyst in a CryptoQuant Quicktake post explained that the asset may be heading towards a correction due to the taker buy-sell ratio coming across strong resistance. The &#8220;taker buy sell ratio&#8221; is an indicator that keeps track of the ratio between the Bitcoin taker buy and taker sell volumes. When the value of this metric is greater than 1, it means that the taker buy or the long volume is greater than the sell volume right now. Such a trend implies that the majority shares a bullish sentiment as the investors are willing to pay a higher price for the asset. Related Reading: Ethereum At $2,100: Why Path To $2,500 Is Now All Clear On the other hand, values under the threshold suggest the dominance of a bearish mentality in the sector, as the selling pressure is greater than the current buying pressure. Now, here is a chart that shows the trend in the 350-day moving average (MA) and 100-day exponential MA (EMA) of the Bitcoin taker buy-sell ratio over the past few years: Looks like the two metrics have crossed each other recently &#124; Source: CryptoQuant In the graph, the quant has highlighted an interesting pattern that has repeated for these two averages of the Bitcoin taker buy-sell ratio over the years. It would appear that whenever the 100-day EMA has crossed above the 350-day MA, the cryptocurrency&#8217;s price has gone on to observe bullish momentum shortly. On the other hand, the opposite type of cross has usually been a bearish predictor for the asset. Besides these two crossovers, the interaction of the 100-day EMA with the 1-mark has also been relevant to the coin. The line crossing above the 1-mark, which serves as the boundary between the bullish and bearish sentiment regions, has often meant a reversal for the cryptocurrency. From the chart, it&#8217;s visible the bullish type of crossover happened between the 100-day EMA and 350-day MA of the Bitcoin taker buy sell ratio just recently, and what has followed so far has been a sharp rally for the asset that has now taken it to the $37,000 level. Related Reading: Polygon (MATIC) Jumps Another 6% As Whales Show High Activity The 100-day EMA initially continued its rise after the cross above the 350-day MA, but the line has stopped around the 1-level, implying that it has been finding resistance. A break above here would have naturally been another bullish signal for Bitcoin, but as the line has been unable to go beyond so far, rejection might take place instead. If such a pattern forms, the asset might see a bearish reversal in the coming days. BTC Price Once again, Bitcoin is challenging the $37,000 level after dipping below it during the past day. BTC has observed further uplift in the last few days &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-10T16:56:00.000Z",
    "title": "Celsius Escapes Bankruptcy: Court Approves Restructuring Plan",
    "url": "https://coinedition.com/celsius-escapes-bankruptcy-court-approves-restructuring-plan/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Celsius_bankruptcy_as_Judge_Martin_Glenn_rules_that_4_2bn_of_crypto.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Court Approves Celsius’ Restructuring Scheme: Celsius Rebrands NewCo\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Celsius_bankruptcy_as_Judge_Martin_Glenn_rules_that_4_2bn_of_crypto.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Celsius_bankruptcy_as_Judge_Martin_Glenn_rules_that_4_2bn_of_crypto-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Celsius_bankruptcy_as_Judge_Martin_Glenn_rules_that_4_2bn_of_crypto-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Celsius_bankruptcy_as_Judge_Martin_Glenn_rules_that_4_2bn_of_crypto-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Celsius_bankruptcy_as_Judge_Martin_Glenn_rules_that_4_2bn_of_crypto-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Celsius_bankruptcy_as_Judge_Martin_Glenn_rules_that_4_2bn_of_crypto-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to recent reports, the New York Bankruptcy Court has approved the bankrupt cryptocurrency firm Celsius&#8217; restructuring plan. After which, customers could recover their funds and receive equity in the new company, a creditor-owned Bitcoin mining company. In a court order dated November 9, Judge Martin Glenn of the Southern District of New York Bankruptcy [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/celsius-escapes-bankruptcy-court-approves-restructuring-plan/\">Celsius Escapes Bankruptcy: Court Approves Restructuring Plan</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]