[
  {
    "source": "Cointelegraph",
    "date": "2023-10-25T05:49:59.000Z",
    "title": "Coinbase disputes SEC’s crypto authority in final bid to toss regulator’s suit",
    "url": "https://cointelegraph.com/news/coinbase-disputes-sec-authority-last-suit-dismissal-bid",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/d0921374-d1e0-458d-a9ac-586e987f986a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Coinbase says the SEC’s definition of an investment contract isn’t in line with U.S. securities laws.</p>\n                    <p><p>The Securities and Exchange Commission overstepped its authority when it classified Coinbase-listed cryptocurrencies as securities, the exchange has argued in its final bid to dismiss a lawsuit by the securities regulator.</p><p>In an Oct. 24 <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.599908/gov.uscourts.nysd.599908.83.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> in a New York District Court, Coinbase chastised the SEC claiming its definition for what qualifies as a security was too wide and contested that the cryptocurrencies the exchange lists are not under the regulator’s purview.</p><blockquote>“The SEC’s authority is limited to securities transactions. Not every parting of capital with a hope of gain qualifies, and trades over Coinbase are only securities transactions if they involve ‘investment contracts.’ The transactions at issue here do not.\"</blockquote><p>Coinbase claimed the SEC has undertaken a “radical expansion of its own authority” and claimed jurisdiction “over essentially all investment activity” which only Congress is entitled to do under the major questions doctrine.</p><p>In an Oct. 24 X post, Coinbase’s chief legal officer Paul Grewal echoed the claims saying the SEC’s definitions have “no limiting function at all.\"</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">By arguing that any purchase in which the buyer hopes for an increase in value constitutes an investment contract-and therefore a security-the SEC is attempting a radical expansion of its own authority. Only Congress can do that as the major questions doctrine makes clear. 2/3</p>&mdash; paulgrewal.eth (@iampaulgrewal) <a href=\"https://twitter.com/iampaulgrewal/status/1716915071753048133?ref_src=twsrc%5Etfw\">October 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Coinbase’s recent filing comes in response to the SEC’s <a href=\"https://cointelegraph.com/news/sec-coinbase-dismiss-motion-lawsuit\">Oct. 3 rebuttal</a> where it asked the court to reject Coinbase’s dismissal motion, iterating its belief that various cryptocurrencies Coinbase listed were investment contracts under the Howey test.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/securities-regulators-back-sec-in-coinbase-suit\"><strong><em>Securities regulators oppose special treatment of crypto in Coinbase case </em></strong></a></p><p>The <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">SEC sued Coinbase on June 6,</a> claiming the exchange violated U.S. securities laws by listing several tokens it considers as securities and not registering with the regulator.</p><p>Coinbase filed the <a href=\"https://cointelegraph.com/news/coinbase-sec-seeks-dismissal-of-sec-suit-claims-extraordinary-abuse-of-process\">motion for judgment on June 29</a> arguing the SEC was abusing its power and violating Coinbase’s due process rights. </p><p>Judge Katherine Polk Failla, who oversees the case, may ask Coinbase and the SEC to appear in court for oral arguments and then could issue judgment on the case, dismiss it or move for it to be heard in front of a jury.</p><p><strong><em>Magazine:</em></strong><a href=\"https://cointelegraph.com/magazine/crypto-lawyer-irina-hall-of-flame/\"><strong><em> </em></strong><strong><em>Hall of Flame: Crypto lawyer Irina Heaver on death threats, lawsuit predictions</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-25T06:05:07.000Z",
    "title": "Coins.ph Reportedly Loses $6 million Worth of XRP Due To Exploit",
    "url": "https://cryptodaily.co.uk/2023/10/coinsph-reportedly-loses-6-million-worth-of-xrp-due-to-exploit",
    "description": "Data from XRP Scan reveals that the threat actor stole the tokens from Coins.ph before sending them out through OKX, WhiteBIT, OrbitBridge, SimpleSwap, ChangeNOW, and Fixed Float among others."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-25T06:00:41.000Z",
    "title": "Dogecoin Aggressive 12% Leap: Fear/Greed Index Uncovers Bullish Sentiment Secrets",
    "url": "https://www.newsbtc.com/news/dogecoin-aggressive-13-surge/",
    "description": "Dogecoin has been showing renewed exuberance with impressive figures this week, surging to an intraday high of $0.06525 Tuesday. This substantial rally allowed the cryptocurrency to surpass a significant resistance level positioned at $0.0640. Notably, this price breakthrough represented a momentous achievement for Dogecoin, as it hadn&#8217;t reached such heights since August 31. The cryptocurrency&#8217;s remarkable rebound from a low of $0.06068 indicated a resurgence in investor interest and enthusiasm, underlining the dynamic and often unpredictable nature of the cryptocurrency market. This event also served as a reminder of Dogecoin&#8217;s ability to capture the attention of traders and investors, prompting them to join the fray during this period of heightened market activity. Related Reading: Solana Barrels Close To $32: Critical Levels Traders Should Watch Dogecoin: Market&#8217;s Shift Toward &#8216;Greed&#8217; Territory In a recent X post by @DogecoinFear, an intriguing insight into the Dogecoin Fear and Greed Index emerges, revealing a current score of 71, which signals that the market may be entering &#8220;greed&#8221; territory. Dogecoin Fear and Greed Index is 71. Greed pic.twitter.com/TEgVW6MunR — Doge Fear and Greed Index (@DogecoinFear) October 24, 2023 In this context, &#8220;greed&#8221; signifies an intense desire for profit. A high score on the Dogecoin Fear and Greed Index, like the 71 mentioned, reflects a market where many investors are primarily motivated by the pursuit of substantial financial gains. This heightened &#8220;greed&#8221; sentiment can raise concerns about potential overvaluation or a forthcoming market correction. This fascinating metric holds significance for cryptocurrency enthusiasts, as it suggests the potential for an impending market correction. Conversely, when the index dips into &#8220;Fear&#8221; territory, it may serve as an indicator for investors to consider it a buying opportunity. At the time of writing, DOGE was trading at $0.066, down 2.8% in the last 24 hours, but still maintained a solid 12% ascent in the last seven days, data from crypto market tracker Coingecko shows. DOGE market cap currently at $9.3 billion. Chart: TradingView.com A number of cryptocurrency analysts have recently said in X posts that they believe DOGE will eventually reach the lofty $1 target. Dogecoin, according to cryptocurrency analyst Ali Martinez over the weekend, is nearing the peak of a multiyear slipping triangle pattern. This pattern often serves as a technical indicator that hints at a potential bullish breakout. The $1 target for DOGE has been a subject of widespread interest and speculation within the cryptocurrency community, and these insights from analysts reinforce the optimism surrounding Dogecoin&#8217;s future price trajectory. Related Reading: XRP 10% Rally Strengthens Case For $0.55 Breakout DOGE&#8217;s Bullish Signal: TD Sequential Indicator in Action Based on Martinez&#8217;s analysis, it has been seen that the Tom DeMark (TD) Sequential indicator has recently exhibited a bullish signal for DOGE. The TD indicator is utilized to identify potential trend reversals by tracking a sequence of price points. #Dogecoin appears ready to start a new uptrend! The TD Sequential presented a buy signal on $DOGE weekly chart. A sustained close above $0.062 could result in an upswing to $0.070. pic.twitter.com/XAGjXHMiOe — Ali (@ali_charts) October 21, 2023 The analyst said: “Dogecoin appears ready to start a new uptrend! The TD Sequential presented a buy signal on DOGE weekly chart.&#8221; He added that a sustained close above the key resistance level at $0.062 holds the potential to trigger a notable upswing in Dogecoin&#8217;s value, potentially driving it towards the $0.070 mark. This pivotal breakthrough could signify a shift in market sentiment, attracting more traders and investors who see the potential for further gains. It&#8217;s an important technical milestone to watch, as surpassing such resistance levels often signals renewed interest and buying activity in the cryptocurrency market. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Air Force Athletics"
  }
]