[
  {
    "source": "Bitcoin.com",
    "date": "2024-03-24T05:30:16.000Z",
    "title": "Japanese Crypto Influencer Calls Ethereum Improvement Proposal 4844 a ‘Layer 1 Middle Ground’",
    "url": "https://news.bitcoin.com/japanese-crypto-influencer-calls-ethereum-improvement-proposal-4844-a-layer-1-middle-ground/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_1036661857-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Japanese Crypto Influencer Calls Ethereum Improvement Proposal 4844 a ‘Layer 1 Middle Ground’\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_1036661857-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_1036661857-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_1036661857-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_1036661857-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_1036661857-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_1036661857-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_1036661857.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to Mai Fujimoto, a Japanese crypto influencer and co-founder of Intmax, the Ethereum Improvement Proposal (EIP) 4844 – also known as proto-danksharding – have emerged as a solid solution for addressing the Ethereum network’s scalability challenges. The EIP 4844 is also significant for scaling solutions such as zero-knowledge rollups (zkrollups) and Layer 2 chains [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-24T05:27:51.000Z",
    "title": "Incoming MATIC Surge: Analyst Predicts $15 Price Target",
    "url": "https://www.newsbtc.com/matic/incoming-matic-surge-analyst-predicts-15-price-target/",
    "description": "Digital asset analyst with X handle Crypto Patel has recently shared a bullish prediction on MATIC price movement in the coming weeks. This forecast comes amidst MATIC’s poor performance in the last seven days, during which it lost 6.68% of its market value, based on data from CoinMarketCap.  The Polygon native token had been one of the best-performing assets in 2024 rising by over 76.38% between January to March. However, the altcoin has now recorded a 22.83% decline over the last two weeks, drawing much concern over its future price movement.  Related Reading: Fantom (FTM) Jumps 180% In 4 Weeks: Just The Beginning? $1.20 Price Level Critical For MATIC Price Surge, Analyst Says In a post on X on March 23, Crypto Patel presented a bullish case for MATIC despite the token’s current downtrend, naming the forecast the “MATIC BULL RUN ROADMAP.” Firstly, the analyst stated that a MATIC bullish pennant was being formed. For context, the bullish pennant represents a price pattern that typically follows a string of upward movement in price (the flagpole) followed by a period of consolidation (pennant). $MATIC BULL RUN ROADMAP 🚀 1⃣ #MATIC Forming Bullish Pennant In HTF 2⃣ 2021 Bull Run: Did 100x in Last bull Market After Bull Flag Breakout 3⃣ If MATIC/USDT Break $1.20 Level in HTF then Ready for $10-$15 Target 4⃣ I am Bullish in #POLYGON for Long Run 5⃣ If Market Crash then… pic.twitter.com/FJEvGiHd4U — Crypto Patel (@CryptoPatel) March 23, 2024 A bullish pennant is characterized by converging trendlines, which indicates the continuation of the previous uptrend once the price breaks out of consolidation. Importantly, Crypto Patel emphasized that MATIC’s bullish pennant was being formed on a higher time frame (HTF), such as the weekly chart.  Following historical trends, the complete formation of the bullish pennant could result in Polygon native asset experiencing a 100x price increase in the highly anticipated crypto bull run, as observed in 2021. However, with a focus on short-term targets, Crypto Patel has stated that MATIC reaching the $1.20 price zone on the HTF could trigger a surge to a range of $10-$15, representing a potential 1500% gain on the asset’s current price.  Albeit, in the advent of an unexpected crash, the crypto analyst expects MATIC could be significantly affected but should find support around the $0.60-$0.70 price zone.  Related Reading: Buy High, Sell Low: FOMO Made This Crypto Trader Lose 6,039 SOL MATIC Price Overview At the time of writing, MATIC trades around $0.9817 with a 1.30% gain in the last 24 hours. Meanwhile, the token’s daily trading volume has declined by 31.82% and is valued at $291.65 million. With a market cap value of $9.7 billion, MATIC is ranked the 16th largest cryptocurrency and one of the world’s most prominent digital assets. MATIC trading at $0.9771 on the daily chart &#124; Source: MATICUSDT chart on Tradingview.com Featured image from Freepik, chart from Tradingview"
  }
]