[
  {
    "source": "CoinDesk",
    "date": "2023-07-31T12:52:52.000Z",
    "title": "First Mover Americas: Curve Finance Exploit Puts More Than $100M of Crypto at Risk ",
    "url": "https://www.coindesk.com/markets/2023/07/31/first-mover-americas-curve-finance-exploit-puts-more-than-100m-of-crypto-at-risk/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for July 31, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-31T12:49:16.000Z",
    "title": "Crypto Firms Raised $129M Last Week, Led by Flashbots",
    "url": "https://www.coindesk.com/business/2023/07/31/crypto-firms-raised-129m-last-week-led-by-flashbots/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The startup, focused on maximal extractable value (MEV) in blockchain transactions, raised $60 million in funding."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-31T12:57:48.000Z",
    "title": "Japan Blockchain Association Requests Crypto Tax Reform",
    "url": "https://cryptodaily.co.uk/2023/07/japan-blockchain-association-requests-crypto-tax-reform",
    "description": "<p>Japan&rsquo;s Blockchain Association (JBA) reportedly urged the government to revise tax rules imposed on virtual assets. </p>\n<p>The JBA has called on the Japanese government to reform its crypto tax rules. The association argues the tax system in its current form hinders the growth of Web3 in Japan.</p>\nRevised Tax Rules Will Foster Web3 Growth\n<p>According to reports by local Japanese news website, Coinpost, the JBA requested that government reconsider its current tax system for virtual currencies as it hinders the growth of Web3 in the country. The organisation says its proposed revisions would allow more domestic companies to enter the burgeoning sector. The JBA also called for developing a crypto-friendly environment where citizens can own and use crypto assets.</p>\n<p>The JBA, led by co-founder and CEO of Bitflyer, Yuza Kano, suggest the following three reforms:</p>\nEliminating Year-End Unrealised Gain Tax on Third-Party Issued Tokens\n<p>Japan&rsquo;s National Tax Agency (NTA) amended rules on corporate tax rules which provide a tax exemption to companies issuing cryptocurrencies. Under its previous system, companies that issue cryptocurrencies must pay taxes on unrealised gains at the end of a tax period.</p>\n<p>The rules, however, did not change as they pertain to third-party token issuers. The JBA argues unrealised profit tax on third-party issuers is a barrier for domestic companies to enter the Web3 space.</p>\nChanging the Taxation Method for Individual Crypto Asset Transactions to Separate Self-Assessment taxation, Applying a Uniform 20% Rate\n<p>The JBA&rsquo;s suggestions further state that losses should be carried forward and deducted in the three years after the year in which they occurred, thereby reducing tax.</p>\nEliminating Income Tax on Profits for Every Crypto Asset Transaction/Exchange\n<p>The association opines that fostering an environment in which citizens want to invest will, in turn, increase the amount of tax the government can collect.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T13:00:54.000Z",
    "title": "Fleek Network Releases New Whitepaper for Decentralized Edge Platform",
    "url": "https://www.cryptopolitan.com/fleek-network-releases-new-whitepaper-for-decentralized-edge-platform/",
    "description": "Brooklyn, New York, July 31st, 2023, Chainwire Fleek Network has released a new whitepaper describing the decentralized edge platform it is developing. Its release is accompanied by the launch of a new open-source Github repository for the protocol. This release is a major milestone on the path to launching a testnet for the decentralized edge ... <a title=\"Fleek Network Releases New Whitepaper for Decentralized Edge Platform\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fleek-network-releases-new-whitepaper-for-decentralized-edge-platform/\" aria-label=\"More on Fleek Network Releases New Whitepaper for Decentralized Edge Platform\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T12:45:46.000Z",
    "title": "An AI Personal Trainer and Holograms Provide An Immersive Fitness Experience",
    "url": "https://www.cryptopolitan.com/keep-fit-with-ai-personal-trainer/",
    "description": "MAGIC, founded in 2021 by Varun Bhanot, is making waves in the fitness industry as one of the UK&#8217;s pioneering AI personal trainers. Combining cutting-edge holographic technology with artificial intelligence, MAGIC offers an immersive fitness experience. Celebrity athletes and sports stars appear as holograms within MAGIC&#8217;s AI wall mirror, guiding users through personalized training programs ... <a title=\"An AI Personal Trainer and Holograms Provide An Immersive Fitness Experience\" class=\"read-more\" href=\"https://www.cryptopolitan.com/keep-fit-with-ai-personal-trainer/\" aria-label=\"More on An AI Personal Trainer and Holograms Provide An Immersive Fitness Experience\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-31T13:07:43.000Z",
    "title": "‘Rich dad’ Kiyosaki disputes WSJ’s economic narrative, favors bitcoin",
    "url": "https://crypto.news/rich-dad-kiyosaki-disputes-wsjs-economic-narrative-advocates-bitcoin/",
    "description": "Renowned author and investor Robert Kiyosaki has rebutted the Wall Street Journal&#8217;s portrayal of a thriving US economy, underlining his skepticism on Twitter. Kiyosaki stressed that the recent upswing in the stock market was primarily driven by President Joe Biden&#8217;s&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-31T12:41:14.000Z",
    "title": "These 5 crypto declined most in July: Pepe and other underperformers",
    "url": "https://crypto.news/these-5-crypto-declined-most-in-july-pepe-and-other-underperformers/",
    "description": "Five tokens stand out as the biggest losers among the top 100 assets, facing significant challenges in recent times. As July comes to a close, the crypto market has witnessed notable fluctuations, with some assets experiencing a downward spiral in&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-31T12:51:17.000Z",
    "title": "XRP Wiped Out 15 Months Losses in 24 Hours – Is This a Sign of What’s to Come?  Expert Recommends Periodic Buying and Holding",
    "url": "https://www.crypto-news-flash.com/xrp-wiped-out-15-months-losses-in-24-hours-is-this-a-sign-of-whats-to-come-expert-recommends-periodic-buying-and-holding/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-wiped-out-15-months-losses-in-24-hours-is-this-a-sign-of-whats-to-come-expert-recommends-periodic-buying-and-holding",
    "description": "<img width=\"780\" height=\"520\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/ripple-xrp-a.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/ripple-xrp-a.jpg 780w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/ripple-xrp-a-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/ripple-xrp-a-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/ripple-xrp-a-104x69.jpg 104w\" sizes=\"(max-width: 780px) 100vw, 780px\" />Crypto analyst commends the recent run of XRP, saying it wiped out 15 months&#8217; loss in just 24 hours. Another analyst has predicted that XRP could trade between $100 and $500 in just seven months. The price of XRP is up by 50 percent in the last 30 days to trade at $0.704322. The dramatic [...]"
  }
]