[
  {
    "source": "Decrypt",
    "date": "2023-09-27T21:46:32.000Z",
    "title": "Nintendo Switch 2: Everything You Need to Know",
    "url": "https://decrypt.co/197793/nintendo-switch-2-rumors-leaks-latest-news",
    "description": "UPDATE: Leakers say that a pair of massive games are headed to the Switch 2. Here's the latest on the next Nintendo console."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-27T21:45:00.000Z",
    "title": "SEC pushes deadlines for ARK 21Shares, VanEck spot Ether ETF applications",
    "url": "https://cointelegraph.com/news/sec-pushes-deadlines-spot-ether-etfs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/3f494e48-8003-4dce-b68f-540a915ff6b3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The commission also designated a longer period to reach a decision on spot Bitcoin ETF applications from ARK 21Shares and GlobalX on Sept. 26.</p>\n                    <p><p>The United States Securities and Exchange Commission (SEC) has delayed reaching a decision on whether to approve or disapprove of spot Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) exchange-traded fund applications from ARK 21Shares and VanEck.</p><p>In separate notices filed Sept. 27, the SEC <a href=\"https://www.sec.gov/files/rules/sro/cboebzx/2023/34-98565.pdf\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it would designate a longer period on whether to approve or disapprove of a proposed rule change that would allow listings of spot ETH ETFs from VanEck and ARK 21Shares on the Cboe BZX Exchange. The commission said it had received no public comments on either proposal and would push the deadlines for another delay or decision to Dec. 25 and Dec. 26, respectively.</p><p>“The Commission finds it appropriate to designate a longer period within which to take action on the proposed rule change so that it has sufficient time to consider the proposed rule change and the issues raised therein,” said the SEC. </p><p>The delay came the same day the Nasdaq Stock Market <a href=\"https://www.sec.gov/files/rules/sro/nasdaq/2023/34-98563.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> a proposed rule change with the SEC for <a href=\"https://cointelegraph.com/news/crypto-ether-mixed-etf-nasdaq-hashdex\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-ether-mixed-etf-nasdaq-hashdex/amp\">listing its mixed ETH ETF</a> — a combination of spot Ether holdings and futures contracts. Proposed rule changes with the New York Stock Exchange Arca for the Grayscale Ethereum Futures Trust and Hashdex Bitcoin Futures ETF, and the Cboe BZX Exchange for the Franklin Bitcoin ETF were also filed on Sept. 27.</p><p>The SEC announced on Sept. 26 it would <a href=\"https://cointelegraph.com/news/sec-pushes-deadline-ark-21shares-spot-bitcoin-etf\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-pushes-deadline-ark-21shares-spot-bitcoin-etf/amp\">designate a longer period</a> to reach a decision on spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) ETF applications from ARK 21Shares and GlobalX. The commission filed the notice weeks ahead of the next deadlines for both investment vehicles, pushing a final decision on ARK 21Shares’ ETF to January.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">And here's <a href=\"https://twitter.com/vaneck_us?ref_src=twsrc%5Etfw\">@vaneck_us</a>' delay as expected <a href=\"https://t.co/uloOidbfd1\">https://t.co/uloOidbfd1</a> <a href=\"https://t.co/i4Hhv5yhiR\">pic.twitter.com/i4Hhv5yhiR</a></p>— James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1707122281489527141?ref_src=twsrc%5Etfw\">September 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/lawmakers-call-sec-chair-approve-spot-bitcoin-etf\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/lawmakers-call-sec-chair-approve-spot-bitcoin-etf/amp\"><strong><em>US lawmakers call on SEC chair to approve spot Bitcoin ETFs ‘immediately’</em></strong></a></p><p>In August, ARK Investment Management founder and CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/cathie-wood\">Cathie Wood</a> speculated that should the SEC move forward with spot ETF approvals, it <a href=\"https://cointelegraph.com/news/cathie-wood-predicts-sec-simultaneously-allowing-multiple-spot-crypto-etf\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cathie-wood-predicts-sec-simultaneously-allowing-multiple-spot-crypto-etf/amp\">could allow multiple listings</a> simultaneously to avoid giving any single company an advantage over another in the market. Her remarks came prior to Grayscale Investments <a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/grayscale-wins-sec-lawsuit/amp\">winning a court battle</a> with the SEC over its spot Bitcoin ETF application, which will likely be reviewed.</p><p>To date, the SEC has never approved a spot crypto ETF in the U.S. but has allowed the listing of crypto-linked futures ETFs as well as a leveraged Bitcoin futures ETF. The next deadlines for spot crypto ETF applications from firms including BlackRock, WisdomTree, Invesco Galaxy, Valkyrie, Bitwise and Fidelity are scheduled for October. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\">Blockchain detectives: Mt. Gox collapse saw birth of Chainalysis</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-27T22:00:56.000Z",
    "title": "Biden administration rumored to be working on executive order requiring disclosure of outsized power consumption",
    "url": "https://cryptoslate.com/biden-administration-rumored-to-be-working-on-executive-order-requiring-disclosure-of-outsized-power-consumption/",
    "description": "<p>An executive order from the Biden administration could compel cloud computing companies to report excess power usage to the U.S. government, Semafor reported on Sept. 27. Based on statements from anonymous sources, the expected order will require cloud computing companies like Microsoft, Google, and Amazon to disclose when a customer rents a certain amount of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/biden-administration-rumored-to-be-working-on-executive-order-requiring-disclosure-of-outsized-power-consumption/\">Biden administration rumored to be working on executive order requiring disclosure of outsized power consumption</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-27T22:03:00.000Z",
    "title": "Ethereum ($ETH) Reaches $10 Billion in Revenue, Outshining Track Records of Tech Giants Like Microsoft and Adobe",
    "url": "https://www.cryptoglobe.com/latest/2023/09/ethereum-eth-reaches-10-billion-in-revenue-outshining-track-records-of-tech-giants-like-microsoft-and-adobe/",
    "description": "The second-largest cryptocurrency by market capitalization Ethereum ($ETH) has seen its protocol revenue surpass the $10 billion mark after significant growth that has seen it overtake tech titans like Microsoft and Adobe in reaching the milestone. According to a report from cryptocurrency brokerage firm Caleb &amp; Brown, it took Ethereum around 7.5 years to reach […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-27T22:00:23.000Z",
    "title": "US Crypto Exchange Kraken Wins ‘Milestone’ Regulatory Approvals in Europe",
    "url": "https://news.bitcoin.com/us-crypto-exchange-kraken-wins-milestone-regulatory-approvals-in-europe/",
    "description": "<img width=\"768\" height=\"433\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1312887530-768x433.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"US Crypto Exchange Kraken Wins ‘Milestone’ Regulatory Approvals in Europe\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1312887530-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1312887530-1024x578.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1312887530-768x433.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1312887530-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1312887530-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1312887530-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1312887530.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Cryptocurrency exchange Kraken announced new achievements in implementing its strategy to pursue expansion on the European market. The U.S. trading platform for digital assets said it has received regulatory nods from the monetary authorities of Ireland and Spain, two of the EU nations with relatively clear rules for the industry. Another Major U.S. Crypto Exchange, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-27T22:00:52.000Z",
    "title": "XRP Price At Risk? SEC Chair’s Congressional Testimony Fuels Ripple’s Legal Battle",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-at-risk-sec-chairs-congressional-testimony-fuels-ripples-legal-battle/",
    "description": "The cryptocurrency sector, particularly Ripple Labs, has been embroiled in a scenario of concern and uncertainty following a contentious exchange between the US Securities and Exchange Commission&#8217;s (SEC) chair, Gary Gensler, and the House Financial Services Committee in Congress which could affect the XRP price.  Despite Ripple&#8217;s partial legal victory against the SEC, Gensler&#8217;s stance remains unchanged, as he emphasized the regulatory body&#8217;s determination to pursue an interlocutory appeal in the ongoing case. This has raised further questions and apprehension within the industry. Congressman Highlights Ripple Case&#8217;s Far-From-Over Status During the hearing, Congressman Stephen F. Lynch expressed his concern about the potential pattern whereby court battles become the norm to determine the classification of individual tokens as securities.  While Gensler did not respond directly, he mentioned the SEC&#8217;s filing for an interlocutory appeal, highlighting the regulator&#8217;s intent to continue the legal battle. Lynch acknowledged that the case is far from over. Related Reading: Chainlink (LINK) Brushes Off Market Downtrend, Scores 11% In Last Week On August 17, Judge Torres granted the SEC&#8217;s request to file an interlocutory appeal, granting the regulatory body an opportunity to present a compelling case to the Second Circuit.  However, it&#8217;s important to note that this permission only allows the SEC to file the motion for an interlocutory appeal, presenting a significant opening for the regulator to challenge the previous ruling and seek a different outcome. These recent developments, as highlighted by Congressman Lynch, indicate that the ongoing Ripple case may take considerable time to resolve.  As a result, XRP is likely to remain stagnant, trapped in a consolidation phase, or potentially retracing beyond its current levels. This could potentially push the cryptocurrency to pursue another annual low, extending beyond the $0.4225 mark reached on August 17. XRP Price Analysis Points To Potential Macro Uptrend Despite the legal battles and the uncertainty surrounding the current state of the crypto market, some signs might point to a different scenario, where XRP could follow a macro uptrend.  Technical analysis highlights a pattern resembling the last market cycle, which consists of five phases: rise, crash, retrace, reaccumulation, and eventual breakout. Drawing parallels to previous cycles, many coins have experienced explosive growth beyond their previous all-time highs after the reaccumulation phase.  For instance, Bitcoin went through its reaccumulation phase during the COVID-19 pandemic. Still, due to the ongoing lawsuit, XRP has entered a more prolonged reaccumulation phase in the form of an Elliott wave triangle, similar to the previous cycle.  Currently, the market is in phase E, which suggests a potential retracement upwards, followed by another dip to lower levels. Eventually, there is anticipation for a breakout from this massive triangle, leading to a new all-time high likely to occur next year or the year after. Related Reading: LINKing The Dots: Why Chainlink Could Be The Altcoin To Watch, Top Trader Says While some argue that the XRP price fate depends on Bitcoin&#8217;s performance, it is worth noting that when comparing XRP to BTC, it is also within an accumulation range and exhibits a bullish outlook. From this perspective, XRP is expected to outperform other alternative coins significantly. However, for the XRP price to sustain an extended uptrend in the near term, it must overcome significant resistance levels that pose potential challenges. In the immediate time frame, XRP faces a resistance at $0.5132, followed by two additional formidable barriers, which are expected to be particularly challenging in the coming weeks. XRP&#8217;s 50-day and 200-day Moving Averages (MAs) are currently positioned at $0.5194 and $0.5318, respectively. These MAs, once considered reliable support levels, have failed to hold, necessitating a significant catalyst for XRP to surpass them.  This is evident in the chart, depicting the partial victory on July 13, when XRP surged above both MAs. However, since August, XRP has been trading below them. Featured image from Shutterstock, chart from TradingView.com"
  }
]