[
  {
    "source": "CryptoSlate",
    "date": "2023-11-28T01:00:58.000Z",
    "title": "Number of short-term Bitcoin holders hits 10-year low",
    "url": "https://cryptoslate.com/insights/number-of-short-term-bitcoin-holders-hits-10-year-low/",
    "description": "<p>Quick Take According to recent data analysis from Glassnode, Bitcoin is experiencing the most significant divergence ever witnessed between its long-term holders (LTHs) and short-term holders (STHs). The distinction between LTHs and STHs is based on a 155-day holding period. Those who have held on to Bitcoin for more than 155 days are classified as [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/number-of-short-term-bitcoin-holders-hits-10-year-low/\">Number of short-term Bitcoin holders hits 10-year low</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-28T01:00:38.000Z",
    "title": "Whale Rapidly Stacking Uniswap, UNI To $10?",
    "url": "https://www.newsbtc.com/news/uniswap/whale-rapidly-stacking-uniswap-uni-to-10/",
    "description": "An active crypto whale has been steadily accumulating UNI, the native token to Uniswap, one of the world&#8217;s most active decentralized exchanges (DEXes). This development suggests that the address believes the token may edge higher in the coming trading days or weeks, extending gains after a sharp leg up on November 22 when UNI soared, breaking above key resistance levels.  Whale Loading Up More UNI, Back To $10? According to recent Lookonchain data, an Ethereum address, stevu.eth, withdrew 311,302 UNI worth $1.93 million from Binance, the world&#8217;s largest crypto exchange, on November 25, pushing its total UNI holdings to 511,301 UNI, or $3.18 million. Related Reading: Cosmos Co-Founder’s Controversial Proposal Triggers 11% Plunge In ATOM Notably, this acquisition follows a withdrawal of 500,545 UNI ($2.42 million) from OKX on June 29, which stevu.eth deposited to Binance and OKX in August. However, the recent accumulative behavior on November 25 indicates that the whale is bullish on UNI, possibly expecting prices to float back to $10, a level last seen in August 2022. Presently, UNI is trading within a bullish breakout formation, looking at the performance in the daily chart. Changing hands at around $6.2 when writing on November 27, the token is up approximately 60% from October lows. Even with the confidence, UNI prices have been mostly consolidating, moving horizontally at spot rates. If buyers press on, a close above $6.6 with expanding volumes might confirm buyers of November 22. In that case, the resulting momentum might form the base for another leg up, pushing the token to August 22 highs of around $10. Uniswap v4 Expectations The whale&#8217;s confidence in UNI aligns with the ongoing development of Uniswap v4, an upgrade that will significantly enhance the DEX. In this update scheduled for a tentative period in 2024, Uniswap Labs, the team behind Uniswap, is introducing a concept called &#8220;hooks.&#8221;  Hooks are contracts that can be executed at various stages of a pool&#8217;s lifecycle. According to the team, Hooks, which act as more plugins, provide increased flexibility and customization for Uniswap&#8217;s liquidity pools. As such, it would be possible for users to enable features like dynamic fees, refined market making, and even advanced orders executed on-chain. Related Reading: Renowned Finance Author Says Buy Bitcoin Now Before It’s Too Late, Here’s Why What&#8217;s notable about Uniswap v4 is the introduction of &#8220;singleton&#8221; contract architecture. All Uniswap liquidity pools will reside inside a single, smart contract in this design change. The team notes that this can significantly reduce gas costs and, more importantly, reduce routing efficiency across numerous pools. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-28T01:00:13.000Z",
    "title": "Analyst Predicts Upward Squeeze for Cosmos and One Additional Altcoin, Updates Outlook on One Crypto Asset",
    "url": "https://dailyhodl.com/2023/11/27/analyst-predicts-upward-squeeze-for-cosmos-and-one-additional-altcoin-updates-outlook-on-one-crypto-asset/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Top-Trader-Says-Altcoins.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Top-Trader-Says-Altcoins.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Top-Trader-Says-Altcoins.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Top-Trader-Says-Altcoins.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Top-Trader-Says-Altcoins.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Top-Trader-Says-Altcoins.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Top-Trader-Says-Altcoins.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto strategist thinks that the interoperable blockchain ecosystem Cosmos (ATOM) is primed for a move up. Pseudonymous analyst Kaleo tells his 606,800 followers on the social media platform X that he&#8217;s bullish on ATOM as he believes that the altcoin is &#8220;due for a squeeze.&#8221; &#8220;I&#8217;m long.&#8221;  Looking at the trader&#8217;s chart, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/27/analyst-predicts-upward-squeeze-for-cosmos-and-one-additional-altcoin-updates-outlook-on-one-crypto-asset/\">Analyst Predicts Upward Squeeze for Cosmos and One Additional Altcoin, Updates Outlook on One Crypto Asset</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]