[
  {
    "source": "Cointelegraph",
    "date": "2024-01-10T16:07:24.000Z",
    "title": " Brevan Howard, Hamilton Lane to tokenize assets through Libre protocol ",
    "url": "https://cointelegraph.com/news/brevan-howard-hamilton-lane-tokenize-assets-through-libre-protocol",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMzAzMjdmYzItYmM3YS00MzQwLWI3MmMtMWIzNzEyOTBjOTYxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Libre is scheduled to go live in the first quarter of 2024, offering asset tokenization and smart contracts through the Polygon network.</p>\n                    <p><p data-ct-non-breakable=\"true\">Brevan Howard and Hamilton Lane will be the first asset managers to tokenize assets on the upcoming Web3 infrastructure provider Libre protocol — backed by Brevan Howard's WebN and Nomura's Laser Digital. </p><p>Libre is scheduled to go live in the first quarter of 2024, offering asset tokenization and smart contracts through the Polygon network, supporting collateralized lending and automated rebalancing of separately managed accounts (SMAs).</p><p>According to a Jan. 10 announcement, both Brevan Howard and Hamilton Lane have entered into a strategic partnership with Libre, seeking to improve access to alternative investments. “We believe that tokenisation has the potential to revolutionise the way investments are managed and traded,\" said Victor Jung, head of digital assets at Hamilton Lane. </p><p><a href=\"https://cointelegraph.com/news/brevan-howard-hamilton-lane-tokenize-assets-through-libre-protocol\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-10T15:54:20.000Z",
    "title": " This is why Bitcoin won&#039;t crash 30% after the ETF decision  ",
    "url": "https://cointelegraph.com/news/bitcoin-crash-30-percent-after-etf-decision",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZDE5ODcwOGUtMjZhMi00YmEzLWIzNGItMTYxMDgyMzNiZTcxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The percent of long-term Bitcoin holders is sitting about 70%. If you're counting on them to jettison their supply at $46,000, you might be disappointed.</p>\n                    <p><p>Amid the<a href=\"https://cointelegraph.com/news/us-senators-letter-gary-gensler-congress-report-x-breach-4-days\"> Bitcoin ETF mania</a>, wild price predictions have flown around. Even with Securities and Exchange Commission (SEC) approval, many anticipate a “sell the news” event that will drive Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price 30% below current levels.</p><p>However, I don’t see this scenario playing out. In fact, there’s a convincing argument to predict Bitcoin will rally another 10% from current levels above the $50,000 mark, before pulling back slightly in the short term. </p><p>Having spent several decades working in traditional asset management, I know that when BlackRock publicly states something, the market should pay attention. BlackRock appeared certain in the days leading to Jan. 10 that approval would be granted.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-crash-30-percent-after-etf-decision\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-10T15:40:54.000Z",
    "title": " Sam Bankman-Fried retains new counsel ahead of sentencing hearing ",
    "url": "https://cointelegraph.com/news/sam-bankman-fried-retains-counsel-sentencing",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYzFiODI1NjMtNTI4MS00OTEwLWE3ZTktOTI0M2M0MzYxYzA4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>As of Jan. 9, Torrey Young and Marc Mukasey of Mukasey Young LLP said they represented the former FTX CEO.</p>\n                    <p><p>Former FTX CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam “SBF” Bankman-Fried</a> has filed notice in federal court that he retained new counsel before his sentencing hearing for seven criminal charges.</p><p>In a Jan. 9 filing in United States District Court for the Southern District of New York, Torrey Young and Marc Mukasey of Mukasey Young LLP <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590940/gov.uscourts.nysd.590940.392.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">said</a> they represented Bankman-Fried. SBF’s legal team also filed a sealed document, which could suggest a possible appeal to his November conviction.</p><p>Bankman-Fried, once the CEO of cryptocurrency exchange FTX, stepped down in November 2022 amid liquidity issues at the firm. FTX subsequently filed for bankruptcy, and SBF was extradited from the Bahamas and charged in the United States for fraud related to the handling of funds between FTX and Alameda Research.</p><p><a href=\"https://cointelegraph.com/news/sam-bankman-fried-retains-counsel-sentencing\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-10T15:45:09.000Z",
    "title": "Bitcoin futures margined in BTC hit historic lows as cash options prevail",
    "url": "https://cryptoslate.com/insights/bitcoin-futures-margined-in-btc-hit-historic-lows-as-cash-options-prevail/",
    "description": "<p>Quick Take A noteworthy shift is visible in the landscape of Bitcoin futures contracts, as evidenced by the current state of open interest margined in native Bitcoin (BTC). There has been a significant fall in BTC-margined futures contracts, down from a peak of 240,000 BTC during the 2021 bull market to an all-time low of [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoin-futures-margined-in-btc-hit-historic-lows-as-cash-options-prevail/\">Bitcoin futures margined in BTC hit historic lows as cash options prevail</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-10T15:48:50.000Z",
    "title": "Shiba Inu’s Blazing Triumph: 9.35 Billion Tokens Incinerated, Burn Rate Skyrockets by 28,659%",
    "url": "https://www.cryptoglobe.com/latest/2024/01/shiba-inus-blazing-triumph-9-35-billion-tokens-incinerated-burn-rate-skyrockets-by-28659/",
    "description": "The Shiba Insu Project and Its Native Token SHIB The Shiba Inu (SHIB) project is a community-driven cryptocurrency ecosystem inspired by the popular Shiba Inu dog meme. Launched in August 2020, it rode the wave of Dogecoin’s meme-coin success and quickly amassed a large and active community. The SHIB token is the main token of […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-10T15:51:55.000Z",
    "title": "Ripple (XRP) Whale Transactions Hint at Price Surge – SOL and Meme Moguls (MGLS) Among Top Coins to Boom",
    "url": "https://cryptodaily.co.uk/2024/01/ripple-xrp-whale-transactions-hint-at-price-surge-sol-and-meme-moguls-mgls-among-top-coins-to-boom",
    "description": "Whales, which refers to large or major players in the crypto world hold massive significance in the price movement of a particular coin."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-10T16:03:17.000Z",
    "title": "Solana Price Prediction 2024-2033: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2024-2033 How much is SOL worth? The live Solana price today is $95.17 USD with a 24-hour trading volume of $5,212,471,771 USD. We update our SOL to USD price in real-time. Solana is down 9.82% in the last 24 hours. The current CoinMarketCap ranking is #5, with a live market cap of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-10T16:02:01.000Z",
    "title": "AI Skills in High Demand as Canadian Companies Prepare for 2024 Hiring",
    "url": "https://www.cryptopolitan.com/ai-skills-in-high-demand-as-canadian-companies-prepare-for-2024-hiring/",
    "description": "Canadian companies are gearing up for their 2024 hiring plans, and one skill stands out as a top priority: artificial intelligence (AI). Members of Canada&#8217;s tech community emphasize the critical need to find individuals who can develop AI-based products or utilize AI to enhance operational efficiency. This heightened demand is fueled by the intensifying global [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-10T15:55:34.000Z",
    "title": "Cardano Price Prediction 2024-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Cardano stands out as a project with remarkable potential beyond its role as a tradable asset. Rooted in scholarly peer-reviewed research, it has cultivated a robust community over time. Here, we delve into the essence of Cardano and offer a projection for the future value of ADA. How much is ADA [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-10T15:52:42.000Z",
    "title": "Dogecoin Price Prediction 2024-2033: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-10T15:51:59.000Z",
    "title": "Nvidia Unveils New Consumer AI Chips and Local AI Tools",
    "url": "https://www.cryptopolitan.com/nvidia-unveils-new-consumer-ai-chips/",
    "description": "Nvidia, a prominent player in the world of graphics processing units (GPUs), has made a significant announcement, unveiling three new consumer AI chips and local AI tools. This development is set to bring cutting-edge AI capabilities to local computers, potentially revolutionizing how consumers interact with artificial intelligence.&#160; The company has introduced the &#8220;super&#8221; versions of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-10T15:47:17.000Z",
    "title": "Generative AI and Patent Eligibility Cases Take Center Stage in 2024",
    "url": "https://www.cryptopolitan.com/ai-skills-in-high-demand-as-canadian/",
    "description": "In 2024, federal courts are grappling with a surge of copyright infringement complaints related to generative artificial intelligence (AI). This emerging technology, characterized by its ability to autonomously create content, is ushering in a new era of legal challenges. Prominent players like Stability AI and Meta Platforms Inc. find themselves in the crosshairs of these [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-10T15:47:12.000Z",
    "title": "Generative AI in Cybersecurity: A Double-Edged Sword",
    "url": "https://www.cryptopolitan.com/generative-ai-in-cybersecurity-a-double-edged-sword/",
    "description": "In cybersecurity, the adoption of generative artificial intelligence (AI) has become a pivotal tool for practitioners in their ongoing battle against cyber threats. While this innovative technology offers marked benefits, it also presents new challenges as malicious actors increasingly harness its power to enhance attacks.&#160; Rob Joyce, Director of Cybersecurity at the National Security Agency [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-10T15:51:49.000Z",
    "title": "Bitcoin price dips as SEC denies approving spot ETF",
    "url": "https://crypto.news/bitcoin-price-dips-as-sec-denies-approving-spot-etf/",
    "description": "Bitcoin prices are under pressure with the U.S. SEC denying approving spot BTC ETF. Bitcoin Minetrix backed to rally"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-10T15:50:52.000Z",
    "title": "Phoenix Group expands mining fleet with $187m Bitmain deal post-IPO",
    "url": "https://crypto.news/phoenix-group-expands-mining-fleet-with-187m-bitmain-deal-post-ipo/",
    "description": "Phoenix Group, a leading Bitcoin mining firm based in the UAE, has recently invested significantly in expanding its operations."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-10T16:00:38.000Z",
    "title": "Cardano Price Explosion: Crypto Analyst Predicts ADA Price To Hit $6",
    "url": "https://www.newsbtc.com/news/cardano/cardano-ada-price-to-hit-6/",
    "description": "Crypto analyst Ali Martinez has predicted an outstanding long-term price for Cardano (ADA), although subject to some downside before the target is reached. The Cardano (ADA) price is currently declining, down by 4.2% in the past 24 hours and 16.7% in a larger timeframe. The crypto did manage to turn bullish for a few hours yesterday, jumping 14.6% from a low of $0.4727 to $0.5421.  Most of this price gain has been shed off and the crypto is now trading at $0.5079, confirming an ongoing consolidation. However, according to crypto analyst Ali Martinez, Cardano&#8217;s current consolidation mirrors that of its 2018-2020 phase, which is preparing the groundwork for a strong bull run. ADA Mirroring Its Past Performance Cryptocurrencies are known to repeat previous price actions, giving analysts an idea of what to expect based on the outcome of the previous performance. In this vein, a Cardano technical analysis shared on social media platform X by Ali Martinez indicated that ADA&#8217;s current consolidation is reminiscent of ADA&#8217;s price action whose breakout led to a 2,980% price surge.  Related Reading: Shiba Inu Breakout To $0.001? Rumored 9.25 Trillion SHIB Token Burn Could Be The Catalyst According to the weekly timeframe chart shared by Martinez, ADA consolidated for 665 days between 2018 to 2020 before going on a price surge to reach $3.058, its current all-time high. If a repeat of this pattern were to successfully play out, we might see ADA continue to consolidate around this level until April. Consequently, a repeat of a 2,980% price surge from the current price would put a price target around $15. So far, #Cardano price action is echoing its 2018-2020 pattern! If this trend continues, we might see $ADA consolidating around its current levels until April, setting the stage for a potential resumption of the bull run. pic.twitter.com/bMy8zrxQIp — Ali (@ali_charts) January 8, 2024 ADA price at $0.5 &#124; Source: ADAUSD on Tradingview.com Current State Of Cardano Cardano went through a price surge in the last quarter of 2023, mirroring a surge in July 2020. As a result, ADA recorded a 173% gain from $0.2435 in October to a yearly high of $0.6655 in December. However, the crypto has been on a decline since then. A recent larger decline among altcoins has also contributed to a further price decline. Related Reading: VanEck Announces Massive $72 Million Bitcoin ETF Seeding As Two Tickers Appear On DTCC Website On-chain data from IntoTheBlock shows that 47.45% of ADA addresses are currently making a profit. Notably, an interpretation of Martinez&#8217;s technical analysis of Cardano points to this number stalling at least until April. For long-term believers in ADA, the current consolidation is an opportunity to increase their holdings for the next bull run. Cardano still remains one of the most actively developed blockchain ecosystems, and a new report shows that development activity has outpaced that of Ethereum and Avalanche in the past 30 days.  A continuation of this growth coupled with a few other bullish market factors like the potential approval of Spot Bitcoin ETFs in the US could lead to ADA going on a sustained price surge before April. Featured image from The Economic Times, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-10T16:04:00.000Z",
    "title": "BNB Chain Experiences Exponential Growth, Setting New Records in Daily Active Users (DAU) and Total Value Locked (TVL)",
    "url": "https://www.crypto-news-flash.com/bnb-chain-experiences-exponential-growth-setting-new-records-in-daily-active-users-dau-and-total-value-locked-tvl/?utm_source=rss&utm_medium=rss&utm_campaign=bnb-chain-experiences-exponential-growth-setting-new-records-in-daily-active-users-dau-and-total-value-locked-tvl",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Frame_8_1_1704897812crcD1T61QK.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Frame_8_1_1704897812crcD1T61QK.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Frame_8_1_1704897812crcD1T61QK-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Frame_8_1_1704897812crcD1T61QK-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Frame_8_1_1704897812crcD1T61QK-150x90.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Frame_8_1_1704897812crcD1T61QK-450x270.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />DAU, UAE, January 10th, 2024, Chainwire Throughout December 2023, BNB Chain’s L1 BNB Smart Chain (BSC), achieved a milestone with a daily DAU of nearly 1.2 million, representing a 22% increase in growth and its highest monthly average. Simultaneously, BNB Chain’s L2 opBNB experienced a tripling of its daily active users (DAU), reaching almost 260,000 [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-10T16:01:33.000Z",
    "title": "Bitcoin Spot ETF Approval Expected to Trigger News Buying Event, Potentially Pushing Price to $55,000 as Weak Hands Get Shaken Out After Fake SEC Tweet",
    "url": "https://www.crypto-news-flash.com/bitcoin-spot-etf-approval-expected-to-trigger-news-buying-event-potentially-pushing-price-to-55000-as-weak-hands-get-shaken-out-after-fake-sec-tweet/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-spot-etf-approval-expected-to-trigger-news-buying-event-potentially-pushing-price-to-55000-as-weak-hands-get-shaken-out-after-fake-sec-tweet",
    "description": "<img width=\"1600\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-blue-ETF-letters-on-a-digital-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin ETF\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-blue-ETF-letters-on-a-digital-background.jpg 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-blue-ETF-letters-on-a-digital-background-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-blue-ETF-letters-on-a-digital-background-1024x768.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-blue-ETF-letters-on-a-digital-background-768x576.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-blue-ETF-letters-on-a-digital-background-1536x1152.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-blue-ETF-letters-on-a-digital-background-150x113.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-blue-ETF-letters-on-a-digital-background-450x338.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-blue-ETF-letters-on-a-digital-background-1200x900.jpg 1200w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />Several crypto experts have predicted that billions of dollars of inflows could be attracted into the market after the spot ETF approval. Others also believe that the predicted capital inflows are outrageous, and make the ETF a sell-the-news event.  The spot Bitcoin Exchange-Traded Fund (ETF) decision is expected to be made today as investors await [...]"
  }
]