[
  {
    "source": "CoinDesk",
    "date": "2023-08-14T02:01:00.000Z",
    "title": "Disappearance of $900K Puts Focus on Vintage Bitcoin Project Libbitcoin",
    "url": "https://www.coindesk.com/tech/2023/08/14/disappearance-of-900k-puts-focus-on-vintage-bitcoin-project-libbitcoin/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The issue, dubbed “Milk Sad,” was discovered in late July by information security firm Distrust."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-14T01:57:42.000Z",
    "title": "This scenario could spark Gary Gensler’s resignation: Former SEC official",
    "url": "https://cointelegraph.com/news/this-scenario-could-see-sec-gary-gensler-resign",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/b9fb2576-1737-42e0-94f3-b199fc9b575a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>John Reed Stark believes SEC chair Gary Gensler could throw in the towel, depending on a possible scenario to play out in 2024.</p>\n                    <p><p>The United States’ securities regulator could completely u-turn its approach to crypto enforcement, depending on a key election in the United States in 2024, according to former SEC official John Reed Stark.</p><p>In an Aug. 13 <a href=\"https://twitter.com/johnreedstark/status/1690707913789112320?s=46&amp;t=yoL7WJcO9vZ3TjSE2j6FRQ\" target=\"_blank\" rel=\"noopener nofollow\">tweet</a>, the former SEC Office of Internet Enforcement chief predicted that a Republican President could drastically shift the crypto-regulatory tide, including the potential resignation of SEC chief Gary Gensler.</p><p>There are currently a number of Republican candidates in the running. Former-President Donald Trump <a href=\"https://www.nytimes.com/2023/07/31/us/politics/2024-poll-nyt-siena-trump-republicans.html\" target=\"_blank\" rel=\"noopener nofollow\">remains</a> the most popular candidate among Republican voters, followed in a distant second b Florida Governer Ron de Santis and then by South Carolina Senator Tim Scott. </p><p>Should a Republican be elected as President, according to Stark, Gensler would likely be replaced by crypto-friendly Hester Peirce — often referred to as \"Crypto Mom.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Will the SEC Approve Any Of The Recent Bitcoin Spot ETF Applications?<br><br>People often ask for my opinion on whether the SEC will approve any of the recent spate of bitcoin spot ETF applications, which is an interesting and important question.<br><br>My take is that the current SEC will… <a href=\"https://t.co/lPXebl03Y4\">pic.twitter.com/lPXebl03Y4</a></p>&mdash; John Reed Stark (@JohnReedStark) <a href=\"https://twitter.com/JohnReedStark/status/1690707913789112320?ref_src=twsrc%5Etfw\">August 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Stark noted Peirce’s history of dissent and opposition to many of the regulator’s crypto-related enforcement, and explained that if Peirce were to become the head of the SEC:</p><blockquote>“The world should expect that most U.S. SEC crypto-related enforcement and most crypto-related SEC disruption would grind to a screeching halt.”</blockquote><p>Stark also drew attention to the increasing polarization of crypto regulation within the SEC and U.S. politics more broadly. </p><p>When Stark first began writing about crypto in 2017, he said that a diverse scope of politicians held the same viewpoint, with then-President Donald Trump, Secretary Hilary Clinton and Congresswoman Maxine Waters all agreeing that crypto was a “dangerous and horrific plague.”</p><p>Now, crypto has become a far more divisive issue. Republican candidate and Florida Governor Ron de Santis said <a href=\"https://cointelegraph.com/news/ron-desantis-protect-bitcoin-us-presidential-bid\">he plans to “protect” Bitcoin</a> (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and <a href=\"https://cointelegraph.com/news/ron-desantis-vows-to-ban-cdbc-in-the-us\">vowed to ban central bank digital currencies</a> (CBDCs) if elected President. </p><p>On the other side of the fence, Democratic Senator Elizabeth Warren has made <a href=\"https://cointelegraph.com/news/elizabeth-warren-is-pushing-the-senate-to-ban-your-crypto-wallet\">a number of concerted efforts</a> to crack down on all forms of crypto in the country, going as far as <a href=\"https://cointelegraph.com/news/polls-suggest-elizabeth-warren-s-anti-crypto-army-strategy-may-not-pay-off\">forming an “anti-crypto army”</a> as part of Senate re-election campaign.</p><p>Until such a time when a Republican sits in the oval office, Stark said it was unlikely that the regulator would become any more friendly towards crypto, predicting that the SEC will reject the current swathe of spot Bitcoin ETFs for a range of “compelling” reasons.</p><p>Citing an Aug. 8 Better Markets SEC Comment <a href=\"https://bettermarkets.org/wp-content/uploads/2023/08/Better_Markets_Comment_Letter_BitcoinETPs.pdf\" target=\"_blank\" rel=\"noopener nofollow\">letter</a>, Stark shared that spot Bitcoin markets have a history of artificially inflated trading volumes, are highly concentrated within the hands of a few actors and rely on a small group of select entities to maintain the Bitcoin network. This reportedly leaves investors “extremely vulnerable” to manipulation by bad actors.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/4f36b401-3773-4331-b891-daa85ff3e62d.png\"  /><figcaption style=\"text-align: center;\"><em>Better Markets letter to the SEC, recommending a rejection of spot Bitcoin ETF products. Source: Better Markets</em></figcaption></figure><p>Despite a number of industry heavyweights from the world of traditional finance, such as <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-could-unlock-30-trillion-worth-of-wealth-bloomberg-analyst-says\">BlackRock and Fidelity lodging applications</a> for a spot Bitcoin ETF product, Stark believes the SEC will eventually reject all of the outstanding filings. </p><p><a href=\"https://cointelegraph.com/magazine/blockchain-games-decentralized-lattice-starknet-cartridge/\"><strong><em>Magazine:</em></strong></a><strong><em> </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-games-decentralized-lattice-starknet-cartridge/\"><strong><em>Blockchain games aren’t really decentralized… but that’s about to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]