[
  {
    "source": "Decrypt",
    "date": "2023-08-29T19:33:03.000Z",
    "title": "Vertex AI by Google Introduces Invisible Watermarks",
    "url": "https://decrypt.co/154143/vertex-ai-by-google-introduces-invisible-watermarks",
    "description": "The ability to mark AI-generated images is Google's latest enhancement for privacy and security."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-29T19:17:45.000Z",
    "title": "Bitcoin Cash Up 17% After Grayscale Prevails Over SEC in ETF Case",
    "url": "https://decrypt.co/154140/bitcoin-cash-up-after-grayscale-prevails-over-sec-etf-case",
    "description": "Bitcoin is rising—but Bitcoin Cash and Stacks have seen much larger gains as the crypto market reacts to Grayscale's court win."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-29T19:16:40.000Z",
    "title": "Chinese gov’t fires up the printer — How will it impact Bitcoin price?",
    "url": "https://cointelegraph.com/news/china-fires-up-the-printer-how-will-it-impact-bitcoin-price",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/8d75060d-e500-4a4d-8a9e-8f091a1e3cd4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>China enacted a number of economic stimulus initiatives to bolster its stock market but will there be a down the pipeline impact on Bitcoin?</p>\n                    <p><p>News headlines have recently covered how China's struggling economy poses significant risk to global growth. Economic activity and the flow of credit in the region are weakening and analysts are not convinced that the Chinese government’s interventions are a sufficient fix for what appear to be structural problems. </p><p>For instance, industrial output in July increased by 3.7% compared to the previous year, which is slower than June's growth rate of 4.4%. Furthermore, Chinese banks issued 89% fewer new loans in July versus June, the lowest since late 2009.</p><p>Beyond its impact on global economic growth, there's concern among investors that the turmoil in China's real estate market might trigger a ripple effect on the U.S. dollar and commodities. This, in turn, could create an unfavorable scenario for Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>).</p><p>On Aug. 28, the Shanghai Shenzhen CSI 300 Index, a key indicator of the Chinese stock market, initially surged by 5.5% before ultimately closing the day with a 1.2% gain. Despite this improvement, Chinese shares continue to be among the poorest performers globally in equity indexes tracked by Bloomberg.</p><p>Bitcoin traders have valid concerns about potential repercussions from the Chinese stock market's fluctuations. This unease arises from historical price trends and a broader shift in investor sentiment toward avoiding risk-on markets during periods of macroeconomic uncertainty.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/5f87b70a-9bd9-4c21-9132-ac83be78cae3.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin/USD index (purple, left) vs. China CSI 300 index (blue, right). Source: TradingView</em></figcaption></figure><p>As shown in the chart above, Bitcoin price performance tends to align with the overall movement of China’s stock market, although these movements can be predicted or happen with a time lag. In fact, the 30-day correlation between the CSI 300 index and Bitcoin/USD reached an unusually high 70% level on Aug. 28.</p><h2>Can the PROC instill confidence in investors?</h2><p>Interestingly, the recent surge in the stock market appears to be primarily driven by the PROC’s measures <a href=\"https://www.bnnbloomberg.ca/china-stocks-surge-after-new-measures-to-boost-markets-1.1964034\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> on Aug. 72. According to Bloomberg, these measures reportedly included:</p><ul><li>Special refinancing terms to the real estate sector, which should assist the companies in managing challenges and sustaining economic stability. </li><li>Reduced fees that encourage companies to buy back shares, potentially boosting stock prices and investor confidence.</li><li>Selected trading firms lowering leverage margins, making trading with borrowed funds more accessible to investors.</li><li>New stock offerings are expected to face heightened regulatory scrutiny, reducing the competition for the existing companies.</li><li>Limits on selling below the IPO offer price for a specific period to prevent excessive volatility and protect investors from immediate losses.</li></ul><p>However, it quickly became evident that the measures which were initially touted as economic stimulus, lacked the intended effect, according to Ting Lu, Chief China economist at Nomura Holdings. He noted that these measures \"fall short in halting the downward trend and their impact will be short-lived unless accompanied by support for the actual economy.\"</p><p>In addition to the CSI 300 index's substantial 23.8% decline since July, there are clear signs of foreign capital fleeing Chinese stocks. Global funds sold around $1.1 billion worth of shares on Aug. 28 alone, contributing to August's outflows exceeding $11 billion, potentially reaching a record level, as reported by Bloomberg.</p><p>The crucial question revolves around why China isn't implementing effective economic stimulus packages. The answer may lie in the country's currency value. The Yuan's value against the US dollar has been consistently dropping, as depicted by the Yuan price chart. This trend is concerning as it indicates the currency reaching historically low levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/7ffd376b-9997-45ee-bc41-12d20f1510c5.png\"  /><figcaption style=\"text-align: center;\"><em>Chinese Yuan / US dollar. Source: TradingView</em></figcaption></figure><p>Despite incentives like tax breaks, government bond buybacks, and monetary distributions to the population, which can lead to increased money circulation and mounting debt, there's a negative impact on the purchasing power of the Yuan. The situation is complex and lacks an easy solution, possibly resulting in China experiencing significantly slower economic growth.</p><h2>A strong U.S. dollar is bad news for Bitcoin’s price</h2><p>Interestingly, the primary beneficiary of the outflow from the Chinese stock market seems to be the U.S. stock market, ultimately strengthening the US dollar. As capital flows away from Chinese equities, it tends to weaken the local currency as investors seek lower-risk options like the S&amp;P 500 index or U.S. money market funds.</p><p>Unfortunately, this scenario could present a challenge for Bitcoin, considering it's priced in dollars and competes as an alternative store of value. For those anticipating a cryptocurrency rally due to a global economic downturn, it's important to note that the U.S. dollar doesn't need to be flawless; it only needs to outperform other competing fiat currencies.</p><p>Still, market dynamics can swiftly transform once investors recognize the potential overvaluation of the U.S. stock market, or when indications of a looming moderate recession in the U.S. emerge, irrespective of the relative strength of the U.S. dollar against its counterparts. Consequently, the value of Bitcoin as an independent and alternative hedge remains valid regardless of being presently unable to reclaim the $29,000 support.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-29T19:10:29.000Z",
    "title": "USDC will launch natively on Base network 'next week' — Jeremy Allaire",
    "url": "https://cointelegraph.com/news/circle-usdc-will-launch-natively-base-next-week-jeremy-allaire",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/c7385d69-4763-435d-9886-ea66465a10f3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Circle announced that a Base version of its USDC stablecoin would be available soon, eventually eliminating the need for the USDbC bridged version.</p>\n                    <p><p>Circle’s United States dollar stablecoin, USDC, will launch natively on the Base network “next week,” according to an Aug. 29 social media post from CEO Jeremy Allaire. The new version will replace the current US Dollar Base Coin (USDbC) that most users rely on as a substitute.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Native <a href=\"https://twitter.com/search?q=%24USDC&src=ctag&ref_src=twsrc%5Etfw\">$USDC</a> on <a href=\"https://twitter.com/BuildOnBase?ref_src=twsrc%5Etfw\">@BuildOnBase</a>.  Coming next week.  <a href=\"https://twitter.com/hashtag/StableSeptember?src=hash&ref_src=twsrc%5Etfw\">#StableSeptember</a>.  Let's go! <a href=\"https://t.co/oqfI0ZZhCn\">https://t.co/oqfI0ZZhCn</a></p>— Jeremy Allaire (@jerallaire) <a href=\"https://twitter.com/jerallaire/status/1696549654605738016?ref_src=twsrc%5Etfw\">August 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Coinbase’s Base network <a href=\"https://cointelegraph.com/news/coinbase-base-network-officially-launched-heres-how-it-can-be-used\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/coinbase-base-network-officially-launched-heres-how-it-can-be-used/amp\">launched on Aug. 9</a>. At the time, no native version of USDC existed on the network. Users could not deposit cash into a Circle account and receive equivalent USDC on Base. To solve this problem, the Base team allowed users to bridge USDC from Ethereum via an official bridge app. The token issued by the bridge is called “USDbC,” and is backed by native USDC locked on the Ethereum network. </p><p>The Aug. 29 announcement states that Circle will soon begin issuing USDC on Base, eventually doing away with the need for a bridged coin backed by the Ethereum version.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/base-dex-rocketswap-announces-emergency-plan-after-exploit\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/base-dex-rocketswap-announces-emergency-plan-after-exploit/amp\"><strong>Base project RocketSwap shares emergency plan following $865K exploit</strong></a></em></p><p>According to an accompanying blog post, the contract for the new token has already been deployed to Base. On launch day, the team will explain how the current USDbC can be <a href=\"https://www.circle.com/blog/need-to-know-native-usdc-on-base\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://www-circle-com.cdn.ampproject.org/c/s/www.circle.com/blog/need-to-know-native-usdc-on-base?hs_amp=true\">redeemed</a> for native USDC. The team will also “work with ecosystem apps” to allow liquidity providers to “smoothly transition” to providing liquidity for the new coin, and the current Base bridge that issues USDbC will continue to operate normally for the time being.</p><p>The Circle team has not announced a specific date for the coin’s official launch, as Allaire stated only that it will happen sometime “next week.”</p><p>Base network <a href=\"https://cointelegraph.com/news/coinbase-base-daily-active-users-reaches-high\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/coinbase-base-daily-active-users-reaches-high/amp\">gained over 136,000 active users</a> on Aug. 10, the day after its launch. On August 25, Base announced it would <a href=\"https://cointelegraph.com/news/base-optimism-unveil-shared-governance-revenue-sharing-framework\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/base-optimism-unveil-shared-governance-revenue-sharing-framework/amp\">share its revenue and partly govern</a> the upcoming “Superchain” consisting of Base, Optimism, and other networks.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-29T19:10:38.000Z",
    "title": "SEC’s sealed motion against Binance could be related to DOJ charges: Former SEC official",
    "url": "https://cryptoslate.com/secs-sealed-motion-against-binance-could-be-related-to-doj-charges-former-sec-official/",
    "description": "<p>The U.S. Securities Exchange Commission (SEC) submitted a sealed and potentially high-impact court filing in its case against Binance on Aug. 29. The filing in question represents the SEC&#8217;s sealed motion to leave to file a document under seal. It also includes 36 attachments, including statements from SEC lawyers Jennifer Farer and Matthew Scarlato. Though [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/secs-sealed-motion-against-binance-could-be-related-to-doj-charges-former-sec-official/\">SEC’s sealed motion against Binance could be related to DOJ charges: Former SEC official</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-29T19:31:08.000Z",
    "title": "Solana Ecosystem Collapse? Clockwork Next Project to Shut Down",
    "url": "https://cryptobriefing.com/solana-ecosystem-collapse-clockwork-next-project-to-shut-down/?utm_source=feed&utm_medium=rss",
    "description": "Clockwork, an automation network for Solana smart contracts, has announced it will cease development at the end of October."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-29T19:34:36.000Z",
    "title": "Bitcoin Exchanges Record Lowest BTC Supply in Six Years, Indicating Strong Hodling",
    "url": "https://www.crypto-news-flash.com/bitcoin-exchanges-record-lowest-btc-supply-in-six-years-indicating-strong-hodling/",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/stock-exchange-7036661_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/stock-exchange-7036661_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/stock-exchange-7036661_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/stock-exchange-7036661_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/stock-exchange-7036661_1920-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />According to recent on-chain data, the current supply of Bitcoin on exchanges have declined to newer levels.  The new week looks promising for Bitcoin, as the apex cryptocurrency clears weekly losses, and heads towards the $26,000 price levels.  As market experts had previously predicted, Bitcoin’s supply has continued to dwindle. Newly obtained market metrics have [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-29T19:28:00.000Z",
    "title": "Cardano Holders Stake $40M Worth of ADA Following Price Decline",
    "url": "https://coinedition.com/cardano-holders-stake-40m-worth-of-ada-following-price-decline/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Cardano-Founder-Says-Cardano-Staking-Method-Better-Than-Ethereum.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano Holders Stake $40M Worth of ADA Following Price Decline\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Cardano-Founder-Says-Cardano-Staking-Method-Better-Than-Ethereum.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Cardano-Founder-Says-Cardano-Staking-Method-Better-Than-Ethereum-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Cardano-Founder-Says-Cardano-Staking-Method-Better-Than-Ethereum-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Cardano-Founder-Says-Cardano-Staking-Method-Better-Than-Ethereum-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Cardano-Founder-Says-Cardano-Staking-Method-Better-Than-Ethereum-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Cardano users have staked more than 157 million ADA over the past week. The surge in staking activity came after a decline of more than 5% in the world’s seventh-largest cryptocurrency by market capitalization. On-chain data shows that Cardano holders have staked a whopping $40.8 million worth of ADA since August 21, 2023. According to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/cardano-holders-stake-40m-worth-of-ada-following-price-decline/\">Cardano Holders Stake $40M Worth of ADA Following Price Decline</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]