[
  {
    "source": "CoinDesk",
    "date": "2023-12-26T06:56:49.000Z",
    "title": "Bitcoin's Share in Crypto Futures Trading Slides as Altcoin Profits Allure Traders",
    "url": "https://www.coindesk.com/markets/2023/12/26/bitcoin-futures-open-interest-slides-as-altcoin-profits-allure-traders/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bitcoin's dominance by futures open interest has declined to 38% from nearly 50% two months ago."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-12-26T06:59:40.000Z",
    "title": "Bitcoin Mining Power Hits Record, Squeezing Miner Profits Amid Market Rally",
    "url": "https://www.cryptoglobe.com/latest/2023/12/bitcoin-mining-power-hits-record-squeezing-miner-profits-amid-market-rally/",
    "description": "The Bitcoin network’s mining power, known as the hash rate, reached a new peak on Christmas Day, intensifying challenges for miners amid decreasing profitability. On December 25, the hash rate hit 544 exahashes per second (EH/s), marking a 130% growth since the start of the year. Meanwhile, Bitcoin’s price has surged by over 160% since […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T07:03:02.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 How much is Bitcoin (BTC) worth? Today, the price of Bitcoin stands at $42,815, with a trading volume over the past 24 hours reaching $24 billion. Its market capitalization is $843 billion, and it currently commands 54% of the market share. Over the last 24 hours, the BTC price has experienced [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T06:55:00.000Z",
    "title": "ChatGPT Composes Melodies on Raspberry Pi Pico Synthesizer",
    "url": "https://www.cryptopolitan.com/chatgpt-composes-melodies/",
    "description": "ChatGPT, the versatile language model, is venturing into musical composition in a remarkable fusion of artificial intelligence and music. A collaborative project led by Filipe dos Santos Branco and Edward Gu has taken the capabilities of ChatGPT beyond its traditional text-based applications. The initiative revolves around generating 10-note melodies using ChatGPT&#8217;s language-processing prowess and translating [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-26T07:04:35.000Z",
    "title": "Mt. Gox creditors finally getting paid after 10 years",
    "url": "https://crypto.news/mt-gox-creditors-finally-getting-paid-after-10-years/",
    "description": "Creditors of long-failed cryptocurrency exchange Mt. Gox have finally started receiving payments for their Bitcoin (BTC), which has been locked up on the exchange since February 2014. On Dec. 25, on the mtgoxinsolvency Reddit page, users speculated that Mt.Gox was&#8230;"
  }
]