[
  {
    "source": "Decrypt",
    "date": "2023-10-06T18:04:23.000Z",
    "title": "You Can Play 'Call of Duty: Modern Warfare III' Now—Here's How",
    "url": "https://decrypt.co/200458/play-call-duty-modern-warfare-3-now-open-beta-early-access",
    "description": "The Modern Warfare III beta is live in early access. Here's how to start playing the next Call of Duty and when it hits certain platforms."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-06T17:54:49.000Z",
    "title": "3 reasons why Solana (SOL) price is up this week",
    "url": "https://cointelegraph.com/news/3-reasons-why-solana-sol-is-up-this-week",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/8b744d11-45be-4bbc-9c2e-c1185f1ea7d0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Solana price staged a double-digit recovery since September and a portion of the move was caused by improving fundamentals.</p>\n                    <p><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) price experienced a 20% gain between Sept. 28 and Oct. 6, but is the rally a tandem move with Bitcoin (BTC) price or is it being driven by other factors. Prior to the price breakout, or perhaps, it’s recovery, SOL faced a turbulent period after a U.S. court approved the <a href=\"https://cointelegraph.com/news/ftx-crypto-liquidation-crypto-markets-solana-price\">sale of $1.3 billion in SOL </a>from the bankrupt exchange FTX.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/ca159cb1-4c57-4f94-b9f3-29db76b85722.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Solana daily price index, USD. Source: TradingView</em></figcaption></figure><p>The bankruptcy court has taken measures to ensure that the liquidation of FTX assets won't become a burden for the crypto market, demanding the sale to occur through an investment adviser in weekly batches in accordance with pre-established rules.</p><p>Following the initial impact, which drove Solana's price down to a 2-month low of $17.34 on Sept. 11, some degree of confidence among bulls emerged as it re-established the $20 support on Sept. 29. This movement coincided with a successful upgrade to version 1.16, boosting the SOL token by 16% over the next 7 days.</p><p>Solana's rally was also supported by growth in decentralized applications (Dapps) usage and increased nonfungible token (NFT) volumes. Solana's price is now attempting to establish a $23 support and consolidate its position as the fifth-largest cryptocurrency (excluding stablecoins) by market capitalization, surpassing Cardano's $9.22 billion.</p><h2>Solana’s DApp and NFT market activity surges </h2><p>When analyzing networks focused on Dapp execution, the number of active users should be a top priority. Therefore, one should begin by quantifying the addresses involved with smart contracts, which serve as a proxy for the number of users.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/f6cb8773-f698-44d7-b1ca-dcd75ec5f4b4.png\"  /><figcaption style=\"text-align: center;\"><em>Solana Dapps active addresses, 7-days. Source: DappRadar</em></figcaption></figure><p>Notice that the increase in activity was consistent across all sectors, including NFT marketplaces, decentralized finance (DeFi), collectibles, social, and gaming. Furthermore, Solana's active addresses engaging with Dapps exceeded those of Ethereum in the same period, which were capped at 55,230.</p><p>Solana has been gaining traction in the NFT market due to its cost-efficient and scalable solution, as <a href=\"https://cointelegraph.com/news/magic-eden-integrates-solana-compressed-nfts-into-marketplace\">data is compressed and stored off-chain</a>. This allows for more viable production in larger quantities, as they require lower minting fees, enabling creators to reach wider audiences.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/b9ef79a6-89c5-4539-a296-fe65f8eed3c5.png\"  /><figcaption style=\"text-align: center;\"><em>NFT sales per blockchain, 7-days. Source: Cryptoslam</em></figcaption></figure><p>Over the past 7 days, the Solana network surpassed Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) in NFT sales, accumulating $6.8 million in value according to Cryptoslam. In September, the situation was reversed, with Solana totaling $23.9 million, while the Polygon network achieved $31 million in NFT sales.</p><h2>Network upgrade enhances privacy and eases the stress on validators</h2><p>A potential driver behind Solana's recent 20% price gains was the network upgrade to version 1.16 on Sept. 28, which introduced a \"gate system\" to ensure the gradual activation of new features on the network. This process helps maintain network stability and prevents issues caused by sudden changes.</p><p>Another notable change in this update is \"confidential transfers,\" which use zero-knowledge proofs to encrypt transaction details, enhancing user privacy. The release also includes improvements in RAM usage for validators, resizable data accounts, and a mechanism to identify corrupted data.</p><p>Overall, this update brings improved efficiency, privacy, and security to the Solana blockchain, marking a significant milestone in its development.</p><h2>Stiff competition from Ethereum layer-2 solutions</h2><p>Despite Solana's competition with other blockchain networks, there is no doubt that Ethereum layer-2 solutions have gained more traction in terms of total value locked (TVL) and activity. For instance, Arbitrum holds $1.73 billion in TVL, and Optimism holds another $637 million, both vastly superior to Solana's $326 million, according to DeFiLlama.</p><p>Even as Solana continues to make progress in terms of privacy, scaling, and security, external factors are at play beyond the FTX bankruptcy drama, making the $23 resistance harder to breach than anticipated. </p><p>Ultimately, investors remain largely focused on the Ethereum ecosystem, as it remains the leader in terms of developers and consolidated decentralized applications.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-06T17:40:55.000Z",
    "title": "Markets rally on strong U.S. jobs report",
    "url": "https://cryptoslate.com/markets-rally-after-strong-u-s-jobs-report/",
    "description": "<p>A stronger-than-expected jobs report from the U.S. Bureau of Labor Statistics has buoyed markets going into the weekend. In September, the US nonfarm payroll employment increased by 336,000, which defied expectations and led to a surge in stock markets and Treasury yields, according to a report from the U.S. Bureau of Labor Statistics. The unemployment [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/markets-rally-after-strong-u-s-jobs-report/\">Markets rally on strong U.S. jobs report</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-06T17:51:34.000Z",
    "title": "Researchers Rally for the Return of Meta’s Galactica",
    "url": "https://www.cryptopolitan.com/researchers-rally-for-return-of-galactica/",
    "description": "In the ever-evolving realm of artificial intelligence, last year witnessed the launch of a promising large language model (LLM) by Meta, named Galactica. This model, boasting capabilities such as summarizing academic papers, solving mathematical problems, generating Wikipedia articles, writing scientific code, and annotating molecules and proteins, was introduced even before the renowned ChatGPT. However, unlike ... <a title=\"Researchers Rally for the Return of Meta&#8217;s Galactica\" class=\"read-more\" href=\"https://www.cryptopolitan.com/researchers-rally-for-return-of-galactica/\" aria-label=\"More on Researchers Rally for the Return of Meta&#8217;s Galactica\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-06T17:46:36.000Z",
    "title": "Kambi’s Innovative Sportsbook Solutions and Growth Trajectory at G2E",
    "url": "https://www.cryptopolitan.com/kambis-innovative-sportsbook-at-g2e/",
    "description": "In an exclusive interview with Focus Gaming News, David Bretnitz, Kambi&#8217;s Senior Director of Sales, shared insights into the company&#8217;s preparations ahead of the Global Gaming Expo (G2E) in Las Vegas. Bretnitz discussed Kambi&#8217;s cutting-edge sportsbook solutions, its unique position in the industry, recent awards, and the transformative impact of AI-driven trading. As G2E approaches, ... <a title=\"Kambi&#8217;s Innovative Sportsbook Solutions and Growth Trajectory at G2E\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kambis-innovative-sportsbook-at-g2e/\" aria-label=\"More on Kambi&#8217;s Innovative Sportsbook Solutions and Growth Trajectory at G2E\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-06T18:00:50.000Z",
    "title": "Bitcoin News: Here Is When BTC Could Revisit $20,000 One Last Time, Analyst Says",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-news-here-is-when-btc-could-revisit-20000-one-last-time-analyst-says/",
    "description": "Based on several factors, the latest Bitcoin news points to a potential bullish continuation in the long term. However, the short term remains uncertain; the cryptocurrency continues to trade in a tight range, although BTC has shown a spike in volatility. Related Reading: Bitcoin Price Is Showing Early Signs of Fresh Drop, $27,200 Is The Key As of this writing, the Bitcoin price trades at $25,500 with a 2% loss in the last 24 hours. In the previous seven days, the cryptocurrency maintained some of its profits as most of the tokens in the top 10 by market cap traded in the red after experiencing a slight uptick. Bitcoin News: BTC At Risk Of Topping For Remaining Of The Year The bigger picture for Bitcoin leans to the upside with the approval of a BTC spot Exchange Traded Fund (ETF) in the US gaining momentum. However, analyst Rekt Capital believes current prices are similar to those in late 2019 and early 2020. As the chart below shows, at that time, the price of Bitcoin was trending to the upside in a tight triangle with a top at around $10,000. The cryptocurrency eventually broke about this resistance and entered uncharted territory. As the chart shows, this scenario has some obstacles for optimistic investors. Before the breakout, the price of Bitcoin revisited the lows and event wicked below critical support at $3,250. The analyst believes that BTC could display similar price action as it approaches the top of its current channel. In this scenario, which aligns with BTC’s pre-halving behavior, the cryptocurrency could re-visit the low of the trend. As a result, a return to $20,000 and even the $15,000 lows seems likely. The analyst stated: Here&#8217;s the thing about current prices. Right now, there&#8217;s a risk of them representing the Top for 2023. But after the Halving, these same exact prices will represent a Re-Accumulation range (red) before lift-off into a Parabolic Uptrend (green). Still Hope For BTC Price Bulls As mentioned, this scenario could hint at short-term losses for BTC, but the analyst shared other Bitcoin news in a more positive tone. First, Rekt Capital believes that the next 6 months into the Bitcoin halving could provide the “last ever retrace” to the $20,000 lows. Related Reading: Bitcoin And Crypto Under The Lens As Bond Market Recalls 2008 Crash As the market approaches this event, the price of Bitcoin is more likely to trend upwards, with a “stronger” beat back to previous highs and potentially into uncharted territory. The analyst concluded: Next ~6 months may offer the last ever retrace to low $20,000s (orange) And 2 months Pre-Halving, we&#8217;ll likely see some stronger upside volatility (light blue) Lots of volatility to both the downside &#38; upside await between now and the Halving. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-06T18:05:55.000Z",
    "title": "Bitcoin to $120,000? Glassnode Co-Founders Say One Indicator Is Flashing a ‘Ready-To-Fly’ Signal",
    "url": "https://dailyhodl.com/2023/10/06/bitcoin-to-120000-glassnode-co-founders-say-one-indicator-is-flashing-a-ready-to-fly-signal/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/btc-flying-off.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/btc-flying-off.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/btc-flying-off.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/btc-flying-off.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/btc-flying-off.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/btc-flying-off.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/btc-flying-off.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The co-founders of the crypto analytics firm Glassnode believe that Bitcoin (BTC) could soar into six figures early next year. Glassnode co-founders Jan Happel and Yann Allemann, who share the handle Negentropic on the social media platform X, say that the king crypto appears ready to greatly outperform gold on a rally toward $120,000. “Will BTC [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/06/bitcoin-to-120000-glassnode-co-founders-say-one-indicator-is-flashing-a-ready-to-fly-signal/\">Bitcoin to $120,000? Glassnode Co-Founders Say One Indicator Is Flashing a ‘Ready-To-Fly’ Signal</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]