[
  {
    "source": "CryptoSlate",
    "date": "2023-12-25T22:00:05.000Z",
    "title": "Political donations from crypto industry surge ahead of 2024 elections",
    "url": "https://cryptoslate.com/political-donations-from-crypto-industry-surge-ahead-of-2024-elections/",
    "description": "<p>The cryptocurrency industry has significantly increased its political donations in response to growing regulatory challenges and skepticism in Washington, the Financial Times reported. The strategy highlights an escalation in the crypto sector&#8217;s engagement with political processes in an effort to shape the narrative and policies surrounding digital assets. Pro-crypto legislation Key players in the cryptocurrency [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/political-donations-from-crypto-industry-surge-ahead-of-2024-elections/\">Political donations from crypto industry surge ahead of 2024 elections</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-25T21:50:20.000Z",
    "title": "TrueUSD and MooreHK partner for enhanced stablecoin transparency",
    "url": "https://www.cryptopolitan.com/trueusd-and-moorehk-partner/",
    "description": "TrueUSD (TUSD), a leading stablecoin, has partnered strategically with Moore Hong Kong (MooreHK), a renowned accounting firm. This collaboration is set to begin in January 2024, marking a significant step in TUSD&#8217;s commitment to transparency and trust within the industry. MooreHK boosts TrueUSD&#8217;s global transparency efforts Starting January 2024, MooreHK will conduct daily attestations for [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-25T22:00:46.000Z",
    "title": "VeChain Skyrockets By 77% To Reach New Yearly High, Analyst Bullish On VET Targeting $1.6",
    "url": "https://www.newsbtc.com/news/vechain-skyrockets-by-77-to-reach-new-yearly-high-analyst-bullish-on-vet-targeting-1-6/",
    "description": "In a remarkable display of bullish movement, the smart contract blockchain VeChain,  and its native token VET have emerged as significant players in the altcoin rally, experiencing an impressive surge of 77% since the end of November. Over the past seven days, VET has recorded a substantial 33.5% increase, with an additional 5.4% surge in the past 24 hours, propelling the token to reach a new yearly high of $0.03806, a level unseen since May 2022. This surge in VET&#8217;s value has generated substantial excitement among crypto analysts, who predict promising days and months for the token, noting a clear bullish momentum across various time frames.  VeChain Potential Breakthrough  Rekt Capital, a renowned crypto analyst, highlights the progress VeChain has made in closing the &#8220;Volume Gap&#8221; between $0.01728 and $0.02694.  Rekt Capital suggests that VeChain is now primed to test the resistance wall between $0.0500 and $0.0600. This analysis indicates that VeChain&#8217;s momentum is strong and positions the token for potential further growth. Related Reading: Why Did The XRP Price Surge To $0.64 Today? However, while the bullish prospects for VET appear promising, significant resistance lines must be overcome to achieve further gains.  In the event of a continuation of the VET rally above $0.0600, the token will face resistance walls at $0.06170 and $0.06450 before reaching the $0.0700 level on its path towards the coveted $1 mark. VET’s Potential Surge To $1.6 Based On Historical Patterns In addition to Rekt Capital&#8217;s analysis, Egrag Crypto, another respected crypto analyst, offers an optimistic outlook for VeChain&#8217;s future.  Egrag Crypto believes that VeChain has the potential to reach an impressive target of $1.6. To support this projection, Egrag Crypto examines VeChain&#8217;s previous price movements and identifies patterns that indicate the potential for significant growth.  By analyzing a similar move &#8216;A&#8217; from VeChain&#8217;s launch point at around $0.90, which resulted in a threefold increase from the previous all-time high, Egrag Crypto suggests that VeChain could replicate a similar move, leading to a surge towards the $1.6 mark or even Fib 1.618. Egrag Crypto&#8217;s analysis aligns with VeChain&#8217;s historical performance and reinforces the notion that the token has the potential for substantial growth.  With VeChain&#8217;s previous all-time high standing at $0.27, achieving the projected $1.6 mark would require a relatively modest 6X surge. Egrag Crypto&#8217;s analysis suggests that VeChain could easily experience a 50X to 100X climb from its bottom, presenting an enticing opportunity for investors and traders. Related Reading: Shiba Inu Climbs 12% On Christmas Day – Brewing Bull Run Or False Dawn? The future trajectory of VET&#8217;s uptrend remains uncertain, as it faces the possibility of a correction. The potential risk lies in gainers selling off their tokens, which could jeopardize the bullish momentum of the token.  However, the analyses provided by both Egrag and Rekt indicate that VET is well-positioned to reach and even surpass its previous all-time high. Featured image from Shutterstock, chart from TradingView.com"
  }
]