[
  {
    "source": "CryptoSlate",
    "date": "2023-12-06T15:45:08.000Z",
    "title": "North Korea’s Lazarus Group escalates crypto attacks via Telegram phishing",
    "url": "https://cryptoslate.com/north-koreas-lazarus-groups-escalates-crypto-attacks-via-telegram-phishing/",
    "description": "<p>North Korea-backed hackers Lazarus Group are increasingly targeting the cryptocurrency community through widespread phishing operations on the popular messaging application Telegram, according to a Dec. 6 update from blockchain security firm SlowMist. The group&#8217;s new modus operandi involves impersonating reputable venture capital investment figures from Archax, HashKey, and Gumi Cryptos to lure crypto teams with [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/north-koreas-lazarus-groups-escalates-crypto-attacks-via-telegram-phishing/\">North Korea&#8217;s Lazarus Group escalates crypto attacks via Telegram phishing</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-06T16:02:13.000Z",
    "title": "Market Correction Incoming? Why Solana (SOL), Avalanche (AVAX) and Polkadot (DOT) Holders Should Be Worried",
    "url": "https://cryptodaily.co.uk/2023/12/market-correction-incoming-why-solana-sol-avalanche-avax-and-polkadot-dot-holders-should-be-worried",
    "description": "Explore the potential market correction risks for Solana (SOL), Avalanche (AVAX), and Polkadot (DOT) investors. This insightful article delves into the latest trends, market analyses, and factors influencing these popular cryptocurrencies. Stay informed about the volatility and future prospects of SOL, AVAX, and DOT"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-06T16:00:10.000Z",
    "title": "Comparing Peaks: Bitcoin Hits 20-Month High, Other Cryptos Still Strive for Past Glories",
    "url": "https://news.bitcoin.com/comparing-peaks-bitcoin-hits-20-month-high-other-cryptos-still-strive-for-past-glories/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/peaks-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Comparing Peaks: Bitcoin Hits 19-Month High, Other Cryptos Still Strive for Past Glories\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/peaks-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/peaks-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/peaks-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/peaks-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/peaks-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/peaks-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/peaks.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />As bitcoin&#x2019;s value soared to heights last witnessed on April 6, 2022, a multitude of crypto assets have also reaped benefits from the surge of the premier cryptocurrency. Yet, despite a significant number of these digital currencies experiencing substantial increases, surpassing even bitcoin in percentage gains, they have yet to approach the peak values achieved [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-06T16:03:52.000Z",
    "title": "DODO Decentralized Exchange Improves Trading with Dynamic Slippage Feature",
    "url": "https://www.cryptopolitan.com/dodo-decentralized-trading-dynamic-slippage/",
    "description": "In the world of decentralized finance (DeFi), DODO, a prominent decentralized exchange platform, has unveiled its latest innovation: a dynamic slippage feature. The feature is set to significantly enhance the trading experience by providing more accurate slippage predictions, thereby reducing the likelihood of failed transactions and vulnerability to Miner Extractable Value (MEV) attacks. The advancement ... <a title=\"DODO Decentralized Exchange Improves Trading with Dynamic Slippage Feature\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dodo-decentralized-trading-dynamic-slippage/\" aria-label=\"More on DODO Decentralized Exchange Improves Trading with Dynamic Slippage Feature\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-06T16:02:57.000Z",
    "title": "AI Chatbots Have Made Customer Service Worse",
    "url": "https://www.cryptopolitan.com/ai-chatbots-have-made-customer-service-worse/",
    "description": "AI chatbots have become increasingly popular for customer service interactions, with many businesses scrambling just to fit into the narrative and AI trend. However, the rush has resulted in several overlooked limitations that have soiled the customer service experience of users.&#160; In a survey conducted by Infobip, a global cloud communications platform, about 40.4% of ... <a title=\"AI Chatbots Have Made Customer Service Worse\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-chatbots-have-made-customer-service-worse/\" aria-label=\"More on AI Chatbots Have Made Customer Service Worse\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-06T15:53:45.000Z",
    "title": "Cosmos Breaks New Ground with CometBFT V1 Alpha Release",
    "url": "https://www.cryptopolitan.com/cosmos-with-cometbft-v1-alpha-release/",
    "description": "Cosmos, a leading name in the industry, has unveiled the CometBFT V1 Alpha version. The release marks a major milestone in the Cosmos project, introducing a suite of advanced features designed to enhance the overall functionality and efficiency of the network. The CometBFT V1 Alpha is a testament to Cosmos&#8217; commitment to innovation and its ... <a title=\"Cosmos Breaks New Ground with CometBFT V1 Alpha Release\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-with-cometbft-v1-alpha-release/\" aria-label=\"More on Cosmos Breaks New Ground with CometBFT V1 Alpha Release\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-06T15:45:05.000Z",
    "title": "Orderly Network Unveils Orderly Omnichain SDK",
    "url": "https://www.cryptopolitan.com/orderly-network-unveil-orderly-omnichain-sdk/",
    "description": "The Orderly Network, a key player within the NEAR ecosystem, has recently announced the launch of its innovative Orderly Omnichain SDK. The software development kit is poised to revolutionize how developers integrate various functionalities into their applications, particularly in the realm of decentralized trading protocols. Orderly transforming cross-chain interactions The Orderly Omnichain SDK stands as ... <a title=\"Orderly Network Unveils Orderly Omnichain SDK\" class=\"read-more\" href=\"https://www.cryptopolitan.com/orderly-network-unveil-orderly-omnichain-sdk/\" aria-label=\"More on Orderly Network Unveils Orderly Omnichain SDK\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-06T15:59:07.000Z",
    "title": "Shiba Inu soars 21% in a week, becomes 18th largest cryptocurrency by market cap",
    "url": "https://crypto.news/shiba-inu-soars-21-in-a-week-becomes-18th-largest-cryptocurrency/",
    "description": "Shiba Inu (SHIB), the second largest memecoin, is now the 18th largest cryptocurrency based on market cap, climbing ahead of Litecoin and Dai with its massive 21% growth since last week. "
  },
  {
    "source": "BTCManager",
    "date": "2023-12-06T15:47:20.000Z",
    "title": "Do Kwon appeals extradition decision from Montenegrin high court",
    "url": "https://crypto.news/do-kwon-appeals-extradition-decision-from-montenegrin-high-court/",
    "description": "Do Kwon, founder of Terraform Labs, is fighting a court order mandating his extradition to either South Korea or the U.S. for criminal prosecution."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-06T16:00:50.000Z",
    "title": "Tether (USDT) Cap Approaches $90 Billion: Why This Affects Bitcoin",
    "url": "https://www.newsbtc.com/bitcoin-news/tether-usdt-cap-90-billion-why-affects-bitcoin/",
    "description": "Data shows that the Tether (USDT) market cap is almost $90 billion. Here&#8217;s why this growth could matter for the price of Bitcoin. Tether Market Cap Has Continued To Observe A Rise Recently Tether is a cryptocurrency pegged to the US Dollar, meaning its price remains stable around the $1 mark. The asset is the most famous such &#8220;stablecoin&#8221; in the sector, with its market cap outstripping any other stable&#8217;s. As the market intelligence platform IntoTheBlock pointed out, the largest stablecoin supply has only continued to grow recently. The chart below shows the trend in the market caps of the various stablecoins in the cryptocurrency sector over the past year. Looks like the metric has been growing for USDT in recent days &#124; Source: IntoTheBlock on X As displayed in the above graph, Tether has observed an overall uptrend during the past year, while USD Coin (USDC), the next largest competitor, has observed outflows as its market cap has fallen. Related Reading: Sleeping Bitcoin Giants Wake Up: Pattern Mirrors 2021 Bull Run The chart also puts into perspective how small the other stables are when compared to these two assets, making them perhaps insignificant for the wider market. What relevance does a large stablecoin like Tether have for Bitcoin and other coins in the sector? The answer to that question lies in what the stablecoins represent. Generally, investors make use of stables whenever they want to avoid the volatility associated with the other assets in the sector. The holders keeping their capital locked in these fiat-tied tokens usually plan to return towards the volatile side, however, as they would have gone for fiat itself if they wanted to keep away from cryptocurrency altogether. When such investors finally move back towards coins like Bitcoin, they naturally put buying pressure on their prices. For this reason, the supply of stablecoins could be considered the &#8220;potential buying supply&#8221; for BTC and others. There are two ways the USDT market cap grows. The first is an influx of fresh capital directly going to the asset, which is naturally a bullish development as it means the total capital in the sector goes up. The second is through a swap from another coin like Bitcoin. In this case, the overall capital present in the sector wouldn&#8217;t change, as it&#8217;s just a reshuffling, but whatever asset is being sold in favor of the stablecoin would naturally see some decline. Related Reading: Analyst Says Solana At Risk Of Pullback: Here Is The Target The most bullish scenario for the market is, therefore, when both the BTC price and Tether market cap head up, as it implies, a fresh influx of capital is happening towards both the coins. As analyst James V. Straten explained in a post on X, the correlation between the USDT market cap and BTC has almost hit 100% during this latest rally, as both have shot up. The value of the metric seems to have been high recently &#124; Source: @jimmyvs24 on X The USDT market cap continuing to grow in these circumstances is certainly an optimistic sign for the current rally, as it means that all this dry powder that&#8217;s accumulating could potentially be deployed into Bitcoin should the surge slow down, helping extend the move further. BTC Price Bitcoin had breached the $44,000 mark earlier in the past day, but the asset has since seen some pullback as it&#8217;s now back around $43,800. BTC has continued to observe a strong surge during the past day &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Glassnode.com, IntoTheBlock.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-06T16:04:26.000Z",
    "title": "After a Spate of Incidents, the Future of Trading Bots is Decentralized and Self-Custodial",
    "url": "https://www.crypto-news-flash.com/after-a-spate-of-incidents-the-future-of-trading-bots-is-decentralized-and-self-custodial/?utm_source=rss&utm_medium=rss&utm_campaign=after-a-spate-of-incidents-the-future-of-trading-bots-is-decentralized-and-self-custodial",
    "description": "<img width=\"512\" height=\"307\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-30.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-30.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-30-300x180.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-30-336x200.png 336w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Trading bots have become a must-have for many cryptocurrency traders. However, following a spate of recent incidents where hackers and thieves have targeted popular bot apps, the industry needs to up its security game. Can decentralized, non-custodial trading bots like ApeX’s Telegram Bot help to restore trust? Automated trading has become increasingly popular among traders [...]"
  }
]