[
  {
    "source": "CryptoSlate",
    "date": "2023-06-29T13:55:45.000Z",
    "title": "North Carolina passes bill to explore holding crypto in state treasury",
    "url": "https://cryptoslate.com/north-carolina-passes-bill-to-explore-holding-crypto-in-state-treasury/",
    "description": "<p>North Carolina House Bill 721 has been passed to explore the benefits and implications of holding cryptocurrencies and precious metals in the state treasury. The bill was introduced on Apr. 18, passing the House on Jun. 28 after the third reading, with 73 in favor, 40 against, and seven absent. Section 1 of the bill [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/north-carolina-passes-bill-to-explore-holding-crypto-in-state-treasury/\">North Carolina passes bill to explore holding crypto in state treasury</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-29T13:43:06.000Z",
    "title": "Gold slides below $1,900, registers lowest correlation with Bitcoin in 2023",
    "url": "https://cryptoslate.com/insights/gold-slides-below-1900-registers-lowest-correlation-with-bitcoin-in-2023/",
    "description": "<p>Quick Take The June 28 report of the U.S. GDP exceeding expectations has led to notable movements in the economic landscape. In the commodities market, the gold price has dipped below the $1,900 mark, reflecting investor sentiment influenced by robust economic performance. Bitcoin, however, is charting a different course, climbing higher and surpassing the $30,600 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/gold-slides-below-1900-registers-lowest-correlation-with-bitcoin-in-2023/\">Gold slides below $1,900, registers lowest correlation with Bitcoin in 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-29T14:00:00.000Z",
    "title": "Bitcoin Price Analysis:  Stops Cited Above 30994 - 30 June 2023",
    "url": "https://cryptodaily.co.uk/2023/06/bitcoin-price-analysis-stops-cited-above-30994-30-june-2023",
    "description": "<p>BTC/USD Stops Cited Above 30994:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 30 June 2023</p>\n<p>Bitcoin (BTC/USD) sought to extend recent gains early in the Asian session as the pair rallied from the 29885.53 area and reached the 30753.74 area following steady upside activity that intensified around the 30127.80 area, an upside price objective related to buying activity that emerged around the 15460 and 19568.52 areas.&nbsp; The 50-bar, 4-hourly simple moving average has provided technical support for BTC/USD for a couple trading sessions.&nbsp; &nbsp;The pair&rsquo;s recent print around the 31443.67 area was a twelve-month high and test of an upside price objective associated with buying pressure that strengthened around the 26637.41 area.&nbsp; &nbsp;Additional upside price objectives include the 31737, 32125, and 33569 areas.&nbsp; Stops are cited above additional upside price objectives around the 31674, 32043, 34531, and 34658 areas.</p>\n<p>Following recent selling pressure, areas of potential technical support and buying pressure include the 29863, 29427, 28886, 28804, 28182, 28096, and 27306 areas.&nbsp; &nbsp;Stops were also recently triggered above additional upside price objectives around the 29068, 29159, 29458, 30088, 30200, 30292, and 30477 levels.&nbsp; &nbsp;&nbsp;Technicians are closely watching to see how much technical support develops around the 28095.44 area, representing the 23.6% retracement of the historical depreciating range from 69000 to 15460.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bullishly indicating above the 100-bar MA (4-hourly)&nbsp;and&nbsp;above the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 100-bar MA (hourly) and above the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 30245.77 and the&nbsp;100-bar MA&nbsp;(Hourly) at 30400.39.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is Bearishly below MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bullishly above MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n<p>&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-29T14:00:50.000Z",
    "title": "Bitcoin Difficulty Takes a Dip: Network’s First Downward Adjustment in 56 Days Signals Easier Mining Ahead",
    "url": "https://news.bitcoin.com/bitcoin-difficulty-takes-a-dip-networks-first-downward-adjustment-in-56-days-signals-easier-mining-ahead/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/minerrrr-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Difficulty Takes a Dip: Network&#039;s First Downward Adjustment in 56 Days Signals Easier Mining Ahead\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/minerrrr-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/minerrrr-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/minerrrr-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/minerrrr-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/minerrrr-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/minerrrr-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/minerrrr.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On June 28, 2023, Bitcoin saw its first downward difficulty adjustment in 56 days, or since May 4, with a decline of 3.26%. This modification lowered the network&#x2019;s difficulty to 50.65 trillion from its record high of 52.35 trillion on June 14. Bitcoin Mining Gets a Breather: Difficulty Decreases by 3.26% in Recent Adjustment Today, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-29T13:56:15.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-29T13:40:14.000Z",
    "title": "Binance’s euro banking partner pulls support – Why?",
    "url": "https://www.cryptopolitan.com/binances-euro-banking-partner-pulls-support/",
    "description": "The global cryptocurrency scene is evolving at a rapid pace, and with that evolution, adjustments and shifts in alliances are inevitable. Today, we delve into the recent developments involving one of the world&#8217;s biggest cryptocurrency exchanges, Binance. The latest news revolves around Binance&#8217;s current banking partner for euro transactions, Paysafe Payment Solutions, deciding not to ... <a title=\"Binance&#8217;s euro banking partner pulls support &#8211; Why?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binances-euro-banking-partner-pulls-support/\" aria-label=\"More on Binance&#8217;s euro banking partner pulls support &#8211; Why?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-29T14:00:50.000Z",
    "title": "Wall Street Insiders Buying Bitcoin, Ethereum and this AI Crypto Gem, Learn Why",
    "url": "https://nulltx.com/wall-street-insiders-buying-bitcoin-ethereum-and-this-ai-crypto-gem-learn-why/",
    "description": "A noteworthy trend is emerging in financial circles as Wall Street insiders show increased interest in cryptocurrencies. Despite the SEC’s altcoin crackdown amid unclear regulations, digital assets have attracted significant attention from traditional financial institutions and influential individuals. Recent crypto interest by heavyweights like FDX and BlackRock attests to this fact. Let’s explore the reasons [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-29T14:08:54.000Z",
    "title": "BaFin rejects Binance’s crypto custody license application",
    "url": "https://crypto.news/bafin-rejects-binances-crypto-custody-license-application/",
    "description": "According to a report, the German financial regulator BaFin rejected Binance's application for a cryptocurrency custody license. "
  },
  {
    "source": "BTCManager",
    "date": "2023-06-29T13:48:27.000Z",
    "title": "Coinbase responds to SEC’s lawsuit, says some tokens are not securities",
    "url": "https://crypto.news/coinbase-responds-to-secs-lawsuit-says-some-tokens-are-not-securities/",
    "description": "Coinbase has asked the court to dismiss the lawsuit filed against the company by the US Securities and Exchange Commission (SEC), stating that the tokens mentioned in the lawsuit are not \"investment contracts\" and therefore do not qualify as crypto asset securities. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-29T14:00:13.000Z",
    "title": "Altcoin Whales Show Highly Active Day, Volatility Incoming?",
    "url": "https://www.newsbtc.com/altcoin/altcoin-whales-highly-active-day-volatility-incoming/",
    "description": "On-chain data shows that altcoin whales have been highly active recently, something that could lead to volatility in the prices of these assets. Altcoin Whales Have Displayed One Of The Most Active Days Of 2023 According to data from the on-chain analytics firm Santiment, several altcoins have seen transfers worth more than $10 million in value in a single day. Generally, besides centralized platforms like exchanges, only whale investors are capable of moving such a large amount of tokens with individual transactions. Whales are an important part of any cryptocurrency&#8217;s ecosystem, as the sheer number of coins that they hold means that they can sometimes have the power to influence the market. Related Reading: Stablecoin Cap Shows Early Sign Of Reversal, Why This Could Benefit Bitcoin Naturally, only a couple of whales making a few sizeable, but still relatively small transfers likely won&#8217;t actually produce visible fluctuations on the market, but a few massive transfers may do so. Thus, whenever the whales are highly active (that is, a number of them are making multiple large transactions), the price of the asset that they are trading can become more likely to display volatility. Now, here is a chart from Santiment that shows how the scale of whale activity has recently looked like for the various altcoins in the sector: Many different assets seem to have observed high levels of whale activity recently &#124; Source: Santiment on Twitter As highlighted in the above graph, the whales of several altcoins moved around a large volume of tokens yesterday. Many of these alts saw major transactions crossing the $10 million mark, making the day the third most active of the year. These large transactions have come while these alts have registered some amount of fluctuations during the past week. It would appear that this market activity has raised the interest of the whales in trading these assets. As mentioned before, whales making such large multiple transactions can result in higher volatility for the prices of these cryptocurrencies. So far, however, since these large transfers have taken place, some of these coins have noticed some volatile price action, while the others have continued to move sideways. From the chart, it&#8217;s visible that Polygon (MATIC) in particular saw extreme amounts moved by the whales, but the asset has still only moved 1% in the past day. Nonetheless, it&#8217;s possible that volatility could still be coming soon for the asset, so it may be worth keeping an eye on the cryptocurrency. Related Reading: Bitcoin Rally Stalls As Short-Term Holder Exchange Inflows Intensify Interestingly, the Tether (USDT) whales have also been quite active recently, suggesting that some large shifts have been taking place. It&#8217;s unknown whether these moves are for buying or selling, but if they are a sign of whales exchanging the stablecoin for buying into the other cryptocurrencies, then their prices may feel a bullish effect. MATIC Price At the time of writing, Polygon is trading around $0.63, up 6% in the last week. Looks like MATIC has been struggling recently &#124; Source: MATICUSD on TradingView Featured image from Vivek Kumar on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-29T14:01:07.000Z",
    "title": "Cryptocurrency Mystery: Dogecoin Wallet Awakens After 9 Years, Surging 30,000% – What’s Behind the Dormancy?",
    "url": "https://www.crypto-news-flash.com/cryptocurrency-mystery-dogecoin-wallet-awakens-after-9-years-surging-30000-whats-behind-the-dormancy/?utm_source=rss&utm_medium=rss&utm_campaign=cryptocurrency-mystery-dogecoin-wallet-awakens-after-9-years-surging-30000-whats-behind-the-dormancy",
    "description": "Data from Whale Alert indicates that an extremely old DOGE address has suddenly shown signs of activity within the last 24 hours.  This Dogecoin wallet had remained inactive for approximately 9.5 years. Interestingly, data from Whale Alert, a cryptocurrency transaction tracker service, indicates that an extremely old DOGE address has suddenly shown signs of activity [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-29T14:00:49.000Z",
    "title": "Frax Share and Trust Wallet Token Rally Over 20%, InQubeta Leads The Way With 25% Increase",
    "url": "https://www.crypto-news-flash.com/frax-share-and-trust-wallet-token-rally-over-20-inqubeta-leads-the-way-with-25-increase/?utm_source=rss&utm_medium=rss&utm_campaign=frax-share-and-trust-wallet-token-rally-over-20-inqubeta-leads-the-way-with-25-increase",
    "description": "The crypto market is buzzing with excitement as Frax Share (FXS) and Trust Wallet Token (TWT) experience remarkable rallies, with both tokens increasing in value by over 20% in recent days. This surge has caught the crypto community&#8217;s attention, drawing comparisons to the remarkable performance of InQubeta (QUBE) which rose 25%. InQubeta&#8217;s successful presale, which [...]"
  }
]