[
  {
    "source": "Decrypt",
    "date": "2023-12-26T18:59:23.000Z",
    "title": "Solana Cools Slightly as Bitcoin and Ethereum See Prices Slump",
    "url": "https://decrypt.co/210911/solana-cools-slightly-as-bitcoin-and-ethereum-see-prices-slump",
    "description": "Solana, which soared past the $100 mark over the weekend, has cooled slightly. SOL is trading for $109.20—down 11% in the past day."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-26T18:50:00.000Z",
    "title": " Amid legal troubles, Changpeng Zhao’s wealth increased by $25B in 2023 ",
    "url": "https://cointelegraph.com/news/changpeng-zhao-wealth-increased",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYjFhYzEyZjAtNjBhMC00NGRkLWIyM2YtZDE0ODgwYTJkNmM0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bloomberg ranked the former Binance CEO as the 35th wealthiest person on the planet, ahead of Citadel CEO Ken Griffin and behind Uniqlo CEO Tadashi Yanai.</p>\n                    <p><p>Former Binance CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/changpeng-zhao\">Changpeng “CZ” Zhao</a> reportedly added roughly $25 billion to his net worth since December 2022.</p><p>According to the Bloomberg Billionaires Index as of Dec. 25, CZ <a href=\"https://www.bloomberg.com/billionaires/?sref=323RPL5z\" target=\"_blank\" rel=\"noopener nofollow\">had</a> a total net worth of $37.2 billion — a year-to-date increase of $24.6 billion. This change placed the former Binance CEO as the 35th highest-ranked billionaire, ahead of Citadel CEO Ken Griffin and behind Uniqlo CEO Tadashi Yanai. </p><p>Bloomberg reported Tesla CEO Elon Musk took the title of the world’s wealthiest man with a net worth of $232 billion — a 25% decrease from an estimated $340 billion in November 2021. The news outlet reported that Coinbase CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/brian-armstrong\">Brian Armstrong</a> had a net worth of $7.25 billion, with a year-to-date increase of $5.77 billion. </p><p><a href=\"https://cointelegraph.com/news/changpeng-zhao-wealth-increased\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-26T18:40:23.000Z",
    "title": "Cryptocurrency market sees over 50% decline in hacks over 2023",
    "url": "https://cryptoslate.com/cryptocurrency-hacks-see-over-50-decline-in-2023/",
    "description": "<p>Cryptocurrency hacks dropped by over half in 2023 compared to the previous year, indicating that heightened security measures and increased law enforcement scrutiny may be paying off. According to research by TRM Labs and other blockchain security firms, cybercriminals stole roughly $1.85 billion in 2023, starkly contrasting the nearly $4 billion lost in hacks throughout [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/cryptocurrency-hacks-see-over-50-decline-in-2023/\">Cryptocurrency market sees over 50% decline in hacks over 2023</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T19:05:20.000Z",
    "title": "Spot Bitcoin ETF could dwarf all the crypto ETPs in the market",
    "url": "https://www.cryptopolitan.com/spot-bitcoin-etf-could-dwarf-etps-market/",
    "description": "The market for cryptocurrency exchange-traded products (ETPs) has reached approximately $50.3 billion in assets under management, encompassing around 150 products globally, as per data from BitMEX research. This has created a case for spot Bitcoin ETFs dwarfing ETPs. These ETPs include both spot and futures funds, typically tracking the performance of major cryptocurrencies like Bitcoin [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-26T19:00:59.000Z",
    "title": "A Crypto Christmas Special With Material Indicators: Past, Present, And Future",
    "url": "https://www.newsbtc.com/news/a-crypto-christmas-special-with-material-indicators-past-present-and-future/",
    "description": "Another year, another Crypto Christmas special for our team at NewsBTC. In the coming week, we’ll be unpacking 2023, its downs and ups, to reveal what the next months could bring for crypto and DeFi investors. Related Reading: A Crypto Christmas Special With Jlabs Digital: Past, Present, And Future Like last year, we paid homage to Charles Dicke’s classic “A Christmas Carol” and gathered a group of experts to discuss the crypto market’s past, present, and future. In that way, our readers might discover clues that will allow them to transverse 2024 and its potential trends. Crypto Christmas: A Deep Look Into The Bull Market And A Secret Pattern Once again, the crypto analytics firm Material Indicators joined us to discuss the current market structure. This year, we spoke with Keith Alan, one of the co-founders and analysts at the firm. Alan gave us his perspective on the bull market or what looks like the beginning of a bullish trend. Material Indicators is well known for their reliance on hard data, and for sharing views that often questioned the general beliefs in the crypto market. This time was no difference as Alan pointed to the evidence favoring both sides, bulls and bears. This is what he told us. Q: In light of the prolonged bearish trends observed in 2022 and 2023, how do these periods compare to previous downturns in severity and impact? With Bitcoin now crossing the $40,000 threshold, does this signify a conclusive end to the bear market, or are there potential market twists investors should brace for? MI: Nobody could argue that 2022 was anything but a bear market. After Bitcoin reached an ATH in November of 2021 we saw the bear market develop in classic fashion by losing support at key technical levels. While the bear was playing out in somewhat predictable fashion, the market was caught off guard by the events that led to the FTX crash in November 2022. Because the contagion from FTX had a devastating ripple effect that was felt by the largest institutions with crypto exposure as well as banks, I actually expected prices to fall even lower.  At the time, fear and fighting among institutional players like Galaxy, Gemini and Grayscale (under DCG) who were among SBF’s largest institutional victims added to the concern that price would grind down towards the lower teens, yet somewhat remarkably and perhaps not so coincidentally on January 1, 2023 Bitcoin started to rally. What was first considered weekend whale games evolved long past the weekend, and in fact, through Q1/2023 I identified an entity on FireCharts which I nicknamed &#8220;Notorious B.I.D.&#8221; that was double stacking large blocks of bid liquidity to push price higher. There was a pattern to the behavior that made it somewhat predictable and tradable. Those moves were well documented in my X feed during that period of time. Once price reached $25k that entity disappeared. Even without the help of that manipulation pushing price up, and despite the fact that the macroeconomic situation was horrible, the geopolitical situation went from bad to worse and the US political situation evolved from a dysfunctional sh*t show to a full blown circus, the market continued to rally.  Now, nearly 12 months and &#62; 150% from the day the rally began, the debate between bulls and bears over whether this is a confirmed bull market or a sequence of bear market distribution rallies literally continues today. While it’s understandable that someone could look at 150% and immediately assume bull market, it does require a deeper understanding of what distribution and accumulation look like. From my view, that still isn’t as clear as one would expect. Historically, the Purple Class of Whales with orders in the $100k &#8211; $1M range have had the most influence over BTC price direction. The order flow data I’ve been monitoring on Binance shows that through most of the year they (along with larger MegaWhales) have been buying dips and distributing significantly more than they bought on those dips on the uptrends that followed. Only recently have we seen an uptick that could be an indication that the trend is shifting. Parallel to that, some on-chain data providers are showing an increase in the number of wallets holding BTC which is also an indication that we could be transitioning from a distribution phase to an accumulation phase and I’m looking for more clear evidence of that. One of the things I look for to get a sense of that is bid liquidity. I believe that &#8220;Liquidity = Sentiment,&#8221; and it’s no secret that order books have been thin on both sides of price through most of the year, however in the last 3 weeks or so, we’ve started seeing more institutional sized bid ladders coming into the order book and that fact supports a bullish thesis, as long as they don’t dump through the next pump. With all of the above in mind, there are most certainly turns and twists that investors should look out for. Sure we are starting to see some improvements on the U.S. inflation and unemployment numbers, but something in those reports doesn’t jive with reality. For most middle and lower income Americans, credit card debt is climbing to new highs, rents have soared, home ownership is unattainable, grocery prices are high and a Metallica “Standing Room Only” Field ticket is $575.  So in my mind, we still have a percolating macroeconomic problem and the geopolitical and U.S. political issues seem to get worse by the day. Aside from that, the RSI has been over cooked for an extended period of time and we just had 8 consecutive green weekly candles. Both of those factors have historically led to corrections. I could give you the “History doesn’t have to repeat itself…” spiel or I can show you what historically happens after moves like this and let you decide.  Another potential twist to consider is that the current PA has a striking resemblance to the first leg of the 2019 rally that turned out to be a Fib retracement, that ultimately got rejected from the top of the Golden Pocket at .618 Fib. That led to a 53% correction before the Covid Crash took it down more than 70% from the .618 Fib. At this stage, I’d be surprised to see a downside move that deep without the aid of a Black Swan, but we are currently having some interaction with the Golden Pocket that seems familiar. While it is reasonable to expect some resistance entering and exiting the Golden Pocket, there is one very weird twist to what we are seeing and that is a strange pattern I’ve noticed occurring on or around December 17th. Every year since 2017 there has been a move on December 17th that had Macro implications. The only exception to that is last year when it happened on December 20th. On each occasion the price action led to a macro breakout or breakdown. It’s too soon to tell if this move will validate the pattern on the day of writing (Dec 19th), but on the 17th we saw BTC get rejected from the lower end of the Golden Pocket and also lose the 21-Day moving average. Price has been flirting with both of those levels ever since so we’ll have to wait to see how it plays out over time. Aside from those things I’m watching the upcoming ETF window very closely. I think that the market is numb to SEC delays on these decisions, but there is so much anticipation that this time we’ll see an approval, that a flat out rejection has the potential to be the catalyst that triggers a correction.  Regardless of where you side on whether we are or are not in a confirmed bull market, we’re seeing a lot of evidence that if we are not in it, we’re close to it. If you’re a long term investor and you haven’t already started building a position, it’s a good time to identify some targets to start scaling into one. This of course depends on your time horizon and risk appetite, but if you have a long term outlook and 6 figure targets for BTC it’s still early enough to get in, but it’s also a good idea to save some dry powder for a correction because in my opinion, it’s not a matter of if it will come, but when. Q: Right now, we are seeing Bitcoin reach new highs. Do you think we are in the early days of a full bull run? What has changed in the market that enabled the current price action; is it the Bitcoin spot ETF or the US Fed hinting at a loser policy or the upcoming Halving? What is the big narrative that will go on in 2024? MI: Despite the ongoing debate between bulls and bears over whether or not we’ve been in a bull market, I can say that despite the uptrend, there has been no clear confirmation that we’ve been in a bull market through most of the year. However, the fact that we’ve recently started to see more institutional sized bid ladders coming into the order book along with the on-chain data that indicates more wallets holding for longer and the recent buying after the R/S flip at $40k are indications that we may be on the verge of a breakout. There’s no doubt in my mind that a lot of the momentum we’ve been seeing is related to the next ETF decision window opening January 5-10 and the April 2024 Halving. The FED’s recent decision to pause rate hikes and hint at a pivot to cuts in 2024 certainly added fuel to that momentum that pushed price above $40k. In typical crypto form, we also had some help in late October through early December when I noticed some familiar patterns in the order book. I can’t confirm with absolute certainty if it was the Notorious B.I.D. spoofer we saw in Q1 returned, but it was the same game I identified through Q1 being executed and there is no question that it helped push price up through the $35k &#8211; $40k range before it disappeared. (&#8230;) As much as I’d like to see a correction come before we get there (the Bitcoin spot ETF decision), the market doesn’t care what I want. I would expect it to come before the Halving. Whether it comes before or after the ETF decision window closes remains to be seen. In the meantime, I’ll continue to watch order book and order flow data and trade what’s in front of me. Q: Last year, we spoke about the most resilient sectors during the Crypto Winter. Which sectors and coins will likely benefit from a new Bull Run? We are seeing the Solana ecosystem bloom along with the NFT market; what trends could benefit in the coming months? MI: The vast majority of my focus is on Bitcoin and to be honest, after seeing so many ponzi’s in the space, it’s the only digital asset I truly trust. There are certainly some great opportunities with certain alts, but with that comes increased risk. As for sectors, it’s no secret that AI and Gaming have been hot. According to some research I’ve been reviewing Memes, DePin and GambleFi are dominant narratives right now. The fact that Memes are more dominant than something that’s actually physical like DePin speaks to the immaturity of this market. Perhaps a better way of stating that is, “We are still early.” That said, if I’ve learned anything in crypto there is an opportunity cost associated with having high standards and principles for projects you invest in. As ridiculous as that may sound, the biggest upside potential seems to come from some of the most meaningless projects because they have large communities of &#8220;Crypto Bros&#8221; pumping them and thin liquidity makes them easy to pump. Just know that they also come with a huge risk and like every other ponzi, you don’t want to be the last guy holding the bag. I personally tend to avoid memes for all the reasons I mentioned above, but I do trade DOGE on occasion because it’s been a relatively easy scalp lately. Elon Musk playing kingmaker with that coin doesn’t make me like it any more or less (okay maybe less), but the results have been predictable.  The fact he has obtained a money transfer license for X (Twitter) and that he has a DOGE logo on his X profile has me considering taking a flier on DOGE, but that’s not something I’m recommending to anyone who isn’t willing to lose that money. The fact he has SpaceX launching a DOGE sponsored satellite next month should at the very least bring a short term pump. Of the leading narratives mentioned, Memes may be the most dominant, but DePin is the most interesting to me, because it’s associated with something very real and very hot right now. For those who may not be familiar, DePin stands for Decentralized Physical Infrastructure Networks which are blockchain protocols that build, maintain and operate infrastructure for the AI industry. (Do Your Own Research). The fact that you mentioned Solana is proof that nothing changes sentiment like price. Solana has been through the ringer since falling from it’s ATH in November 2021 and the FTX crash of 2022 delivered another 80% correction that took it to single digit levels. There is no denying that it has been on an epic run recently. It’s somewhat puzzling to me how that is happening at the exact same time FTX liquidators have started the long process of distributing over $1B worth of $SOL back into the market. Related Reading: Shiba Inu Climbs 12% On Christmas Day – Brewing Bull Run Or False Dawn? Rather than speculate on what may be behind that, I’ll say that it is apparent that they have a very strong community and despite the network issues they’ve had in the past, they seem to be growing in popularity in staking pools. Then again, nothing influences sentiment like price, so I expect we’ll see a number of coins filter their way in and out of the leading narratives through the year. I’m just hoping more of them do so for legitimate reasons rather than fake news or P&#38;D groups. IMO, until we see the projects with real teams, real use cases, real adoption and real revenue establishing themselves as the best projects to invest in for their fundamentals, “We’re still early.” Keith Alan is President at Keith Alan Productions, Inc., Co-Founder at Blacknox, LLC and Material Indicators, LLC. Nothing written should be taken as financial advice. For more insight and analysis follow @KAProductions and @MI_Algos. Find premium tools for traders at Material Indicators. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-26T19:05:24.000Z",
    "title": "Top Trader Reveals 141% Price Target for Under-the-Radar Ethereum Altcoin on the Move",
    "url": "https://dailyhodl.com/2023/12/26/top-trader-reveals-141-price-target-for-under-the-radar-ethereum-altcoin-on-the-move/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Altcoin-Thats-Exploded-390.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Altcoin-Thats-Exploded-390.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Altcoin-Thats-Exploded-390.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Altcoin-Thats-Exploded-390.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Altcoin-Thats-Exploded-390.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Altcoin-Thats-Exploded-390.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Altcoin-Thats-Exploded-390.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto strategist believes that one under-the-radar Ethereum (ETH) scaling solution is on track to more than double in price. Pseudonymous crypto strategist Pentoshi tells his 727,200 followers on the social media platform X that layer-2 rollup platform Metis (METIS) could be setting up to soar more than 141% from its current value. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/26/top-trader-reveals-141-price-target-for-under-the-radar-ethereum-altcoin-on-the-move/\">Top Trader Reveals 141% Price Target for Under-the-Radar Ethereum Altcoin on the Move</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]