[
  {
    "source": "Decrypt",
    "date": "2023-11-16T20:16:49.000Z",
    "title": "How to Claim the Pyth Airdrop for Ethereum, Solana, Aptos Users",
    "url": "https://decrypt.co/206387/how-to-claim-the-pyth-airdrop-for-ethereum-solana-aptos-users",
    "description": "Users across 27 blockchains are eligible for the massive drop, which kicks off Monday. "
  },
  {
    "source": "Decrypt",
    "date": "2023-11-16T20:12:23.000Z",
    "title": "AI Brings ‘Great Promise and Great Risk' to Financial Markets: CFTC Commissioner",
    "url": "https://decrypt.co/206378/artificial-intelligence-in-financial-markets-regulation",
    "description": "\"Excessive reliance on a few AI models could lead to herd behavior,\" Christy Goldsmith warned today."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-16T20:30:00.000Z",
    "title": "Failed '$175M' real estate token raise draws ire of Texas regulators",
    "url": "http://cointelegraph.com/news/failed-175m-real-estate-cryptocurrency-token-raise-draws-ire-texas-regulators",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/73fffd54-71fb-4ad3-a9f3-ff3348df1811.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>\"GS Partners promoted the products through a multilevel marketing scheme paying lavish commissions,\" regulators say. </p>\n                    <p><p>The Texas State Securities Board has <a href=\"https://ssb.texas.gov/sites/default/files/2023-11/Release_GSPartners_FINAL2_11162023.pdf\" target=\"_blank\" rel=\"noopener nofollow\">accused</a> a network of companies under the \"GS\" brand and operating from Germany of fraudulent activities \"tied to digital assets, investments in a staking pool in a proprietary metaverse.\" The network of companies is controlled by Josip Dortmund Heit.</p><p>As <a href=\"https://ssb.texas.gov/sites/default/files/2023-11/ENF_23_CDO_1879.pdf\" target=\"_blank\" rel=\"noopener nofollow\">described</a> by regulators on November 16, respondents GS Partners, GS Smart Finance and GS Wealth allegedly held three rounds of metaverse property sales beginning September 2021. At the time, investors were informed that could purchase XLT Vouchers, or BNB Chain tokens that represented ownership of one square inch of a unit in the company's G999 Tower metaverse, at 9.63 Tether (USDT) per voucher. However, the token rapidly lost its value, to less than 0.0000049 USDT apiece on decentralized exchange PancakeSwap, after the respondents failed to reach its $175 million raise target for the offering.</p><blockquote>\"Respondents have not been registered with the Securities Commissioner as dealers or agents at any time material hereto.\"</blockquote><p>Regulators allege that other investment products created by GSB, such as its Lydian World metaverse tokens, gold tokens, G999 coin, and Elemental Certificates, also constituted unregistered security offerings. The Texas State Securities Board has filed an emergency enforcement action for the GSB group of companies to cease and desist from such activities in the state.</p><p>On August 15, the Ontario Securities Commission <a href=\"https://ca.finance.yahoo.com/news/osc-investor-warnings-alerts-july-155000275.html\" target=\"_blank\" rel=\"noopener nofollow\">issued a warning</a> that GS Partners was not registered to do business in the Canadian province of Ontario. Previous warnings regarding the firm were also published by securities regulators in the Canadian provinces of Saskatchewan, British Columbia, Alberta, and Quebec. </p><p><strong>Related: <a href=\"https://cointelegraph.com/news/texas-lawmaker-introduces-resolution-to-protect-bitcoin-miners-and-hodlers\">Texas lawmaker introduces resolution to protect Bitcoin miners and HODLers</a></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-16T20:29:37.000Z",
    "title": "Why is the crypto market down today?",
    "url": "http://cointelegraph.com/news/why-is-the-crypto-market-down-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2022-09/8032812d-1d50-46ab-b965-a0cb6dd41a63.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The crypto market is down today, resulting in over $160 million long liquidations amid concerns that the SEC could delay a decision on all pending spot BTC ETF applications</p>\n                    <p><p>Price action across the crypto market remains tilted to the downside as investors and money managers begin to digest the potential fallout if the SEC chooses to delay the current spot Bitcoin ETF applications.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/0685f123-2598-4e54-b500-86dee306bdeb.png\"  /><figcaption style=\"text-align: center;\"><em>Cryptocurrency market performance, 30-day chart: Coin360</em></figcaption></figure><h2>XRP and altcoins sell-off after a fake ETF filing</h2><p>The decline in the crypto market is happening during a week when the U.S. Securities and Exchange Commission (SEC) is expected to review a handful of pending <a href=\"https://cointelegraph.com/news/bitcoin-etf-approval-window-sec-bloomberg-analysts\">spot Bitcoin ETF</a> applications.</p><p>Notably, the securities regulator must decide on applications from Hashdex and Global X ETFs by Nov. 17. The SEC also needs to decide on Franklin Templeton’s Bitcoin ETF application by Nov. 21. Failing to do so would push the deadline to 2024.</p><p>The market <a href=\"https://cointelegraph.com/news/xrp-hoax-filing-spike-bad-look-wont-sway-sec-etf-decisions\">anticipates another delay</a>, according to James Edwards, a crypto analyst at Australian fintech firm Finder. </p><p>The analyst mentioned a fake BlackRock XRP trust filing that caused <a href=\"https://cointelegraph.com/news/delaware-authorities-refer-fake-blackrock-xrp-trust-filing-to-state-s-justice-department\">extreme price swings</a> in the XRP markets and prompted an investigation request to be sent to the United States Department of Justice. He believes this event will hurt the chances of launching a spot Bitcoin ETF in the U.S. because it supports the SEC’s claims of price manipulation in the crypto industry.</p><p>For now, traders are likely securing profits at the current multi-month high prices in the crypto market because of this potentially long wait.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/magazine/breaking-into-liberland-dodging-guards-decoys-and-diplomats/\"><strong><em>Breaking into Liberland: Dodging guards with inner-tubes, decoys and diplomats</em></strong></a></p><h2>ETH and BTC spot ETF euphoria could be waning </h2><p>Market sentiment boomed due to optimism about a potential Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund (ETF) approval to start November. The euphoria sent <a href=\"https://cointelegraph.com/news/bitcoin-make-break-zone-btc-price-back-to-38k\">Bitcoin price</a> to 18-month highs above $38,000. However, the euphoria seems to be easing, with the BTC price dropping 4% on Nov. 16 due to low liquidity at higher levels. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/1df15348-e1ab-4974-89c6-6df80f871295.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin historical returns by month. Source: Newhedge</em></figcaption></figure><p>While the market was poised for an ETF approval by Nov. 17, this seems unlikely, with the <a href=\"https://www.sec.gov/files/rules/sro/nysearca/2023/34-98947.pdf\" target=\"_blank\" rel=\"noopener nofollow\">SEC</a> already delaying Hashdex’s application for a spot Bitcoin ETF conversion on Nov. 15. And while BlackRock does not believe the SEC has any legitimate reason not to approve a <a href=\"https://cointelegraph.com/news/blackrock-argues-sec-has-no-grounds-to-treat-crypto-futures-and-spot-etfs-differently\">cryptocurrency spot ETF</a>, the SEC seems poised to delay. </p><p>On Nov. 15, the <a href=\"https://www.sec.gov/files/rules/sro/nysearca/2023/34-98944.pdf\" target=\"_blank\" rel=\"noopener nofollow\">SEC</a> delayed a decision on Grayscale’s Ether futures ETF. Some analysts believe the 19b-4 form submitted by Grayscale is a potential “<a href=\"https://cointelegraph.com/news/grayscale-eth-futures-etf-trojan-horse-spot-eth-etf\">trojan horse</a>” for the agency. </p><h2>Futures liquidations send the crypto market lower</h2><p>The decline across major cryptocurrencies has led to a rush of liquidations across the derivative market.</p><p>In the past 24-hours alone, over $160 million in long positions have been liquidated across the crypto market, with $144.3 million being wiped out in the previous 12-hours. Crypto market prices are negatively affected when long derivative positions are liquidated without buying pressure from trading volume.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/60c881ff-43e1-4af2-809e-ff7a145231c2.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto market liquidations. Source: Coinglass</em></figcaption></figure><p>Despite the crypto market being down today, <a href=\"https://cointelegraph.com/markets\">select altcoins</a> have performed well. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/solana-sol-avalanche-avax-and-dydx-produce-double-digit-gains-as-bitcoin-reclaims-37k\"><strong><em>Solana (SOL), Avalanche (AVAX) and dYdX produce double-digit gains as Bitcoin reclaims $37K</em></strong></a><em> </em></p><p>In the short term, the cryptocurrency market will continue to navigate multifaceted challenges, and the ebb and flow of various economic and regulatory factors will undoubtedly shape its trajectory for the foreseeable future.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-16T20:26:35.000Z",
    "title": "Cardano’s Remarkable 461% YTD Stablecoin Growth: Insights from Messari’s Q3 2023 Report",
    "url": "https://www.cryptoglobe.com/latest/2023/11/cardanos-remarkable-461-ytd-stablecoin-growth-insights-from-messaris-q3-2023-report/",
    "description": "According to Messari’s report, Cardano demonstrated substantial progress in Q3 2023. A standout highlight was the 461% year-to-date increase in stablecoin value. The period also marked the completion of Project Catalyst Fund10 and continued development in the Voltaire governance phase. Messari highlights the launch of Mithril as a significant technological advancement, enhancing node syncing efficiency. […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-16T20:26:11.000Z",
    "title": "Will the Striking Comeback of Avalanche (AVAX), Algorand (ALGO) and Arbitrum (ARB) Catch the Crypto World Off Guard?",
    "url": "https://cryptodaily.co.uk/2023/11/will-the-striking-comeback-of-avalanche-avax-algorand-algo-and-arbitrum-arb-catch-the-crypto-world-off-guard",
    "description": "Discover the understated yet significant movements of Avalanche (AVAX), Algorand (ALGO), and Arbitrum (ARB) in the cryptocurrency market. Our in-depth analysis explores their recent, quietly impressive performances, considering the potential impacts of their innovative projects and partnerships. Gain insights into these altcoins' market trajectories as they navigate the complex crypto landscape, subtly gaining momentum. Keep informed with our expert analysis to understand the nuances of their potential breakout or pullback, and stay ahead in the dynamic world of digital currencies."
  }
]