[
  {
    "source": "Cointelegraph",
    "date": "2023-08-18T02:56:30.000Z",
    "title": "Why did Bitcoin drop? Analysts point to 5 potential reasons",
    "url": "https://cointelegraph.com/news/why-did-bitcoin-price-suddenly-drop-analysts-explain",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/9e3a1817-b601-429e-adbc-b4508c03321c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin's price fell approximately 8% in a span of 10 minutes, leaving crypto investors scrambling to make sense of the drop.</p>\n                    <p><p>Elon Musk's SpaceX reportedly selling its Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) holdings, the <a href=\"https://edition.cnn.com/2023/08/17/business/evergrande-files-for-bankruptcy/index.html\" target=\"_blank\" rel=\"noopener nofollow\">bankruptcy</a> of a Chinese property giant and fears of interest rate hikes have been among the theories raised as to Bitcoin's freak price dip.</p><p>On Aug. 18 around 9:35 pm UTC, the price of Bitcoin suddenly plummeted over 8% in a span of 10 minutes, taking with it the wider cryptocurrency market, leaving many in the crypto community scratching their heads.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">the fuck was that? <a href=\"https://t.co/Lh2zGXv29n\">pic.twitter.com/Lh2zGXv29n</a></p>&mdash; Molly White (@molly0xFFF) <a href=\"https://twitter.com/molly0xFFF/status/1692295673918452067?ref_src=twsrc%5Etfw\">August 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>While there appears to be no consensus as to why the markets suddenly dropped, several crypto market analysts have shared their initial theories with Cointelegraph. </p><h3>SpaceX offloads Bitcoin, interest rate fears</h3><p>eToro market analyst Josh Gilbert pinned the drop on a report <a href=\"https://cointelegraph.com/news/spacex-sold-bitcoin-acquired-2021-2022-report\">that SpaceX may have offloaded</a> some or all of its $373 million in Bitcoin holdings, which came from an Aug. 17 article from the Wall Street Journal. </p><blockquote>“Whenever you have a big name in the industry selling Bitcoin, especially someone as influential as Elon Musk, it will put the price under pressure.”</blockquote><p>This would put the sudden price drop around 2.5 hours after the report was published online.</p><p>Gilbert said another theory could be the rapid shift in sentiment, due to the broader markets’ <a href=\"https://www.investmentweek.co.uk/news/4122409/federal-reserve-officials-split-future-path-interest-rate-hikes\" target=\"_blank\" rel=\"noopener nofollow\">expectations</a> of future interest rate hikes from the U.S. Federal Reserve. </p><p>“If we also consider some of the weaknesses we’ve seen across global markets — particularly risk assets — over the last few weeks with the expectation that rates will likely stay higher for longer, it was a recipe for a pullback,” Gilbert explained. </p><p>“Bitcoin has struggled for a leg higher in the last month, trading in a tight range of between $29k and $30k with little ‘good news’ to push the asset higher, which has only exuberated this sell-off,” he added.</p><h3>Government bond yields</h3><p>Tina Teng, a market analyst from CMC Markets shared a different opinion, looking to the recent rise in government bond yields as the root cause behind the sell-off. </p><p>Teng explained that increasing bond yields typically shows a reduction in liquidity for the broader market. </p><p>“This could be the primary reason that cryptocurrencies sank,” she said. </p><p>Additionally, Teng said that while the Evergrande crisis could have an indirect cause on the price of Bitcoin she didn’t believe that it was among the root causes of the decline. “This has more of an impact on sentiment toward the Chinese economy and investors,” she explained.</p><h3>Whale's selling big</h3><p>While there were many other news events that could be responsible, pseudonymous derivatives trader @TheFlowHorse told Cointelegraph that the sudden move down could have resulted from a single large actor making a big sell, which then resulted in further pressure on derivatives. </p><blockquote>“It was not just a natural cascade. Someone big bailed for a purpose and set it in motion. Spot volume barely compared to perps.”</blockquote><p>According to data from crypto analytics platform Coinglass, more than $427 million in Bitcoin long positions were liquidated in the last 4 hours. Over the course of the last 24 hours, there were more than more than $822 million liquidations for traders with open long positions — a bet that the price of crypto assets will move upwards.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/271dadd8-dfee-49e8-8144-2eb0be8ef6c6.png\"  /><figcaption style=\"text-align: center;\"><em>More than $427 million worth of Bitcoin long positions have been liquidated in the last 24 hours. Source: Coinglass</em></figcaption></figure><p>Describing much of the explanations for the decline as “pure speculation,” Horse suggested that since the reports of the <a href=\"https://cointelegraph.com/news/sec-to-approve-ethererum-eth-futures-etf\">SEC hinting its approval of an Ethereum Futures ETF</a> came moments after the dump — a large fund may have offloaded their Bitcoin position to “trigger a cascade to buy ETH.” </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-price-falls-below-26k-in-two-month-lows-for-btc\"><strong><em>Bitcoin price briefly dips below $26K, falling to two-month lows</em></strong></a></p><p>Bitcoin has recovered slightly since the crash, gaining 1.2% in the last two hours, according to data from TradingView. At the time of publication, Bitcoin is changing hands for $26,619. </p><p>Its price seems to have been buoyed by news that the SEC may look to approve an Ethereum Futures ETF product as soon as October. </p><p><strong><em>Deposit risk: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]