[
  {
    "source": "Decrypt",
    "date": "2023-11-30T03:28:50.000Z",
    "title": "Sam Altman Retakes Helm at OpenAI with Microsoft on the Board",
    "url": "https://decrypt.co/208048/sam-altman-retakes-helm-at-openai-with-microsoft-on-the-board",
    "description": "“One of the most important things for the team that builds AGI safely is the ability to handle stressful and uncertain situations,” Altman said."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-30T03:26:28.000Z",
    "title": "Sam Altman returns as OpenAI CEO as Microsoft gets board seat",
    "url": "http://cointelegraph.com/news/sam-altman-returns-openai-ceo-microsoft-new-board",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/e762a41c-9011-4e6b-a006-e9492cda8a70.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sam Altman addressed his employees in a company memo on Nov. 29, marking his official return to the top leadership position at OpenAI. </p>\n                    <p><p>Sam Altman, one of the founders of OpenAI, has officially returned to office as the firm’s CEO, ending a whirlwind few weeks caused by his abrupt and unexpected temporary departure. </p><p>Addressing OpenAI employees in a company <a href=\"https://openai.com/blog/sam-altman-returns-as-ceo-openai-has-a-new-initial-board\" target=\"_blank\" rel=\"noopener nofollow\">memo</a> made public on Nov. 29, Altman confirmed that interim CEO Mira Murati will step down from her position and return to her previous role as chief technology officer.</p><p>Altman also revealed a new initial board, chaired by Salesforce CEO Bret Taylor, along with Larry Summers, who previously served as the United States Secretary of the Treasury, and Adam D’Angelo, the CEO of social question-and-answer website Quora. D’Angelo was on OpenAI’s board before the saga that unfolded in mid-November. Greg Brockman will also resume his role as OpenAI’s President.</p><blockquote class=\"twitter-tweet\"><p lang=\"art\" dir=\"ltr\">❤️ <a href=\"https://t.co/9JnRmJMptH\">https://t.co/9JnRmJMptH</a></p>&mdash; Sam Altman (@sama) <a href=\"https://twitter.com/sama/status/1730032854493716898?ref_src=twsrc%5Etfw\">November 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p>\"I have never been more excited about the future. I am extremely grateful for everyone’s hard work in an unclear and unprecedented situation, and I believe our resilience and spirit set us apart in the industry. I feel so, so good about our probability of success for achieving our mission,\" said Altman to employees.</p><p>Altman also revealed that Microsoft will be included as a non-voting observer on the new board. </p><p>\"We clearly made the right choice to partner with Microsoft and I’m excited that our new board will include them as a non-voting observer,\" he said. </p><p>Looking ahead, Altman said he would be focused on advancing the firm’s research plan, improving its products and better serving customers as his three top priorities to focus on in his second stint as CEO. </p><p>In the same official announcement, Taylor stressed OpenAI will \"enhance the governance structure,\" and put together \"an independent committee of the Board to oversee a review of the recent events,\" in effort to provide more stability to the firm.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The OpenAI team is irreplaceable -- I couldn’t be happier to be back at work alongside <a href=\"https://twitter.com/sama?ref_src=twsrc%5Etfw\">@sama</a> and <a href=\"https://twitter.com/gdb?ref_src=twsrc%5Etfw\">@gdb</a> . The mission continues.</p>&mdash; Mira Murati (@miramurati) <a href=\"https://twitter.com/miramurati/status/1730032754887430352?ref_src=twsrc%5Etfw\">November 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]