[
  {
    "source": "CoinDesk",
    "date": "2023-06-14T16:00:00.000Z",
    "title": "Ethereum Ecosystem Is Getting Busier, Not Quieter, Amid Layer 2 Shift",
    "url": "https://www.coindesk.com/tech/2023/06/14/ethereum-ecosystem-is-getting-busier-not-quieter-amid-layer-2-shift/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Many transactions are getting offloaded onto layer-2 blockchains, and those should be included in any analysis of the Ethereum ecosystem."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-14T16:00:00.000Z",
    "title": "A Crypto Lesson From George Soros Amid Binance and Coinbase Accusations",
    "url": "https://www.coindesk.com/markets/2023/06/14/a-crypto-lesson-from-george-soros-amid-binance-and-coinbase-accusations/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Positioning and expectations explain why the Binance case drove prices down but markets rebounded after Coinbase."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-14T16:00:00.000Z",
    "title": "The Graph Starts Migrating its Settlement Layer to Arbitrum from Ethereum",
    "url": "https://www.coindesk.com/tech/2023/06/14/the-graph-starts-migrating-its-settlement-layer-to-arbitrum-from-ethereum/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The transition is aimed at reducing barriers of entry for The Graph’s users by decreasing gas costs and speeding up transactions."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-14T15:57:00.000Z",
    "title": "Solana Hard Fork to Stave Off SEC? Devs Say It's Not Happening",
    "url": "https://decrypt.co/144576/solana-hard-fork-devs-say-its-not-happening",
    "description": "“I work on the largest Solana project, with more than 10 developers, and nobody is discussing [a hard fork]” said Matías Kudelski, a cyber security researcher who audits Solana’s code."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-14T16:00:00.000Z",
    "title": "Israeli crypto entrepreneur joins privacy-focused project amid fraud allegations",
    "url": "https://cointelegraph.com/news/israeli-crypto-entrepreneur-joins-privacy-focused-project-amid-fraud-allegations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/96a1a6d2-3204-494f-8eeb-06ba93b694ea.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Moshe Hogeg said he was a “small” but “significant” part of the Tomi team, handling a network solution that seemed to allow transactions of ERC-20 tokens without an Etherscan record.</p>\n                    <p><p>Moshe Hogeg, an Israeli entrepreneur, has returned to the spotlight of the crypto industry after speaking at a conference in Morocco on ‘alternative internet network’ Tomi.</p><p>Speaking at the Nakamoto Forum in Marrakech on June 6, Hogeg was one of a handful of project leaders at Tomi who spoke on the network’s privacy features to a crowd of investors, representatives from crypto and blockchain firms, and members of the media. The entrepreneur was <a href=\"https://www.timesofisrael.com/hogeg-freed-to-house-arrest-on-22-million-bail-in-probe-of-sex-crimes-crypto-fraud/\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://www-timesofisrael-com.cdn.ampproject.org/c/s/www.timesofisrael.com/hogeg-freed-to-house-arrest-on-22-million-bail-in-probe-of-sex-crimes-crypto-fraud/amp/\">arrested</a> by Israeli authorities in November 2021 for allegedly engaging in financial fraud related to cryptocurrency as well as trafficking and underage prostitution.</p><p>In an interview with Cointelegraph, Hogeg compared himself to other industry leaders including Binance CEO Changpeng Zhao, who was <a href=\"https://cointelegraph.com/news/sec-can-t-find-binance-ceo-changpeng-zhao-asks-court-for-alternative-service\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-can-t-find-binance-ceo-changpeng-zhao-asks-court-for-alternative-service/amp\">targeted by United States authorities</a> in their case against the global exchange. The Israeli entrepreneur claimed officials understood the power of public opinion among those in crypto and the financial world, and conducted “a well-orchestrated attack” to damage his reputation.</p><p>“I see that more and more key figures in the crypto industry are becoming targets to authorities,” Hogeg told Cointelegraph. “Whenever there’s something like this [...] they try to eliminate the risks. I think that something very similar happened to me in Israel.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/1cb8ee3e-9f28-4fdc-b057-b054d6bf86e4.jpeg\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Moshe Hogeg speaking at the Nakamoto Forum at the Royal Mansour hotel in Marrakech, Morocco on June 6</em></figcaption></figure><p>Hogeg said there had been no official indictment in his case, which largely <a href=\"https://www.timesofisrael.com/hogeg-freed-to-house-arrest-on-22-million-bail-in-probe-of-sex-crimes-crypto-fraud/\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://www-timesofisrael-com.cdn.ampproject.org/c/s/www.timesofisrael.com/hogeg-freed-to-house-arrest-on-22-million-bail-in-probe-of-sex-crimes-crypto-fraud/amp/\">required</a> him to be under house arrest for several months in 2021 and 2022. He reportedly <a href=\"https://www.calcalistech.com/ctechnews/article/ryq7yzxvh\" target=\"_blank\" rel=\"noopener nofollow\">received</a> permission from an Israeli court to visit Morocco for the conference, temporarily lifting his travel restrictions between May 27 and June 13.</p><p>Several members of the Tomi team introduced features of the project, ranging from a content creator platform to minting nonfungible tokens. Hogeg described himself as being a “small” but “significant” part of the Tomi team amid his own controversies in his talks at the Nakamoto Forum.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/privacy-anonymity-considered-retail-cbdc-treasury\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/privacy-anonymity-considered-retail-cbdc-treasury/amp\">Privacy should be considered in ‘potential retail CBDC’ — Treasury official</a></em></strong></p><p>As part of a demonstration for attendees, Hogeg and a Tomi developer showed how they encrypted Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) to create a “totally private” token. He spoke on the network’s privacy solution, which seemed to allow crypto users to send ERC-20 and Ethereum-based tokens <a href=\"https://cointelegraph.com/news/ethereum-researcher-says-staking-reveals-ip-address-sparking-privacy-concerns\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ethereum-researcher-says-staking-reveals-ip-address-sparking-privacy-concerns/amp\">without any trace of the transaction</a> on blockchain analytics platform Etherscan.</p><p>“Ethereum is great — but Ethereum is not private,” Hogeg told attendees. “Privacy is a basic, basic right. So developing a technology that allows you to transact billions of dollars without risking your privacy is groundbreaking.”</p><p>With the addition of Hogeg to the team, Tomi recently raised $10 million for the project on top of a $40-million funding round the firm <a href=\"https://www.businesswire.com/news/home/20230321005837/en/tomi-Secures-40M-in-a-Funding-Round-Led-by-DWF-Labs-For-Its-Alternative-Internet\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> in March. The price of the network’s tomiNET (TOMI) token surged to an all-time high of $6.59 on June 6 amid the Nakamoto Forum, but has since dropped to $4.70 at the time of publication.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-senegal-why-how-african-country-using-btc/\"><strong><em>Bitcoin in Senegal: Why is this African country using BTC?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-14T16:01:16.000Z",
    "title": "Dogecoin (DOGE/USD) Price Analysis – 14 June 2023: ‘BUY’ Signal From Moving Averages",
    "url": "https://www.cryptoglobe.com/latest/2023/06/dogecoin-doge-usd-price-analysis-14-june-2023-buy-signal-from-moving-averages/",
    "description": "Introduction This report provides a comprehensive analysis of Dogecoin’s (DOGE) price dynamics on Binance, covering technical indicators, moving averages, and pivot points. Price and Volume Overview As of 3:41 p.m. UTC UTC on 14 June 2023, on Binance, the price of DOGE is $0.061800, which is an increase of $0.000250 (+0.41%) from the previous close. […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-14T15:55:48.000Z",
    "title": "SEC In a Difficult Position as Hinman Docs Are Unsealed",
    "url": "https://cryptodaily.co.uk/2023/06/sec-in-a-difficult-position-as-hinman-docs-are-unsealed",
    "description": "<p>The long-awaited Hinman documents were unsealed and revealed to the public on June 13. The documents provide insight into William Hinman&rsquo;s speech which stated that Ether is not a security.</p>\n<p>The highly anticipated Hinman documents were unsealed and released to the public earlier this week.</p>\n<p>The documents contain internal communications within the SEC, which provide much-needed insight into William Hinman&rsquo;s, the former director of the SEC&rsquo;s corporate finance division, 2018 speech in which he claimed that Ether (ETH) should not be categorized as a security.</p>\n<p>Hinman famously said during his speech:</p>\n\n<p>Based on my understanding of the present state of Ether, the&nbsp;Ethereum&nbsp;network and its decentralized structure, current offers and sales of Ether are not securities transactions.</p>\n\n<p>In the now publicly available internal communications, Hinman said:</p>\n\n<p>Attached please find a draft of the speech I had mentioned, which suggests that we don&rsquo;t need to see a need to regulate Ether, as it is currently offered, as a security.</p>\n\n<p>According to the documents, Hinman also did not regard Bitcoin as a security either:</p>\n\n<p>Applying the disclosure regime of the federal securities laws to the offer and resale of Bitcoin would seem to add little value.</p>\n\nRipple&rsquo;s Interest in the Hinman Docs\n<p>Although the documents do not directly pertain to Ripple, the firm believes they are instrumental in proving its case that XRP is not a security. Ripple has been embroiled in a legal battle with the SEC since 2020, when the agency asserted that Ripple sold $1.3 billion worth of XRP as unregistered securities.</p>\n<p>Ripple&rsquo;s argument rests on the speech indicating that the regulator does not believe ETH or BTC to be securities and argues that XRP should also not be deemed a security.</p>\n<p>The SEC was hesitant to hand over the documents but was ordered to do so by Judge Analisa Torres in September. The agency consequently tried to keep the records sealed by arguing that they were irrelevant to the case but was again denied by Judge Torres, who ruled they should be made available to the public.</p>\nLegal Experts Weigh In\n<p>Ripple&rsquo;s Chief Legal Officer, Stuart Alderoty, commented on the documents in a recent Twitter thread.</p>\n<p>Alderoty says the discovery reveal that Hinman ignored multiple warnings from collogues who suggested that the speech could create possible confusion in the market.</p>\n\n<p dir=\"ltr\" lang=\"en\">2/ We now can all see Hinman ignored multiple warnings that his speech contained made-up analysis with no basis in law, was divorced from the Howey factors, exposed regulatory gaps, and would create not just confusion, but &ldquo;greater confusion&rdquo; in the market.</p>\n&mdash; Stuart Alderoty (@s_alderoty) June 13, 2023\n<p>\n\n</p>\n<p>Alderoty also questioned why Hinman went ahead with the speech despite numerous warnings.&nbsp;</p>\n\n<p dir=\"ltr\" lang=\"en\">13/An investigation must be conducted to understand what or who influenced Hinman, why conflicts (or, at the very least, appearances of conflicts) were ignored, and why the SEC touted the speech knowing that it would create &ldquo;greater confusion.&rdquo;</p>\n&mdash; Stuart Alderoty (@s_alderoty) June 13, 2023\n<p>\n\n</p>\n<p>Crypto lawyer John Deaton further offered insights into the communications. Deaton said in a tweet quoting Coinbase legal officer Paul Grewal that the emails indicate how &ldquo;hypocritical and reckless the SEC is being.&rdquo;&nbsp;</p>\n\n<p dir=\"ltr\" lang=\"en\">The Hinman emails help @coinbase, #ETH and @Ripple&rsquo;s fair notice defense. How much it helps anyone in a courtroom is yet to be seen. But in the Court of Public Opinion and in Congress, the emails should help drive attention to how hypocritical and reckless the SEC is being. https://t.co/kdYOSsh2RX</p>\n&mdash; John E Deaton (@JohnEDeaton1) June 13, 2023\n<p>\n\n</p>\n<p>Deaton gave an interview to the news agency Cointelegraph, where he said the documents provide support for not just Ripple but for Coinbase and other entities that have been facing &ldquo;unjust targeting by regulators.&rdquo; He further opines that the documents could potentially shape legislative discussions in Congress.</p>\n<p>Deaton is quoted as saying:</p>\n\n<p>&ldquo;The documents are what I expected in two ways. One, it helps Ripple, Coinbase, and others being unfairly targeted by regulators playing fast and loose with the law they took an oath to uphold. How much it helps in the courtroom is yet to be seen, but it certainly helps in the court of public opinion and in the halls of Congress.</p>\n<p>Two, it highlights the massive conflicts of interests and gross appearances of impropriety by William Hinman and Jay Clayton.&rdquo;</p>\n\n<p>The document&rsquo;s release comes at a critical time for the crypto industry. The SEC served two of the largest crypto exchanges last week with allegations of securities violations triggering a market spiral.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-14T16:00:58.000Z",
    "title": "Biggest Movers: XRP 9% Lower, as Price Falls From 10-Week High",
    "url": "https://news.bitcoin.com/biggest-movers-xrp-9-lower-as-price-falls-from-10-week-high/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2129482007-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers: XRP 9% Lower, as Price Falls From 10-Week High\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2129482007-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2129482007-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2129482007-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2129482007-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2129482007-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2129482007-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2129482007.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />XRP plunged by over 9% on Wednesday, as traders moved to secure profits following a recent ten-week high. This decline comes as overall market sentiment remains bearish, following last week&#x2019;s actions by the U.S. Securities and Exchange Commission (SEC). Cardano was also back in the red today. XRP XRP, formerly ripple, dropped by over 9% [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T15:53:33.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T15:45:44.000Z",
    "title": "Ankr Price Prediction 2023-2032: Will the ANKR price go up?",
    "url": "https://www.cryptopolitan.com/ankr-price-prediction/",
    "description": "Ankr Price Prediction 2023-2032 As the internet matures, decentralized systems provide new possibilities for businesses to outsource specific processes. ANKR is one such platform seeking to profit from the growing field of cloud computing blockchain nodes and provides a way for firms to reward themselves. Look at this Ankr Price Prediction to see the potential ... <a title=\"Ankr Price Prediction 2023-2032: Will the ANKR price go up?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ankr-price-prediction/\" aria-label=\"More on Ankr Price Prediction 2023-2032: Will the ANKR price go up?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T15:44:53.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years, and there is no stopping it anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. Various APE price highlights unfold in this ApeCoin Price Prediction. How much is ApeCoin ... <a title=\"ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T15:43:43.000Z",
    "title": "Google introduces AI-powered features to optimize ad placements for marketers",
    "url": "https://www.cryptopolitan.com/google-introduces-ai-powered-features-to-optimize-ad-placements-for-marketers/",
    "description": "Alphabet&#8217;s Google has unveiled two new artificial intelligence (AI)-powered features aimed at assisting marketers in finding the best ad placements across the company&#8217;s services. The introduction of these AI tools reflects the increasing utilization of AI in the tech industry and its growing role in enhancing advertising strategies. Enhancing ad placement efficiency with AI The ... <a title=\"Google introduces AI-powered features to optimize ad placements for marketers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/google-introduces-ai-powered-features-to-optimize-ad-placements-for-marketers/\" aria-label=\"More on Google introduces AI-powered features to optimize ad placements for marketers\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-14T15:54:03.000Z",
    "title": "Horizen partners with Auros to enhance liquidity for EON",
    "url": "https://crypto.news/horizen-partners-with-auros-to-enhance-liquidity-for-eon/",
    "description": "Horizen has formed a strategic partnership with Auros to enhance liquidity for Horizen’s smart contracting platform"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-14T15:51:00.000Z",
    "title": "VeChain’s VeRocket Token Swap Platform on VET Blockchain Sees Explosive Trading Volume Surge Thanks to Superior Technology – Report ",
    "url": "https://www.crypto-news-flash.com/vechains-verocket-token-swap-platform-on-vet-blockchain-sees-explosive-trading-volume-surge-thanks-to-superior-technology-report/?utm_source=rss&utm_medium=rss&utm_campaign=vechains-verocket-token-swap-platform-on-vet-blockchain-sees-explosive-trading-volume-surge-thanks-to-superior-technology-report",
    "description": "VeRocket records an incredible surge in trading volume since March. Its permissionless and other interesting technologies are said to be the catalyst. VeRocket, a secure, fast, and audited Defi infrastructure on VeChain has reportedly recorded explosive trading volume since March. According to the report, the platform has some incredible features and experiences that contributed to [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-14T16:01:00.000Z",
    "title": "Anonymous Wallet Transfers 150K ETH to Coinbase, Is it a Selloff?",
    "url": "https://coinedition.com/anonymous-wallet-transfers-150k-eth-to-coinbase-is-it-a-selloff/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Assessing_the_chances_of_Ethereum_price_revisiting_the_triple_digit-3-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Assessing_the_chances_of_Ethereum_price_revisiting_the_triple_digit-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Assessing_the_chances_of_Ethereum_price_revisiting_the_triple_digit-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Assessing_the_chances_of_Ethereum_price_revisiting_the_triple_digit-3.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Crypto Tony, a trader and analyst retweeted Whale Alerts, a blockchain transaction surveyor’s tweet which stated that 149,999 ETH was transferred from an unknown wallet to Coinbase. The transferred ETH accumulates to $261,949,642. However, the reason behind this mass transaction is yet to be determined. It could be that the whale is gearing up to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/anonymous-wallet-transfers-150k-eth-to-coinbase-is-it-a-selloff/\">Anonymous Wallet Transfers 150K ETH to Coinbase, Is it a Selloff?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]