[
  {
    "source": "CoinDesk",
    "date": "2023-07-21T08:14:47.000Z",
    "title": "FTX Leadership Seeks Return of Over $1B in Cash, Stocks From Former Executives",
    "url": "https://www.coindesk.com/policy/2023/07/21/ftx-leadership-seeks-return-of-over-1b-in-cash-stocks-from-former-executives/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The lawsuit alleges that fraudulent transfers of cash and shares were used to finance political donations, real estate buys, Sam Bankman-Fried’s criminal defense, and even potentially an island."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-21T08:35:24.000Z",
    "title": "ChatGPT gains basic memory feature with new update",
    "url": "https://cryptoslate.com/chatgpt-gains-basic-memory-feature-with-new-update/",
    "description": "<p>OpenAI, the artificial intelligence research lab, has introduced a new update to its popular app, ChatGPT, the ability to set custom prompts across all chats. As OpenAI reported, this new feature brings a semblance of memory to the AI system, essentially allowing it to recall some context in its interactions with users. The update, called [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/chatgpt-gains-basic-memory-feature-with-new-update/\">ChatGPT gains basic memory feature with new update</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-21T08:35:00.000Z",
    "title": "Worldcoin Completes Migration To OP Mainnet",
    "url": "https://cryptodaily.co.uk/2023/07/worldcoin-completes-migration-to-op-mainnet",
    "description": "<p>Sam Altman-founded Worldcoin has completed its migration to the Optimism ecosystem, with critical components such as the World ID and World App technology stack already migrated to the OP mainnet.&nbsp;</p>\n<p>The project announced the news on Twitter, adding that user migration is currently ongoing.&nbsp;</p>\nA Significant Step&nbsp;\n<p>The Worldcoin Foundation (Worldcoin&rsquo;s initial steward) and other early contributors, such as Tools for Humanity (Lead Software Contributor), had announced a collaboration with the Optimism Collective. As part of the partnership between the organizations, the World App and the World ID protocol would migrate from Polygon to the Optimism mainnet. Worldcoin Foundation and Tools for Humanity had stated at the time,&nbsp;</p>\n\n<p>&ldquo;With more than 1.6 million sign-ups in beta and 500,000+ monthly active World App users, the deployments on OP Mainnet will expand access and help Worldcoin reach a values-aligned ecosystem of developers and users.&rdquo;</p>\n\n<p>With the World App and World ID migration to Optimism complete, World App has now begun the process of user migration from Polygon to Optimism, intending to scale Web3 identity and governance on the Optimism Superchain. World App users and World ID holders will see a plethora of changes, such as the Worldcoin protocol migrating to Ethereum to support World ID. Additionally, a majority of Safe wallets have been deployed on the OP mainnet, with the remainder set to be deployed on user-initiated migration. Following the migration, World App also supports Uniswap on the OP mainnet.&nbsp;</p>\nA Boost For Optimism&nbsp;\n<p>Worldcoin believes that the migration of World ID to the OP mainnet could significantly boost the capabilities of Optimism&rsquo;s Citizen House. Citizen House works in tandem with the Token House to govern the larger Optimism Collective. World ID could also help enhance Optimism Collective&rsquo;s AttestationStation, a shared database designed to make the verification of information easier, and creates a strong network of trust on OP chains within the Superchain.&nbsp;</p>\n<p>World ID SDK Publicly Available&nbsp;</p>\n<p>Worldcoin has also made its World ID software development kit (SDK) publicly available to developers through a limited waitlist. Worldcoin&rsquo;s World ID software development kit has been critical in building over 100 projects, including flagship integrations such as Okta&rsquo;s Auth0 and Talent Protocol. The former is a global authentication and authorization platform, while the latter is a social and economic platform designed for Web3 builders based in Europe.&nbsp;</p>\n<p>The World ID software development kit includes a developer portal, web widget (JS), development simulator, and a comprehensive guide. Thanks to its permissionless architecture, it can support open identity standards and currently supports OAuth 2.0 and OIDC (OpenID Connect). There are plans to introduce support for Verifiable Credentials (VCs), Decentralized Identifiers (DIDs), and Sign in with Ethereum (SIWE) in the near future.&nbsp;</p>\n<p>Just last week, Worldcoin hit a significant milestone, registering 2 million World ID signups in its beta phase. The signups are an indication of World ID&rsquo;s global reach and appeal, with users registering from several cities, such as Buenos Aires, New York, Berlin, Barcelona, Tokyo, and Seoul.&nbsp;</p>\nOptimism&rsquo;s Superchain\n<p>Optimism&rsquo;s Superchain is a network of Layer 2 solutions that share security and communication layers. Worldcoin began its collaboration with Optimism almost a year ago when they jointly contributed to EIP-4844. This Ethereum improvement proposal looked to improve Ethereum&rsquo;s scalability beyond what was achievable with current Layer 2 networks. According to Worldcoin, EIP-4844 would reduce Layer 2 fees by a factor of 10. At the time, Worldcoin had noted,&nbsp;</p>\n\n<p>&ldquo;EIP-4844 is now expected to be included in the next hard fork of Ethereum. Its potential to accelerate adoption in the Optimism ecosystem could also enable a significant boost in World App transactions across Ethereum L2s with the World App wallet&rsquo;s migration to OP Mainnet.&rdquo;</p>\n\n<p>World ID and World App&rsquo;s migration to the OP mainnet is the latest step in realizing Optimism&rsquo;s Superchain vision.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice. </p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T08:12:52.000Z",
    "title": "UK government plans strict regulations: banks risk license loss for political debanking",
    "url": "https://www.cryptopolitan.com/uk-government-plans-strict-regulations-banks-risk-license-loss-for-political-debanking/",
    "description": "The British government is considering implementing stringent regulations on banking licenses that could lead to the revocation of a bank&#8217;s consent if it chooses to debank individuals based on their political beliefs. The anticipated new measures, set to be disclosed next week by the U.K. Treasury, aim to prevent discrimination and uphold the principles of ... <a title=\"UK government plans strict regulations: banks risk license loss for political debanking\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uk-government-plans-strict-regulations-banks-risk-license-loss-for-political-debanking/\" aria-label=\"More on UK government plans strict regulations: banks risk license loss for political debanking\">Read more</a>"
  }
]