[
  {
    "source": "CoinDesk",
    "date": "2023-06-05T15:15:10.000Z",
    "title": "SEC Sues Crypto Exchange Binance, CEO Changpeng Zhao Over Multiple Securities Violation Allegations",
    "url": "https://www.coindesk.com/policy/2023/06/05/sec-sues-crypto-exchange-binance-ceo-changpeng-zhao/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Securities and Exchange Commission is suing crypto exchange Binance and its CEO, Changpeng \"CZ\" Zhao on allegations of violating federal securities laws."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-05T15:12:31.000Z",
    "title": "Virtual Reality Tokens Surge 8% as Traders Await Apple's VR Headset Release",
    "url": "https://www.coindesk.com/business/2023/06/05/virtual-reality-tokens-surge-8-as-traders-await-apples-vr-headset-release/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Cryptocurrency's virtual reality sector has surged by almost 8% over the past 24 hours as investors anticipate Apple's VR headset reveal on Monday."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-05T15:36:52.000Z",
    "title": "Binance and CZ sued by SEC for breaching securities law",
    "url": "https://cryptoslate.com/binance-and-cz-sued-by-sec-for-breaching-securities-law/",
    "description": "<p>The U.S. Securities and Exchange Commission (SEC) has filed a court action against Binance and company CEO Changpeng Zhao, Bloomberg reported June 5 A copy of the filing detailed accusations of ignoring federal securities law and placing investors at risk. It stated that the Defendants had profited in the billions by soliciting U.S. investors to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-and-cz-sued-by-sec-for-breaching-securities-law/\">Binance and CZ sued by SEC for breaching securities law</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-05T15:30:00.000Z",
    "title": "DeFi Boom Boosts Aave (AAVE), EOS (EOS) Struggles, and Sparklo's Rapid Progress: 2023 Predictions",
    "url": "https://cryptodaily.co.uk/2023/06/defi-boom-boosts-aave-aave-eos-eos-struggles-and-sparklos-rapid-progress-2023-predictions",
    "description": "<p class=\"s5\">As decentralized finance (DeFi) experiences phenomenal growth, the Aave (AAVE) token seems to be riding this wave, forecasting a bullish trend for 2023. On the flip side, EOS (EOS), another prominent player in the crypto space, is projected to face a challenging future, potentially slipping below the crucial $1 support level. </p>\n<p class=\"s5\">Meanwhile, Sparklo, a newcomer in the crypto arena, is making remarkable strides, demonstrating rapid progress that has captured the industry's attention.</p>\n<p class=\"s8\">2023 Forecasts: Sparklo's Impressive Growth Trajectory</p>\n<p class=\"s5\">Sparklo is set to revolutionize how we invest in precious metals in the digital realm. Making waves with its groundbreaking model, Sparklo allows investors to buy parts of a Non-Fungible Token (NFT), each one representing a physical asset. Additionally, the platform enables purchasing a complete NFT, with the tangible precious metal delivered to the owner.</p>\n<p class=\"s5\">Currently progressing through its second presale phase, Sparklo positions itself as a lucrative venture for aspiring investors. With a current price tag of just $0.030, renowned crypto analysts predict an impressive rise in Sparklo's value. Forecasts indicate an extraordinary 1,500% increase by the end of 2023, highlighting the potential rewards on offer.</p>\n<p class=\"s5\">The Sparklo smart contract's robustness has received the nod of approval from the Interfinetwork after rigorous auditing. To prevent any potential rugpull situations, the Sparklo team has committed to locking the liquidity for a hundred years, demonstrating their long-term vision. Backed by extensive research and promising prospects, Sparklo is shaping to be a promising investment contender for 2023. Interested investors can purchase tokens via the platform's linked partners.</p>\n<p>&gt;&gt;&gt;&gt; BUY SPARKLO TOKENS &lt;&lt;&lt;</p>\n<p class=\"s8\">Aave (AAVE) 2023 Forecast: DeFi Surge Bolstering Bullish Trajectory</p>\n<p class=\"s5\">In light of the escalating popularity of decentralized finance (DeFi), Aave's (AAVE/USD) 2023 trajectory seems promisingly bullish. With predictions indicating a top between $700 and $750, Aave (AAVE) is set to harness the power of this newfound adoption of digital currencies and their decentralized protocols. Further supporting this bullish trend, experts forecast a potential peak at $1,500 within the next two years, suggesting a sustained growth phase for Aave (AAVE) that could push trading values as high as $2,500 by 2026. These Aave (AAVE) projections are based on historic price trends and the increasing embracement of cryptocurrencies.</p>\n<p class=\"s5\">Founded in 2017 by Stani Kuchelov, Aave (AAVE) has evolved into a robust decentralized lending and borrowing protocol. Aave (AAVE) has paved the way for quicker loan processing with a revolutionary DeFi model that eliminates the need for matching lenders and borrowers. </p>\n<p class=\"s8\">EOS (EOS) in 2023: A Decline Towards Sub-Dollar Territory</p>\n<p class=\"s5\">Entering 2023, EOS (EOS), a popular cryptocurrency, faces challenging market dynamics. Ranked 49th in the crypto industry, the resilience of EOS is evident despite the 2022 crypto fallout. The strength of the EOS (EOS) network - a thriving and well-knit community of traders - ensures that EOS (EOS) maintains a foothold in the industry, irrespective of market fluctuations. However, EOS (EOS) current trajectory reveals a downward trendline, suggesting a dip below the $1 psychological support level. As of May 25th, 2023, EOS (EOS) to USDT trades at $0.861996, showing a decrease of 0.74% from the previous price.</p>\n<p class=\"s5\">By the end of 2023, EOS is projected to hover around the $1.14 mark, with a bottom lineexpectation of not less than $1.10. Although this shows signs of a possible return to its 2021 value of $2.77, it's essential to consider the market conditions and the factors affecting the cryptocurrency. Like other cryptos, EOS undergoes similar fluctuations, and the future growth patterns largely depend on the coin's inherent features and the broader crypto market sentiment.</p>\n<p class=\"s11\">Find out about the Sparklo presale using the links below</p>\n● Buy Presale: https://invest.sparklo.finance\n● Website: https://sparklo.finance\n● Twitter: https://twitter.com/sparklo_finance\n● Telegram: https://t.me/sparklofinance\n<p class=\"s15\">&nbsp;</p>\n<p class=\"s15\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-05T15:35:01.000Z",
    "title": "Former OKX exec Rachel Conlan joins Binance as Vice President of Global Marketing to drive expansion",
    "url": "https://www.cryptopolitan.com/rachel-conlan-joins-binance-as-vp-global-marketing/",
    "description": "Binance, one of the world&#8217;s leading cryptocurrency exchanges, has appointed Rachel Conlan as its new Vice President of Global Marketing. The move comes as the company looks to bolster its shrinking market share and expand its reach in the crypto space. Conlan, who previously held the position of Global Head of Brand and Partnerships at ... <a title=\"Former OKX exec Rachel Conlan joins Binance as Vice President of Global Marketing to drive expansion\" class=\"read-more\" href=\"https://www.cryptopolitan.com/rachel-conlan-joins-binance-as-vp-global-marketing/\" aria-label=\"More on Former OKX exec Rachel Conlan joins Binance as Vice President of Global Marketing to drive expansion\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-05T15:21:33.000Z",
    "title": "UK parliamentary group urges caution over UK CBDC",
    "url": "https://crypto.news/uk-parliamentary-group-urges-caution-over-uk-cbdc/",
    "description": "A report released by the U.K.'s All Party Parliamentary Group on crypto and digital assets urges the government to carefully consider the introduction of a CBDC, or \"digital pound.\""
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-05T15:30:06.000Z",
    "title": "IOTA is Here for the Long Term: ‘Trillions or Nothing,’ Says Dominik Schiener",
    "url": "https://www.crypto-news-flash.com/iota-is-here-for-the-long-term-trillions-or-nothing-says-dominik-schiener/?utm_source=rss&utm_medium=rss&utm_campaign=iota-is-here-for-the-long-term-trillions-or-nothing-says-dominik-schiener",
    "description": "<p>IOTA co-founder clarifies that the project is for the long term, but not a short-term pump.  An analyst lists factors that can drive the price to $10. IOTA (MIOTA) is one of the most real-world problem-solving crypto projects in the industry and is highly expected to dominate the market in different categories. Interestingly, the asset [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/iota-is-here-for-the-long-term-trillions-or-nothing-says-dominik-schiener/\">IOTA is Here for the Long Term: &#8216;Trillions or Nothing,&#8217; Says Dominik Schiener</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-05T15:29:02.000Z",
    "title": "A New Digital Frontier: The Melding of Artificial Intelligence and Blockchain Tech",
    "url": "https://www.crypto-news-flash.com/a-new-digital-frontier-the-melding-of-artificial-intelligence-and-blockchain-tech/?utm_source=rss&utm_medium=rss&utm_campaign=a-new-digital-frontier-the-melding-of-artificial-intelligence-and-blockchain-tech",
    "description": "<p>As two uniquely disruptive technologies, there is enough evidence to show that Artificial Intelligence (AI) and blockchain have been extremely transformational in their respective ways. And, as more and more firms look to utilize these two distinct paradigms in conjunction with one another, they stand to create an unparalleled synergy that promises to revolutionize a [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/a-new-digital-frontier-the-melding-of-artificial-intelligence-and-blockchain-tech/\">A New Digital Frontier: The Melding of Artificial Intelligence and Blockchain Tech</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]