[
  {
    "source": "Cryptopolitan",
    "date": "2023-10-29T10:56:17.000Z",
    "title": "South Korea Marks Its Presence at the Upcoming Global AI Safety Summit in Britain",
    "url": "https://www.cryptopolitan.com/south-korea-at-the-global-ai-safety-summit/",
    "description": "In an ambitious move marking its commitment to the emerging concerns around artificial intelligence (AI), South Korea has announced that it will be represented by key figures from the government, Samsung Electronics Co., and Naver Corp at an international AI safety summit scheduled for next month in Britain. Collaborative stance on AI safety The event, ... <a title=\"South Korea Marks Its Presence at the Upcoming Global AI Safety Summit in Britain\" class=\"read-more\" href=\"https://www.cryptopolitan.com/south-korea-at-the-global-ai-safety-summit/\" aria-label=\"More on South Korea Marks Its Presence at the Upcoming Global AI Safety Summit in Britain\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-29T10:44:34.000Z",
    "title": "Scottish Universities Consider Return to Pen and Paper Tests to Combat AI Cheating",
    "url": "https://www.cryptopolitan.com/universities-return-to-pen-and-paper-tests/",
    "description": "In recent months, Scottish universities have witnessed a concerning surge in the use of artificial intelligence (AI) by students to complete their coursework. The availability and accessibility of AI programs like ChatGPT have made it easier for students to automate the writing process, leading to a growing academic integrity issue. Lecturers across institutions have expressed ... <a title=\"Scottish Universities Consider Return to Pen and Paper Tests to Combat AI Cheating\" class=\"read-more\" href=\"https://www.cryptopolitan.com/universities-return-to-pen-and-paper-tests/\" aria-label=\"More on Scottish Universities Consider Return to Pen and Paper Tests to Combat AI Cheating\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-29T11:12:00.000Z",
    "title": "A decentralized revolution: Empowering the masses with home staking | Opinion",
    "url": "https://crypto.news/a-decentralized-revolution-empowering-the-masses-with-home-staking-opinion/",
    "description": "Home staking is crucial to the success and future of creating a more adoption-friendly web3 ecosystem."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-29T10:48:27.000Z",
    "title": "Bitcoin Bull Market: Crypto Spot Trading Volumes Climb To 8-Month Highs",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-crypto-spot-trading-volumes-climb/",
    "description": "Bitcoin&#8217;s surge past $35,000 on the 24th and 25th of October took the crypto world by surprise, as it indicated what might be the beginning of a new bullish sentiment. Trading volumes for the world&#8217;s largest cryptocurrency hit their highest levels since March, showing that interest in Bitcoin is booming once more. The entire crypto market saw an inflow of funds during the week, leading to a surge in market cap. Data from CoinGecko shows that the entire market cap increased from $1.184 trillion on Sunday, October 22, to $1.312 trillion on Wednesday, October 25. Most of this inflow went into Bitcoin, which saw its share of the cryptocurrency market increase from 49.58% to 51.47 % during this same time period.  Related Reading: Injective (INJ) Rules Weekend Top 50 Crypto Ranking With 60% Hike – Here’s Why Chart From CoinGecko Daily Crypto Exchange Volumes Reach 8-Month High The recent boom in Bitcoin and cryptocurrency prices pushed Bitcoin daily trading volumes on crypto exchanges to their highest level since March. According to The Block&#8217;s data dashboard, the seven-day moving average for spot exchange volumes across multiple exchanges hit $24.12 billion on Thursday and $23.98 billion on Friday, respectively. In comparison, Bitcoin trading volume on exchanges was at $11.02 billion on the first day of the month.  Chart from The Block A similar metric from IntoTheBlock shows Bitcoin transactions reaching 1.4 million BTC as bulls looked to push Bitcoin to $35,000. Chart from IntoTheBlock Trading volumes are an important metric because higher volumes suggest greater interest and activity in a market. It means more people are actively buying and selling, leading to more liquidity and volatility. Whale activity also increased during this time period, as indicated by on-chain trackers. Whale transaction tracker Whale Alerts has shown various BTC transactions amounting to millions of dollars to and from crypto exchanges.  🚨 🚨 🚨 2,000 #BTC (68,255,228 USD) transferred from #Coinbase to unknown wallethttps://t.co/SdIJ87ZxNT — Whale Alert (@whale_alert) October 26, 2023 🚨 🚨 🚨 2,000 #BTC (68,560,116 USD) transferred from unknown wallet to #Coinbasehttps://t.co/MJNn4HwswP BTCUSD trading at $34,187 on the weekend chart: TradingView.com — Whale Alert (@whale_alert) October 26, 2023 🚨 🚨 🚨 1,499 #BTC (51,276,429 USD) transferred from #Binance to #Coinbenehttps://t.co/lVaDk8pYio — Whale Alert (@whale_alert) October 27, 2023 What’s Next? More Bitcoin Movement? Bitcoin has since formed a resistance level around $35,000 and is now trading in a range. At the time of writing, Bitcoin is trading at $34,150, still up by 14.47% in a 7-day timeframe. While price action seems to be moving sideways at the moment, there are still hopes of continued momentum from the bulls to push BTC past $35,000 in the new week.  Related Reading: Aptos TVL Soars To A Record $74 Million, Reflecting Growing Investor Confidence Matt Hougan, CEO of crypto index fund manager Bitwise, has hinted at a further inflow of money into Bitcoin. Hougan makes this prediction on spot Bitcoin ETFs to project an inflow of around $50 billion within the first five years of its launch. Others like crypto financial services platform Matrixport have made more optimistic claims.  Data from analytics platform mempool.space has shown a sustained increase in activity on the BTC network. If bulls continue to maintain a strong push, we could see Bitcoin reach as high as $45,000 in the early days of November. Featured image from Shutterstock"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-29T11:00:00.000Z",
    "title": "Cardano (ADA) Is the Cryptocurrency of the Day, How Did It Happen?",
    "url": "https://coinedition.com/cardano-ada-is-the-cryptocurrency-of-the-day-how-did-it-happen/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/Charles-Hoskinson-Faces-Criticism-for-CS-from-Cardano-Community.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano Is the Cryptocurrency of the Day\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/Charles-Hoskinson-Faces-Criticism-for-CS-from-Cardano-Community.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/Charles-Hoskinson-Faces-Criticism-for-CS-from-Cardano-Community-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/Charles-Hoskinson-Faces-Criticism-for-CS-from-Cardano-Community-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/Charles-Hoskinson-Faces-Criticism-for-CS-from-Cardano-Community-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/Charles-Hoskinson-Faces-Criticism-for-CS-from-Cardano-Community-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/Charles-Hoskinson-Faces-Criticism-for-CS-from-Cardano-Community-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Cardano (ADA) has been named the cryptocurrency of the day for October 28, according to a post shared by X (formerly Twitter) CryptoDep. The token of the day is a list coined by the crypto social intelligence platform LunarCrush. To be top of the list, a project needs to have a significant surge in terms [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/cardano-ada-is-the-cryptocurrency-of-the-day-how-did-it-happen/\">Cardano (ADA) Is the Cryptocurrency of the Day, How Did It Happen?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]