[
  {
    "source": "CoinDesk",
    "date": "2023-11-01T13:00:41.000Z",
    "title": "FTX, Alameda Wallets Move Millions in Crypto to Exchanges: Spotonchain",
    "url": "https://www.coindesk.com/policy/2023/11/01/ftx-alameda-wallets-move-millions-in-crypto-to-exchanges-spotonchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Just over $13 million in crypto were moved to Binance and Coinbase overnight, data from Spotonchain show."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-01T13:01:02.000Z",
    "title": "Maple Finance Launches on Base Network, Targeting Institutional Activity",
    "url": "https://decrypt.co/203954/maple-finance-launches-base-network-targeting-institutional-activity",
    "description": "With corporate treasuries already a key clientele, Maple Finance hopes to tap Coinbase's institutional users with a launch on Base."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-01T13:08:00.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-01T12:52:52.000Z",
    "title": "Lego Natural History Museum Set to Enrich Miniature Cities",
    "url": "https://www.cryptopolitan.com/lego-museum-set-to-enrich-miniature-cities/",
    "description": "Lego aficionados and collectors are in for a treat this December 1st as the highly anticipated Lego Natural History Museum is set to hit the shelves. Part of the modular series of buildings, this $300 set promises to add a touch of historical culture to your Lego-built metropolis. With over 4,000 pieces included, this intricate ... <a title=\"Lego Natural History Museum Set to Enrich Miniature Cities\" class=\"read-more\" href=\"https://www.cryptopolitan.com/lego-museum-set-to-enrich-miniature-cities/\" aria-label=\"More on Lego Natural History Museum Set to Enrich Miniature Cities\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-01T13:01:30.000Z",
    "title": "Celestia mainnet launched, token tops social trend charts",
    "url": "https://crypto.news/celestia-mainnet-launched-token-tops-social-trend-charts/",
    "description": "TIA token, the native asset of the modular blockchain network Celestia, has been the top trending token on several social media and crypto platforms. The recent boost in its popularity coincides with Celestia&#8216;s launch of its mainnet beta on Oct.&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-01T12:59:27.000Z",
    "title": "Can FTX make a comeback after Bankman-Fried’s trial? ",
    "url": "https://crypto.news/can-ftx-make-a-comeback-after-bankman-frieds-trial/",
    "description": "FTX's potential relaunch hangs in the balance as founder Sam Bankman-Fried faces trial, challenging the exchange to rebuild trust and financial stability."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-01T12:56:40.000Z",
    "title": "Hackers hijack Frax Finance DNS domain",
    "url": "https://crypto.news/hackers-hijack-frax-finance-dns-domain/",
    "description": "The domain of the decentralized internet protocol Frax Finance has been captured by attackers. The protocol posted the news on X (formerly Twitter) on Nov. 1. The project team later reported that they had brought the domain back under control&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-01T12:51:04.000Z",
    "title": "Hong Kong’s HashKey unveils plans to launch ERC-20 utility token",
    "url": "https://crypto.news/hong-kongs-hashkey-unveils-plans-to-launch-erc-20-utility-token/",
    "description": "The token&#8217;s economic model will be &#8216;closely tied to the long-term interests of ecosystem contributors,&#8217; the firm said. HashKey Exchange is set to roll out its own ERC-20 token as the firm is seeking options to expand its regional presence&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-01T13:00:25.000Z",
    "title": "Solana Bull Run Could Smash Through $40 Barrier This Week – Here’s How",
    "url": "https://www.newsbtc.com/news/solana-bull-run-could-smash-through-40-barrier-this-week-heres-how/",
    "description": "Solana (SOL) remains on a relentless upward trajectory, defying even recent reports of the embattled crypto exchange FTX moving millions of funds in SOL and other tokens. The cryptocurrency is now hovering close to a critical resistance point at $40, showcasing remarkable resilience and determination.  As of the latest data from CoinGecko, the current SOL price stands at $37.96, reflecting a 5% increase in the past 24 hours and a seven-day surge of 21.3%. The journey toward $40 has been an exciting one, with SOL appreciating by approximately 80% from its intramonth low of around $21.07, a level it touched near October 12, as per CoinMarketCap figures. While SOL has demonstrated its potential, the looming question on everyone&#8217;s mind is whether it can indeed break through the $40 resistance and continue its bullish run. Related Reading: THORChain Beats Rivals In Top 100 Coin Rankings With 34% Rally – How RUNE Did It Solana Bullish Momentum And Technical Indicators Last week, there were ominous signs of a reversal when SOL dipped below the $30 mark. However, the Relative Strength Index (RSI) proved to be a strong support as it bounced off at 70, reinforcing the bullish sentiment among traders. This key technical indicator suggested that the cryptocurrency had more room to grow, encouraging traders to keep their buy positions open. An important turning point in SOL&#8217;s chart was an accumulation drive at the $30 mark. This price level allowed bulls to build the necessary momentum for the resumption of the uptrend. The subsequent surge catapulted Solana&#8217;s price above $35, bringing it closer to the elusive $40 milestone. Related Reading: Cardano Experiences Decline In Q3 Network Activity – Unraveling The Root Cause SOLUSD currently trading at $38.48 on the daily chart: TradingView.com The Path To $40 &#8211; Key Metrics To Watch As Solana inches closer to the $40 resistance, several key metrics and indicators are worth monitoring to gauge the cryptocurrency&#8217;s likelihood of breaking through this crucial barrier. Increasing trading volume often accompanies strong price movements. Traders should keep an eye on SOL&#8217;s trading volume as a surge in buying interest can indicate a potential breakout. Sentiment analysis across social media platforms, forums, and news sources can provide valuable insights into market sentiment. Positive sentiment may fuel the bullish drive, while negative sentiment could signal potential headwinds. The Solana ecosystem is dynamic and continuously evolving. Any significant developments, partnerships, or platform upgrades can influence SOL&#8217;s price trajectory. Solana&#8217;s journey to $40 is characterized by a combination of technical strength, market sentiment, and ecosystem developments. While it has shown remarkable resilience, achieving this milestone will depend on a confluence of factors. Traders and enthusiasts are eagerly watching for signs of a potential breakout, and the coming days will reveal whether SOL can maintain its bullish momentum and breach the $40 resistance. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-01T12:52:00.000Z",
    "title": "RLB Jumps 15% After Large Purchases by Whales: On-Chain Data",
    "url": "https://coinedition.com/rlb-jumps-15-after-large-purchases-by-whales-on-chain-data/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-3-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-3-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-3-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Lookonchain, the on-chain tracking platform, revealed in an X post that the price of Rollbit Coin (RLB) jumped 15% today. Subsequently, the altcoin was able to reach a new all-time high (ATH). According to the post, the cryptocurrency’s substantial increase in price may be linked to 4 whales who purchased several millions worth of RLB [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/rlb-jumps-15-after-large-purchases-by-whales-on-chain-data/\">RLB Jumps 15% After Large Purchases by Whales: On-Chain Data</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]