[
  {
    "source": "NewsBTC",
    "date": "2023-10-25T05:04:25.000Z",
    "title": "Ethereum Price Sees Technical Correction But Key Uptrend Support Intact",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-correction-1750/",
    "description": "Ethereum price rallied following Bitcoin and tested $1,850 against the US dollar. ETH is correcting gains, but the bulls might remain active near $1,750. Ethereum started a downside correction from the $1,850 resistance. The price is trading above $1,750 and the 100-hourly Simple Moving Average. There is a major bullish trend line forming with support near $1,755 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase unless there is a clear move below $1,750. Ethereum Price Remains Supported Ethereum started a strong increase above the $1,750 resistance. Bitcoin dragged ETH higher toward the $1,850 resistance before the bears appeared. A high is formed near $1,849 and the price is now correcting gains. It traded below the 23.6% Fib retracement level of the upward move from the $1,659 swing low to the $1,849 high. However, the price is still trading in a positive zone. Ethereum is now trading above $1,750 and the 100-hourly Simple Moving Average. There is also a major bullish trend line forming with support near $1,755 on the hourly chart of ETH/USD. The trend line is near the 50% Fib retracement level of the upward move from the $1,659 swing low to the $1,849 high. Source: ETHUSD on TradingView.com On the upside, the price is facing resistance near the $1,805 level. The first major resistance is near the $1,850 zone. The next key resistance is near $1,880. A close above the $1,880 resistance could send the price further higher. The next key resistance is $1,950, above which the price could accelerate higher. In the stated case, Ether could test the main $2,000 barrier. Any more gains might open the doors for a move toward $2,200. More Losses in ETH? If Ethereum fails to clear the $1,805 resistance, it could continue to move down. Initial support on the downside is near the $1,780 level. The next key support is $1,750 and the trend line zone. A downside break below the $1,750 support might send the price further lower. In the stated case, Ether could drop toward the $1,720 level. Any more losses may perhaps send Ether toward the $1,700 level and the 100-hourly Simple Moving Average. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,750 Major Resistance Level – $1,805"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-25T05:00:10.000Z",
    "title": "Bitcoin’s Surge Shakes Up ETF World: Who’s Soaring And Who’s Crashing?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcois-surge-shakes-up-etf-world-whos-soaring-crashing/",
    "description": "A ripple of excitement has recently coursed through the crypto market, particularly on Bitcoin. Bolstered by speculation regarding the impending approval of a spot Bitcoin exchange-traded fund (ETF) —a sentiment propelled by BlackRock&#8217;s iShares ETF&#8217;s appearance on the DTCC website—Bitcoin recorded an 18-month high trading above $35,000. This upward movement came on the heels of a notable 10% surge on Monday. ProShares Short Bitcoin Strategy ETF: A Declining Tale? Contrary to the general jubilance, not all BTC-related financial instruments are shared in the celebration. The ProShares Short BTC Strategy ETF, designed for traders banking on a decline in Bitcoin futures, grappled with a record low. Related Reading: Bitcoin Mania: EY Insider Reveals Demand From Wall Street Titans, $40,000 Soon? Just over a year ago, this fund basked in the glory of a peak value of $45.61; a zenith reached as crypto assets took a downturn in the aftermath of FTX&#8217;s collapse. However, this year, the ProShares Short Bitcoin Strategy ETF has faced challenges, its value diminishing by 59.3% to stand at $16.68, a historic nadir, at the time of writing. This dip didn&#8217;t deter investors. Despite the drop, the ProShares Short BTC ETF, boasting net assets of $62.98 million, is poised for its second consecutive month of inflows, according to data from Lipper. Lucas Kiely, the Chief Investment Officer at digital wealth platform Yield App, offered a perspective on this trend. He posited that the market might be &#8220;buying the rumor and selling the fact.&#8221; Kiely further elaborated that the BTC short ETF provides investors a unique opportunity to speculate on a potential BTC sell-off. The Chief Investment Officer noted: A lot of people think this rally is a short squeeze &#8211; we have no real news coming out and a lot of anticipation around the SEC&#8217;s approval or disapproval of these spot ETFs and people are getting ahead of themselves. Ultimately, the market is again buying the rumor and selling the fact and the BTC short ETF is the only way for investors to express the view BTC is going to sell off. Furthermore, Kiely suggested another motive behind investors&#8217; moves. With the surge in BTC&#8217;s value, some might be seeking to &#8220;lock in&#8221; their profits and, hence, are turning to the ETF as a hedge against potential future downturns. Other BTC-Related ETFs Enjoy The Rise Conversely, some BTC-associated ETFs rode the wave of optimism. The ProShares Bitcoin Strategy ETF, mirroring BTC futures alongside the Valkyrie Bitcoin Miners ETF, registered gains of 7.68% and 6.54%, respectively, over the past day.  Leading the pack among recently introduced funds that track Ethereum (ETH )futures was the Valkyrie Bitcoin and Ether Strategy ETF, with a commendable 7.64% uptick over the same period. Related Reading: All Clear For $40,000? Bitcoin Shows Little On-Chain Resistance Ahead Furthermore, BTC has retraced from its recent traded high of $35,000 and currently trades at $33,746, at the time of writing, still up 9.2% in the last 24 hours. Featured image from Unsplash, Chart from TradingView"
  }
]