[
  {
    "source": "Cointelegraph",
    "date": "2023-07-04T11:15:00.000Z",
    "title": "China to tighten control on exports of AI chip-making materials ",
    "url": "https://cointelegraph.com/news/china-to-tighten-control-on-exports-of-ai-chip-making-materials",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/66606f2a-ac65-441f-b002-136dda05c141.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Chinese government has announced that it plans to control the export of gallium and germanium products that are heavily used to produce semiconductors.</p>\n                    <p><p>The Chinese government has announced plans for export controls on metals predominantly used to manufacture semiconductors used in the development of artificial intelligence (AI) systems.</p><p>On July 3, the Chinese Ministry of Commerce issued a joint statement with the General Administration of Customs which said the controls are aimed at protecting the interests of national security and that it will require a government-issued license to export specific gallium and germanium products. </p><p>The controls begin on August 1 and include eight gallium-related products: gallium antimonide, gallium arsenide, gallium metal, gallium nitride, gallium oxide, gallium phosphide, gallium selenide and indium gallium arsenide.</p><p>They also cover six germanium products: germanium dioxide, germanium epitaxial growth substrate, germanium ingot, germanium metal, germanium tetrachloride and zinc germanium phosphide.</p><p>Gallium is a metal often found in electronics, with semiconductors being the most prominent use case along with transistors and lasers. It can also be used to make LEDs. Germanium is also used in the creation of semiconductors, along with solid-state electronics and fiber optic systems. </p><p>The statement said anyone who exports such products without proper permission or in excess will be punished. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/state-sponsored-chinese-ai-firm-launches-bot-service-to-surpass-chatgpt\"><strong><em>State-sponsored Chinese AI firm launches bot service to ‘surpass’ ChatGPT</em></strong></a></p><p>According to a 2023 <a href=\"https://single-market-economy.ec.europa.eu/sectors/raw-materials/areas-specific-interest/critical-raw-materials_en\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from the European Commission and the European Association of Critical Raw Materials Alliance (CRMA), “the global supply of germanium is still highly concentrated in China.”  The CRMA has also reported over 80% of the world’s gallium coming from China.</p><p>In October 2022 the US. imposed sanctions that deprived Chinese developers of accessing the most advanced semiconductors on the market. These included Nvidia’s A100 chips and the latest version, the H100. </p><p>Nvidia chips A800 and H800, are currently accessible within the Chinese market. However, due to lesser technology, they can only support small-scale AI models. Chinese companies have been said to be <a href=\"https://cointelegraph.com/news/china-is-developing-ai-without-us-chips-here-s-how\">searching for workarounds</a> to the lack of access. </p><p>Currently, officials in the U.S. are mulling over <a href=\"https://cointelegraph.com/news/us-considers-tightening-restrictions-on-ai-chip-exports\">the possibility of additional restrictions</a> on their already imposed limitations to exports of high-level AI chips needed to produce powerful systems. </p><p>Since the AI boom, Nvidia, a major developer of coveted semiconductors, has seen its <a href=\"https://cointelegraph.com/news/nvidia-ai-chip-value-skyrockets-amid-ai-development-boom\">chip value skyrocket</a>. Cointelegraph reached out to Nvidia to comment on the recent developments out of China, however they did immediately respond. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-travel-booking-bad-3-weird-uses-chatgpt-crypto-plugins/\"><strong><em>AI Eye: AI travel booking hilariously bad, 3 weird uses for ChatGPT, crypto plugins</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-04T11:10:04.000Z",
    "title": "Ripple executives applaud UK crypto regulations, claim US lags behind",
    "url": "https://cryptoslate.com/ripple-executives-applaud-uks-crypto-regulations-claim-us-lags-behind/",
    "description": "<p>Ripple senior executives Andrew Whitworth and Susan Friedman have praised the United Kingdom&#8217;s approach to the crypto industry, arguing that the country was leaving the United States behind regarding crypto regulations. The executives made these statements in reaction to the Royal approval of the Financial Services and Markets Bill, which made crypto trading a regulated [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ripple-executives-applaud-uks-crypto-regulations-claim-us-lags-behind/\">Ripple executives applaud UK crypto regulations, claim US lags behind</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T11:32:40.000Z",
    "title": "Meta challenges Twitter with launch of new app",
    "url": "https://www.cryptopolitan.com/meta-challenges-twitter-with-launch-of-new-app/",
    "description": "Meta is set to launch Threads, its own rival to the popular social media platform. Expected to debut on Thursday, Threads will offer a text-based platform similar to Twitter, allowing users to publish posts, engage in discussions, and share content. The app will be closely linked to Meta&#8217;s photo-sharing platform, Instagram, enabling seamless portability of ... <a title=\"Meta challenges Twitter with launch of new app\" class=\"read-more\" href=\"https://www.cryptopolitan.com/meta-challenges-twitter-with-launch-of-new-app/\" aria-label=\"More on Meta challenges Twitter with launch of new app\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T11:21:54.000Z",
    "title": "Hong Kong Is winning the battle for crypto dominance leaving the US  behind- Yat Siu",
    "url": "https://www.cryptopolitan.com/hong-kong-is-winning-on-crypto-dominance/",
    "description": "Hong Kong is shifting its attitude towards blockchain technology, cryptocurrencies, and Web3, which is attracting the attention of industry experts and potentially enticing businesses away from the United States. The city has been actively fostering the development of the Web3 space and enabling retail investment in cryptocurrencies. A notable step in this direction is the ... <a title=\"Hong Kong Is winning the battle for crypto dominance leaving the US  behind- Yat Siu\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hong-kong-is-winning-on-crypto-dominance/\" aria-label=\"More on Hong Kong Is winning the battle for crypto dominance leaving the US  behind- Yat Siu\">Read more</a>"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-04T11:25:28.000Z",
    "title": "Top 7 Altcoins For JULY 2023",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-7-altcoins-for-july-2023/",
    "description": "<p>July is a very important month for many reasons: The US-SEC regulation scenario, the big funds filling ETFs, the Riiple-SEC lawsuit, and the beginning of the bull run are things that can make this month something very special. In this article, you will discover 7 important altcoins that are ready to explode: #1: BitTorrent (BTT) [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-7-altcoins-for-july-2023/\">Top 7 Altcoins For JULY 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]