[
  {
    "source": "CryptoSlate",
    "date": "2023-08-28T10:00:41.000Z",
    "title": "Bitcoin network reaches unprecedented 400 th/s amid global energy concerns",
    "url": "https://cryptoslate.com/insights/bitcoin-network-reaches-unprecedented-400-th-s-amid-global-energy-concerns/",
    "description": "<p>Quick Take The Bitcoin network has witnessed a significant milestone, with its hash rate peaking at 400 terahashes per second (th/s), a first in its history. This development is particularly noteworthy considering the ongoing energy crises in Texas and escalating electricity prices globally. The growth pattern closely mirrors the events preceding the 2020 halving, where [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-network-reaches-unprecedented-400-th-s-amid-global-energy-concerns/\">Bitcoin network reaches unprecedented 400 th/s amid global energy concerns</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-28T10:00:00.000Z",
    "title": "\n                        Bitcoin further downside unless…\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/bitcoin-further-downside-unless",
    "description": "\n                        <p dir=\"ltr\">With no new inflows into the crypto market bitcoin is slowly sinking. An impulse is needed from somewhere if bitcoin is to gain new momentum.</p>\nSinking lower\n<p dir=\"ltr\">Bitcoin is very much still below its daily and weekly moving averages, indicators that are pointing to further downside unless something fairly momentous pushes the price back above.</p>\n<p dir=\"ltr\">Bitcoin has found some support at the $26,000 level, but is currently pushing steadily against this. A break here is likely to see the price drop down to major support at $24,000, and possibly to $21,000, $19,000, and even back to the lows.</p>\n<p dir=\"ltr\">One thing is looking much more certain for this bitcoin bull market, and that is the cycle is lengthening. Declining returns is another factor. Some analysts are pointing to how bitcoin is making less gains with each succeeding bull market.</p>\n<p dir=\"ltr\">With this in mind, it might be likely that bitcoin only gets as far as $100k this bull market. Perhaps a blow-off top could take it to $150k, but when you look at percentage gains for previous bull markets, this potential best-case scenario is only a 6x from here.</p>\n<p dir=\"ltr\">Therefore, bitcoin could certainly take its time and drop lower from here. Is this a bad thing? For those looking to make a fast buck, yes. But for those looking for long term gains and a reliable store of value outside of the legacy monetary system, lower prices mean being able to buy more.</p>\n<p dir=\"ltr\">However, as always in markets, the least expected route is the one that may well be followed. There are factors that are bubbling away in the background that could change bitcoin&rsquo;s trajectory in an extremely decisive way.</p>\nMomentum can be regained\n<p dir=\"ltr\">Not least among these is the impending decision for a bitcoin spot ETF. This coming Friday, the SEC has to make its decision on whether 6 large and influential institutions will be granted the capacity to launch their own spot ETFs, and by doing so, provide the rocket fuel to propel bitcoin out of its current doldrums.</p>\n<p dir=\"ltr\">Of course, the SEC could just decide to put the decision back, so this particular impulse may have to wait until perhaps early next year. Another way around this may come from the D.C. Circuit Court of Appeals, which is due to decide on Grayscale vs SEC. Should this go in Grayscale&rsquo;s favour, the SEC could be obliged to approve a spot ETF given that it has already approved several futures ETFs.</p>\n<p dir=\"ltr\">Whether up, down, or sideways, bitcoin is the asset of the future that provides an alternative to our deeply unfair and corrupt monetary system. The largest institutions are coming to this realisation - it is to be hoped that the common man and woman can also manage to ignore the mainstream media misdirection.</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T09:53:15.000Z",
    "title": "CEHV founder questions SBF’s plea for more trial prep time",
    "url": "https://www.cryptopolitan.com/cehv-founder-questions-sbfs-plea-for-more-trial-prep-time/",
    "description": "Adam Cochran, the founder of venture capital firm Cinneamhain Ventures (CEHV), has taken to Twitter to criticize the legal team of Sam Bankman-Fried (SBF), founder of crypto firm FTX. The lawyers had objected to the court&#8217;s current plan to provide SBF with discovery materials, calling it “plainly inadequate” and stating that it violates Fried&#8217;s Sixth ... <a title=\"CEHV founder questions SBF&#8217;s plea for more trial prep time\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cehv-founder-questions-sbfs-plea-for-more-trial-prep-time/\" aria-label=\"More on CEHV founder questions SBF&#8217;s plea for more trial prep time\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-28T09:51:38.000Z",
    "title": "OnlyFans invested $20m in Ethereum in 2022",
    "url": "https://crypto.news/onlyfans-invested-20m-in-ethereum-in-2022/",
    "description": "In a recent filing, OnlyFans' revealed its Ethereum holdings which faced market turbulence as 2022 proved a bear market for the crypto realm."
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-28T09:53:48.000Z",
    "title": "The Great Bitcoin Comeback: Will Alpha Coin Retake $28,000 Before August Ends?",
    "url": "https://www.newsbtc.com/news/bitcoin/the-great-bitcoin-comeback-will-alpha-coin-retake-28000-before-august-ends/",
    "description": "Bitcoin (BTC) is currently marked by cautious sentiments as the Crypto Fear and Greed Index holds steady within the fear zone, scoring 39 out of 100 and showing a slight increase from the previous day. This sentiment reflects the prevailing uncertainty in the cryptocurrency realm. Amidst this backdrop, Bitcoin&#8217;s price trend takes center stage, influenced by the evolving dynamics of the market. Related Reading: Shiba Inu Nears Make-Or-Break Resistance Barrier – What Awaits Traders? Zooming in on the price action reveals a distinct pattern on the 4-hour timeframe. Bitcoin&#8217;s price, guided by a falling channel pattern, traces a consistent downtrend, oscillating between two parallel trendlines. This price movement hints at the formation of a well-recognized bullish reversal pattern, known as the falling parallel channel. At its current valuation of $25,877 according to CoinGecko, Bitcoin experienced a minor 0.6% dip in the last 24 hours and a marginal 0.3% decline over the past week. Despite these fluctuations, the price behavior strikingly emulates the falling parallel channel, suggesting the potential for a shift in momentum. Deciphering Bitcoin Falling Parallel Channel The falling parallel channel is a technical pattern often observed during a downtrend. It features two parallel trendlines encompassing the price action within a defined range. The lower trendline provides a support level, while the upper trendline acts as resistance. This pattern typically indicates a possible trend reversal, with a breakout above the upper trendline indicating an imminent bullish recovery. For Bitcoin, a significant breakout involving a 4-hour candle closure above the upper trendline could trigger the anticipated bullish bounce. This potential surge, according to price analysis, has the capacity to propel prices upwards by approximately 8%, leading to a retest of the $28,500 resistance.  However, prudence remains paramount as the overarching trend still displays negative undertones. Traders and cryptocurrency holders are urged to proceed cautiously at this resistance point, as the potential for sellers to regain bearish momentum persists, possibly resulting in an extended corrective phase. Bitcoin (BTC) is currently trading at $25.928. Chart by TradingView.com Understanding The Fear And Greed Index&#8217;s Significance In a sentiment-driven market, the Crypto Fear and Greed Index holds substantial importance. It offers valuable insights into the collective psychological state of investors and traders, shedding light on their overall outlook. A prolonged presence within the lower spectrum, exemplified by the current fear score of 39/100, underscores the prevailing apprehension and uncertainty among market participants. This underscores the need for judicious decision-making amidst the interplay of technical patterns and market sentiment. Related Reading: Worldcoin Meltdown: 50% Crash Caused By Mounting Data Privacy Paranoia The sustained position of the Crypto Fear and Greed Index within the fear zone, coupled with Bitcoin&#8217;s price dynamics marked by the falling parallel channel, underscores the intricate interplay of forces within the cryptocurrency market. As traders closely monitor the potential breakout and its potential repercussions, exercising caution remains pivotal in navigating this intricate landscape. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Makersplace"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-28T10:03:23.000Z",
    "title": "Shiba Inu’s Shibarium Average Block Time is 5 Seconds – Can It Drive SHIB Price to $0.0001 and Ignite a New Bull Run? Report",
    "url": "https://www.crypto-news-flash.com/shiba-inus-shibarium-average-block-time-is-5-seconds-can-it-drive-shib-price-to-0-0001-and-ignite-a-new-bull-run-report/",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-96.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-96.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-96-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Shibarium, the Shiba Inu Layer-2 blockchain, boasts a swift average block time of just 5 seconds. SHIB holders show caution, but on-chain data signals potential bullish action on the horizon. CoinHub, the premier source for crypto news, reports an exciting development: Shibarium now claims an average block time of 5 seconds, marking it as one [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-28T10:02:47.000Z",
    "title": "SpaceX’s Bitcoin (BTC) Move Sparks August Correction: JPMorgan Predicts Limited Crypto Downside Ahead",
    "url": "https://www.crypto-news-flash.com/spacexs-bitcoin-btc-move-sparks-august-correction-jpmorgan-predicts-limited-crypto-downside-ahead/",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/stock-market-g1ffda500d_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"JPMorgan\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/stock-market-g1ffda500d_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/stock-market-g1ffda500d_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/stock-market-g1ffda500d_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/stock-market-g1ffda500d_1920-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/stock-market-g1ffda500d_1920-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/stock-market-g1ffda500d_1920-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/stock-market-g1ffda500d_1920-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/stock-market-g1ffda500d_1920-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/stock-market-g1ffda500d_1920-48x32.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />JPMorgan analysis indicates the crypto market decline is abating with settled long positions. Elon Musk&#8217;s Bitcoin reduction China concerns contributed to the downturn. A recent analysis conducted by JPMorgan Chase &#38; Co. suggests that the current decline in the cryptocurrency markets is coming to an end. The company contends that the liquidation of long positions [...]"
  }
]