[
  {
    "source": "CoinDesk",
    "date": "2023-11-13T09:24:53.000Z",
    "title": "Grayscale Discount Continues to Narrow as Spot Bitcoin, Ether ETF Euphoria Works Through Markets",
    "url": "https://www.coindesk.com/markets/2023/11/13/grayscale-discount-continues-to-narrow-as-spot-bitcoin-ether-etf-euphoria-works-through-markets/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Prices on the major cryptocurrencies stabilized after a rally at the end of the U.S. trading week, while crypto winter continues to thaw in every part of the market from bitcoin to ether and DEXs."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-13T09:35:56.000Z",
    "title": "French millennials embrace crypto investments amid rising digital influence",
    "url": "https://cryptoslate.com/french-millennials-embrace-crypto-investments-amid-rising-digital-influence/",
    "description": "<p>The investment landscape in France is witnessing a significant shift, with an increase in interest in crypto among younger citizens. A recent study published by the Autorité des marchés financiers (AMF) and conducted by Audirep reveals intriguing insights into the evolving behaviors and preferences of new retail investors in France, with a notable emphasis on [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/french-millennials-embrace-crypto-investments-amid-rising-digital-influence/\">French millennials embrace crypto investments amid rising digital influence</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-13T09:30:28.000Z",
    "title": "Bianco Research President Foresees Spot Bitcoin ETF Launch Mirroring Facebook’s 2012 IPO Trajectory",
    "url": "https://www.cryptoglobe.com/latest/2023/11/bianco-research-president-foresees-spot-bitcoin-etf-launch-mirroring-facebooks-2012-ipo-trajectory/",
    "description": "Jim Bianco, a prominent macro strategist, recently shared insights suggesting that the launch of a spot Bitcoin exchange-traded fund (ETF) could mirror the market trajectory of Facebook’s 2012 initial public offering (IPO). Jim Bianco, serving as President and Macro Strategist at Bianco Research, L.L.C., has been a notable figure in financial analysis since 1990. His […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T09:33:56.000Z",
    "title": "“I guess ETF is a big deal in the US, but not elsewhere,” Changpeng ‘CZ’ Zhao",
    "url": "https://www.cryptopolitan.com/etf-is-a-big-deal-in-the-us-not-elsewhere-cz/",
    "description": "The Bitcoin ETF mania has swept over the decentralized financial industry, and one of the crypto bigwigs has something to say about it. Changpeng &#8220;CZ&#8221; Zhao, the CEO of Binance, has been an influential figure in crypto and the DeFi ecosystem, and his thoughts on a Bitcoin exchange traded-funds should be taken into account. While ... <a title=\"&#8220;I guess ETF is a big deal in the US, but not elsewhere,&#8221; Changpeng &#8216;CZ&#8217; Zhao\" class=\"read-more\" href=\"https://www.cryptopolitan.com/etf-is-a-big-deal-in-the-us-not-elsewhere-cz/\" aria-label=\"More on &#8220;I guess ETF is a big deal in the US, but not elsewhere,&#8221; Changpeng &#8216;CZ&#8217; Zhao\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T09:26:32.000Z",
    "title": "Ulster University Professor’s VR Program Revolutionizes Goalkeeping Training",
    "url": "https://www.cryptopolitan.com/ulster-professors-vr-reshapes-goalkeeping/",
    "description": "Ulster University Professor Cathy Craig, an expert in experimental psychology, has developed a groundbreaking virtual reality (VR) sports program called CleanSheet. Partnering with her husband, Dr. Adrien Kissenpfennig, they founded the neuro-technology start-up INCISIV five years ago. CleanSheet, recently launched on the Meta Quest store, promises to transform aspiring goalkeepers&#8217; skills and decision-making through immersive ... <a title=\"Ulster University Professor&#8217;s VR Program Revolutionizes Goalkeeping Training\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ulster-professors-vr-reshapes-goalkeeping/\" aria-label=\"More on Ulster University Professor&#8217;s VR Program Revolutionizes Goalkeeping Training\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-13T09:22:20.000Z",
    "title": "Bitcoin mining difficulty reached new maximum",
    "url": "https://crypto.news/bitcoin-mining-difficulty-reached-new-maximum/",
    "description": "As a result of the next recalculation, the difficulty of Bitcoin mining increased by 3.55%. The indicator updated its maximum at 64.68 T, according to BTC.com. The average hashrate since the previous value change was 479 EH/s. The range between&#8230;"
  }
]