[
  {
    "source": "CoinDesk",
    "date": "2023-09-28T19:19:51.000Z",
    "title": "Bitcoin Tops $27K as Rates and Oil Retreat; Ether Outperforms on ETF Hopes",
    "url": "https://www.coindesk.com/markets/2023/09/28/bitcoin-tops-27k-as-rates-and-oil-retreat-ether-outperforms-on-etf-hopes/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Cryptocurrency markets surged higher Thursday, with the price of bitcoin (BTC) breaking above the $27,000 level for the first time alongside easing macro pressures."
  },
  {
    "source": "CoinDesk",
    "date": "2023-09-28T19:10:45.000Z",
    "title": "Ripple Cancels Plan to Buy Fortress Trust",
    "url": "https://www.coindesk.com/business/2023/09/28/ripple-cancels-plan-to-buy-fortress-trust/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "\"While this outcome is different from what was originally planned, we’ll continue to support them and hope to work together in the future,\" said CEO Brad Garlinghouse."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-28T19:13:25.000Z",
    "title": "These Paris Fashion Week Outfits Transform Under Ultraviolet Light",
    "url": "https://decrypt.co/199218/anrealage-paris-fashion-week-outfits-transform-under-ultraviolet-light",
    "description": "Anrealage delivered a head-turning runway at Paris Fashion Week, spotlighting designer Kunihiko Morinaga's latest color-changing outfits."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-28T19:16:45.000Z",
    "title": "Ripple pulls back from Fortress acquisition 20 days after announcement",
    "url": "https://cointelegraph.com/news/ripple-pulls-back-fortress-acquisition",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/7b02d21a-eb56-4c6b-96bb-3e5dfd42bef4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ripple’s CEO Brad Garlinghouse shared the news on X, saying it will remain an investor in Fortress Trust. </p>\n                    <p><p>Within 20 days of announcing the acquisition of Fortress Trust to allegedly expand its pool of licenses in the United States, financial technology firm Ripple is pulling out of the deal. </p><p>Ripple’s CEO Brad Garlinghouse made the announcement on X (formerly Twitter) on Sept. 28, saying that “we’ve since made the decision not to move forward with an outright acquisition,” although Ripple will remain a shareholder in Fortress Trust’s parent company Fortress Blockchain Technologies. </p><p>Ripple first <a href=\"https://cointelegraph.com/news/ripple-acquires-fortress-trust-expands-license-portfolio-united-states\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ripple-acquires-fortress-trust-expands-license-portfolio-united-states/amp\">announced the acquisition on Sept. 8</a>, surprising even company insiders with the news, Cointelegraph has learned. At the time, Ripple revealed plans to acquire other companies in the Fortress' group, including an affiliated firm, FortressPay. </p><p>A few days later, Fortress Trust acknowledged that the acquisition <a href=\"https://cointelegraph.com/news/ripple-security-incident-accelerated-fortress-trust-acquisition\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ripple-security-incident-accelerated-fortress-trust-acquisition/amp\">was rushed by a security incident</a> involving a third-party analytics vendor. In an interview with Fortune, Fortress CEO Scott Purcell said the company lost $12 million to $15 million in the attack. A majority of the funds were Bitcoin (BTC), along with small amounts of USD Coin (USDC) and Tether (USDT). Ripple, an investor in Fortress since its seed round in 2022, had to step in to make customers whole. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">A few weeks ago, we signed a letter of intent to acquire Fortress Trust – we’ve since made the decision not to move forward with an outright acquisition, though Ripple will remain an investor in <a href=\"https://twitter.com/Fortress_io?ref_src=twsrc%5Etfw\">@Fortress_io</a>.</p>— Brad Garlinghouse (@bgarlinghouse) <a href=\"https://twitter.com/bgarlinghouse/status/1707455045942292954?ref_src=twsrc%5Etfw\">September 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In comments to Cointelegraph, Purcell said the merging cancelation “is not a big deal\". According to him, the plan change is unrelated to the security incident. \"They are an investor in Fortress and a great partner, nothing changes there,\" he noted.</p><p> Cointelegraph reached out to Ripple, but the company declined to comment beyond its CEO's X post. </p><p>As Ripple continues its high-profile legal battle with the United States Securities and Exchange Commission, the deal failure could benefit other companies linked to Fortress. </p><p>Swan Bitcoin, for example, <a href=\"https://cointelegraph.com/news/bitgo-swan-unveil-bitcoin-only-trust-company\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitgo-swan-unveil-bitcoin-only-trust-company/amp\">is working on a joint venture with BitGo</a> to create a Bitcoin-only trust company in the U.S., which is pending regulatory approval. Fortress Trust provides custody of records for Swan. As the deal collapsed, Swan will no longer be involved in Ripple's business in the country.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Blockchain detectives — Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-09-28T19:12:12.000Z",
    "title": "Ethereum’s Holesky Testnet Goes Live After Initial Failed Attempt",
    "url": "https://cryptobriefing.com/ethereums-holesky-testnet-goes-live-after-initial-failed-attempt/?utm_source=feed&utm_medium=rss",
    "description": "The Ethereum developer community successfully launched the Holesky testnet, positioned to become Ethereum's largest testnet."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-28T19:30:41.000Z",
    "title": "Russia’s Yuan Shift: EBRD Economist Warns of Waning US Dollar Dominance",
    "url": "https://news.bitcoin.com/russias-yuan-shift-ebrd-economist-warns-of-waning-us-dollar-dominance/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/chndnnd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Russia&#039;s Yuan Shift: EBRD Economist Warns of Waning US Dollar Dominance\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/chndnnd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/chndnnd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/chndnnd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/chndnnd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/chndnnd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/chndnnd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/chndnnd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a recent interview, the European Bank for Reconstruction and Development&#8217;s (EBRD) chief economist, Beata Javorcik, highlighted a notable trend: Russia&#8217;s growing inclination to transact in the Chinese yuan. This shift, the economist emphasized, could challenge the dominance of the U.S. dollar. &#8220;[The] increase in the usage of the Chinese currency is coming at the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T19:32:21.000Z",
    "title": "Meta Unveils Plans to Launch 28 AI Chatbots Featuring Celebrities and Influencers",
    "url": "https://www.cryptopolitan.com/meta-unveils-plans-to-launch-28-ai-chatbots/",
    "description": "Mark Zuckerberg, the CEO of Meta, formerly known as Facebook, made a significant announcement during the company&#8217;s annual Connect conference. Meta revealed its intention to introduce 28 AI chatbots, with half of them being portrayed by celebrities and influencers. The goal is to engage a younger audience and provide assistance in various activities, from gaming ... <a title=\"Meta Unveils Plans to Launch 28 AI Chatbots Featuring Celebrities and Influencers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/meta-unveils-plans-to-launch-28-ai-chatbots/\" aria-label=\"More on Meta Unveils Plans to Launch 28 AI Chatbots Featuring Celebrities and Influencers\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-28T19:27:39.000Z",
    "title": "Back To BlockShine ☀️",
    "url": "https://www.newsbtc.com/all/back-to-blockshine-%e2%98%80%ef%b8%8f/",
    "description": "As I kid I remember reading a Donald Duck story about him being frustrated that people were different to him. In the story, he then all of a sudden multiplied to be in the city with just various versions of himself, leading everything to be a total mess. Turns out, we need different views, temperaments, skills, and cultural standpoints to make this whole planet thing work. These days, when ever you have something real to say, you are a threat to someone. We&#8217;ve lost the idea that some of our bad ideas should die facing better ones in public conversations, so we don&#8217;t all have to die by the bad ideas. As it is perceived by many that there is no transcendent realm, many feel like their ideas is who they are. So challenging ideas, even shitty ones, feels like dying to them. We are each others checks and balances, if this democracy thing is done right, but it goes beyond it. We are born with different temperaments to maintain the balance of the cosmos, even if the planets collide into one another on occasion. A simpler way is trying a make a NY socialite do your farm growing. As hinted towards in the previous article, the art world is by en large, is still totally clueless about the value of digital decentralised certificates. The human desire to erase the parts we don&#8217;t like, multiply ourselves in an attempt to reach utopia, and play power games &#8211; without accountability &#8211; led to this multiplied Donald Duck nightmare. Real inclusivity means inclusivity of temperaments and ideas foreign to us, and that is HARD work to live with. The law of entropy means something Ayn Rand once said: You Can Avoid Reality, But You Cannot Avoid the Consequences of Avoiding Reality The Fork and Flip piece now works in AR via the Artivive app From Vantaa to Dubai When I was a kid, a couple kids used to call me &#8220;big head&#8221; as my head was disproportionately bigger than the rest of my body. It was true at that point, but I figure it had also something to do with those big ideas I had, that didn&#8217;t really fit into the sub-urban grey Vantaa school setting. I&#8217;m sure you&#8217;ve never heard of Vantaa, but that has something to do with big ideas not being so common there, even if some individuals reach escape velocity. Not saying it was Bronx in the 70&#8217;s, but as tough environments damage us, but they also breed sisu. This is a Finnish term equivalent to something like grit, but it doesn&#8217;t quite cover it. It has been a very useful thing throughout my life, as I keep being animated and inspired by big ideas. &#160; This bubble head figure is being turned into a 50cm 3D statue by the talented and idea filled Hadrien from Arteier3D. We met through Hamad Al Ali from Yalla Group earlier in Dubai, and kept in touch figuring out ways to work together. Getting this statue done is a great honor for me with a sentiment reaching all the way to some lemons being made into lemonade since a kid. It comes to show that through working hard enough and pushing for a vision, things become possible. Very grateful for this whole process now, even if part of the pain remains as the rocket fuel to elevate further still. &#160; More on this collab later, as we are onto even bigger ideas. Renaissance 360 continued The Desert Rose piece from the MIrrors series. Blow up at the Theatre of Digital Art in Dubai Would you live here? Would you fly in this? Thanks to Mic Kuisma, that I finally met in person at the Tmrw Conf in Serbia, I was introduced to Martin from White Mammoth studios. He is now responsible for the implementation of &#8220;Desert Rose&#8221; into a fantastic render of a villa as well as a jet, giving a vision on where we are headed. We will be working together on many things, to which this is a great start. What does it look like, when liabilities get turned into assets via a creative art &#38; licence process utilising digital certificates? Can assets be turned into further value through the same process? Before heading to Finland this summer, due to the kind introduction of H.E Amna Fikri, we had a meeting with the eloquent H.E Fahad Al Gergawi, who is the Chief Executive Officer of the Dubai Investment Development Agency (Dubai FDI). We keep being inspired by the vision of Dubai and UAE, as well as feel there is a significant contribution we can add to the region via our Renaissance 360 concept. &#160; fT NFT at Dubai Mall &#160; Pioneering physical and digital integration, the ftNFT Art Gallery located at the Dubai Mall is one of its kind. The super sleek store, equipped with screens and opens space to showcase physical works and merchandise, stands as the grand creative experiment of the Fastex exchange. VESA has always worked to bridge physical and digital together, so a partnership between the two was a natural evolution. Tom Badley&#8217;s &#8220;Art &#38; Money&#8221; show is currently on, so please check that out. Team VESA has consulted for the gallery over the summer, and now the partnership will turn to exhibiting VESA at their location. &#8220;Million Dirham Hotel&#8221; is one of the ones being sold as a motion NFT coming with a physical piece that launches the AR animation. &#8220;Caramel&#8221; is one of the ones being sold as a motion NFT coming with a physical piece that launches the AR animation. The show will include some OG Crypto artworks as re-paints as well as new works from the Mirrors series. Some of them were last seen in Toda Dubai at the MKO concert. The opening night will be on the 11th of November at Dubai Mall / ftNFT store. Check them out here: FT NFT GALLERY &#160; I mean, just WOW! If you’ve been to this event, you already know. WOW Summit (8.-9. October) is back, bigger, and more lavish than before. One of the most epic events in town, WOW reunites once again the spearheading keynote speakers, Founders, panelists, and thought leaders of our industry. VESA will be featured on a panel on NFTs during the event, and excitingly on the first night, he will give a presentation before the gala dinner for the VIP guests. Looks &#160; This was from a previous presentation at WOW Summit 2021 at the Atlantis hotel conference room. Primal Scream While we live in a gas light planet, I don&#8217;t know if you are doing well or not, but this will give a kick to your day! Enjoy! Catch you at the events, Keep your flag high, VESA &#38; Lotta Crypto &#38; NFT Artist All links to physical, NFTs, and more below http://linktr.ee/ArtByVesa &#160;"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-28T19:23:00.000Z",
    "title": "CZ Explains Migration Process in Wake of Binance’s Russia Exit",
    "url": "https://coinedition.com/cz-explains-migration-process-in-wake-of-binances-russia-exit/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/BINANCE-CEO-9.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/BINANCE-CEO-9.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/BINANCE-CEO-9-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/BINANCE-CEO-9-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/BINANCE-CEO-9-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/BINANCE-CEO-9-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/BINANCE-CEO-9-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>CEO of Binance Changpeng Zhao provided clarification after announcing the sale of Binance&#8217;s Russia business to digital asset exchange CommEx, which launched on September 26 and is backed by crypto VCs. Zhao explained that as Russian users migrate to CommEx, some cross-platform crypto transfers between the exchanges will occur to move funds. He noted similar [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/cz-explains-migration-process-in-wake-of-binances-russia-exit/\">CZ Explains Migration Process in Wake of Binance&#8217;s Russia Exit</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-28T19:20:50.000Z",
    "title": "Radix Babylon Upgrade Marks New Era for Web 3.0 User and Developer Experience",
    "url": "https://dailyhodl.com/2023/09/28/radix-babylon-upgrade-marks-new-era-for-web-3-0-user-and-developer-experience/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/Radix-Industry-Announcement-Featured-Image-Template-1-1-1.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/Radix-Industry-Announcement-Featured-Image-Template-1-1-1.jpg 1500w, https://dailyhodl.com/wp-content/uploads/2023/09/Radix-Industry-Announcement-Featured-Image-Template-1-1-1.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/09/Radix-Industry-Announcement-Featured-Image-Template-1-1-1.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/09/Radix-Industry-Announcement-Featured-Image-Template-1-1-1.jpg?resize=768,768 768w, https://dailyhodl.com/wp-content/uploads/2023/09/Radix-Industry-Announcement-Featured-Image-Template-1-1-1.jpg?resize=1024,1024 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/Radix-Industry-Announcement-Featured-Image-Template-1-1-1.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/09/Radix-Industry-Announcement-Featured-Image-Template-1-1-1.jpg?resize=350,350 350w, https://dailyhodl.com/wp-content/uploads/2023/09/Radix-Industry-Announcement-Featured-Image-Template-1-1-1.jpg?resize=750,750 750w, https://dailyhodl.com/wp-content/uploads/2023/09/Radix-Industry-Announcement-Featured-Image-Template-1-1-1.jpg?resize=1140,1140 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>September 28, 2023 – London, England Decentralized ledger platform Radix Publishing has celebrated the successful completion of its long-anticipated Babylon mainnet upgrade. The Babylon upgrade represents the end of the Olympia era and has been hailed by Radix as a game-changing moment for Web 3.0 and the wider DeFi space. The Babylon mainnet upgrade has [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/28/radix-babylon-upgrade-marks-new-era-for-web-3-0-user-and-developer-experience/\">Radix Babylon Upgrade Marks New Era for Web 3.0 User and Developer Experience</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]