[
  {
    "source": "Cointelegraph",
    "date": "2023-09-11T05:53:45.000Z",
    "title": "Weekend Wrap: SBF's internet sucks, BlackRock denies Voyager buy and more",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-on-the-weekend",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/49ce4f13-5053-4197-842f-530122a6b860.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to get caught up with what happened in crypto over the weekend? Here’s the latest on crypto regulation, Bitcoin, blockchain, DeFi and Web3. </p>\n                    <p><h3>Sam Bankman-Fried on dial-up level internet</h3><p>Former FTX CEO Sam Bankman-Fried’s lawyers have again asked a court to temporarily release the former FTX boss claiming the poor internet connection in his Brooklyn prison is interfering with their trial prep.</p><p>In a Sep. 8 <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590940/gov.uscourts.nysd.590940.271.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">letter</a> to District Judge Lewis Kaplan, Bankman-Fried’s lawyer Mark Cohen said his client can’t access an internet-enabled computer twice a week for four to five hours <a href=\"https://cointelegraph.com/news/sam-bankman-fried-lawyers-push-temporary-release-object-prosecutors-proposed-deal\">as previously agreed to</a> with United States prosecutors.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/4cf007c6-8f79-4e5a-b8e1-1fc5e6ddc1c1.png\"  /><figcaption style=\"text-align: center;\"><em>Cohen’s letter to Judge Lewis Kaplan. Source: CourtListener</em></figcaption></figure><p>Citing an Aug. 30 incident, Cohen claimed Bankman-Fried lost two hours of “review time” due to an unrelated delay involving another inmate at the prison.</p><p>Once Bankman-Fried was eventually brought up to the visiting room the internet connection was so slow that it took 10 minutes for the home page to load, his lawyers claimed.</p><blockquote>“By 1:00pm — 1.5 hours later — Mr. Bankman-Fried was only able to load one document from the database to review. Effectively, Mr. Bankman-Fried had no access to the internet for the entire 5-hour period.”</blockquote><p>“The defendant cannot prepare for trial with these kinds of limitations,” the letter reads.</p><p>Cohen claimed Bankman-Fried hasn’t been able to effectively prepare for his trial for the better part of a month and pushed for a temporary release saying it’s necessary in order to make up for the lost time.</p><h3>BlackRock’s purchase of Voyager was one big lie</h3><p>Asset management giant BlackRock has denied buying bankrupt crypto brokerage firm Voyager Digital — despite a widely shared press release stating otherwise.</p><p>A Sep. 8, a fake press <a href=\"https://world.einnews.com/pr_news/654615188/blackrock-enters-in-cryptocurrency-market-by-acquiring-voyager-digital\" target=\"_blank\" rel=\"noopener nofollow\">release</a> — <a href=\"https://apnews.com/press-release/ein-presswire-newsmatics/currency-markets-blockchain-82a5279560afc617ff9bf1aaeadc2135\" target=\"_blank\" rel=\"noopener nofollow\">syndicated</a> to the Associated Press — claimed that BlackRock planned to acquire Voyager, citing “industry insiders.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/0f8fbd42-08ab-4bec-81cb-5136f8be155a.png\"  /><figcaption style=\"text-align: center;\"><em>Faked press release of BlackRock’s purchase of Voyager on AP. Source: Associated Press</em></figcaption></figure><p>A BlackRock spokesperson told Cointelegraph it’s not acquiring Voyager and stories suggesting otherwise are false.</p><p>As first noted by crypto journalist Colin Wu in an X (Twitter) <a href=\"https://twitter.com/WuBlockchain/status/1700504956414099601\" target=\"_blank\" rel=\"noopener nofollow\">post</a> the same day, the social media account linked at the bottom of the release directed to a newly-created X <a href=\"https://twitter.com/JoyTyger930897\" target=\"_blank\" rel=\"noopener nofollow\">account</a> with one post and one follower.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/965e3a3d-0b08-4fcb-8a71-ac673fd21d69.png\"  /><figcaption style=\"text-align: center;\"><em>The social media account linked at the bottom of the faked press release set its display name to “Voyager” but its handle is “@JoyTyger930897.” Source: X</em></figcaption></figure><p>EINPresswire was seemingly the first to post the press release, which shows a company called MK Digiworld provided the news. That company’s <a href=\"https://mkdigiworld.com/\" target=\"_blank\" rel=\"noopener nofollow\">website</a> only directs users to message a Pakistan-based number.</p><p>Voyager’s VGX token still spiked 15% to $0.153 within 12 hours of the AP’s syndication on Sept. 9. However the token has since returned to $0.126, <a href=\"https://www.coingecko.com/en/coins/voyager-token\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to CoinGecko.</p><h3>Remember the guy who threw 8,000 BTC in the trash?</h3><p>Early Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) investor James Howells is gearing up for a lawsuit against a south Wales council over its refusal to let him try to dig up and find a hard drive he threw out over 10 years ago containing 8,000 BTC.</p><p>In a Sep. 8 report in the British paper The Telegraph, Howells said the hard drive was accidentally binned by his ex — ending up in a tip managed by Newport City Council.</p><p>Since then Howells has been fighting with the council about getting into the tip to find the drive — which it’s refused multiple times citing the negative environmental impact of digging up rubbish.</p><p>On Sep. 4, Howells sent an open letter to the council demanding he’s allowed to access the dump and start work by Sep. 18 or face a lawsuit with damages seeking nearly $560 million — more than double what the stash would be currently worth at nearly $206 million.</p><p>“I’ve tried everything I can for 10 years,” Howells said. “They didn’t want to play ball, so now we have to go down the legal route.”</p><p>Previously, Howells has proposed a venture-backed <a href=\"https://cointelegraph.com/news/crypto-user-who-lost-163m-in-bitcoin-wants-to-deploy-robot-search-party-report\">$11 million project</a> to dig up the drive that would employ artificial intelligence and robot dogs to sort the trash along with experts in excavation, waste management and data extraction.</p><h3>Someone pays $500,000 in Bitcoin fees</h3><p>The online crypto community has been left scratching their heads over a single Bitcoin transaction where someone paid nearly 20 BTC, or over $515,000 in fees.</p><p>The Sep. 10 transaction was <a href=\"https://twitter.com/whale_alert/status/1700920065934213256\" target=\"_blank\" rel=\"noopener nofollow\">picked</a> up by the blockchain-tracking X account Whale Alert and pseudonymous X user “mononaut” posted the transaction “makes absolutely no sense.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">My best guess is that this was created manually by pasting addresses and amounts into some kind of wallet software.<br><br>they meant to set a fee of 8632 sats, but accidentally pasted an output into the fee box, turning it into 1982108632 sats, then broadcast without double-checking.</p>&mdash; mononaut (@mononautical) <a href=\"https://twitter.com/mononautical/status/1700936879695179989?ref_src=twsrc%5Etfw\">September 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“My best guess is that this was created manually by pasting addresses and amounts into some kind of wallet software,” mononaut wrote.</p><p>They explained the user may have accidentally pasted an output amount into the fee box of the software then sent the transaction without checking.</p><p>Bitcoin wallet provider Casa co-founder Jameson Lopp said the transaction “looks like an exchange or payment processor with buggy software.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The transaction that paid nearly 20 BTC ($500,000) fee a few hours ago looks like an exchange or payment processor with buggy software.<br><br>They&#39;ve received 60,000+ txns and sent 60,000+ txns from the same address (bad practice) and likely calculated their change output incorrectly. <a href=\"https://t.co/s44Yc8S2ia\">pic.twitter.com/s44Yc8S2ia</a></p>&mdash; Jameson Lopp (@lopp) <a href=\"https://twitter.com/lopp/status/1700985810714239222?ref_src=twsrc%5Etfw\">September 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>He added the address seems to operate as a businesses “withdraw-only hot wallet” and probably miscalculated a <a href=\"https://cointelegraph.com/learn/what-is-bitcoin-a-beginners-guide-to-the-worlds-first-cryptocurrency\">change output</a> due to having around the same number of sent and received transactions.</p><h3>Also making news</h3><p>The X account of Ethereum co-founder Vitalik Buterin <a href=\"https://cointelegraph.com/news/ethereum-vitalik-buterin-x-hackers-drain\">was compromised</a> on Sep. 9 with hackers posting a phishing link that led to them netting a nearly $700,000 payday.</p><p>The same day, FTX sued cross-chain protocol LayerZero Labs to try <a href=\"https://cointelegraph.com/news/ftx-sues-layer-zero-labs-seeks-recover-millions-bankruptcy\">claw back $21 million</a> allegedly illegally withdrawn prior to the crypto exchange’s November 2022 bankruptcy.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-banters-ran-neuner-says-xrp-is-despicable-tips-hat-to-zachxbt-hall-of-flame/\"><strong><em>Hall of Flame: Crypto Banter’s Ran Neuner says Ripple is ‘despicable,’ tips hat to ZachXBT</em></strong></a></p><p class=\"post-content__disclaimer\">Additional reporting by Brayden Lindrea. </p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-11T05:44:40.000Z",
    "title": "The Impact of Artificial Intelligence on the Media Industry: Challenges and Opportunities",
    "url": "https://www.cryptopolitan.com/the-impact-of-ai-on-the-media-industry/",
    "description": "Artificial intelligence (AI) is swiftly changing the media landscape, prompting concerns and opportunities. News Corporation&#8217;s CEO, Robert Thomson, has highlighted issues related to job losses, content quality, and AI&#8217;s broader societal influence. Concerns about job displacement Robert Thomson has raised a red flag regarding the potential for AI to displace jobs within the media sector. ... <a title=\"The Impact of Artificial Intelligence on the Media Industry: Challenges and Opportunities\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-impact-of-ai-on-the-media-industry/\" aria-label=\"More on The Impact of Artificial Intelligence on the Media Industry: Challenges and Opportunities\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-11T05:56:06.000Z",
    "title": "Shiba Inu’s Shibarium: The Rocket Fuel for SHIB, BONE, and LEASH Tokens to New All-Time Highs",
    "url": "https://www.crypto-news-flash.com/shiba-inus-shibarium-the-rocket-fuel-for-shib-bone-and-leash-tokens-to-new-all-time-highs/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-shibarium-the-rocket-fuel-for-shib-bone-and-leash-tokens-to-new-all-time-highs",
    "description": "<img width=\"1920\" height=\"1277\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1.0.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shina Inu\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1.0.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1.0-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1.0-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1.0-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Lucie announces the successful Shibarium launch and addresses initial doubts (FUDs). Discord admin Da Vinci sees Shibarium as a catalyst for SHIB, BONE, and LEASH. The relaunch of Shibarium, Shiba Inu&#8217;s Layer 2 network, has brought immense joy to the SHIB community and the broader cryptocurrency enthusiasts. On August 28, Shiba Inu&#8217;s leader, Shytoshi Kusama, [...]"
  }
]