[
  {
    "source": "Crypto Daily",
    "date": "2023-06-30T07:56:00.000Z",
    "title": "Former First Lady Melania Trump Launches New NFT Collection",
    "url": "https://cryptodaily.co.uk/2023/06/former-first-lady-melania-trump-launches-new-nft-collection",
    "description": "<p>Melania Trump, the former first lady of the United States, has launched a new NFT collection to celebrate the country&rsquo;s Independence Day, inspired by the nation&rsquo;s iconic landmarks.&nbsp;</p>\n<p>The collection, called &ldquo;The 1776 Collection,&rdquo; consists of a six-piece range of NFTs consisting of images sourced from across the United States of America.&nbsp;</p>\nTrump Family NFTs Make A Comeback&nbsp;\n<p>The Trump family is back in the NFT space with the launch of Melania Trump&rsquo;s new NFT collection inspired by the upcoming Independence Day holiday. The launch of the new collection comes only a couple of months after former president Donald Trump released the second set of his NFT trading cards. The new set of collectibles launched by the former first lady is part of &ldquo;The 1776 Collection.&rdquo;</p>\n<p>The NFTs are based on the Solana blockchain and feature several iconic images, including prominent landmarks such as Mount Rushmore and the Statue of Liberty, affixed to animated placards. Each NFT is priced at $50, with the collection comprising seven different designs, making up a total of 3500 NFTs. The NFTs can be purchased through a website called USA Collectibles, with Melania Trump retweeting the company&rsquo;s original tweet about the NFT collection going on sale. The USA Collectibles website also offers POTUS TRUMP NFTs, which feature photos of former President Trump and the former first lady. Melania Trump stated,&nbsp;</p>\n\n<p>&ldquo;The 1776 Collection of artwork draws inspiration from several iconic landmarks of our nation, which I had the privilege of visiting during the time I served as first lady. Each piece provides a view into our nation&rsquo;s history, culture, and patriotism. I am proud to celebrate our great nation and remain inspired by the words contained within the Declaration of Independence.&rdquo;</p>\n\n<p>The collection went live on the 29th of July.&nbsp;</p>\nPortion Of Proceeds To Benefit Foster Kids&nbsp;\n<p>According to reports, a portion of all proceeds from the collection will go towards Fostering The Future, an initiative by BeBest. The initiative helps children in the foster care community secure educational opportunities and scholarships. Primarily, the Fostering the Future initiative aims to grant computer science scholarships to children coming out of the foster care system, helping them achieve the academic foundation needed to secure technology-based jobs. The former first lady also added that her commitment towards the foster community has grown stronger since leaving Washington DC.&nbsp;</p>\n<p>Melania Trump also added that she supports former President Trump&rsquo;s reelection campaign and looks forward to working with him once again and restoring hope for the future and leading America. She stated that if she could serve as the first lady again, she would continue to prioritize initiatives that focus on the well-being and development of children, ensuring that they reach their full potential.&nbsp;</p>\nThe Trumps And NFTs&nbsp;\n<p>The Trumps have considerable history in the NFT ecosystem going back at least a couple of years. It was Melania Trump who first jumped into the NFT space with the release of her first NFT in December 2021. The NFT was also based on the Solana blockchain. However, Solana Labs, the entity behind the Solana blockchain, clarified that it was not a Solana-led initiative. The former first lady released more NFTs in 2022 before former president Donald Trump released his popular digital trading cards collection, consisting of around 45,000 NFTs. The collection was launched on Polygon, an Ethereum scaling solution, and each NFT was priced at $99. Furthermore, each NFT in the collection was tied to special perks, such as a potential dinner with the ex-president.&nbsp;</p>\n<p>While the collection was widely ridiculed, it sold out within 24 hours and became the talk of the NFT space, causing their resale value to surge. At the peak of their popularity, the cards were starting at a price of over $1000 on secondary marketplaces. The former president then released a second collection, consisting of 47,000 NFTs, causing the original NFTs&rsquo; price to fall considerably. At present, the original Trump NFTs start at around $185, while NFTs from the second collection start at approximately $54.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T08:07:29.000Z",
    "title": "Polygon 2.0 Architecture Unveiled, MATIC Price Surges by 5.6%",
    "url": "https://www.cryptopolitan.com/polygon-2-0-unveiled-matic-price-surges-by-5/",
    "description": "Polygon, the Layer-2 scalability platform co-founded by Sandeep Nailwal, has reached a significant milestone with the unveiling of its highly anticipated Polygon 2.0 architecture. The announcement not only marks a major advancement for the project but has also had a positive impact on the market performance of Polygon&#8217;s native cryptocurrency, MATIC, which experienced a notable ... <a title=\"Polygon 2.0 Architecture Unveiled, MATIC Price Surges by 5.6%\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-2-0-unveiled-matic-price-surges-by-5/\" aria-label=\"More on Polygon 2.0 Architecture Unveiled, MATIC Price Surges by 5.6%\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T08:00:48.000Z",
    "title": "Crypto scams soaring, Blockchain Australia CEO demands urgent action",
    "url": "https://www.cryptopolitan.com/crypto-scams-soaring-ceo-demands-action/",
    "description": "Simon Callaghan, the new CEO of Blockchain Australia, is calling for collaboration between Australia&#8217;s banks, government, and the crypto industry to tackle the increasing number of crypto scams. During his speech at Australian Blockchain Week in Melbourne on June 30, Callaghan emphasized the importance of protecting consumers and announced that the association would prioritize efforts ... <a title=\"Crypto scams soaring, Blockchain Australia CEO demands urgent action\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-scams-soaring-ceo-demands-action/\" aria-label=\"More on Crypto scams soaring, Blockchain Australia CEO demands urgent action\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T07:41:18.000Z",
    "title": "Melania Trump launches “The 1776 NFT Collection” featuring iconic landmarks in the US",
    "url": "https://www.cryptopolitan.com/melania-trump-launches-the-1776-collection/",
    "description": "Former First Lady of the United States, Melania Trump, has launched another NFT collection, &#8220;The 1776 Collection,&#8221; ahead of the Independence Day celebration on July 4. The NFT collection features three thousand digital tokens with seven different designs. Melania launches the 1776 Collection Melania Trump&#8217;s new NFT collection draws inspiration from various iconic landmarks in ... <a title=\"Melania Trump launches &#8220;The 1776 NFT Collection&#8221; featuring iconic landmarks in the US\" class=\"read-more\" href=\"https://www.cryptopolitan.com/melania-trump-launches-the-1776-collection/\" aria-label=\"More on Melania Trump launches &#8220;The 1776 NFT Collection&#8221; featuring iconic landmarks in the US\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-30T07:56:38.000Z",
    "title": "Solana Makes A Comeback: 15% Rally Signals Renewed Momentum",
    "url": "https://www.newsbtc.com/news/solana-makes-a-comeback-15-rally/",
    "description": "Solana (SOL) has staged an impressive comeback, igniting renewed momentum in the crypto space with a decent 15% rally. The blockchain platform has been making significant strides as of late, particularly in the realm of non-fungible tokens (NFTs).  Over the past few weeks, Solana&#8217;s NFT trade counts and trade volume have experienced a notable surge, underlining the platform&#8217;s growing popularity among artists, collectors, and enthusiasts. Adding to the excitement, SOL&#8217;s price witnessed a significant uptick in the last 24 hours, further fueling investor interest and cementing its position as one of the most promising cryptocurrencies in the market. Related Reading: Dogecoin Faces Downward Pressure – Will DOGE Bulls Avert A Further Slide? The recent surge in NFT activity on Solana reflects the platform&#8217;s increasing appeal for digital creators seeking efficient and eco-friendly solutions for tokenizing and trading their unique artworks and digital assets. Top Solana Projects by Active Users (Last 7D)@MagicEden$RARI @rarible$MEAN @meanfinance$GARI @Chingari_IN$SBR @Saber_HQ$GENE @genopets@solincinerator@SharkyFi$RAY @RaydiumProtocol$TFMC @tapfantasy2021@dappradar #Solana $SOL pic.twitter.com/n4HTxmMcjA — Solana Daily (@solana_daily) June 28, 2023 Solana&#8217;s Magic Eden Triggers Active Users Surge In a noteworthy update highlighted by Solana Daily, a renowned Twitter account dedicated to sharing updates about the Solana ecosystem, it was revealed that Magic Eden has emerged as the project with the highest number of active users in the past week. This development showcases the growing popularity and adoption of Magic Eden within the Solana community. The blockchain&#8217;s metrics further substantiate this narrative of growth. According to data from Dune, Solana&#8217;s NFTs have observed a significant increase in the total number of transaction counts over the recent weeks. Source: Dune Analytics The increasing level of transaction activity is matched by a corresponding surge in transaction volume, highlighting the growing enthusiasm and involvement in Solana&#8217;s NFT marketplace. SOL up 15.4% in the last 24 hours. Source: Coingecko As a result of these positive developments, SOL, the native cryptocurrency of Solana, has experienced a substantial surge of 15.4% within the past 24 hours alone. CoinGecko reports that SOL&#8217;s price has reached $18.63, consolidating its upward momentum. This consistent climb has persisted over the past seven days, with SOL climbing 11.0%. SOL market cap currently at $7.3 billion. Chart: TradingView.com Altcoin&#8217;s Popularity On The Rise According to a recent report on SOL&#8217;s price, it is evident that the altcoin experienced an increase in popularity over the course of last week. This rise in popularity was reflected in the surge of social volume surrounding the token. As more users engaged in discussions and shared information about SOL on various social media platforms, it became clear that interest in the altcoin was growing steadily. Moreover, SOL&#8217;s weighted sentiment also witnessed an upward trajectory during the same period. This indicates that the overall sentiment surrounding the token was predominantly positive. Investors and enthusiasts expressed optimism and confidence in SOL, which contributed to the overall positive sentiment observed in discussions and sentiment analysis. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Unsplash"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-30T07:46:18.000Z",
    "title": "Never Skip A Korea Pump? Bitcoin Cash Soars 168% in 10 Days",
    "url": "https://www.newsbtc.com/news/bitcoin-cash/never-skip-korea-pump-bitcoin-cash-soars-168-10-days/",
    "description": "The Bitcoin Cash (BCH) price has gone through the roof in recent days. Within the last ten days, the Bitcoin fork has risen by a staggering 168%, temporarily BCH was already up over 200% today. While Bitcoin Cash was still trading at $104 on June 20 and was stuck in a deep bull market that looked bad even compared to other altcoins, a miracle occurred 10 days ago. The price exploded out of nowhere. Why Is Bitcoin Cash Experiencing A Revival? As NewsBTC reported, the reasons for the phenomenal rise in BCH&#8217;s price have already been discussed hotly over the past few days. It was often heard that the listing on the new crypto exchange EDX Markets, which is backed by industry giants Citadel Securities, Charles Schwab Corp. and Fidelity Digital Assets, favored BCH. Furthermore, it has been argued that the price increase is also due to Bitcoin Cash&#8217;s recent &#8220;game-changing&#8221; upgrade. In mid-May, Bitcoin Cash underwent a hard fork that not only improved the network&#8217;s security and privacy measures, but also introduced plans for CashTokens. However, the real reasons for the current Bitcoin Cash pump seem to lie elsewhere: namely in South Korea. Chinese crypto journalist Colin Wu reports today that South Korea could be the reason for the BCH pump, looking at where much of the trading volume originates. Related Reading: Kaching! Bitcoin Cash (BCH) Price Explodes Over 100% – What’s Powering It? In the last 24 hours, the largest exchange in South Korea, Upbit, recorded over $350 million in trading volume for BCH/KRW, accounting for 23.58% of the total trading volume for BCH. Moreover, it is also three times the trading volume of BTC/KRW on Upbit &#8211; an anomaly that has extreme rarity. Renowned crypto whale and trader Andrew Kang agrees, stating that the current BCH rally reminds him of the multi-week Aptos (APT) battle between Korean retailers and &#8220;professional traders.&#8221; Never Skip A Korea Pump? &#8220;Koreans didn&#8217;t need a reason to bid, all that mattered is that it kept going up and early bears got slaughtered,&#8221; Kang said. The trader is alluding to APT&#8217;s 500% rally earlier this year. Related Reading: Bitcoin Cash Surges 20% In One Day As Market Rebounds, What’s Next? South Koreans pumped Aptos because of a joke about housing affordability. APT&#8217;s trading volume on the South Korean crypto exchange UpBit was often higher than the total trading volume on Binance at the time. It was also beneficial that the Aptos Foundation marketed the altcoin to Koreans from day one. According to Alex Shin, co-founder of crypto venture capital firm Hashed, South Korean crypto investors took Aptos&#8217; three-letter ticker &#8220;APT&#8221; and turned it into a meme alluding to how absurdly expensive it is to buy an &#8220;apartment&#8221; in South Korea. Asia expert Wu said at the time that &#8220;pumping altcoins is a tradition in the Korean community.&#8221; Kang concluded: &#8220;People are shorting more BCH than there is liquid supply of it. It’s highly illiquid since most of the supply is dead. Imagine fading the original cartel&#8221; and added &#8220;disbelief pump.&#8221; At press time, BCH changed hands for $300 per coin. Featured image from Binance Academy, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-30T08:00:29.000Z",
    "title": "This New AI Crypto Could Be The Next Ethereum (ETH). Experts Believe It Could Match The Explosive Growth.",
    "url": "https://www.crypto-news-flash.com/this-new-ai-crypto-could-be-the-next-ethereum-eth-experts-believe-it-could-match-the-explosive-growth/?utm_source=rss&utm_medium=rss&utm_campaign=this-new-ai-crypto-could-be-the-next-ethereum-eth-experts-believe-it-could-match-the-explosive-growth",
    "description": "Cryptocurrencies are full of potential investment opportunities, with new projects constantly emerging. InQubeta (QUBE), a revolutionary AI project, has garnered attention for its unique combination of artificial intelligence and blockchain technology. In fact, it shows promising signs reminiscent of the early days of Ethereum (ETH), one of the most successful and influential cryptocurrencies to date. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-30T07:42:56.000Z",
    "title": "Breaking: FOMO Alert! CME Group Launching Game-Changing Ether/Bitcoin Ratio Futures, Unleashing New Trading Opportunities",
    "url": "https://www.crypto-news-flash.com/breaking-fomo-alert-cme-group-launching-game-changing-ether-bitcoin-ratio-futures-unleashing-new-trading-opportunities/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-fomo-alert-cme-group-launching-game-changing-ether-bitcoin-ratio-futures-unleashing-new-trading-opportunities",
    "description": "CME Group, a dominant player in the global derivatives marketplace, is set to introduce Ether/Bitcoin Ratio futures on July 31, pending regulatory approval. The cash-settled futures contract will allow investors to capture both Ether and Bitcoin exposure in a single trade, without the need for a directional view. Chicago Mercantile Exchange (CME) Group, a leading [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-30T08:05:41.000Z",
    "title": "Analyst Predicts ADA Could Rise 15% If SOL Breaks Above $18.83",
    "url": "https://coinedition.com/analyst-predicts-ada-could-rise-15-if-sol-breaks-above-18-83/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Cardano-And-Solanas-Prices-Jump-Significantly-In-2023.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Analyst Predicts ADA Could Rise 15% If SOL Breaks Above $18.83\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Cardano-And-Solanas-Prices-Jump-Significantly-In-2023.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Cardano-And-Solanas-Prices-Jump-Significantly-In-2023-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Cardano-And-Solanas-Prices-Jump-Significantly-In-2023-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Cardano-And-Solanas-Prices-Jump-Significantly-In-2023-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Cardano-And-Solanas-Prices-Jump-Significantly-In-2023-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Cardano-And-Solanas-Prices-Jump-Significantly-In-2023-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Dan Gambardello predicted that ADA could rise 15% in the coming few days. The analyst’s forecast follows SOL’s gain in the past 24 hours, which he believes will be replicated by ADA. At press time, ADA was trading at $0.2824 after it gained 3.97% over the past 24 hours. The crypto trader and analyst Dan [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/analyst-predicts-ada-could-rise-15-if-sol-breaks-above-18-83/\">Analyst Predicts ADA Could Rise 15% If SOL Breaks Above $18.83</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]