[
  {
    "source": "Bitcoin.com",
    "date": "2023-06-22T01:30:44.000Z",
    "title": "Federal Reserve Chairman Says Crypto Appears to Have Staying Power in US Economy",
    "url": "https://news.bitcoin.com/federal-reserve-chairman-says-crypto-appears-to-have-staying-power-in-us-economy/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/powell-crypto-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Federal Reserve Chairman Says Crypto Appears to Have Staying Power in US Economy\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/powell-crypto-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/powell-crypto-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/powell-crypto-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/powell-crypto-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/powell-crypto-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/powell-crypto-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/powell-crypto.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Federal Reserve Chairman Jerome Powell has acknowledged that cryptocurrency appears to have staying power as an asset class in the U.S. economy. In addition, he stated that the central bank views payment stablecoins as a form of money, emphasizing that it would be appropriate to have a robust federal role in what happens in stablecoin [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-22T01:30:08.000Z",
    "title": "Dogecoin Signal Bullish Momentum On Daily Chart, What’s Next?",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-signal-bullish-momentum-on-daily-chart-whats-next/",
    "description": "Dogecoin emerged as a highly popular cryptocurrency, originating from the world of internet memes. Despite its initially modest beginnings and relatively low value, it has amassed a large and enthusiastic community of followers. Dogecoin has gained significant popularity and a passionate community of supporters. The value of Dogecoin has been influenced by celebrity endorsements and increased adoption as a payment method on mainstream platforms. Other altcoins, including TCRV associated with Tradecurve, have also demonstrated positive performance and growth trends. Related Reading: Dogecoin Price Prediction: DOGE Signals Fresh Rally If It Clears 100 SMA DOGECOIN: Community, Endorsements, And Performance The dedicated community has played a pivotal role in propelling the value of DOGE forward. Renowned figures such as Elon Musk, the CEO of Tesla, have continued to express their support for DOGE, contributing to its ongoing surge in popularity. Furthermore, the wider adoption of DOGE as a payment method on mainstream platforms and the influx of celebrity endorsements have further bolstered its growth. As of June 17, 2023, the trading value of DOGE stood at $0.062569. Throughout the previous week, its value experienced fluctuations, dropping as low as $0.059487 before climbing back up to $0.062845. When considering the past 30 days, DOGE has seen a decline of 15.7% in its overall value. However, in the weekly charts, it registered a growth of 5.5%, marking a 1.8% increase compared to the previous trading day. The volatility and expansion pattern witnessed by DOGE is not exclusive, as several other alternative cryptocurrencies have undergone similar processes. In general, the recent positive performance of Dogecoin has instilled greater confidence among investors. Nevertheless, it is important to acknowledge that other alternative coins have also demonstrated comparable growth trajectories. Related Reading: Conflux Gains 20% In 24 hours, Emerges On Top Gainers Chart Featured image from Shutterstock, charts from TradingView.com"
  }
]