[
  {
    "source": "Cryptopolitan",
    "date": "2024-01-27T00:42:07.000Z",
    "title": "HBAR Price Prediction 2024-2033: Hedera Hashgraph Soon to Retest its ATH?",
    "url": "https://www.cryptopolitan.com/hbar-price-prediction/",
    "description": "HBAR Price Prediction 2024-2033 Hedera Hashgraph (HBAR) cryptocurrency is one of the altcoins that enjoyed a bullish trend from the beginning of 2021 to the end of March 2022. As a result, many crypto traders have taken an interest in the digital coin since its blockchain technology shows many prospects of becoming a force to [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-27T01:00:15.000Z",
    "title": "Hedera (HBAR) Shines: Record-Breaking 164 Million Daily Transactions, Market Cap Reaches $2.9 Billion",
    "url": "https://www.newsbtc.com/news/hedera-hbar-shines-record-breaking-164-million-daily-transactions-market-cap-reaches-2-9-billion/",
    "description": "Hedera (HBAR), the open-source Proof-of-Stake (PoS) blockchain network, has made significant strides in the fourth quarter (Q4) of 2023, according to a recent report by Messari. The network&#8217;s performance showcased notable growth in key metrics, outpacing the crypto market. Hedera Outpaces Crypto Market With 78% QoQ Increase During Q4 2023, Hedera&#8217;s circulating market cap experienced a 78% quarter-over-quarter (QoQ) increase, reaching $2.9 billion. This growth surpassed the overall crypto market&#8217;s growth rate of 54%, signifying Hedera&#8217;s growing influence. The year-on-year (YoY) change for HBAR stood at 211%, reflecting the network&#8217;s progress and adoption. In the same line, Hedera Network&#8217;s revenue witnessed a substantial 59% QoQ increase, amounting to $1.6 million in Q4 2023, primarily driven by a 66% QoQ surge in transactions, notably propelled by the Hedera Consensus Service.  Related Reading: Is Chainlink (LINK) Ready To Soar? Key Indicators To Monitor Furthermore, the revenue generated from Token and Smart Contract Services contributed approximately 14% of the total revenue, exemplifying a healthy distribution in Hedera&#8217;s revenue streams. With a fixed total supply of 50 billion HBAR, Q4 2023 saw 33.6 billion HBAR, or 67% of the total supply, in circulation.  The quarterly distribution of HBAR, reported through the Hedera Treasury Management Report, anticipates an additional 10% of the total supply to be unlocked in Q1 2024, including new ecosystem grants. While the number of addresses experienced a decline in Q4 2023, with average daily active addresses decreasing by 22% QoQ to 6,600 and average daily new addresses dropping by 39% QoQ to 5,200, there was still substantial YoY growth. Active addresses were up 90% YoY, and new addresses witnessed a 123% YoY increase. Hedera Network achieved a new record in transaction volume for the sixth consecutive quarter, with an impressive daily average of 164 million transactions in Q4 2023, marking a 66% QoQ surge. The Hedera Consensus Service remained the primary driver of this activity, accounting for 99% of all transactions on the network. DEX Trading Volume Skyrockets 164% QoQ In Q4 2023, the Hedera network reported 28 billion HBAR staked, representing 85% of the circulating and 56% of the total supply.  Entities such as Swirlds and Swirlds Labs played a significant role in staking their HBAR allocations, and the Hedera Treasury supported validators in meeting the minimum staking threshold for network consensus.  The Hedera network&#8217;s Total Value Locked (TVL) demonstrated positive growth, reaching $64 million by the end of 2023, reflecting a significant YoY increase of 169%. The TVL denominated in HBAR reached 733 million, indicating a 16% QoQ and YoY increase. Interestingly, Hedera&#8217;s TVL ranked among the top 40 blockchain networks. Related Reading: Algorand CEO’s X Account Hacked, Is Justin Sun Involved? Moreover, Hedera Network experienced a 164% QoQ increase in average daily decentralized exchange (DEX) trading volume, reaching $1.3 million, an all-time high. SaucerSwap dominated DEX trading volume on the Hedera network, accounting for most of the trading activity, as seen in the chart below. Lastly, the stablecoin market cap on the Hedera network grew by an impressive 73% QoQ, culminating in a year-end total of $6.3 million. Circle’s USDC stood as the sole stablecoin available on Hedera.  The network&#8217;s rank in the stablecoin market cap among blockchain networks improved by four spots QoQ, solidifying Hedera&#8217;s position in the stablecoin market. Under current market conditions, the price of HBAR stands at $0.0736, showcasing substantial growth in the past 24 hours, with a 5% increase.  Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-27T01:04:57.000Z",
    "title": "Fraudulent ‘Jet Frog’ Withdrawals Hit Bank Accounts As Millions Warned To Watch for Unusual Activity",
    "url": "https://dailyhodl.com/2024/01/26/fraudulent-jet-frog-withdrawals-hit-bank-accounts-as-millions-warned-to-watch-for-unusual-activity/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/bank-warn-dollar-hq.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/bank-warn-dollar-hq.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/bank-warn-dollar-hq.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/bank-warn-dollar-hq.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/bank-warn-dollar-hq.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/bank-warn-dollar-hq.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/bank-warn-dollar-hq.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Several major banks are confirming the spread of a new banking scam that utilizes the unusual name &#8220;Jet Frog&#8221;. News.com.au is warning millions of banking customers to watch for pending withdrawals labeled Jet Frog on their credit and debit card statements. One of the first victims to speak out on social media reportedly spotted a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/26/fraudulent-jet-frog-withdrawals-hit-bank-accounts-as-millions-warned-to-watch-for-unusual-activity/\">Fraudulent &#8216;Jet Frog&#8217; Withdrawals Hit Bank Accounts As Millions Warned To Watch for Unusual Activity</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-27T01:00:00.000Z",
    "title": "Total Value of Crypto Stolen From DeFi Platforms in 2023 Plummets by 63.7% Year-on-Year: Chainalysis",
    "url": "https://dailyhodl.com/2024/01/26/total-value-of-crypto-stolen-from-defi-platforms-in-2023-plummets-by-63-7-year-on-year-chainalysis/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/total-value-stolen-in.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/total-value-stolen-in.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/total-value-stolen-in.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/total-value-stolen-in.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/total-value-stolen-in.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/total-value-stolen-in.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/total-value-stolen-in.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Blockchain analysis firm Chainalysis says the value of crypto assets that cybercriminals stole in 2023 went down by more than 50% compared to 2022, largely due to a significant drop in hacking incidents targeting decentralized finance (DeFi) platforms. In a new report, Chainalysis notes that hackers stole just $1.1 billion from DeFi protocols in 2023, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/26/total-value-of-crypto-stolen-from-defi-platforms-in-2023-plummets-by-63-7-year-on-year-chainalysis/\">Total Value of Crypto Stolen From DeFi Platforms in 2023 Plummets by 63.7% Year-on-Year: Chainalysis</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]