[
  {
    "source": "Crypto Daily",
    "date": "2023-05-30T15:57:37.000Z",
    "title": "Crypto AI spikes post debt ceiling agreement",
    "url": "https://cryptodaily.co.uk/2023/05/crypto-ai-spikes-post-debt-ceiling-agreement",
    "description": "<p>A debt ceiling agreement appears to have been reached, but a vote is still needed. Crypto AI tokens are rising strongly.</p>\nStill some way to go to agree debt ceiling\n<p>Amid mutterings of discontent about the debt ceiling deal, especially on the Republican side, the issue is due to be put before the House. Republican lawmaker Chip Roy put it into perspective by remarking in a tweet on Sunday:</p>\n<p>&ldquo;they haven&rsquo;t been educated yet on what a t*rd-sandwich this &ldquo;deal&rdquo; is.&nbsp; They will be.&rdquo;</p>\n<p>Republicans and Democrats need to get the deal voted on and passed by June 6. Should they fail to do so, a most unlikely scenario, the US government would default on its debt for the first time in history.</p>\nCrypto is a hedge out of the debt debacle\n<p>Bitcoin and crypto are receiving an advantage of the uncertainty as investors dip their feet into the asset class in order to diversify and hedge their risk.&nbsp;</p>\n<p>However, it&rsquo;s not the entire crypto sector that is benefiting. Bitcoin and ethereum are looking strong, as are some of the more fundamentally sound tokens, although the sector as a whole is still flat after the crypto rally from the beginning of the year - that is with the exception of the artificial intelligence niche.</p>\nAI tokens make strong moves to the upside\n<p>Certain of these AI tokens have surged considerably today. Ocean (OCEAN) has been one of the most prominent of the AI crypto tokens to make some great gains in the last several hours. From a price of $0.34 OCEAN rose as high as $0.39 - a 14% increase. Now the token looks to be forming a flag at the upper limit of a trendline formed since early February. A further break to the upside is a possibility.</p>\n<p>SingularityNET (AGIX) is another trendline breaker. It has managed 13% in all today, but the price is still to come back and retest the trendline before potentially going much higher.</p>\n<p>Possibly the most successful of the AI tokens so far today is Matrix.ai (MAN). MAN surged more than 30% in just the last two hours, taking it to a price of just under $0.32. The price has since returned to $0.30, but there does appear to be more in the tank for a potential move higher.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T15:53:33.000Z",
    "title": "South Africa’s pro-Russia stance faces sanctions threat",
    "url": "https://www.cryptopolitan.com/south-africa-pro-russia-face-sanction-threat/",
    "description": "As the South African financial sector faces a crisis, the South African Reserve Bank (SARB) warns of impending threats due to perceived allegiances with Russia, which could lead to secondary sanctions and disrupt the nation&#8217;s financial stability. Concerns have been raised that South Africa&#8217;s position may jeopardize the global involvement of its financial institutions. South ... <a title=\"South Africa&#8217;s pro-Russia stance faces sanctions threat\" class=\"read-more\" href=\"https://www.cryptopolitan.com/south-africa-pro-russia-face-sanction-threat/\" aria-label=\"More on South Africa&#8217;s pro-Russia stance faces sanctions threat\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-30T15:57:49.000Z",
    "title": "Reserve Bank of India expands digital rupee pilot program",
    "url": "https://crypto.news/reserve-bank-of-india-expands-digital-rupee-pilot-program/",
    "description": "The Reserve Bank of India is enhancing its digital rupee pilot, as it intends to broaden participation and incorporate diverse use cases in the upcoming fiscal year."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-30T16:02:03.000Z",
    "title": "BREAKING: Russia to Focus on Bitcoin and Ethereum Exchanges for People and Companies Alike Through Regulations",
    "url": "https://www.crypto-news-flash.com/breaking-russia-to-focus-on-bitcoin-and-ethereum-exchanges-for-people-and-companies-alike-through-regulations/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-russia-to-focus-on-bitcoin-and-ethereum-exchanges-for-people-and-companies-alike-through-regulations",
    "description": "<p>Russia rescinded its decision to create a National Bitcoin Exchange. The country has decided to rather focus on regulations to control crypto exchanges. Russia was earlier reported to be working on a national crypto exchange despite the divided opinions between the Ministry of Finance and the Central Bank. However, the latest report discloses that the [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/breaking-russia-to-focus-on-bitcoin-and-ethereum-exchanges-for-people-and-companies-alike-through-regulations/\">BREAKING: Russia to Focus on Bitcoin and Ethereum Exchanges for People and Companies Alike Through Regulations</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-30T15:47:50.000Z",
    "title": "Revolutionary Upgrade: Terra Classic L1TF Soars with CosmWasm Parity Testnet and LUNC Validator Commission Boost",
    "url": "https://www.crypto-news-flash.com/revolutionary-upgrade-terra-classic-l1tf-soars-with-cosmwasm-parity-testnet-and-lunc-validator-commission-boost/?utm_source=rss&utm_medium=rss&utm_campaign=revolutionary-upgrade-terra-classic-l1tf-soars-with-cosmwasm-parity-testnet-and-lunc-validator-commission-boost",
    "description": "<p>The Joint L1 Task Force has successfully concluded the V2.0.1 upgrade and is now preparing for future upcoming upgrades.  LuncBurnArmy, an L1 development team project manager, has revealed that a 5 percent minimum validator commission fee has already been developed.  The Joint L1 Task Force, the developer team working on Terra Classic LUNC has carried [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/revolutionary-upgrade-terra-classic-l1tf-soars-with-cosmwasm-parity-testnet-and-lunc-validator-commission-boost/\">Revolutionary Upgrade: Terra Classic L1TF Soars with CosmWasm Parity Testnet and LUNC Validator Commission Boost</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-30T15:50:00.000Z",
    "title": "PancakeSwap Launches Pancake Protectors, Sparks CAKE Price Surge",
    "url": "https://coinedition.com/pancakeswap-launches-pancake-protectors-sparks-cake-price-surge/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/01/PancakeSwap_price_analysis_rallies_to_3_98_as_bulls_continue_to-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/PancakeSwap_price_analysis_rallies_to_3_98_as_bulls_continue_to-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/PancakeSwap_price_analysis_rallies_to_3_98_as_bulls_continue_to-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/PancakeSwap_price_analysis_rallies_to_3_98_as_bulls_continue_to-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/PancakeSwap_price_analysis_rallies_to_3_98_as_bulls_continue_to-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/PancakeSwap_price_analysis_rallies_to_3_98_as_bulls_continue_to-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/01/PancakeSwap_price_analysis_rallies_to_3_98_as_bulls_continue_to.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>PancakeSwap, the leading decentralized exchange on Binance Smart Chain (BSC), has made a groundbreaking move by releasing its own crypto game, Pancake Protectors. The successful launch of the first DEX-backed GameFi platform has resulted in a surge in the price of CAKE. On May 29, PancakeSwap introduced Pancake Protectors, integrating the exchange platform&#8217;s native token, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/pancakeswap-launches-pancake-protectors-sparks-cake-price-surge/\">PancakeSwap Launches Pancake Protectors, Sparks CAKE Price Surge</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]