[
  {
    "source": "Crypto Daily",
    "date": "2023-07-30T15:55:17.000Z",
    "title": "Gensler: Crypto is “Rife With Fraud,” Underscores Hostile Views",
    "url": "https://cryptodaily.co.uk/2023/07/gensler-crypto-is-rife-with-fraud-underscores-hostile-views",
    "description": "<p>SEC Chairman Gary Gensler, probably crypto&rsquo;s harshest critic, has again vocalized his opinions, labelling the industry as &ldquo;rife with fraud&rdquo; and non-compliance. </p>\n<p>In a recent interview with Bloomberg, Gary Gensler, the infamous Chairman of the US SEC, offered his critical views of the crypto industry.</p>\nGensler Disappointed by Ripple Ruling\n<p>In a recent interview on Bloomberg Daybreak Podcast, SEC Chairman Gary Gensler, declared the crypto sector as &ldquo;a field rife with fraud, rife with hucksters&rdquo; and hinted the possibility of a Bitcoin ETF in an industry with such supposed &ldquo;poor compliance&rdquo; is unlikely.</p>\n<p>Gensler&rsquo;s response to Bitcoin ETFs seemed somewhat confusing and did not substantively address the issue. Instead, the Chairman answered in a defamatory note:</p>\n<p>&ldquo;This is a field that, there&rsquo;s a lot of non-compliance in this field, and, uh, that the platforms themselves, where trading is occurring of various crypto tokens, though some of it comes under the securities laws, currently they&rsquo;re not necessarily compliant with those time-tested protections against fraud and manipulation.&rdquo;</p>\n<p>The head of the SEC further stated the industry needs &ldquo;more cops on the beat&rdquo; to bring violators to justice.</p>\n<p>During the podcast, Gensler seemed unwilling to respond when prompted about Ripple&rsquo;s recent partial victory over the SEC. Unsurprisingly, Gensler said he was &ldquo;disappointed&rdquo; in Judge Torres&rsquo; ruling.</p>\n<p>When asked to elaborate on his disappointment and the possibility of an appeal by the agency, chairman Gensler gave a vague and mysterious answer. He told the host:</p>\n\n<p>&ldquo;The Commission has not acted on that, and if the staff makes a recommendation, we&rsquo;ll have a discussion of it and we&rsquo;ll take it up then. But I don&rsquo;t really have anything more for you, for that.&rdquo;</p>\n\n<p>Gensler also commented on consumer protection from the agency in this &ldquo;highly speculative&rdquo; industry:</p>\n\n<p>&ldquo;Even though the securities laws apply to many of those tokens, without prejudging any one. But you as investors are not getting the full, fair, and truthful disclosure. And the platforms, the intermediaries, are doing things that we would never, in a day, allow or think the New York Stock Exchange or Nasdaq would do. The platforms, often, are commingling or trading against you and have market makers, often, that are on the other side of the trades.&rdquo;</p>\n\nRipple CEO Blames SEC for Regulatory &ldquo;Mess&rdquo;\n<p>Ripple&rsquo;s CEO, Brad Garlinghouse, recently shared his views regarding the current regulatory &ldquo;mess&rdquo; whilst defending Judge Torres&rsquo;s decision. Garlinghouse expressed his dismay with the SEC by saying:</p>\n\n<p>&ldquo;An important topic has come up about protecting retail. The SEC created this mess by proclaiming it was the cop on the crypto beat when it had no legal jurisdiction Where&rsquo;s that gotten us? Consumers left holding the bag in bankruptcy court while the SEC holds press conferences.&rdquo;</p>\n\n<p>He continued by saying:</p>\n\n<p>&ldquo;It&rsquo;s absurd to blame a Judge for faithfully applying the law. We all know legislation &ndash; not more regulation by enforcement &ndash; is the only way forward to provide clear rules and protect retail.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-30T16:07:40.000Z",
    "title": "Majority of Workers Call for Ban on AI in the Workplace, Fearing Job Displacement",
    "url": "https://www.cryptopolitan.com/workers-call-ban-ai-in-workplace-fearing-job/",
    "description": "New research commissioned by recruiter Randstad UK reveals that three in every five workers advocate for a government ban on artificial intelligence (AI) in the workplace. The poll of 1,147 employees sheds light on their concerns about job displacement and the potential impact of AI on the workforce. Despite the fears, the adoption of AI ... <a title=\"Majority of Workers Call for Ban on AI in the Workplace, Fearing Job Displacement\" class=\"read-more\" href=\"https://www.cryptopolitan.com/workers-call-ban-ai-in-workplace-fearing-job/\" aria-label=\"More on Majority of Workers Call for Ban on AI in the Workplace, Fearing Job Displacement\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-30T15:45:43.000Z",
    "title": "US passes military spending bill, aims to curb crypto money laundering",
    "url": "https://crypto.news/us-passes-military-spending-bill-aims-to-curb-crypto-money-laundering/",
    "description": "The U.S. Senate has approved the 2024 National Defense Authorization Act (NDAA) to enhance oversight and transparency of crypto transactions"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-30T16:00:52.000Z",
    "title": "Here’s How Long The Majority Of New Ethereum Wallets Are Used Before They’re Dumped",
    "url": "https://www.newsbtc.com/news/ethereum/new-ethereum-wallets-before-theyre-dumped/",
    "description": "Ethereum is currently the leader in decentralized finance, non-fungible tokens, and smart contracts, and it continues to maintain its position as the dominant cryptocurrency in the altcoin market. This has led to Ethereum having the highest rate of creation of new addresses when compared to the other blockchains. However, data suggests most of these new addresses are dumped just after a few days.  New Ethereum Wallets Are Used for Only a Short Time Ethereum is second to Bitcoin in terms of unique addresses. Ycharts estimates put the number of unique addresses on the Ethereum network to around 239.62 million. However, on-chain transaction data shows that if you&#8217;ve just created a new Ethereum wallet, chances are you won&#8217;t be using it for long.  Related Reading: Court Filing Suggests FTX’s $2 Billion Lawsuit Against Genesis Is Coming To An End According to crypto data analyst Jack Gorman, over 70% of new Ethereum wallets are used for less than 30 days before the owners stop transacting completely. While taking to a customized graph on Dune Analytics, a blockchain ecosystem analytics platform, the data analyst noted the rate of creation and abandonment of new Ethereum addresses. The data show that Ethereum has one of the highest rates of new addresses, with 2 million new wallets per month. In the past year alone, more than 26.69 million wallets were created. However, most new addresses display minimal activity, with 66% only active for one day and 95.5% being active for less than ten days. For instance, in May 2023, 2.41 million addresses were created, with only 6.91% making transactions after 30 days.  ETH price sitting at $1,876 &#124; Source: ETHUSD on Tradingview.com Overall, monthly active addresses total around 4.5 million to 7 million. This means that most wallets don&#8217;t last long, and only 1.9 million are active for more than 10 days. Fewer addresses are used frequently and long-term, with only 400,000 addresses completing more than 100 transactions in the past year. Why Are There So ETH Addresses? Ethereum has had one of the most impressive adoption rates in recent years. The creation of new addresses provides valuable insights into improving adoption and longevity, and the creation and abandonment of addresses can be traced to airdrop hunters. Airdrop hunters create multiple addresses with the sole aim of farming ERC-20 tokens from airdrops.  Related Reading: Shiba Inu Reclaims 14th Spot In Market After 5% Jump While the retention rate of new wallets is really low, Ethereum is blessed with various holders, including smart contract addresses and centralized exchanges. The Eth2 Beacon Deposit Contract has the largest address, boasting more than 27.6 million ETH and a 22.9% stake in the network. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-30T16:00:42.000Z",
    "title": "XLM Leg Up Continues After 20% Surge, Here’s Why QUBE is A Better Bet For 5X Gains in 2023",
    "url": "https://www.crypto-news-flash.com/xlm-leg-up-continues-after-20-surge-heres-why-qube-is-a-better-bet-for-5x-gains-in-2023-2/?utm_source=rss&utm_medium=rss&utm_campaign=xlm-leg-up-continues-after-20-surge-heres-why-qube-is-a-better-bet-for-5x-gains-in-2023-2",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-30T181633.441.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-30T181633.441.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-30T181633.441-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-30T181633.441-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-30T181633.441-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-30T181633.441-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Stellar Lumens (XLM) has been in the limelight with a recent 20% surge in its price, garnering attention from crypto investors worldwide. Yet, amid the excitement of surging altcoins, one name stands out for potential future gains &#8211; InQubeta (QUBE). As we look ahead in 2023, market analysts and crypto enthusiasts are predicting QUBE to [...]"
  }
]