[
  {
    "source": "Cointelegraph",
    "date": "2023-09-30T17:30:06.000Z",
    "title": "Expect new crypto regulations to follow Bitcoin ETFs",
    "url": "https://cointelegraph.com/news/expect-new-crypto-regulations-bitcoin-etfs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/bfa8c91a-4027-4678-8a31-69d7e3070476.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Will Bitcoin ETFs attract more regulatory attention to the crypto industry? We can only hope, because many questions need to be answered.</p>\n                    <p><p>Aside from liquidity, what do institutions bring to crypto? What precisely is their value added? This is an instructive question to ponder, because there is little consensus on what deeper institutional participation means for an industry that is riven with contradictions.</p><p>The long-running wait for <a href=\"https://cointelegraph.com/news/sec-delays-spot-bitcoin-etfs-blackrock-bitwise-valkyrie-invesco\">Bitcoin ETF approval</a>, giving pensions and funds exposure to BTC, may well prove to be a positive catalyst for industry growth. But in focusing on price action, observers are missing out on the real benefit of broadscale institutional adoption. The greatest benefit of deepening institutional adoption may be the regulatory certainty it ushers in.</p><h3>Tax and Compliance</h3><p>There are a number of areas where institutional involvement is forcing regulators to give straight answers. Chief among these are taxation and compliance. What trades can a business legally make, how should they be disclosed on its balance sheet, and what steps must it take to report these activities?</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-etfs-600-billion-tipping-point-crypto\"><strong><em>Bitcoin ETFs: A $600B tipping point for crypto</em></strong></a></p><p>Determining what constitutes a taxable event in crypto depends on your dominion. While U.S. traders are required to calculate <a href=\"https://cointelegraph.com/news/what-is-profit-and-loss-pnl-and-how-to-calculate-it\">profit and loss (PnL)</a> on every trade on a <a href=\"https://cointelegraph.com/explained/dex-explained\">decentralized exchange (DEX)</a>, perps position, and on-chain event, other countries take a less rigorous approach, while a few don’t bother to tax it at all.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> ETFs will be Delayed until the Final Deadline<br><br>The SEC is trying to show that they are not interested and attempting to push the dates until the final deadline, even though both the SEC and BlackRock know the inevitable outcome.<br><br>BlackRock&#39;s ETF should be the first one… <a href=\"https://t.co/6ZkfUf9WPR\">pic.twitter.com/6ZkfUf9WPR</a></p>&mdash; Mags (@thescalpingpro) <a href=\"https://twitter.com/thescalpingpro/status/1707657014154023141?ref_src=twsrc%5Etfw\">September 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Regardless of where you reside, determining your obligations when buying, selling, and storing digital assets can be a headache. But it could be worse: imagine how much more is at stake for businesses, whose public accounts must be scrutinized, and which typically require permission to even list Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) on their balance sheet.</p><p>There are good reasons why a higher bar is set for enterprises in terms of compliance, disclosure, reporting, and taxation compared to consumers. It’s a primary reason why it’s taken so long for serious institutional adoption to manifest. But as the trickle of financial firms gaining a foothold in the space turns into a flow, the retinue of lawyers and lobbyists in tow has begun to yield dividends. When BlackRock starts beating the drum for a <a href=\"https://cointelegraph.com/news/lawmakers-call-sec-chair-approve-spot-bitcoin-etf\">Bitcoin ETF</a>, even the Securities and Exchange Commission (SEC) has to sit up and take notice.</p><p>Grayscale’s <a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\">favorable</a> court ruling against the SEC on Aug. 29 has shown the power institutions can muster in forcing regulators to renegotiate. The precedent this appeals decision sets will further increase the confidence of institutions in their ability to reframe legislation in their favor.</p><h3>Seeking regulatory clarity</h3><p>For those who already have skin in the game — sole traders, trading firms, family funds, venture capitalists — greater institutional involvement can only be a good thing. When the largest institutions decide they want in, it forces regulators to play ball. Not every provision that’s consequently pushed through the statute books will aid the industry — some will be asinine — but collectively they provide something that’s been missing for years: <em>clarity</em>.</p><p>Is Bitcoin a security? What about Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) or Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>)? The answer, at present, depends on who you ask. Some agencies seem intent on declaring everything bar Bitcoin a security; others take a more measured approach, focusing their enforcement efforts on the most egregious token sales and shills.</p><p><em><strong>Related: <a href=\"https://cointelegraph.com/news/10-years-later-no-bitcoin-etf\">10 years later, still no Bitcoin ETF — but who cares?</a></strong></em></p><p>Institutions can’t trade assets that lie in regulatory no man’s land: they need black and white, not shades of gray. Their increasing participation in the market is bound to provide clearer answers in terms of crypto classification, which will benefit the entire industry.</p><p>In addition, greater institutional involvement is legitimizing digital assets by making them less exotic to those tasked with regulating them. Crypto opponents can’t justifiably claim the industry to be a hotbed of money laundering and wash trading when its most active participants include the world’s leading trading firms.</p><h3>Signs of institutional adoption</h3><p>Today, businesses and governments are pressing ahead with blockchain-based initiatives such as <a href=\"https://cointelegraph.com/news/state-of-cbdc-report-by-cointelegraph-research\">CBDC pilots</a>. In Asia alone, Hong Kong and the Bank of Japan are exploring programs involving digital currencies. </p><p>Meanwhile, banks from the U.S. to Europe are introducing crypto custody and trading services for their clients. And in August, Europe’s first spot Bitcoin <a href=\"https://cointelegraph.com/news/bitcoin-etf-europe-s-first-spot-bitcoin-etf-eyes-2023-debut-after-a-year-long-delay\">ETF listed</a> in Amsterdam, proving that institutional willpower eventually gets things done.</p><p>Regulators and institutional players are still catching up in terms of expertise to those who helped build the industry from the ground up in its early days through hands-on participation. No one has complete mastery. But as a rising tide lifts all ships, greater institutional involvement will bring benefit to all players, from the humblest yield farmer to the richest whale. Rather than assume any one group has it all figured out, an open and collaborative dialogue is most likely to lead to positive outcomes. Regulators, institutions and early adopters each offer unique insights.</p><p>You don’t have to thank them, but big institutions are a net positive for the industry. Bigger players produce better rules — and better outcomes for everyone.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Gracy Chen</strong> is the managing director of the crypto derivatives exchange Bitget, where she oversees market expansion, business strategy, and corporate development. Before joining Bitget, she held executive positions at the Fortune 500 unicorn company Accumulus and venture-backed VR startups XRSPACE and ReigVR. She was also an early investor in BitKeep, Asia's leading decentralized wallet. She was honored in 2015 as a Global Shaper by the World Economic Forum. She graduated from the National University of Singapore and is currently pursuing an MBA degree at the Massachusetts Institute of Technology.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-30T17:19:38.000Z",
    "title": "VanEck Pledges 10% of Profits from Upcoming Ether Futures ETF to Ethereum Core Developers",
    "url": "https://www.cryptoglobe.com/latest/2023/09/vaneck-pledges-10-of-profits-from-upcoming-ether-futures-etf-to-ethereum-core-developers/",
    "description": "Global investment firm VanEck has declared that it will allocate 10% of all profits generated from its soon-to-be-launched Ether futures exchange-traded fund (ETF) to Ethereum’s core developers for a period of ten years. The announcement was made on 29 September 2023 via social media platform X (previously known as Twitter). The recipient of this charitable […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-30T17:31:56.000Z",
    "title": "The Environmental Impact of Generative AI",
    "url": "https://www.cryptopolitan.com/the-environmental-impact-of-generative-ai/",
    "description": "The rapid growth of generative AI tools for text, images, and audio has ushered in a new era of technological innovation. However, beneath the surface of these remarkable achievements lies a hidden cost that demands our attention—environmental sustainability. This article explores the environmental footprint of generative AI, including energy consumption, water usage, and the quest ... <a title=\"The Environmental Impact of Generative AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-environmental-impact-of-generative-ai/\" aria-label=\"More on The Environmental Impact of Generative AI\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-30T17:25:33.000Z",
    "title": "Dogecoin (DOGE) & VC Spectra (SPCT): Identifying the Upcoming 10x Crypto Titans",
    "url": "https://www.cryptopolitan.com/dogecoin-doge-vc-spectra-spct-identifying-the-upcoming-10x-crypto-titans/",
    "description": "In the volatile cryptocurrency market, two contenders have been catching the eye of investors and enthusiasts alike: Dogecoin (DOGE) and VC Spectra (SPCT). While Dogecoin (DOGE) battles threats from outside, VC Spectra (SPCT) focuses on its presale. As a result, these top DeFi projects store potential for significant gains.&#160; Let’s find out if Dogecoin (DOGE) ... <a title=\"Dogecoin (DOGE) &#38; VC Spectra (SPCT): Identifying the Upcoming 10x Crypto Titans\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dogecoin-doge-vc-spectra-spct-identifying-the-upcoming-10x-crypto-titans/\" aria-label=\"More on Dogecoin (DOGE) &#38; VC Spectra (SPCT): Identifying the Upcoming 10x Crypto Titans\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-30T17:19:25.000Z",
    "title": "Congressman Patrick McHenry (R-NC) pushes for stablecoin legislation amid looming U.S. government shutdown",
    "url": "https://www.cryptopolitan.com/patrick-mchenry-r-nc-pushes-for-stablecoin-legislation/",
    "description": "Representative Patrick McHenry, the House Financial Services Committee Chair, reemphasized his commitment to stablecoin regulation in a recent Zoom meeting organized by stablecoin issuer Circle. Despite the imminent threat of a government shutdown, McHenry told a New York-based audience that he&#8217;s determined to bring the stablecoin issue to the President&#8217;s desk. Stablecoins, digital assets tethered ... <a title=\"Congressman Patrick McHenry (R-NC) pushes for stablecoin legislation amid looming U.S. government shutdown\" class=\"read-more\" href=\"https://www.cryptopolitan.com/patrick-mchenry-r-nc-pushes-for-stablecoin-legislation/\" aria-label=\"More on Congressman Patrick McHenry (R-NC) pushes for stablecoin legislation amid looming U.S. government shutdown\">Read more</a>"
  }
]