[
  {
    "source": "Bitcoin.com",
    "date": "2023-12-12T02:00:08.000Z",
    "title": "Robert Kiyosaki Doubles Down on Biggest Crash Prediction — ‘No Time to Play Russian Roulette With Your Life’",
    "url": "https://news.bitcoin.com/robert-kiyosaki-doubles-down-on-biggest-crash-prediction-no-time-to-play-russian-roulette-with-your-life/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/kiyosaki-russian-roulette-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Robert Kiyosaki Doubles Down on Biggest Crash Prediction — &#039;No Time to Play Russian Roulette With Your Life&#039;\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/kiyosaki-russian-roulette-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/kiyosaki-russian-roulette-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/kiyosaki-russian-roulette-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/kiyosaki-russian-roulette-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/kiyosaki-russian-roulette-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/kiyosaki-russian-roulette-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/kiyosaki-russian-roulette.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Rich Dad Poor Dad author Robert Kiyosaki has warned that the biggest crash in history may be starting. Emphasizing that the U.S. banking system is bankrupt, he warned that the S&#38;P 500 will be next to collapse, which will &#8220;toast millions&#8221; of U.S. retirement plans. There’s “no time to play Russian Roulette with your life,&#8221; [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-12T02:00:44.000Z",
    "title": "Crypto Market Crashes: Traders React With “Buy The Dip” Calls",
    "url": "https://www.newsbtc.com/crypto/crypto-crashes-traders-react-buy-dip-calls/",
    "description": "The crypto market has seen a plunge today, and it would appear that social media users have reacted by calling to buy this &#8220;dip.&#8221; Coins Across The Crypto Sector Are In The Red Today According to data from the on-chain analytics firm Santiment, social media mentions of &#8220;buy the dip&#8221; have gone up following the latest tumble that the crypto market has experienced. The relevant indicator here is the &#8220;social volume,&#8221; which keeps track of the number of unique posts/threads/messages on the various social media platforms that mention a specific topic. The metric counts the posts themselves instead of the mentions because this method provides a more accurate representation of the behavior among social media users as a whole. Related Reading: SEC’s “Crypto Asset Securities” Alert Boosts Spot Bitcoin ETF Prospects – Here’s Why Consider two scenarios: one where a large number of mentions are happening over a few posts and another where mentions are also taking place but are spread out over a large number of posts. In the first, discussion is limited to a specific group of users, but going by the mentions, this case would have as much interest in the topic as the latter when it&#8217;s not the case. Now, to find whether &#8220;buy the dip&#8221; is gaining traction among crypto investors, what Santiment has done is filter out the social volume of crypto first and then search these posts for the mention of terms related to this idea. Here is a chart that shows the trend in the social volume for this topic over the last month: The value of the metric appears to have spiked recently &#124; Source: Santiment on X The graph shows that the crypto social volume for terms related to &#8220;buy the dip&#8221; has shot up after this plummet in the market. In the same chart, the analytics firm has also attached the &#8220;social dominance&#8221; data, which keeps track of what percentage of these discussions are adding up. Social dominance has also registered a spike recently, and at the peak of this spike, it seems the metric assumed a value of about 0.7, which means 0.7% of all discussions related to the crypto sector involved this topic. &#8220;Crypto has experienced its fastest drop in 4 months as markets have corrected and caused mild trader concerns,&#8221; notes Santiment. &#8220;There is a high level of buythedip calls, which typically means that there is a bit of overeagerness and FOMO on these low prices.&#8221; Related Reading: 63.2% Of PEPE Holders Now In Profit: How This Compares With DOGE, SHIB While the market is optimistic about this plunge, too much optimism about things like &#8220;bottoms&#8221; has historically actually backfired for the assets&#8217; prices. Thus, these mentions aren&#8217;t a sign that Bitcoin and others have finished with their decline, and more could potentially be on the way. BTC Price Bitcoin had gone under the $41,000 mark during its initial plunge, but it wasn&#8217;t long before it made some recovery towards the current price. Looks like the value of the asset has plunged &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Santiment.net"
  }
]