[
  {
    "source": "Cointelegraph",
    "date": "2024-03-14T18:28:59.000Z",
    "title": " Ether (ETH) price drops after Dencun upgrade, as Ethereum layer-2s experience lower transaction costs ",
    "url": "https://cointelegraph.com/news/eth-price-drops-after-dencun-upgrade-ethereum-layer-2s-lower-transaction-costs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvODc0MjQ0NTgtMWVjMi00YzI3LWE0NGUtYTM4ZWQ0ZTIxZTFiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Historically, Ethereum network upgrades rarely significantly impact the price of ETH. </p>\n                    <p><p>The much-awaited Dencun Ethereum upgrade <a href=\"https://cointelegraph.com/news/dencun-upgrade-live-ethereum-mainnet\">finally went live</a> on March 13, bringing with it the promise of improving the network’s cost-effectiveness. Following the upgrade, Ether’s (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) price dropped sharply from a high of $4,082 to $3,932, according to data from CoinMarketCap.</p><p>Data from <a href=\"https://subscription.cointelegraph.com/?_gl=1*1d5155o*_ga*MTAxMzE3MDgyMS4xNzA2Nzk5MzMw*_ga_53R24TEEB1*MTcxMDQzNzM1MC4xNjguMS4xNzEwNDM3NDM0LjAuMC4w\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCGBP/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> shows that Ether resumed its fall on March 14, dropping 3% over the last 24 hours to trade at $3,848 at the time of publishing.</p><p>The <a href=\"https://cointelegraph.com/learn/what-is-ethereum-a-beginners-guide-to-eth-cryptocurrency\">Ethereum network</a> has undergone several upgrades, with each aimed at improving the effectiveness of the layer-1 blockchain either by improving transaction speed, lowering gas fees or changing the consensus mechanism. This improves the value of the network in the long run.</p><p><a href=\"https://cointelegraph.com/news/eth-price-drops-after-dencun-upgrade-ethereum-layer-2s-lower-transaction-costs\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-14T18:30:48.000Z",
    "title": "BNB Chain Launches Rollup-as-a-Service to Bolster L2 Blockchain Development",
    "url": "https://news.bitcoin.com/bnb-chain-launches-rollup-as-a-service-to-bolster-l2-blockchain-development/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/bnbchainsnsn-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BNB Chain Launches Rollup-as-a-Service to Bolster L2 Blockchain Development\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/bnbchainsnsn-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bnbchainsnsn-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bnbchainsnsn-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bnbchainsnsn-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bnbchainsnsn-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bnbchainsnsn-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bnbchainsnsn.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Thursday, the team behind BNB Chain introduced a novel Rollup-as-a-Service (RaaS) offering for the development of layer two blockchains (L2s) atop the BNB Chain. The team detailed that the service equips sizable decentralized applications (dapps), enterprises, and the BNB Chain with the essential technological framework required for launching specific L2s on BNB Smart Chain [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-14T18:40:06.000Z",
    "title": "Solana’s $150 surge shifts focus to DeeStream presale, Dogecoin whale’s 100x claim",
    "url": "https://crypto.news/solanas-150-surge-shifts-focus-to-deestream-presale-dogecoin-whales-100x-claim/",
    "description": "Solana's impressive surge leads to increased attention on the DeeStream presale, amid predictions of significant growth by a Dogecoin whale. #partnercontent"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-14T18:27:29.000Z",
    "title": "Martin Shkreli questions Dogwifhat’s value, explores Solana meme coins",
    "url": "https://crypto.news/martin-shkreli-questions-dogwifhats-value-explores-solana-meme-coins/",
    "description": "Martin Shkreli criticizes Dogwifhat's valuation, drawing parallels to historical bubbles, while seeking promising Solana-based meme coins. #partnercontent"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-14T18:18:34.000Z",
    "title": "Elliptic: Lazarus Group taps Tornado Cash to launder Heco Bridge, HTX hack proceeds",
    "url": "https://crypto.news/lazarus-group-tornado-cash-laundering/",
    "description": "North Korea’s hacker organization Lazarus is using Tornado Cash again despite U.S. sanctions against the popular cryptocurrency mixer."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-14T18:13:19.000Z",
    "title": "Arbitrum to reduce gas fees amid Dencun update",
    "url": "https://crypto.news/arbitrum-reducing-gas-fees-dencun/",
    "description": "Arbitrum developers will reduce the cost of layer-2 transactions by 10 times, with gas fee reductions going live on March 18."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-14T18:12:19.000Z",
    "title": "ETH nears $4,000 as Kelexo presale ignites post-BTC halving buzz",
    "url": "https://crypto.news/eth-nears-4000-as-kelexo-presale-ignites-post-btc-halving-buzz/",
    "description": "Ethereum (ETH) approaches $4,000, while Kelexo (KLXO) presale excites investors, potentially soaring post-bitcoin halving. #partnercontent"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-14T18:30:02.000Z",
    "title": "Crypto Expert Reveals Why XRP Is Primed For Growth In This Bull Market",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-is-primed-for-growth/",
    "description": "Despite XRP lagging in this early stage of this bull run, crypto expert Zach Rector has shared his belief and given reasons why the crypto token is still bound to perform well. He went as far as ranking the token up there with Bitcoin to drive home his point on why the token will make a run soon enough.  “XRP Will Not Miss This Bull Run” Rector mentioned in an X (formerly Twitter) post that XRP will not miss this bull run. In the accompanying video, the crypto expert highlighted the crypto token’s fundamentals as one of the reasons he holds this belief despite XRP’s tepid price action. Rector further claimed that the token and XRP Ledger (XRPL) have some of the best fundamentals in the crypto space.  Related Reading: Dogecoin Influencer Sounds Critical Warning Alarm For Scams Targeting The Community Rector even challenged his followers to mention any other crypto token with a better fundamental than XRP. According to him, Bitcoin is the only other token that comes close to XRP in that regard. His statement echoes the sentiments of Ripple’s CEO Brad Garlinhouse, who recently stated the importance of real-world utility in driving a crypto’s growth.  Meanwhile, Rector alluded to XRP’s recent pump as a sign of the great things to come for the crypto token. On March 11, XRP climbed to as high as $0.74 before seeing a sharp correction. However, the community will hope Rector’s conviction is correct, considering that XRP didn’t make any significant statement in the 2021 bull run.   As Rector noted, community members’ faith in the token is fast waning, and there is a belief that a repeat of the altcoin&#8217;s sluggish 2021 run will ultimately erode this faith. XRP getting close to or surpassing its all-time high (ATH) of $3 will be a great place to start if it is to make a run in this bull run.  Time For Price Predictions To Come True Crypto analysts like Crypto Rover and Egrag Crypto had before now made bullish price predictions for XRP, which are meant to be actualized sometime around this period. On his part, Crypto Rover predicted that the altcoin would see a “massive breakout” this March. Meanwhile, Egrag predicted that XRP will rise to $5 between now and April.  Related Reading: Samson Mow Gives Reasons Why Bitcoin Price Could Reach $1 Million This Year Other analysts like Dark Defender have also fuelled expectations for XRP this period. Dark Defender, in particular, recently stated that the next target for toke is the $1.33 price mark and that the $1.88 and $5.85 Fibonacci targets could be attained in the upcoming weeks.  At the time of writing, XRP is trading at around $0.686, down over 1% in the last 24 hours, according to data from CoinMarketCap.  Token price at $0.68 &#124; Source: XRPUSDT on Tradingview.com Featured image from Bitcoin News, chart from Tradingview.com"
  }
]