[
  {
    "source": "Decrypt",
    "date": "2023-11-08T19:44:30.000Z",
    "title": "Bitcoin ATMs in El Salvador are Getting a Lightning Network Upgrade",
    "url": "https://decrypt.co/204933/lightning-network-hits-bitcoin-atms-in-el-salvador",
    "description": "The switch will \"enable smaller and potentially more frequent transactions,\" according to Genesis Coin."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-08T20:00:00.000Z",
    "title": "NFT sales jump to $129M, OpenSea layoffs and Elon Musk slams NFTs: Nifty Newsletter",
    "url": "http://cointelegraph.com/news/nft-sales-jump-129-m-open-sea-layoffs-elon-musk-slams-nfts-nifty-newsletter",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/bb6f8d05-9f6c-49a9-82e7-fd019f1b8745.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Elon Musk slams NFTs on the Joe Rogan podcast only to unintentionally make the case for Bitcoin Ordinals.</p>\n                    <p><p>In this week’s newsletter, we dive into the dynamic world of <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a> and their impact on the digital landscape, as NFT sales have skyrocketed to an impressive $129 million in November, according to data from Nansen. Despite the surge in sales, OpenSea has laid off a substantial amount of staff as it prepares to launch version 2.0 of its platform, and Elon Musk unintentionally made a case for Bitcoin Ordinals. Meanwhile, an OpenSea investor has taken a 90% markdown on their stake in the platform, and don’t forget this week’s Nifty News featuring The Simpsons roasting NFTs.</p><h2>NFT sales volume jumps to $129 million in November — Nansen data</h2><p>NFTs have seen a large increase in weekly sales volume, with sales reaching 29,704 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), worth approximately $56 million, and later surging to 68,342 ETH (over $129 million) in a matter of weeks.</p><p>NFT marketplace Blur had the highest trading volume in the last 30 days, with 161,433 ETH, which is worth around $305 million, followed by OpenSea with 52,307 ETH, which is around $100 million. When it comes to NFT collections, Bored Ape Yacht Club (BAYC) had the highest trading volume in the last 30 days, at 35,226 ETH, which is approximately $66.7 million.</p><p><a href=\"https://cointelegraph.com/news/nft-sales-volume-november-blur-opensea\"><strong>Continue reading</strong></a></p><h2>OpenSea lays off 50% of staff with severance in preparation for version 2.0 launch</h2><p>OpenSea announced on Nov. 3 that it was laying off employees as part of its plan to launch OpenSea 2.0 with a smaller team. The company has previously laid off 20% of its employees in July 2022 due to the “crypto winter.” At that time, it had a staff of 230.</p><p>According to the company, around 50% of employees would be affected across all functions. Those affected by the mass layoff would receive four-month severance packages, accelerated equity vesting, and six months of continued healthcare and mental healthcare.</p><p><a href=\"https://cointelegraph.com/news/opensea-lays-off-staff-severance-version-2-0-launch\"><strong>Continue reading</strong></a></p><h2>Elon Musk slams NFTs but ends up arguing the case for Bitcoin Ordinals</h2><p>Tesla CEO Elon Musk has unintentionally highlighted the case for Bitcoin Ordinals, also known as Bitcoin NFTs, during his recent appearance on the <em>Joe Rogan Experience</em> podcast. The billionaire pointed out that NFTs are often not stored on the blockchain but are merely URLs linking to JPEG images.</p><p>Bitcoin supporters used Musk’s comments to argue in favor of Bitcoin Ordinals, which were launched in January by developer Casey Rodarmor. Bitcoin Ordinals are similar to NFTs but are stored on Bitcoin’s blockchain.</p><p><a href=\"https://cointelegraph.com/news/elon-musk-slams-nfts-jpeg-url-argues-case-bitcoin-ordinals\"><strong>Continue reading</strong></a></p><h2>OpenSea investor marks down stake in platform by 90%: Report</h2><p>Coatue Management, a tech investment firm based in the United States, has marked down the value of its stake in the NFT platform OpenSea by 90%. The company reduced its investment from $120 million to $13 million, driving down OpenSea’s valuation to $1.4 billion.</p><p>Apart from OpenSea, another Web3 firm has also been marked down. Coatue Management also marked down its investment in a Web3 payment provider firm called MoonPay by 90%. </p><p><a href=\"https://cointelegraph.com/news/opensea-investor-coatue-marks-down-investment\"><strong>Continue reading</strong></a></p><h2>Nifty News: The Simpsons roasts NFTs, Yuga Labs exec departs after antisemitic tweets, and more</h2><p>The animated television series The Simpsons has shown an entire segment making fun of NFTs in its Halloween special. In a segment called “Wild Barts Can’t Be Token,” Homer mints Bart on the blockchain. The segment continued to poke fun at the industry and how the fear of missing out fuels the market. </p><p><a href=\"https://cointelegraph.com/news/nifty-news-the-simpsons-nft-halloween-special\"><strong>Continue reading</strong></a></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-01/43adc850-7dbd-4fa8-811b-9eb32b6c1983.jpg\"  alt=\"\"  title=\"NFT sales jump to $129M, OpenSea layoffs and Elon Musk slams NFTs: Nifty Newsletter\"  /></figure><p class=\"post-content__accent post-content__accent_big\"><a href=\"https://cointelegraph.com/podcasts/nft-steez\">CHECK OUT COINTELEGRAPH’S <em>NFT STEEZ</em> PODCAST</a></p><p><em>Thanks for reading this digest of the week’s most notable developments in the NFT space. Come again next Wednesday for more reports and insights into this actively evolving space.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-08T20:00:00.000Z",
    "title": "LidoDAO launches official version of wstETH on Base",
    "url": "http://cointelegraph.com/news/lidodao-launches-official-version-of-wsteth-on-base",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/7d003885-aa54-4992-8a76-a519315ef54e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>LidoDAO took control of the deployment for a wrapped version of its flagship token, stETH, on Base.</p>\n                    <p><p>Lido’s governing body has approved the deployment of Lido’s Wrapped Staked Ether (wstETH) to Coinbase’s Base network, according to a Nov. 8 announcement. The token is now live and can be traded or used in decentralized finance (DeFi) applications on the Base network.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Lido is on <a href=\"https://twitter.com/BuildOnBase?ref_src=twsrc%5Etfw\">@BuildOnBase</a> <br><br>You can now bridge your staked ETH to Base. <a href=\"https://t.co/JmmFeVwNnN\">https://t.co/JmmFeVwNnN</a> <a href=\"https://t.co/R9vN2XGs2g\">pic.twitter.com/R9vN2XGs2g</a></p>&mdash; Lido (@LidoFinance) <a href=\"https://twitter.com/LidoFinance/status/1722265297913336023?ref_src=twsrc%5Etfw\">November 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Lido is a liquid staking protocol that allows users to stake some cryptocurrencies <a href=\"https://cointelegraph.com/learn/what-is-lido-liquidity-for-staked-assets\">while simultaneously using them in DeFi applications</a>. It does this by issuing a derivative token that can be redeemed for the underlying staked one. </p><p>In the case of Ethereum’s native coin, Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), the derivative token is called “Lido taked Ether (stETH),” which exists on the Ethereum network. When it is sent to other networks through a bridge, it has to first be wrapped, creating a double derivative token called “Wrapped Staked Ether (wstETH).” Before Nov. 8, no official version of wstETH existed on the Base network.</p><p>On Oct. 17, Kyberswap <a href=\"https://research.lido.fi/t/wsteth-deployment-to-base-and-ownership-acceptance-by-lido-dao/5668\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that the Beefy Finance team had deployed an unofficial version of wstETH on Base. The two teams offered a proposal for the DAO to take control and accept ownership of this version, so as to officially endorse it.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/9-protocols-criticize-layerzero-wsteth-token-claiming-proprietary\"><strong>Lido will ‘wind down’ support for Solana stSOL token</strong></a></em></p><p>The DAO approved the proposal on Nov. 2 after 597 million votes were cast in favor of it and 255 were cast against it.</p><p>“The availability of wstETH on Base marks a major milestone in the journey to scaling wstETH adoption,” LidoDAO contributor Marin Tvrdić stated. “Expanding the protocol’s network of compatible L2s bridges the gap between scalability limitations and the growing demand for decentralized staking to benefit the broader Ethereum ecosystem.”</p><p>Although this particular deployment received support from LidoDAO members, not all versions of wstETH have been accepted as official. LayerZero launched a version of wstETH for Avalanche, BNB Chain, and Scroll that <a href=\"https://cointelegraph.com/news/9-protocols-criticize-layerzero-wsteth-token-claiming-proprietary\">drew criticism from multiple protocols</a> for allegedly being “proprietary.” That version is still being debated by the DAO, and no vote has yet been taken on it.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-11-08T20:10:12.000Z",
    "title": "October sees a spike in spot trading volume after 4 months of decline",
    "url": "https://crypto.news/october-sees-a-spike-in-spot-trading-volume-after-4-months-of-decline/",
    "description": "October marks a significant uptick in cryptocurrency trading, with volumes hitting a seven-month peak driven by major digital asset rallies and ETF speculation."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-08T20:05:53.000Z",
    "title": "Ex-NYSE chief leads in FTX’s revival bid ",
    "url": "https://crypto.news/ex-nyse-chief-leads-in-ftxs-revival-bid/",
    "description": "Former NYSE President's firm competes with two others to acquire and relaunch FTX."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-08T20:02:02.000Z",
    "title": "SUI rallies amid market downturn following partnership news",
    "url": "https://crypto.news/sui-rallies-amid-market-downturn-following-partnership-news/",
    "description": "The SUI token has rallied 28% in the past week, riding even higher after Sui's partnership with Space and Time to empower developers building secure dApps."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-08T20:03:06.000Z",
    "title": "Third Ever XRP Bull Signal Is Back: What To Expect",
    "url": "https://www.newsbtc.com/analysis/xrp/third-ever-xrp-bull-signal-is-back-what-to-expect/",
    "description": "XRP is trading at roughly 70 cents per token, but if a recent high timeframe bullish crossover is just the start of the upside to come, the cryptocurrency could be gearing up for an explosive rally. Fishing For New All-Time Highs In XRP XRP is among a few major cryptocurrencies that failed to set a new all-time high in 2021 above its 2018 peak. The lack of strength three years following the still-standing price record could be due to the fact 2018 capped off a 50,000% surge. When that surge back then happened, it occurred just as the 3-month Fisher Transform flipped bullish. That was the first instance of the Fisher Transform crossing bullish and it triggered alongside a breakout from a downtrend line. Related Reading: XRP Price Historical Data Suggests Substantial Q4 Rally Possible The second Fisher Transform 3M signal crossed bullish from much lower, but failed to produce the same substantial upside as the first crossover. Now the crossover is back and it is happening at levels that match the first epic rally. Could the third-time be the charm and produce another rally similar to the first crossover? XRP to over $6? &#124; SRPUSD on TradingView.com The Possible Target Of The Triangle Thrust Considering the law of diminishing returns, the probability of another 50,000% rally is extremely low. However, that doesn’t mean something special couldn’t be on the way. XRP is also breaking out from a downtrend line and triangle pattern on the 3M timescale. The target of this pattern based on the measure rule is an 850% rally, if the price objective is met. This realistically puts XRP at a minimum of $6. Related Reading: XRP Price Prediction for 2023, 2024, 2025, 2030 and Beyond Breaching the previous all-time high from 2018 could cause any really to pick up even more steam, potentially overshooting the pattern-based price objective. Triangles are typical of a wave 4 according to Elliott Wave Principle, and only appear before the final move in a sequence. Although this pattern is bullish for XRP, after the next major rally and new all-time high, things could get ugly. Crypto might be headed for longer duration bear market. Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from Shutterstock, Charts from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-08T20:00:03.000Z",
    "title": "Bitcoin Indicator Backed By Founders Of Top Crypto Data Analytics Firm Predicts Bullish Trends",
    "url": "https://www.newsbtc.com/news/bitcoin-indicator-backed-by-founders-of-top-crypto-data-analytics-firm-predicts-bullish-trends/",
    "description": "Bitcoin (BTC) enthusiasts are keeping a close eye on the latest market trends, and the recent insights from Glassnode&#8217;s co-founders, Jan Happel and Yann Allemann, have stirred up a new wave of excitement.  The duo, known by their Negentropic handle on the social media platform X, have shared some compelling perspectives that shed light on the current dynamics of the BTC market. Bitcoin&#8217;s market demand has outpaced its supply, a clear sign of robust positive momentum. In just one day, a whopping 700,000 new BTC addresses joined the network. This expansion is considered one of the most reliable indicators for price predictions. With fewer BTC coins… pic.twitter.com/zAcgFc9LkS — 𝗡𝗲𝗴𝗲𝗻𝘁𝗿𝗼𝗽𝗶𝗰 (@Negentropic_) November 6, 2023 Related Reading: Exploring The Resurgence Of BNB: Unveiling The Force Behind Renewed Interest Surging Market Demand And Supply Imbalance Happel and Allemann&#8217;s recent observation of the surging market demand outpacing BTC&#8217;s supply has triggered a wave of optimism among investors. They emphasized the remarkable influx of a staggering 700,000 new BTC addresses within a single day, highlighting this expansion as one of the most promising indicators for BTC price predictions.  As the number of BTC coins in circulation decreases, the co-founders anticipate an upward pressure on buying bids, potentially driving the BTC price even higher. As of now, the current price of BTC, according to CoinGecko, stands at $35,255, with a 2.0% gain in the last 24 hours and a 2.7% increase over the past week. Source: Glassnode Unpredictable Shifts In Market Dynamics A closer look at the current state of the BTC market reveals a dynamic landscape where buyers are expected to embrace a proactive approach, potentially entering the market without waiting for significant dips. The co-founders&#8217; analysis suggests that the rapid pace at which BTC is evolving has created an environment where investors are compelled to make timely decisions, leading to an intensified buying spree and consequent upward pressure on the cryptocurrency&#8217;s valuation. The recent surge in the utilization of Bitcoin futures and options has captured the attention of both the media and seasoned investors. Glassnode&#8217;s Happel and Allemann speculate that this increasing demand for leverage is primarily fueled by investors&#8217; anticipation of two highly bullish catalysts slated for 2024.  Related Reading: Defensive Moves: XRP Bulls Firmly Shield $0.66 Before Ripple Swell 2023 Bitcoin currently trading at $35K level today. Chart: TradingView.com The first catalyst revolves around the long-awaited potential for a spot BTC Exchange-Traded Fund (ETF), a development that could significantly boost institutional adoption and drive further demand for BTC. Secondly, the prospect of the Bitcoin halving event has emerged as another powerful incentive, drawing the attention of investors who anticipate a subsequent scarcity-driven price surge. As the BTC market continues to evolve and capture the attention of both seasoned investors and newcomers alike, the observations and insights shared by Glassnode&#8217;s co-founders serve as valuable signposts, guiding market participants through the intricate maze of cryptocurrency investments and market dynamics. The latest developments in the world of Bitcoin point to a market in which demand is outstripping supply, potentially setting the stage for a bullish run. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-08T19:47:00.000Z",
    "title": "HSBC To Launch Custody Services For Digital Assets With Metaco",
    "url": "https://coinedition.com/hsbc-to-launch-custody-services-for-digital-assets-with-metaco/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/HSBC_Global_CEO_Noel_Quinn_Decodes_The_Way_Ahead_For_Digital_Currencies.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"HSBC To Launch Custody Services For Digital Assets With Metaco\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/HSBC_Global_CEO_Noel_Quinn_Decodes_The_Way_Ahead_For_Digital_Currencies.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/HSBC_Global_CEO_Noel_Quinn_Decodes_The_Way_Ahead_For_Digital_Currencies-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/HSBC_Global_CEO_Noel_Quinn_Decodes_The_Way_Ahead_For_Digital_Currencies-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/HSBC_Global_CEO_Noel_Quinn_Decodes_The_Way_Ahead_For_Digital_Currencies-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/HSBC_Global_CEO_Noel_Quinn_Decodes_The_Way_Ahead_For_Digital_Currencies-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>On November 8, Bloomberg reported that HSBC Holdings Plc intends to provide custody services for digital assets like tokenized securities to its institutional clients, in collaboration with Metaco, a Swiss-based institutional digital asset custody, trading and DeFi firm owned by Ripple Labs. According to Reuters, the bank stated that these services will become operational in [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/hsbc-to-launch-custody-services-for-digital-assets-with-metaco/\">HSBC To Launch Custody Services For Digital Assets With Metaco</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-08T19:45:46.000Z",
    "title": "$163,000,000 in Ethereum (ETH) To Be Distributed to Token Holders of Aragon (ANT) As Project Gets Handed Off",
    "url": "https://dailyhodl.com/2023/11/08/163000000-in-ethereum-eth-to-be-distributed-to-token-holders-of-aragon-ant-as-project-gets-handed-off/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/eth-token-ant.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/eth-token-ant.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/eth-token-ant.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/eth-token-ant.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/eth-token-ant.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/eth-token-ant.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/eth-token-ant.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The association behind Aragon (ANT), a decentralized governance platform on the Ethereum (ETH) blockchain, is dissolving. The Aragon Association (AA) says in a new announcement that it will deploy 86,343 ETH worth about $163 million to offer Ethereum redemptions for ANT holders. According to the statement, holders of the governance token may redeem their coins [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/08/163000000-in-ethereum-eth-to-be-distributed-to-token-holders-of-aragon-ant-as-project-gets-handed-off/\">$163,000,000 in Ethereum (ETH) To Be Distributed to Token Holders of Aragon (ANT) As Project Gets Handed Off</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-08T19:41:45.000Z",
    "title": "CFTC Says 2023 Saw Record Number of Digital Asset Complaints, Nearly Half of All Enforcement Actions",
    "url": "https://dailyhodl.com/2023/11/08/cftc-says-2023-saw-record-number-of-digital-asset-complaints-nearly-half-of-all-enforcement-actions/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/Crypto-Regulations-From-CFTC-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/Crypto-Regulations-From-CFTC-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/Crypto-Regulations-From-CFTC-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/Crypto-Regulations-From-CFTC-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/Crypto-Regulations-From-CFTC-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/Crypto-Regulations-From-CFTC-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/Crypto-Regulations-From-CFTC-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The Commodity Futures Trading Commission (CFTC) says that 2023 has seen a record number of complaints about crypto assets, which were the topic of nearly half of its enforcement actions. In a new press release, the regulatory agency says that fiscal year 2023 has seen a record number of digital asset cases, ultimately culminating in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/08/cftc-says-2023-saw-record-number-of-digital-asset-complaints-nearly-half-of-all-enforcement-actions/\">CFTC Says 2023 Saw Record Number of Digital Asset Complaints, Nearly Half of All Enforcement Actions</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]