[
  {
    "source": "Cointelegraph",
    "date": "2023-08-16T13:01:00.000Z",
    "title": "From the U.S. to Japan, regulators are beginning to embrace crypto",
    "url": "https://cointelegraph.com/news/from-the-u-s-to-japan-regulators-are-beginning-to-embrace-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/95ea2da6-6c15-4be8-b107-ccbe3ed946e0.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Switzerland, Singapore and the EU have taken the early regulatory lead, but Japan and the UAE are coming on now. Even the U.S. may be awakening. </p>\n                    <p><p>When it comes to cryptocurrency/blockchain regulation, considerable attention has been focused, this past year, on the United States' action (or inaction). But the U.S. is not the world, just one important player, and crypto, from its beginnings, has been a global enterprise. </p><p>Perhaps, then, it makes sense to step back and ask: What is going on with crypto regulation when viewed through a <em>global </em>lens?</p><p>For instance, how do geographic regions such as Europe, Asia and North America compare in terms of crypto legislation, rules and enforcement? Is there any single country or jurisdiction that could serve as an exemplar for regulation? How is the developing world dealing with all this variation? And finally, are there reasons to be hopeful about the way regulatory trends are now unfolding?</p><p>If one focuses solely on the negative — the tide of crypto-related collapses, bankruptcies and enforcement actions in the United States this past year — a skewed picture can emerge. Progress in places like Europe might be overlooked, like the European Union’s recent adoption of its Markets in Crypto-Assets (MiCA) regulatory framework. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/688d28bf-2ff4-45e6-9740-87accd7502ac.jpg\"  /></figure><p>“Through MiCA, the European Union has been a global model by offering the much needed regulatory clarity that crypto businesses of varying sizes and business models would need,” Caroline Malcolm, vice president of global Policy at Chainalysis, told Cointelegraph, adding:</p><blockquote>“Regulatory clarity and consistent implementation of rules will allow businesses to devise their operational program.” </blockquote><p>Nor is Europe necessarily alone in pursuing a forward-looking path. “There is massive momentum on achieving regulatory clarity for digital assets across the world, whether that be in the U.S., Singapore, the UAE or others,” Malcolm said.</p><h2>A fragmented world</h2><p>Despite some promising trends, global crypto regulation — laws, rules, enforcement, taxation, etc. — remains a mixed bag. </p><p>“There's a lot of fragmentation when it comes to regulation depending on the jurisdictions and geographical areas,” Bertrand Perez, CEO of the Web3 Foundation, told Cointelegraph in an interview earlier this week. </p><p>“In the U.S. we know, we know what's happening or what is not happening over there,” continued Perez, who earlier served as chief operations officer at the Diem Association (formerly Libra, Facebook’s high-profile but ultimately failed stablecoin experiment). </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\">Deposit risk: What do crypto exchanges really do with your money?</a></em></strong></p><p>Europe’s MiCA regulations, by comparison, focus on stablecoins. Indeed, MiCA is the EU’s “answer to the Libra project,” Perez said.</p><p>Significantly, the Europeans recognize that one can’t have a single regulatory framework for everything crypto, he added. MiCA is step one, “but then they've been slicing the use cases.” There will eventually be another regulatory framework for nonfungible tokens and another for metaverse-related use cases.</p><p>The EU doesn’t hold a monopoly on progressive thinking either. Switzerland, which is not an EU member, was the first country to develop a clear crypto framework back in 2018. </p><p>The <a href=\"https://cointelegraph.com/learn/an-overview-of-the-cryptocurrency-regulations-in-switzerland\">Swiss regulatory scheme</a> separates tokens into three categories: security (a.k.a. “asset”) tokens, utility tokens and payment tokens, and also provides a number of licensing schemes dependent on the project's structure. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/c7e53753-963d-430c-a7d2-0a50fc34ed63.png\"  /></figure><p>In the U.S., by comparison, the Securities and Exchange Commission appears to have categorized all digital tokens — with the possible exception of Bitcoin — as security tokens. But in Switzerland, according to Perez:</p><blockquote>“If you are a utility token and or if you're a security token, the rules of the road are completely different from the regulation perspective.” </blockquote><p>The legal certainty that Switzerland has offered for several years now is the reason that so many crypto-related foundations and companies are based there and the reason so much Web3 innovation comes out of that country, he said. The Web3 Foundation, creator of the Polkadot protocol, is based in Zug, Switzerland. </p><p>Historically, Singapore followed Switzerland’s lead, and for a while, those two venues stood alone in terms of crypto rule-making clarity. “In 2019, when we announced Libra, there were those two choices, either Switzerland or Singapore, in terms of regulation,” Perez recalled. “The two countries were clearly leading the pack and having clear frameworks that were well defined.”</p><h2>The evolving case of Japan</h2><p>Today, there are more approaches. “In Asia as a geographical area, every country is having a different approach” to regulation, Perez continued. </p><p>However, Japan is one jurisdiction that is attracting more attention than the others. Japan was formerly the home of Mt. Gox, which was the subject of crypto’s first mega scandal. When that cryptocurrency exchange <a href=\"https://coingeek.com/mt-gox-repayments-to-start-in-march-2023-nine-years-after-collapse/#:~:text=receiving%20their%20stash.-,Mt.,at%20least%20some%20of%20them.\" target=\"_blank\" rel=\"noopener nofollow\">collapsed</a> in 2014, it arguably made Japan crypto-wary. But if so, the island nation seems to be emerging from its isolation now — at least based on discussions Perez and others have held there recently. </p><p>“Japan is still a land of many innovations,” he reported. Indeed, at the WebX conference held in Tokyo in late July, Japanese Prime Minister Fumio Kishida <a href=\"https://www.businesswire.com/news/home/20230726651017/en/ADDING-MULTIMEDIA-Web3-Foundation-Initiates-Global-Roundtable-Discussions-with-Policy-makers-Starting-in-Japan\" target=\"_blank\" rel=\"noopener nofollow\">announced</a>, “Web3 is part of the new form of capitalism,” adding that it would be a vital element of Japan's economic strategy, centered on growth, innovation, wealth distribution, digital transformation and the support of startups.</p><p>“The Prime Minister announced that basically he is welcoming Web3 to Japan, where a year ago or even a few months ago it wasn’t clear if they were supportive or not,” Perez told Cointelegraph. “Now it's clear and the rules are going to be as business friendly as possible.” </p><p>Japan wanted to develop and implement clear and well-defined rules of the road for cryptocurrencies before it opened its gates again after Mt. Gox, Perez suggested, and they have those now. As he further noted:</p><blockquote>“Japan’s crypto exchanges are the safest in the world now because the regulation is very strong. And now they are broadening their reach and welcoming broader [crypto] use cases.”</blockquote><h2>The most progressive G7 nation?</h2><p>Elsewhere, China has been in the process of launching its digital yuan, becoming “the first country to have a central bank digital currency at scale,” according to Perez. Meanwhile, Dubai, the most populous city in the United Arab Emirates, is now “really pushing hard” in the crypto sphere “to attract not only capital but also skills from all around the world,” said Perez.</p><p>Asked to rank the largest Western countries in terms of regulatory crypto foresightedness, Perez put the European countries ahead of Japan, with the U.S. bringing up the rear. Within the EU, he would place his native France at the forefront, given that it is “the first European country to clearly implement the MiCA framework ahead of the law being enforced in the European Union.” </p><p>France has also done a good job at defining the rules of the road “in a way that is usable from a business perspective.” The U.K., no longer in the EU, is also “beginning to shift and see the value” in crypto and blockchain technology, he added. </p><p>Perez even detects “a different tone” among U.S. regulators and legislators; they now seem less likely to view the cryptoverse as a place inhabited chiefly by drug dealers and money launderers. He also observed that cryptocurrency reform is being spearheaded by legislators “on both sides of the aisles” within the most recent U.S. Congress. </p><p>What about low- and moderate-income countries — where do they stand with regard to crypto regulation? </p><p>“Most of those countries are basically waiting for the big players like the U.S., the European Union and Japan,” Perez said. They will watch to see which frameworks work best and can be adapted to their particular circumstances. </p><p>Which regulatory elements would he especially like to see duplicated globally? “If I had to recommend one framework, I would choose a combination of the Swiss token framework and parts of the EU’s stablecoin framework,” Perez answered.</p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/bitcoin-etf-approval-2024\">SEC delays set deadlines for Bitcoin ETF approval to early 2024</a></em></strong></p><p>These would offer some flexibility and encourage innovation. Within the EU framework, there is even room now for a token to be reclassified over time. A token might begin its “life” as a security token, but later evolve into a utility token. As the Web3 Foundation’s chief legal officer, Daniel Schoenberger, <a href=\"https://cointelegraph.com/news/in-the-us-targeted-crypto-legislation-could-start-the-ball-rolling\">explained to Cointelegraph in May</a>:</p><blockquote>“A token can be used initially as a fundraising instrument. If a token is used for fundraising purposes, it should be subject to all applicable laws and regulations. However, over time that same token may serve a functional purpose devoid of speculative investment. This is part of the nature and innovation of blockchain technology.”</blockquote><p>When asked whether he viewed the global regulatory glass as half empty or half full, Perez noted that this past year was generally a difficult one for the crypto sector amid scandals and bankruptcies like FTX and Celsius. </p><p>However, “I think we've passed through the worst,” Perez said. Some harsh criticism was heaped upon the industry, but that in turn may have led to “a bit more transparency” as well as reinforcing the need to build projects that last. Perez continued:</p><blockquote>“So from that perspective, I’m very optimistic in terms of regulation. I'm also optimistic regarding U.S. policymakers. People are really starting to get it.” </blockquote><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-16T13:00:00.000Z",
    "title": "Ledger announces U.S. PayPal integration, lets users buy crypto from within app",
    "url": "https://cointelegraph.com/news/ledger-announces-u-s-paypal-integration-lets-users-buy-crypto-from-within-app",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/bfeab222-7c0a-4a78-9e0c-8df920b08599.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Through the new integration, verified PayPal users in the United States will be able to buy BTC, ETH, BCH, and LTC directly through Ledger Live.</p>\n                    <p><p>Hardware wallet manufacturer Ledger has integrated its Ledger Live software with PayPal, according to an Aug. 16 joint announcement by the two companies. The integration allows U.S. residents with verified PayPal accounts to buy Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), Bitcoin Cash (BCH) and Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) directly through Ledger Live with no extra verification, the announcement stated.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/031dd98c-919a-4bb2-90fd-257f91d8341a.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Ledger Live software and device. Source: Ledger</em></figcaption></figure><p>Ledger Live previously allowed users to buy crypto through partners MoonPay, Transak, Ramp, Simplex, Loopipay and Mercuryo. PayPal is the newest addition to this list. When a user purchases crypto through PayPal via Ledger Live, it is immediately sent to the user’s wallet, and no “withdrawal” process needs to be initiated by the user, the announcement stated.</p><p>Ledger chairman and CEO Pascal Gauthier claimed that combining Ledger Live with PayPal will make crypto transactions simpler while also not compromising on security:</p><blockquote>“We’re combining the uncompromising security of Ledger with PayPal's leadership in protected payments technology to help facilitate a seamless platform for user crypto transactions. Ledger is committed to simplifying the world of crypto and PayPal is committed to making the movement of money as simple, reliable and affordable as possible.”</blockquote><p>Ledger claims to have <a href=\"https://www.ledger.com/the-ledger-nano-s-sunset-the-next-phase-in-our-web3-hardware-journey\" target=\"_blank\" rel=\"noopener nofollow\">sold</a> over 3 million Ledger Nano S hardware wallets since 2016, making it one of the top hardware wallet manufacturers. It came under some controversy in May, when it launched a secret recovery phrase storage service that <a href=\"https://cointelegraph.com/news/crypto-community-reacts-to-ledger-wallet-s-secret-recovery-phrase-service\">led to confusion among users</a>. The team later attempted to hose down criticism by <a href=\"https://cointelegraph.com/news/ledger-clarifies-how-its-firmware-works-after-deleted-tweet-controversy\">clarifying how their wallet works</a>.</p><p>PayPal announced on Aug. 7 that it is <a href=\"https://cointelegraph.com/news/paypal-launches-stablecoin-for-payment\">launching a stablecoin</a> called PYUSD, but the Aug. 15 announcement does not list PYUSD as one of the coins that will be available on Ledger Live just yet.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/ledger-announces-u-s-paypal-integration-lets-users-buy-crypto-from-within-app&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-16T13:00:00.000Z",
    "title": "$26M ETH bridged: ConsenSys completes public launch of zkEVM Linea",
    "url": "https://cointelegraph.com/news/consensys-completes-public-launch-of-zkevm-linea",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/8020b14b-77e9-4c33-b2d0-54cfd664c3a6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>ConsenSys’ Ethereum scaling network Linea is now fully public, having processed over three million transactions and bridging $26 million in Ether.</p>\n                    <p><p>ConsenSys has completed the launch of its Ethereum scaling rollup Linea, onboarding over 150 partners and bridging more than $26 million in Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) to date.</p><p>Linea <a href=\"https://cointelegraph.com/news/consensys-launches-linea-zk-evm-to-scale-ethereum\"></a><a href=\"https://cointelegraph.com/news/consensys-launches-linea-zk-evm-to-scale-ethereum\">went live with select partners</a> onboarded to the alpha mainnet in July 2023, allowing developers to migrate existing decentralized applications (DApps) from Ethereum’s mainnet or other scaling solutions. The zero-knowledge Ethereum Virtual Machine (zkEVM) is a <a href=\"https://cointelegraph.com/learn/a-beginners-guide-on-blockchain-layer-2-scaling-solutions\">layer-2</a> scaling solution that provides lower transaction costs and higher throughput for DApps running in the Ethereum ecosystem.</p><p>Cointelegraph spoke exclusively to Linea senior product manager Declan Fox to unpack major milestones since the zkEVM’s launch. Fox highlighted Ethereum co-founder Vitalik Buterin’s belief that zero-knowledge rollups (ZK-rollups) would prove crucial in the operation of the wider Ethereum ecosystem as Zero-Knowledge Succinct Non-Interactive Argument of Knowledge (zk-SNARK) technology improves.</p><blockquote>“Bytecode-compatible zkEVMs, like Linea, provide stronger security guarantees than existing scaling solutions and maintain the full network effects of the EVM — the most adopted smart contract execution environment.”</blockquote><p>According to Fox, Linea’s mainnet facilitates trustless bridging between Ethereum and layer 2 in minutes, creating a capital-efficient environment for liquidity to be tied into rollups. Linea also addresses the disadvantages of <a href=\"https://cointelegraph.com/learn/a-beginners-guide-on-blockchain-layer-2-scaling-solutions\">optimistic rollup</a> solutions that have a seven-day withdrawal confirmation time. </p><blockquote>“Much like how countries without foreign exchange control in the financial markets are more competitive, zkEVM solutions will soon outperform optimistic solutions in terms of user and liquidity acquisition.”</blockquote><p>Fox added that Linea supports a variety of Web3 use cases, while its low transaction costs and high throughput makes it particularly useful for decentralized finance (DeFi) applications. </p><blockquote>“Linea is seamless for existing DeFi protocols and DApp developers to build composable money legos that work together to create innovative user experiences.”</blockquote><p>Linea also features default integration with ConsenSys’ browser-based MetaMask wallet, allowing DApps on the network to access millions of users across the ecosystem.</p><p>Fox also noted that the potential for the Linea ecosystem is “boundless,” reflecting on the capabilities of ZK-rollup technology to provide lower costs, higher throughput and Ethereum-based security while providing a capital-efficient bridge to the layer-1 mainnet.</p><p>The public release also saw Linea’s ERC-20 token bridge go live, allowing ERC-20 tokens — like stablecoins, liquid staking ETH and memecoins — to be bridged and accessible through the scaling solution.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/consensys-completes-public-launch-of-zkevm-linea&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><em><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/ethereums-layer-2-zk-rollups-can-become-interoperable/\">Here’s how Ethereum’s ZK-rollups can become interoperable</a></strong></em></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-16T13:08:10.000Z",
    "title": "Sora Summit to close out Taipei Blockchain Week 2023 with powerhouse speakers",
    "url": "https://cryptoslate.com/sora-summit-to-close-out-taipei-blockchain-week-2023-with-powerhouse-speakers/",
    "description": "<p>Crypto investment firm Sora Ventures will host its Sora Summit in Taipei on Dec. 16 to mark the end of Taipei Blockchain Week, according to a recent statement shared with CryptoSlate. The initiative, first hosted in Macau in 2018, will feature over 100 speakers discussing Web3-related topics before the over 1000 expected attendees. Summit to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sora-summit-to-close-out-taipei-blockchain-week-2023-with-powerhouse-speakers/\">Sora Summit to close out Taipei Blockchain Week 2023 with powerhouse speakers</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-16T13:00:00.000Z",
    "title": "Stellar’s MoneyGram Investment Unlocks Board Seat",
    "url": "https://cryptodaily.co.uk/2023/08/stellar-s-moneygram-investment-unlocks-board-seat",
    "description": "<p>The Stellar Development Foundation (SDF) has made a strategic investment in MoneyGram International, which resulted in obtaining a coveted seat on the firm&rsquo;s Board of Directors.&nbsp;&nbsp;</p>\nBuilding On A Strong Partnership\n<p>The Stellar Development Foundation, responsible for expanding the Stellar network, announced a substantial investment in MoneyGram, a key player in the money transfer sector. This decision builds upon their existing commercial partnership, which was established two years ago. Although the SDF established a commercial partnership with MoneyGram in 2021, the two have collaborated on tools and technology since 2019.&nbsp;</p>\n<p>Back then, MoneyGram joined forces with SDF to enable cryptocurrency payments and to introduce a cash-to-crypto service. Late last year, the payments firm announced plans to enable users to buy, sell, and hold crypto assets.&nbsp;</p>\nStrategic Investment from SDF\n<p>Denelle Dixon, the CEO and Executive Director of SDF, clarified in a recent blog post that the investment was made from the SDF's cash treasury, distinct from the Enterprise Fund, which typically supports startups and early-stage companies. This marks the first instance of such an investment being drawn from SDF's treasury. Dixon emphasized that this strategic move aligns with SDF&rsquo;s core mission and is a testament to MoneyGram's commitment to digital evolution.</p>\nA Leap Towards Digital Advancement\n<p>This investment is expected to bring about substantial benefits for both parties involved. MoneyGram, a prominent player in global financial technology, is set to expand its digital reach with the support of SDF's investment. Moreover, this collaboration will pave the way for the exploration of blockchain technology in the realm of money transfers.</p>\n<p>Dixon highlighted the significance of this partnership by stating,&nbsp;</p>\n\n<p>&ldquo;Most importantly, it signifies a rededication from MGI, one of the world&rsquo;s leading global financial technology, to becoming a digital-forward leader in fintech.&rdquo;</p>\n\nGaining a Seat at the Table\n<p>The most noteworthy outcome of this investment is SDF securing a seat on MoneyGram's Board of Directors. This move not only solidifies their partnership but also positions SDF to actively contribute to MoneyGram's strategic decisions and digital business expansion.</p>\n<p>Although the exact amount of the investment remains undisclosed, Dixon affirmed that this collaboration underscores SDF's commitment to bridging the gap and democratizing access to financial services.</p>\n<p>In her own words,&nbsp;</p>\n\n<p>&ldquo;Continuing to build strong partnerships with organizations across the payments space puts SDF one step closer to achieving our mission of creating equitable access to financial services.\"</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T13:03:25.000Z",
    "title": "UK Invests in Green AI Initiatives to Drive Carbon Emission Reductions",
    "url": "https://www.cryptopolitan.com/ukin-green-ai-initiatives-to-drive-carbon/",
    "description": "The United Kingdom is taking a groundbreaking step towards combatting carbon emissions by investing in innovative artificial intelligence (AI) solutions. Twelve cutting-edge AI initiatives will be funded with a multi-million-pound government investment to enhance decarbonization efforts and advance renewable energy generation. This strategic move aligns with the UK&#8217;s ambitious net zero goal for 2050, showcasing ... <a title=\"UK Invests in Green AI Initiatives to Drive Carbon Emission Reductions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ukin-green-ai-initiatives-to-drive-carbon/\" aria-label=\"More on UK Invests in Green AI Initiatives to Drive Carbon Emission Reductions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T12:56:59.000Z",
    "title": "Silvergate CEO’s mysterious exit amid fraud allegations",
    "url": "https://www.cryptopolitan.com/silvergate-ceos-mysterious-exit/",
    "description": "Silvergate Capital, the parent company of Silvergate Bank, is undergoing significant changes as CEO Alan Lane and two other top executives prepare to step down from their positions. This comes as part of the company&#8217;s plan to wind down operations and voluntarily liquidate Silvergate Bank, which was once known for its crypto-friendly stance. Alan Lane ... <a title=\"Silvergate CEO&#8217;s mysterious exit amid fraud allegations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/silvergate-ceos-mysterious-exit/\" aria-label=\"More on Silvergate CEO&#8217;s mysterious exit amid fraud allegations\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T12:48:20.000Z",
    "title": "Dutch economy enters into recession following a 0.3% drop in Q2",
    "url": "https://www.cryptopolitan.com/dutch-economy-enters-into-recession/",
    "description": "The Dutch economy has officially slipped into a recession as it recorded consecutive declines in quarterly gross domestic product indicators. According to data from Statistics Netherlands (CBS), the GDP volume experienced a decrease of 0.4 percent in the initial quarter of this year, followed by a further dip of 0.3 percent in the subsequent quarter. ... <a title=\"Dutch economy enters into recession following a 0.3% drop in Q2\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dutch-economy-enters-into-recession/\" aria-label=\"More on Dutch economy enters into recession following a 0.3% drop in Q2\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-16T13:09:06.000Z",
    "title": "BlockFi’s bankruptcy moves forward with creditor vote",
    "url": "https://crypto.news/blockfis-bankruptcy-moves-forward-with-creditor-vote/",
    "description": "BlockFi announces the start of its Chapter 11 solicitation period, allowing creditors to vote on the bankruptcy plan. Blockfi has announced via Twitter that the solicitation period for creditors under Chapter 11 has begun. During this time, the creditors can&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-16T13:03:23.000Z",
    "title": "FDIC highlights potential banking risks from crypto activities",
    "url": "https://crypto.news/fdic-highlights-potential-banking-risks-from-crypto-activities/",
    "description": "In this year&#8217;s review, the FDIC evaluates the potential implications and challenges of integrating crypto activities into the traditional US banking framework. In its 2023 annual risk review, the US Federal Deposit Insurance Corporation (FDIC) dedicated a comprehensive section to&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-16T12:50:07.000Z",
    "title": "Best-Selling Author Touts Buy XRP Now, But This Price Is Crucial",
    "url": "https://www.newsbtc.com/analysis/xrp/best-selling-author-buy-xrp-now-but-this-price-crucial/",
    "description": "Linda P. Jones has identified a life-changing buying opportunity for XRP, urging investors to capitalize on this moment. Jones, known for her works, &#8220;3 Steps to Quantum Wealth: The Wealth Heiress&#8217; Guide to Financial Freedom by Investing in Cryptocurrencies&#8221; and &#8220;You&#8217;re Already a Wealth Heiress, Now Think and Act Like One: 6 Practical Steps to Make It a Reality Now!&#8221; took to Twitter today, sharing her bullish perspective on several cryptocurrency assets. She fervently states, &#8220;Gave a wake up call to VIP Experience members today: If you&#8217;re not investing in XRP at $0.60, XDC at $0.06, ALGO at $0.10, XLM at $0.10…don&#8217;t come crying to me when they are higher!&#8221; Drawing attention to the present market valuations, she highlighted that many of these assets are currently &#8220;selling at a deep discount&#8221;. She further advised her followers and readers to take a decisive stance on their investments. &#8220;You need to be scooping them up, without a perfectionist mindset of being too afraid to buy if it isn&#8217;t the absolute bottom.&#8221; Related Reading: Institutional XRP Holdings Rise Rapidly Following Ripple’s Win Over SEC While Jones accentuates the potential gains of these assets, she equally emphasizes the investor mindset. Suggesting that the pursuit of the perfect buying point might be a fallacy, she stated, &#8220;You need to be scooping them up, without a perfectionist mindset of being too afraid to buy if it isn&#8217;t the absolute bottom.&#8221; Emphasizing the timely nature of the present market conditions, Jones opines, &#8220;These are life changing prices, but you must take action. The least amount of risk is when prices are low, which is NOW. Could they go lower? Yes. So what, they will likely be a LOT higher in 2 years or sooner, so what are you waiting for?&#8221; XRP Price Analysis A price analysis of the 1-day chart suggests that the XRP price is at a crucial point following the summary judgement in the Ripple vs. SEC case. Related Reading: SEC Asks Court To File Interlocutory Appeal Vs. Ripple, XRP Price Stable At press time, XRP was trading at $0.59, down more than 35% from its yearly high at $0.93 following the summary judgment in the Ripple against the US Securities And Exchange Commission (SEC) case. Before the verdict was announced, XRP was trading at $0.47, meaning that the XRP price has already lost most of its gains following the euphoria over Ripple&#8217;s victory. A look at the 1-day chart shows that XRP found support at the 100-day EMA at $0.5782 yesterday. Subsequently, XRP bulls managed to stage a small recovery. However, XRP is not out of the woods yet as the correction could continue unless the price shows a signal of trend reversal on the shorter timeframes. A first step would be to break above the 61.8% Fibonacci retracement level at $0.6340. A strong confirmation would be a spike above $0.69 where the 50% Fibonacci retracement level is located. In a bearish scenario, XRP also loses the 100-day EMA and falls towards the 200-day EMA at $0.5256. The level can be interpreted as the most crucial support at the moment. If the &#8220;bull line&#8221; fails to hold, the XRP price could face a crash to pre-Ripple ruling levels. Featured image from Outlook India, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-16T13:00:10.000Z",
    "title": "We Asked Google Bard for Tokens To Make Quick 10x Gains; the AI Picked Chiliz, Sui,  Everlodge",
    "url": "https://www.crypto-news-flash.com/we-asked-google-bard-for-tokens-to-make-quick-10x-gains-the-ai-picked-chiliz-sui-everlodge/?utm_source=rss&utm_medium=rss&utm_campaign=we-asked-google-bard-for-tokens-to-make-quick-10x-gains-the-ai-picked-chiliz-sui-everlodge",
    "description": "<img width=\"512\" height=\"329\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-49.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-49.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-49-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The AI language model, Google Bard, has spoken, and its top picks for cryptos to make quick 10x gains are Chiliz (CHZ), Sui (SUI), and Everlodge (ELDG). Today, we&#8217;ll delve into the reasons behind Google Bard&#8217;s choices. Also, we will explore the unique features that make these tokens stand out in the competitive crypto landscape. [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-16T13:07:37.000Z",
    "title": "Why is Bitcoin (BTC) the Best-Performing Asset in 2023?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/why-is-bitcoin-btc-the-best-performing-asset-in-2023/",
    "description": "<p>Many people who joined the crypto industry last year would have been left disappointed because all the promises of good returns were beaten down by the bear market. Last year was not only disappointing but also frustrating for crypto investors. But what if we told you that Bitcoin (BTC) is currently the best-performing asset of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/why-is-bitcoin-btc-the-best-performing-asset-in-2023/\">Why is Bitcoin (BTC) the Best-Performing Asset in 2023?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-16T12:59:53.000Z",
    "title": "Sei Labs Completes Mainnet Launch",
    "url": "https://www.altcoinbuzz.io/spotlight/sei-labs-completes-mainnet-launch/",
    "description": "<p>Following a successful testnet phase, Sei Labs, the parent company of the layer 1 blockchain Sei Network, has announced that its mainnet is now active. In addition, the SEI token was also listed on exchanges such as Huobi, Binance, and Kraken. The Sei Labs team said that the goal is to build a network that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/spotlight/sei-labs-completes-mainnet-launch/\">Sei Labs Completes Mainnet Launch</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-16T12:52:00.000Z",
    "title": "McDonald’s Singapore Launches 2000 Grimace Digital Collectibles",
    "url": "https://coinedition.com/mcdonalds-singapore-launches-2000-grimace-digital-collectibles/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Grimace_goes_digital_McDonalds_Singapore_to_launch_2000_limited.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Grimace_goes_digital_McDonalds_Singapore_to_launch_2000_limited.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Grimace_goes_digital_McDonalds_Singapore_to_launch_2000_limited-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Grimace_goes_digital_McDonalds_Singapore_to_launch_2000_limited-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Grimace_goes_digital_McDonalds_Singapore_to_launch_2000_limited-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Grimace_goes_digital_McDonalds_Singapore_to_launch_2000_limited-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Grimace_goes_digital_McDonalds_Singapore_to_launch_2000_limited-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Grimace_goes_digital_McDonalds_Singapore_to_launch_2000_limited-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Grimace_goes_digital_McDonalds_Singapore_to_launch_2000_limited-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Grimace_goes_digital_McDonalds_Singapore_to_launch_2000_limited-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Grimace_goes_digital_McDonalds_Singapore_to_launch_2000_limited-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Grimace_goes_digital_McDonalds_Singapore_to_launch_2000_limited-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Grimace_goes_digital_McDonalds_Singapore_to_launch_2000_limited-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Grimace_goes_digital_McDonalds_Singapore_to_launch_2000_limited-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Grimace_goes_digital_McDonalds_Singapore_to_launch_2000_limited-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Grimace_goes_digital_McDonalds_Singapore_to_launch_2000_limited-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Grimace_goes_digital_McDonalds_Singapore_to_launch_2000_limited-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>McDonald’s Singapore has announced the release of 2000 NFTs in the upcoming week. The digital collectibles are a collaboration between McDonald’s with the metaverse service provider Bandwagon Labs and the NFT artist The Hidden Walls. The Grimace Digital Collectibles enables users to hold a virtual representation of Grimace, a friend of Ronald McDonald first introduced [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/mcdonalds-singapore-launches-2000-grimace-digital-collectibles/\">McDonald’s Singapore Launches 2000 Grimace Digital Collectibles</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]