[
  {
    "source": "CryptoSlate",
    "date": "2023-10-19T07:49:20.000Z",
    "title": "NVIDIA steps up self-driving with Foxconn partnership to put NVIDIA DRIVE in cars",
    "url": "https://cryptoslate.com/nvidia-steps-up-self-driving-with-foxconn-partnership-to-put-nvidia-drive-in-cars/",
    "description": "<p>In the pursuit of intelligent electric vehicle (EV) platforms, Foxconn and NVIDIA have amplified their ongoing collaboration. They made the announcement at the fourth annual Hon Hai Tech Day in Taiwan, where the CEOs of both companies shared their plans to influence the worldwide car market. The partnership will allow Foxconn to progress its vision [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/nvidia-steps-up-self-driving-with-foxconn-partnership-to-put-nvidia-drive-in-cars/\">NVIDIA steps up self-driving with Foxconn partnership to put NVIDIA DRIVE in cars</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-19T07:59:00.000Z",
    "title": "Former Morgan Stanley Exec Even More Bullish on XRP Following Coinbase’s Launch of XRP Perpetual Futures",
    "url": "https://www.cryptoglobe.com/latest/2023/10/former-morgan-stanley-exec-even-more-bullish-on-xrp-following-coinbases-launch-of-xrp-perpetual-futures/",
    "description": "Coinbase has broadened its trading offerings to feature perpetual futures for qualified clients in select non-U.S. regions. This addition is an integral component of Coinbase Advanced, a trading interface designed for seasoned retail investors. The expansion is a strategic response to the crypto derivatives market, which Coinbase states accounts for 75% of global cryptocurrency trading […]\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-19T08:06:37.000Z",
    "title": "Short-term Uniswap (UNI) holders in loss as investors dump",
    "url": "https://crypto.news/short-term-uniswap-uni-holders-in-loss-as-investors-dump/",
    "description": "Uniswap (UNI) investors have been dumping the asset as the decentralized finance (defi) protocol started to charge swap fees. Uniswap founder Adam Hayden announced on Oct. 16 that the protocol will start charging a 0.15% swap fee to continue its&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-19T08:00:47.000Z",
    "title": "Pro-XRP Lawyer Reacts To Elon Musk And Mark Cuban’s Amicus Brief To SEC",
    "url": "https://www.newsbtc.com/xrp-news/pro-xrp-lawyer-elon-musk-mark-cuban-amicus-sec/",
    "description": "In a pivotal moment backed by pro-XRP lawyer John E Deaton&#8217;s sentiments, high-profile entrepreneurs Elon Musk and Mark Cuban, along with a consortium of prominent investors, have raised objections against the US Securities and Exchange Commission (SEC). This challenge comes in the form of an amicus curiae brief addressing the SEC&#8217;s litigation procedures. Elon Musk and Mark Cuban&#8217;s Amicus Brief Musk, Cuban, and other amici such as Phillip Goldstein, Nelson Obus, Manouch Moshayedi, and the Investor Choice Advocates Network (ICAN) collectively argue against the SEC&#8217;s predominant use of administrative proceedings over jury trials. The brief highlights that this method raises questions about the constitutionality of the SEC&#8217;s practices. The amicus brief was composed for the SEC v. Jarkesy case. Here, George Jarkesy, the complainant, alleges that his Seventh Amendment privileges were infringed upon. He argues that the SEC&#8217;s internal adjudication method, which lacks a jury and is overseen by a commission-designated administrative law judge, violates these privileges. Related Reading: ‘Extra Bullish’ On XRP? Crypto Analyst Pinpoints The Perfect Timing Drawing attention to the Seventh Amendment, which upholds a defendant&#8217;s right to a jury trial for cases mirroring &#8220;suits at common law,&#8221; the amici underline the SEC&#8217;s inconsistency. They cite the SEC v. Seghers case as an example, where the SEC opted for a jury trial, resulting in a liability verdict against Seghers for fraud. The amici also address concerns of &#8220;forum shopping&#8221; by the SEC, suggesting that the agency might prosecute two identical defendants differently. This approach could result in one party benefiting from full constitutional rights, while the other might not, leading to a disparate legal outcome. The document reads: Forum shopping by itself may not be impermissible. But forum shopping by the federal government to pursue the same claims and penalties against similarly situated individuals, so that one individual has access to a jury and the other does not, violates the Equal Protection Clause of the Constitution. The document further contends that such practices damage the SEC&#8217;s credibility at a time when public trust in such institutions is waning, intensified by revelations of the SEC&#8217;s &#8220;improper access to privileged memoranda.&#8221; The amici conclude that the SEC&#8217;s practices deprive the public of critical information that might come to light during a jury trial, which contradicts the SEC&#8217;s core mission. This shared stance by Musk, Cuban, and their associates emphasizes the need for a reassessment of the SEC&#8217;s litigation approach, hinting at a potentially groundbreaking legal tussle on the horizon. Pro-XRP Lawyer Deaton Reacts Renowned pro-XRP lawyer, John E Deaton, aired his views on X, expressing his support for Musk and Cuban&#8217;s stance. Deaton said, &#8220;I’m thrilled to see Mark &#38; Elon take this path, even if they disagree on certain issues.&#8221; He reflected on past decisions, stating, &#8220;Three years ago I filed suit against the SEC, and encouraged companies in the crypto space to do the same.&#8221; Deaton further challenges the narratives that discourage companies or executives from contesting the SEC or its chairmanship. &#8220;Just because they state something doesn’t make it true. Almost every court case involving the SEC is proving that very point,&#8221; he contends. He highlights concerns about potential conflicts of interest within the SEC, suggesting that both parties, Republican and Democrat, are tainted. In a particularly revealing statement, he mentions, &#8220;These temporary bureaucrats are often conflicted, implementing agendas that favor their friends and the companies they go work for immediately following their tenure at the SEC.&#8221; Related Reading: Analyst Predicts XRP Price To Hit $100: Here’s How To Become A Millionaire Detailing alleged past conflicts, the pro-XRP lawyer critically remarks, &#8220;Look at Jay Clayton. He helped Apollo Group after they gave Kushner a huge loan and Clayton becomes a top advisor and Board Member at Apollo&#8230; Speaking of Hinman, he’s made partner at A16z, and they, along with Joseph Lubin, Vitalik Buterin, asked Hinman to give ETH a free pass. Hell, a16z lawyers actually helped Hinman write his famous speech.&#8221; Bringing attention to the broader issue, Deaton&#8217;s concerns are not only with individual transgressions but with systemic flaws. &#8220;The SEC MUST be completely restructured. It’s a broken and failed agency,&#8221; he unequivocally asserts. Deaton concludes with a strong call to action, emphasizing the urgent need for reform. &#8220;We need term limits in Congress and we need to pass legislation forbidding a regulator from immediately working for companies they were just regulating.&#8221; In his final, resounding statement, he warns, &#8220;Now it’s no longer only a revolving problem. It’s gotten so out of hand, they blatantly violate conflict laws because they know no one will do anything about it. The next regulator simply takes the attitude: ‘Now it’s my turn.’” At press time, XRP traded at $0.4804. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-19T07:51:19.000Z",
    "title": "Altcoins Are in the Last Part of Bear Cycle: Michaël Van de Poppe",
    "url": "https://coinedition.com/altcoins-are-in-the-last-part-of-bear-cycle-michael-van-de-poppe/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Investors-Focus-Altcoins-to-BTC-ETH.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Technicals Suggest The Altcoin Market Cap Will Continue To Slide\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Investors-Focus-Altcoins-to-BTC-ETH.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Investors-Focus-Altcoins-to-BTC-ETH-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Investors-Focus-Altcoins-to-BTC-ETH-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Investors-Focus-Altcoins-to-BTC-ETH-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Investors-Focus-Altcoins-to-BTC-ETH-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Investors-Focus-Altcoins-to-BTC-ETH-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Michaël van de Poppe, founder of MN Trading, opined that altcoins are in the final stages of the ongoing bear market as signs point to a new Bitcoin halving cycle beginning. In a recent post on X (formerly Twitter), Van de Poppe noted this has been the longest-lasting bear period ever for altcoins, with peak [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/altcoins-are-in-the-last-part-of-bear-cycle-michael-van-de-poppe/\">Altcoins Are in the Last Part of Bear Cycle: Michaël Van de Poppe</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]