[
  {
    "source": "CoinDesk",
    "date": "2023-08-04T20:50:45.000Z",
    "title": "Global X Refiles Spot-Bitcoin ETF Application, Naming Coinbase as ‘Surveillance-Sharing’ Partner",
    "url": "https://www.coindesk.com/policy/2023/08/04/global-x-refiles-spot-bitcoin-etf-application-naming-coinbase-as-surveillance-sharing-partner/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The filing comes around the same time the firm requested permission to offer a bitcoin-future ETF."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-04T20:47:27.000Z",
    "title": "AI Researchers Claim They Can Double the Efficiency of Chatbots",
    "url": "https://decrypt.co/151392/ai-researchers-can-double-llm-efficiency",
    "description": "Abacus AI claims to have found a way to fine-tune LLMs, making them capable of processing 200% their original context token capacity."
  },
  {
    "source": "BTCManager",
    "date": "2023-08-04T21:00:12.000Z",
    "title": "Curve Finance exploiter returns $12.7 million of stolen funds",
    "url": "https://crypto.news/curve-finance-exploiter-returns-12-7-million-of-stolen-funds/",
    "description": "The Curve Finance exploiter has refunded around $12.7 million worth of 4,820 Alchemix Ethereum (alETH) and 2,258 ETH to the Alchemix Finance platform"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-04T21:00:41.000Z",
    "title": "XDC Token Continues To Record Higher Gains Daily, Can It Achieve $0.1 Mark?",
    "url": "https://www.newsbtc.com/altcoin/xdc-token-continues-to-record-higher-gains-daily-can-it-achieve-0-1-mark/",
    "description": "XDC Network is now on its way to the $0.1 target price after encouraging price movements over the past weeks. The token is now among the most searched cryptos ranking fourth on CoinMarketCap’s list of trending cryptocurrencies. However, the question remains: How long can XDC sustain these rallies? Are the bulls energetic enough to exceed the anticipated $0.1 price mark? Let&#8217;s see XDC Soars Amid Market Downturn, What’s Fueling Its Price Movements? XDC Network is soaring today, August 4, as the broader market slightly improved. With a bullish momentum, the token rose by 16.7% on Friday morning. Also, it emerged as the biggest gainer with over 45% seven-day gain and 162% 30-day value growth. Related Reading: Bitcoin And Crypto Alert: The Implications Of Bill Ackman’s 30-Year T-Bills Short As of July 6, XDC traded at $0.03238 but later climbed to a monthly peak of $0.09092 on August 3, over 180% in the last 30 days. XDC reached a week high of $0.09134 on August 4, a nearly 50% increase from $0.05896 recorded on July 29.  These impressive moves have positioned the token as the best-performing cryptocurrency in the 30-day and seven-day timeframe. Although the momentum is still bullish, it has stalled slightly since the asset has shed a few gains and shifted from the day peak of $0.09146 to $0.081. These gains could result from other ecosystem developments, including the partnership between XDC Network and Infocomm Media Development Authority (IMDA) Singapore.  According to July 28 Bloomberg report, the crypto project integrated with IMDA’s TradeTrust &#8211; a Singaporean framework enables trusted interoperability of electronic trade documents across digital platforms.  This collaborative effort will allow IMDA’s TradeTrust to verify and transfer documents. Such capability can enhance trade visibility, proof of authenticity, and origins of documents. The collaboration is expected to enable a seamless and efficient flow of goods between digital trading partners. According to the report, the partnership marks a milestone for the XDC Network, as it could expand its reach and user base. Such growth will likely lead to a significant spike in active transactions and trading activities and it could be among the primary factors fueling XDC&#8217;s rallies in the past few days. XDC Market Outlook, More Rallies Possible? The XDC/USD chart shows the token trades below the Moving Average Convergence/Divergence signal line. This indicates a bearish momentum as XDC sheds previous gains.  Also, the RSI at 46.75 suggests the asset is approaching the oversold region. Moreover, the bears have formed stiff resistance at the $0.0851 level. They’re ready to push XDC down to lower lows if the bulls fail to regain momentum. Related Reading: Shiba Inu Price Poised To Reach $0.01 With Shibarium Upgrade, These CEOs Say  However, if the bulls rally enough to push the price above $0.851, the next target zone will be the $0.09166 level, from where XDC will likely shoot to $0.1 if momentum is sustained. Featured image from Pixabay and chart from TradingView.com"
  }
]