[
  {
    "source": "Cointelegraph",
    "date": "2023-10-30T04:53:44.000Z",
    "title": "What happened in crypto this weekend?",
    "url": "http://cointelegraph.com/news/what-happened-in-crypto-on-the-weekend",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/49ce4f13-5053-4197-842f-530122a6b860.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Analysts say an approved spot ETF will be “a bedrock moment for Bitcoin,” the Astrid Finance exploiter has sent back 80% of funds stolen, and Celsius has issued a new warning about phishing scammers.</p>\n                    <p><h3>Analysts ‘increasingly confident’ of a spot Bitcoin ETF approval </h3><p>Financial analysts at Cantor Fitzgerald are “increasingly confident” that the United States regulator will grant approval of a spot Bitcoin ETF, based on recent amendments to pending ETF applications. </p><p><a href=\"https://cointelegraph.com/news/vaneck-amends-application-spot-bitcoin-etf\">VanEck was the most recent firm to amend</a> its spot Bitcoin ETF application on Oct. 27 and financial firms such as BlackRock have followed the Securities and Exchange Commission’s request in adding surveillance-sharing agreements over the last few months.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Andddddd <a href=\"https://twitter.com/vaneck_us?ref_src=twsrc%5Etfw\">@vaneck_us</a> joins the amendment filings for spot <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcoin</a> ETF issuers. h/t <a href=\"https://twitter.com/NateGeraci?ref_src=twsrc%5Etfw\">@NateGeraci</a> <a href=\"https://t.co/zdYuUTAaE6\">pic.twitter.com/zdYuUTAaE6</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1718426589904490555?ref_src=twsrc%5Etfw\">October 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Cantor Fitzgerald research analysts Josh Siegler and Will Carlson told Bloomberg in an Oct. 29 <a href=\"https://www.bloomberg.com/news/articles/2023-10-27/cantor-is-increasingly-confident-a-bitcoin-spot-will-win-approval\" target=\"_blank\" rel=\"noopener nofollow\">report</a> that an approved spot Bitcoin ETF in the United States will be “a bedrock moment for Bitcoin’s long-term adoption and legitimization.”</p><p>Siegler and Carlson said an approved spot Bitcoin ETF product would also streamline many services for prospective Bitcoin investors, such as finding a custodian and self-storage services.</p><p>Bitcoin’s <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC)</a> price has pumped 16.5% over the last week to a high of $34,715 amid speculation that BlackRock’s spot Bitcoin ETF application is inching closer towards approval.</p><p>The Cantor Fitzgerald analysts noted that such approval will remain the main force behind Bitcoin’s price movement over the short-term.</p><blockquote>“A Bitcoin Spot ETF approval is the most-important short-term catalyst for Bitcoin’s price.”</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Two-thirds of all bitcoin has not moved in over a year, an all-time high.  <br><br>These people owned bitcoin when FTX blew up, and did not sell. They saw bitcoin rise more than 100% this year, and did not sell.<br><br>Do you expect them to sell now, before a bitcoin ETF is approved? <a href=\"https://t.co/SgLey8NG0R\">pic.twitter.com/SgLey8NG0R</a></p>&mdash; Matt Hougan (@Matt_Hougan) <a href=\"https://twitter.com/Matt_Hougan/status/1717671210597671224?ref_src=twsrc%5Etfw\">October 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Siegler and Carlson added that Grayscale’s recent court victory over the SEC is another sign that spot Bitcoin ETFs could eventually be approved.</p><h3>Astrid Finance exploiter returns $182K after negotiation</h3><p>The team behind Astrid Finance have managed to convince an exploiter to return 80% of the $227,000 in crypto they stole in an Oct. 28 attack.</p><p>Astrid, an Ethereum-based liquid staking protocol was exploited on Oct. 28. However, Astrid said it managed to convince the hacker using an <a href=\"https://etherscan.io/tx/0xa56fdb1fc7c192b23cda44901d2871289cf28831cb94ccc731d089d4fb593793\" target=\"_blank\" rel=\"noopener nofollow\">on-chain</a> message on Oct. 29 to keep 20% of the funds as a bounty and return the rest.</p><p>At the time, the Astrid team threatened to pursue legal action against the hacker if the funds weren’t returned by Oct. 31 at 8:00 am UTC time, however he decided to comply with more than a full day to spare.</p><p>“As such we consider this as settled amicably,” Astrid said in an Oct. 29 statement.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Hacker has decided to return our funds (minus 20% as per the bounty), as such we consider this as settled amicably.<a href=\"https://t.co/5hLsQ7NDrr\">https://t.co/5hLsQ7NDrr</a><br><br>We want to specially thank <a href=\"https://twitter.com/HypernativeLabs?ref_src=twsrc%5Etfw\">@HypernativeLabs</a> for alerting us the soonest and guiding us through the entire process<br><br>Next steps:</p>&mdash; Astrid | Restaking Pool (@AstridFinance) <a href=\"https://twitter.com/AstridFinance/status/1718563845323866383?ref_src=twsrc%5Etfw\">October 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The hacker sent back 102 Ether <a href=\"https://cointelegraph.com/news/vaneck-predicts-a-10-600-solana-price-rally-by-2030\">(ETH)</a>, worth about $182,000 from the approximated 127 Ether stolen.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/7a54041d-2753-43d4-8997-f6e99d335176.png\"  /><figcaption style=\"text-align: center;\"><em>Astrid Finance’s on-chain message to the hacker. Source: Etherscan</em></figcaption></figure><p>Astrid said all refunds have now been processed and that left over funds will now be transferred into a multisignature wallet.</p><p>Those funds will be used to further audit and develop Astrid’s smart contracts, which the firm says will be its next focus.</p><p>“Our next steps are to focus on redeveloping our smart contracts and have our new smart contracts audited by multiple top audit firms before any future Mainnet launch,” the firm said.</p><p>Astrid added that its current contract will remain paused for the time being.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">As all refunds have been processed, remaining funds will be moved to our governance multisig to be used for development and auditing of our new smart contracts.<a href=\"https://t.co/L561etjzZE\">https://t.co/L561etjzZE</a></p>&mdash; Astrid | Restaking Pool (@AstridFinance) <a href=\"https://twitter.com/AstridFinance/status/1718568120422633601?ref_src=twsrc%5Etfw\">October 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Astrid initially said the exploit came from a fix recommended by one of its auditors. However the firm backtracked on that statement about an hour later, explaining that the exploit was “missed” by Astrid and its auditing team.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Correction: <a href=\"https://t.co/NL6jgviRFE\">https://t.co/NL6jgviRFE</a></p>&mdash; Astrid | Restaking Pool (@AstridFinance) <a href=\"https://twitter.com/AstridFinance/status/1718254970619998614?ref_src=twsrc%5Etfw\">October 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>El Salvador president Nayib Bukele to run again in next election</h3><p>El Salvador president Nayib Bukele has filed paperwork to be re-elected in the country’s upcoming 2024 presidential election in February.</p><p>Bukele, a Bitcoin advocate, received strong support from the public on Oct. 26 after he registered to run as president again.</p><blockquote class=\"twitter-tweet\"><p lang=\"es\" dir=\"ltr\">| ÚLTIMA HORA: Al grito de “cinco más, cinco más y ni un paso atrás” Nayib Bukele da su discurso delante de miles de Salvadoreños luego de inscribir su candidatura presidencial para la reelección. “Necesitamos 5 años para seguir mejorando nuestro país.” <a href=\"https://t.co/ApaP8yyQBm\">pic.twitter.com/ApaP8yyQBm</a></p>&mdash; Eduardo Menoni (@eduardomenoni) <a href=\"https://twitter.com/eduardomenoni/status/1717786294183444992?ref_src=twsrc%5Etfw\">October 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>New Ideas, his party, is backed by 70% of the country’s voting population, <a href=\"https://www.reuters.com/world/americas/salvadoran-leader-makes-re-election-bid-official-2023-10-27/\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to Reuters, which cited a study by an El Salvadoran university. Its closest competitor only received 4% of the total votes.</p><p>El Salvador’s presidential election will take place on Feb. 4, 2024.</p><h3>Celsius Network raises alarm over new phishing campaign</h3><p>Bankrupt crypto lending firm Celsius has warned of a new wave of phishing attacks targeting its creditors. </p><p>Celsius notified its creditors and the community of the phishing attempts on Oct. 28, urging creditors and others not to click on any suspicious links. </p><p>The firm iterated that it will only request personal information from creditors and past users through the Celsius app, email or from its domain network.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">For any KYC process, the Debtors will only request your personally identifiable information and financial information through the Celsius App or an email from the domain “<a href=\"https://twitter.com/celsius?ref_src=twsrc%5Etfw\">@celsius</a>.network&quot;</p>&mdash; Celsius (@CelsiusNetwork) <a href=\"https://twitter.com/CelsiusNetwork/status/1718066945621213634?ref_src=twsrc%5Etfw\">October 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“The Debtors, the Official Committee of Unsecured Creditors, Fahrenheit, LLC, or their respective advisors will never contact you directly by phone, text message, or social media to request account or personal information absent an order or on-the-record instruction by the Court,” Celsius <a href=\"https://x.com/CelsiusNetwork/status/1718066947328286904?s=20\" target=\"_blank\" rel=\"noopener nofollow\">added.</a></p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-bank-run-in-2022-catalyzed-by-institutional-withdrawals-research\"><strong><em>Crypto bank runs in 2022 catalyzed by institutional withdrawals: Research </em></strong></a></p><p>It marks the 10th notice filed by Celsius pertaining to the phishing attempts, the first of which came on Nov. 30, 2022.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/f9d45291-f4e7-443a-829a-f2849cb2a549.png\"  /><figcaption style=\"text-align: center;\"><em>Celsius’ notices pertaining to phishing attempts. Source: Streeto</em></figcaption></figure><p>Celsius noted victims of these phishing attempts can file a complaint to the Federal Bureau of Investigation’s Internet Crime Complaint Center in the United States in addition to the Consumer Protection Bureau or the Federal Trade Commission.</p><h3>Other news</h3><p>The Wall Street Journal <a href=\"https://cointelegraph.com/news/wall-street-journal-corrects-article-misciting-hamas-crypto-terrorism-funding-data\">has revised an article</a> that mischaracterized the extent to which Hamas and other militant groups have been funding its terrorist activities with cryptocurrencies, after fierce community criticism. In an Oct. 10 article, it claimed a Palestinian Islamic Jihad raised as much as $93 million between August 2021 and June 2023. However, the correction amended that figure to no more than $12 million.</p><p>Investment firm VanEck says Solana’s <a href=\"https://cointelegraph.com/solana-price-index\">(SOL)</a> price by 2030 could range from a conservative <a href=\"https://cointelegraph.com/news/vaneck-predicts-a-10-600-solana-price-rally-by-2030\">$9.81 to an ambitious $3,211.28 by 2030,</a> while it expects Ether to reach a target price of $11,800 by the end of 2030.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\"><strong><em>Unstablecoins: Depegging, bank runs and other risks loom</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T05:03:04.000Z",
    "title": "Cathie Wood’s Ark Invest Shifts Gears, Selling Nvidia’s AI Stock and Diving into UiPath’s AI Growth",
    "url": "https://www.cryptopolitan.com/ark-invest-nvidias-ai-stock-uipaths-growth/",
    "description": "In an unexpected twist, Cathie Wood&#8217;s Ark Invest has executed a significant maneuver, strategically divesting from Nvidia and fervently investing in UiPath, an emerging player in the artificial intelligence (AI) landscape. While Nvidia&#8217;s stock has soared, Ark&#8217;s decision to shift its focus to UiPath signals a belief in the latter&#8217;s potential to ride the wave ... <a title=\"Cathie Wood&#8217;s Ark Invest Shifts Gears, Selling Nvidia&#8217;s AI Stock and Diving into UiPath&#8217;s AI Growth\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ark-invest-nvidias-ai-stock-uipaths-growth/\" aria-label=\"More on Cathie Wood&#8217;s Ark Invest Shifts Gears, Selling Nvidia&#8217;s AI Stock and Diving into UiPath&#8217;s AI Growth\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-30T04:58:45.000Z",
    "title": "MATIC Price Prediction: Polygon Could Blast 10% To $0.70",
    "url": "https://www.newsbtc.com/analysis/matic-analysis/matic-price-prediction-polygon-rally-0-70/",
    "description": "MATIC price is consolidating gains above the $0.58 support zone. Polygon might gain bullish momentum if it clears the $0.650 resistance zone. MATIC price is showing positive signs below the $0.65 resistance against the US dollar. The price is trading above $0.60 and the 100 simple moving average (4 hours). There is a key contracting triangle forming with resistance near $0.640 on the 4-hour chart of the MATIC/USD pair (data source from Kraken). The pair could continue to rise if it clears the $0.640 and $0.650 resistance levels. Polygon’s MATIC Price Aims Higher After forming a base above the $0.50 level, Polygon’s price started a steady increase. MATIC broke many hurdles near $0.550 to move into a positive zone, like Bitcoin and Ethereum. There was a move above the $0.60 resistance and the price climbed as high as $0.6646. Recently, there was a minor downside correction below the $0.640 level. The price declined below the 23.6% Fib retracement level of the upward move from the $0.5032 swing low to the $0.6646 high. MATIC is now trading above $0.60 and the 100 simple moving average (4 hours). There is also a key contracting triangle forming with resistance near $0.640 on the 4-hour chart of the MATIC/USD pair. Source: MATICUSD on TradingView.com Immediate resistance is near the $0.640 level. The first major resistance is near the $0.650 level. If there is an upside break above the $0.650 resistance level, the price could continue to rise. The next major resistance is near $0.665. A clear move above the $0.665 resistance could start a steady increase. In the stated case, the price could even attempt a move toward the $0.680 level or $0.700. Downside Correction in MATIC? If MATIC’s price fails to rise above the $0.640 resistance level, it could start a downside correction. Immediate support on the downside is near the $0.6100 level. The main support is near the $0.584 level or the 50% Fib retracement level of the upward move from the $0.5032 swing low to the $0.6646 high. A downside break below the $0.584 level could open the doors for a fresh decline toward $0.550. The next major support is near the $0.532 level. Technical Indicators 4 hours MACD – The MACD for MATIC/USD is gaining momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for MATIC/USD is now above the 50 level. Major Support Levels – $0.610 and $0.584. Major Resistance Levels – $0.640, $0.650, and $0.700."
  }
]