[
  {
    "source": "CryptoSlate",
    "date": "2023-11-15T18:00:34.000Z",
    "title": "Record 70% of Bitcoin supply lies dormant for a year or more",
    "url": "https://cryptoslate.com/insights/record-70-of-bitcoin-supply-lies-dormant-for-a-year-or-more/",
    "description": "<p>Quick Take New data analysis reveals an unprecedented trend in the circulating supply of Bitcoin. A notable 70% of the supply has not been transacted within the past year, marking an all-time high for supply last active 1+ year. This cohort is experiencing an increased rate of dormancy. This trend, in large part, can be [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/record-70-of-bitcoin-supply-lies-dormant-for-a-year-or-more/\">Record 70% of Bitcoin supply lies dormant for a year or more</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-15T17:58:31.000Z",
    "title": "2 days before Bitcoin ETF approval window closes; this altcoin aims to capitalize on crypto’s optimism ",
    "url": "https://crypto.news/2-days-before-bitcoin-etf-approval-window-closes-this-altcoin-aims-to-capitalize-on-cryptos-optimism/",
    "description": "BTCETF token aims to capitalize on crypto's optimism ahead of the U.S. SEC approving the first spot Bitcoin ETFs "
  },
  {
    "source": "BTCManager",
    "date": "2023-11-15T17:49:05.000Z",
    "title": "VersiFi hires ex-Genesis exec and secures $10m to revamp crypto lending",
    "url": "https://crypto.news/versifi-hires-ex-genesis-exec-and-secures-10m-to-revamp-crypto-lending/",
    "description": "VersiFi appoints former Genesis executive Martin Garcia as co-CEO and secures $10 million in funding to drive crypto lending services. "
  },
  {
    "source": "BTCManager",
    "date": "2023-11-15T17:45:10.000Z",
    "title": "WonderFi acquires Bitvo, expanding its hold on the Canadian crypto market",
    "url": "https://crypto.news/wonderfi-acquires-bitvo-expanding-its-hold-on-the-canadian-crypto-market/",
    "description": "WonderFi, through its subsidiary Bitbuy, has strategically acquired Bitvo.com, significantly increasing its share in Canada's regulated cryptocurrency exchanges and altering the competitive landscape."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-15T18:00:32.000Z",
    "title": "If Your Bitcoin Wallet Is A Product Of The 2016 Technology, You Could Be In Trouble – Here’s Why",
    "url": "https://www.newsbtc.com/news/i2016-bitcoin-wallet-could-be-problematic/",
    "description": "Is your Bitcoin wallet shackled by the outdated chains of 2016 technology? Brace yourself, for trouble may be lurking in the shadows, ready to pounce on the unsuspecting. In the fast-paced realm of cryptocurrency, your digital fortress could be nothing more than a relic of the past, leaving you vulnerable to the merciless winds of technological evolution. Recently, cryptocurrency startup Unciphered revealed a potential security threat to Bitcoin wallets created prior to 2016. Related Reading: Celestia Strikes: How This Lesser-Known Coin Went Berserk With 126% Price Explosion Known as &#8220;Randstorm,&#8221; this software flaw encompasses a combination of bugs, architectural choices, and API (Application Programming Interface) modifications that heighten the vulnerability of Bitcoin wallets crafted between 2011 and 2015. The genesis of this issue dates back to last year when Unciphered was assisting a customer who found themselves locked out of a Bitcoin wallet originally created on what is now recognized as Blockchain.com. Unveiling The Risks: The Potential Perils Lurking In A 2016-era Bitcoin Wallet During the investigation to recover the wallet, Unciphered stumbled upon a critical flaw in wallets generated by BitcoinJS between 2011 and 2015. Unciphered, in its report on Tuesday, highlighted the significance of this flaw, suggesting that it may have impacted approximately 1.4 million Bitcoin. This means, that if 3 to 5 percent of these wallets were affected, the potential value of the at-risk coins could range from $1.2 to $2.1 billion. Eric Michaud, co-founder of Unciphered, stated that BitcoinJS was severely flawed until March 2014, and anyone using it directly faces a significantly high risk of being attacked. Unciphered has dedicated several months to notifying a substantial number of individuals, over one million, on the vulnerability of their wallets. The Dangers Of Holding Wallets On Obsolete Crypto Platforms A significant number of individuals remain uninformed due to their possession of wallets constructed on defunct digital currency platforms. Unciphered clarified that finding vulnerabilities doesn&#8217;t imply that Bitcoin or technology, in general, is fundamentally flawed. Instead, it reveals a chain of programming errors that occurred across various technologies from 2011 to 2015. There are serious problems in a lot of the wallet code, Unciphered has discovered, and the companies who employed that technology may vanish. Bitcoin slightly above the $36K level today. Chart: TradingView.com Despite that, though, it serves as a stark reminder that open-source projects that little to no one oversees lie beneath software infrastructure of all types, even those specifically aimed at raising capital. Michaud asserted that imperfections within every human-made technology stem from its creators. “Every man-made technology contains flaws that originate within its creators,” he said. The wallets&#8217; software developer, Stefan Thomas, told The Washington Post that he created the wallets as a pastime. He said that without checking the program&#8217;s validity, he had stolen a significant portion of the code from a page belonging to a Stanford University student. “Instead, I was obsessed about making sure that I didn’t make any mistakes in my own code [&#8230;] I’m sorry to anyone affected by this bug,” he added. Source: Unciphered In layman&#8217;s words, Unciphered called the vulnerability &#8220;Randstorm&#8221; since wallet software that produced cryptographic keys wasn&#8217;t sufficiently random was the source of it. They produced electronic keys with a randomness factor that was easier to hack, only one in a specific number of thousands, as opposed to ones that were incredibly unique and hard for someone else to copy (like one in a trillion odds). Related Reading: Red Hot Ethereum: Breach Of $2,000 Draws Major Players Into the Fray Navigating Cryptocurrency&#8217;s Hostile Landscape Security expert Dan Guido said that the world of cryptocurrency is quite unfriendly. It&#8217;s filled with individuals attempting to undermine what you&#8217;re constructing, whether through hacking attempts, regulatory challenges, or others keen on causing harm to Bitcoin. “Crypto is a pretty hostile place, to be honest, full of people attacking what you’re building,&#8221; he said. As the curtains draw on the unsettling revelation of the &#8220;Randstorm&#8221; vulnerability, it&#8217;s a stark wake-up call for those still tethered to Bitcoin wallets from the pre-2016 era. The ominous specter of technological evolution looms large, and the recent exposé by Unciphered sheds light on the potential peril faced by those oblivious to the vulnerabilities embedded in their outdated digital fortresses. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from WJHG"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-15T17:49:38.000Z",
    "title": "Binance Faces Tough Competition from M2 Exchange, Kevin O’Leary Predicts",
    "url": "https://www.crypto-news-flash.com/binance-faces-tough-competition-from-m2-exchange-kevin-oleary-predicts/?utm_source=rss&utm_medium=rss&utm_campaign=binance-faces-tough-competition-from-m2-exchange-kevin-oleary-predicts",
    "description": "<img width=\"1920\" height=\"1277\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Kevin O’Leary endorses M2, a new Abu Dhabi-based crypto exchange aiming to challenge industry leaders like Binance. M2 focuses on becoming the world&#8217;s largest regulated crypto exchange, emphasizing compliance and institutional support. Kevin O’Leary, the renowned venture capitalist and star of &#8220;Shark Tank,&#8221; has spotlighted a budding crypto exchange, M2. Based in Abu Dhabi, M2 [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-15T17:55:14.000Z",
    "title": "Bankrupt Crypto Lender Celsius Moves Over $10,000,000 Worth of Ethereum (ETH) To Exchange: On-Chain Data",
    "url": "https://dailyhodl.com/2023/11/15/bankrupt-crypto-lender-celsius-moves-over-10000000-worth-of-ethereum-eth-to-exchange-on-chain-data/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/moves-over-to-chain.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/moves-over-to-chain.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/moves-over-to-chain.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/moves-over-to-chain.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/moves-over-to-chain.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/moves-over-to-chain.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/moves-over-to-chain.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An address associated with failed crypto lending platform Celsius has moved millions of dollars worth of Ethereum (ETH) to an exchange, according to on-chain data. Citing data obtained from blockchain explorer Etherscan, on-chain data tracker Lookonchain says that Celsius moved 5,160 ETH worth approximately $10.49 million to institutional crypto trading platform FalconX. According to Lookonchain, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/15/bankrupt-crypto-lender-celsius-moves-over-10000000-worth-of-ethereum-eth-to-exchange-on-chain-data/\">Bankrupt Crypto Lender Celsius Moves Over $10,000,000 Worth of Ethereum (ETH) To Exchange: On-Chain Data</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-15T17:41:22.000Z",
    "title": "Launching a First-of-Its-Kind Innovation – ParaX Creates and Deploys Chainlink’s CCIP for Enhanced Accuracy and Gas Efficiency in NFT Oracles",
    "url": "https://dailyhodl.com/2023/11/15/launching-a-first-of-its-kind-innovation-parax-creates-and-deploys-chainlinks-ccip-for-enhanced-accuracy-and-gas-efficiency-in-nft-oracles/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-ParaX-Industry-Announcement-Featured-Image-Template.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-ParaX-Industry-Announcement-Featured-Image-Template.jpg 1500w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-ParaX-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-ParaX-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-ParaX-Industry-Announcement-Featured-Image-Template.jpg?resize=768,768 768w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-ParaX-Industry-Announcement-Featured-Image-Template.jpg?resize=1024,1024 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-ParaX-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-ParaX-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-ParaX-Industry-Announcement-Featured-Image-Template.jpg?resize=750,750 750w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-ParaX-Industry-Announcement-Featured-Image-Template.jpg?resize=1140,1140 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>When it comes to NFT lending, NFT oracles are one of the most important factors in the lending process. NFT oracles must show accurate prices, mitigate risk and be cost-efficient. To date, we’ve partnered with Chainlink for our oracles due to their effective risk management and mitigation systems, which are powered by their unique algorithm. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/15/launching-a-first-of-its-kind-innovation-parax-creates-and-deploys-chainlinks-ccip-for-enhanced-accuracy-and-gas-efficiency-in-nft-oracles/\">Launching a First-of-Its-Kind Innovation – ParaX Creates and Deploys Chainlink’s CCIP for Enhanced Accuracy and Gas Efficiency in NFT Oracles</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-11-15T18:04:12.000Z",
    "title": "Change Log: Version 1.84",
    "url": "https://blog.bitfinex.com/changelogs/change-log-version-1-84/",
    "description": "<p>Change Log: Version 1.84 The Bitfinex Change Log is an overview of all performance and UI changes made to the Bitfinex trading platform. For an overview of all previous changes, please refer to blog.bitfinex.com/category/changelogs. Version 1.84 Improvements Updated to re-enable the Bitrefill widget on the...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/changelogs/change-log-version-1-84/\">Change Log: Version 1.84</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]