[
  {
    "source": "Bitcoin.com",
    "date": "2023-11-01T03:30:59.000Z",
    "title": "Judge Urges for SEC Decision on Planned Celsius Restart as Crypto Miner",
    "url": "https://news.bitcoin.com/judge-urges-for-sec-decision-on-planned-celsius-restart-as-crypto-miner/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2180519563-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Judge Urges for SEC Decision on Planned Celsius Restart as Crypto Miner\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2180519563-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2180519563-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2180519563-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2180519563-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2180519563-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2180519563-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2180519563.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />America’s securities regulator has been urged to decide if it will approve a plan to transform Celsius Network into a bitcoin mining firm. The proposal seeks to repay customers of the bankrupt cryptocurrency lender with both crypto assets and stock in a new publicly traded mining entity. New York Judge Hopes for Expedited SEC Decision [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-01T03:16:05.000Z",
    "title": "Bitcoin Price Topside Bias Vulnerable If It Continues To Struggle Below $35K",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-vulnerable-35k/",
    "description": "Bitcoin price is still struggling to clear the key $35,000 resistance. BTC might correct lower and revisit the $34,000 support zone if it continues to struggle near $35,000. Bitcoin is still facing a major hurdle near the $35,000 resistance. The price is trading above $34,250 and the 100 hourly Simple moving average. There is a key bullish trend line forming with support near $34,260 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could correct lower, but the bulls might remain active near $34,000. Bitcoin Price Remains Supported Bitcoin price attempted another increase above the $34,750 resistance. BTC spiked above the $34,950 level. However, the price remained capped below the main barrier at $35,000. A high was formed near $34,953 and the price recently corrected lower. It traded close to the $34,000 level. A low was formed near $34,060 and the price is now attempting a fresh increase. There was a move above the $34,500 level. It climbed above the 50% Fib retracement level of the downward move from the $34,953 swing high to the $34,060 low. Bitcoin is now trading above $34,260 and the 100 hourly Simple moving average. There is also a key bullish trend line forming with support near $34,260 on the hourly chart of the BTC/USD pair. On the upside, immediate resistance is near the $34,650 level. The next key resistance could be near $34,750 or the 76.4% Fib retracement level of the downward move from the $34,953 swing high to the $34,060 low. Source: BTCUSD on TradingView.com The main resistance is still near the $35,000 zone. A clear move above the $35,000 resistance might start a decent increase. The next key resistance could be $35,500, above which the price could rise toward $36,200. Any more gains might send BTC toward the $37,500 level. Bearish Reaction In BTC? If Bitcoin fails to rise above the $34,650 resistance zone, it could start a downside correction. Immediate support on the downside is near the $34,270 level and the 100 hourly Simple moving average. The next major support is near the $34,000 level. If there is a move below $34,000, there is a risk of more downsides. In the stated case, the price could drop toward the $33,500 level or even $33,200. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now just above the 50 level. Major Support Levels – $34,260, followed by $34,000. Major Resistance Levels – $34,650, $34,750, and $35,000."
  }
]