[
  {
    "source": "Cointelegraph",
    "date": "2024-02-10T22:21:57.000Z",
    "title": " Bitcoin ETFs see high volume, Binance delists Monero, and ARK plans staking Ether: Hodler’s Digest, Feb. 4-10 ",
    "url": "https://cointelegraph.com/magazine/bitcoin-etfs-see-high-volume-binance-delists-monero-and-ark-plans-staking-ether-hodlers-digest-feb-4-10/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2024/02/feb-10-scaled.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin ETFs experience a spike in volume, Binance delists Monero, and ARK plans to stake Ether ETF holdings.</p>\n                    <p><p>Total daily trading volume for spot Bitcoin exchange-traded funds (ETFs) <a href=\"https://cointelegraph.com/news/big-volume-day-blackrock-bitcoin-etfs-notch-1b-volume\" target=\"_blank\" rel=\"nofollow\">topped a billion dollars on Feb. 7</a>, with BlackRock leading the pack. Bloomberg Intelligence analyst James Seyffart described it as a big volume day for BlackRocks iShares Bitcoin Trust, which saw a daily trading volume of $341.2 million, eclipsing the Grayscale Bitcoin Trusts $296.5 million in volume, according to Seyffart. Meanwhile, Fidelitys FBTC fund came in third with $200 million in volume, and the remaining seven funds had $188 million in daily volume  bringing the total for the day to more than a billion dollars.</p><p>Binance <a href=\"https://cointelegraph.com/news/monero-drops-multi-month-lows-binance-delisting\" target=\"_blank\" rel=\"nofollow\">is delisting Monero (XMR) and other tokens</a> like Aragon, Multichain, and Vai on Feb. 20, 2024. The announcement sent XMR’s value to five-month lows on Feb. 6. The exchange will remove all trading pairs involving Monero, including those trading against Bitcoin, Ether, Tether, and Binance’s native coin, BNB. Withdrawals for XMR tokens will be suspended after May 20, 2024. Binance’s decision is based on factors like contribution to the crypto ecosystem’s health, ethical conduct and responsiveness to due diligence requests, said the exchange.</p><p>ARK 21Shares <a href=\"https://cointelegraph.com/news/ark-21shares-refiles-ethereum-etf-cash-creates-staking\" target=\"_blank\" rel=\"nofollow\">has amended its spot Ether exchange-traded fund (ETF) application</a> to adopt a cash-creation model  similar to its approved spot Bitcoin ETF  and has also floated plans to stake a portion of the ETFs Ether to generate additional income. Under the cash creates model, ARK 21Shares would purchase Ether equivalent to the order amount and deposit it in the trusts account with the custodian. ARK’s filing also proposes adding a staking element to its spot Ether ETF. According to the filing, the ETF would stake Ether from the trusts cold vault balance, and staking rewards would be treated as income for the trust. In another headline, the U.S. SEC <a href=\"https://cointelegraph.com/news/sec-delays-invesco-galaxy-spot-ether-etf\" target=\"_blank\" rel=\"nofollow\">delayed a decision on whether to approve an Ether ETF</a> proposed by Invesco and Galaxy Digital.</p><p><a href=\"https://cointelegraph.com/magazine/bitcoin-etfs-see-high-volume-binance-delists-monero-and-ark-plans-staking-ether-hodlers-digest-feb-4-10/\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2024-02-10T22:21:57.000Z",
    "title": " Bitcoin ETFs see high volume, Binance delists Monero, and ARK plans staking Ether: Hodler’s Digest, Feb. 4-10 ",
    "url": "https://cointelegraph.com/magazine/bitcoin-etfs-see-high-volume-binance-delists-monero-and-ark-plans-staking-ether-hodlers-digest-feb-4-10/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2024/02/feb-10-scaled.jpg\"></p><p>Bitcoin ETFs experience a spike in volume, Binance delists Monero, and ARK plans to stake Ether ETF holdings.</p>\n            "
  }
]