[
  {
    "source": "CoinDesk",
    "date": "2023-07-21T12:56:24.000Z",
    "title": "First Mover Americas: ProShares Dismisses Concerns Over Cost of Tracking Futures",
    "url": "https://www.coindesk.com/markets/2023/07/21/first-mover-americas-xrp-momentum-could-set-precedent-for-bitcoin/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for July 21, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-21T13:00:27.000Z",
    "title": "DeFi Protocol Conic Finance Hacked for 1700 ETH",
    "url": "https://cryptobriefing.com/defi-protocol-conic-finance-hacked-for-1700-eth/?utm_source=feed&utm_medium=rss",
    "description": "DeFi protocol Conic Finance reported a loss of 1700 ETH, valued at over $3.2 million. Blockchain security firm BlockSec has traced this incident to an unidentified hacker exploiting a reentrancy..."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-21T12:47:22.000Z",
    "title": "Coinbase Calls on Users to Repay Loans by November",
    "url": "https://cryptobriefing.com/coinbase-users-to-repay-loans-by-november/?utm_source=feed&utm_medium=rss",
    "description": "Coinbase has announced the gradual discontinuation of its lending service, Coinbase Borrow. The decision follows a suspension of new loan applications initiated in May, according to an announcement on July..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-21T12:51:27.000Z",
    "title": "UK Government Rejects Treasury’s Call to Treat Crypto as Gambling",
    "url": "https://cryptodaily.co.uk/2023/07/uk-government-rejects-treasurys-call-to-treat-crypto-as-gambling",
    "description": "<p>The UK government rejected a recent House of Commons Treasury Committee proposal, which suggested that retail crypto trading be regulated like gambling instruments. </p>\nUK Government Rejects Pressure to Treat Crypto Trading Like Gambling\n<p>The UK&rsquo;s HM Treasury officially rejected the House of Commons Treasury Committee&rsquo;s recent recommendation to regulate crypto trading not as financial assets but as gambling instruments.&nbsp;</p>\n\n<p dir=\"ltr\" lang=\"en\">JUST IN: 🇬🇧 UK rejected pressure to regulate #Bitcoin and crypto as gambling rather than as a financial service - Financial Services MinisterBritain wants to become a global hub for the industry 🙌 pic.twitter.com/uUvilSUOHn</p>\n&mdash; Bitcoin Magazine (@BitcoinMagazine) July 20, 2023\n<p>\n\n</p>\n<p>The UK government rejected lawmakers&rsquo; proposal to treat crypto trading and related investment assets as it does gambling instruments.</p>\n<p>The House of Commons Treasury Committee argued that unbacked, mainstream crypto assets such as Bitcoin (BTC) and Ethereum (ETH) should be held to the same standards as gambling. In its report, the Committee said:</p>\n\n<p>With no intrinsic value, huge price volatility and no discernible social good, consumer trading of cryptocurrencies like bitcoin more closely resembles gambling than a financial service, and should be regulated as such.</p>\n\n<p>Andrew Griffith, the UK Economic Secretary to the Treasury, said it &ldquo;firmly disagrees&rdquo; with the &ldquo;Committee&rsquo;s recommendation to regulate retail trading and investment activity in unbacked cryptoassets as gambling rather than as a financial service.&rdquo;</p>\nRegulating Crypto as Gambling Would Drive Crypto Offshore\n<p>In its response to the Committee&rsquo;s concerns, Griffith stated that such an approach to regulation would defy the globally agreed-upon standards and potentially drive crypto activity offshore.</p>\n<p>The government also opined that such a law would fail to address certain risks associated with crypto trading, such as market manipulation.</p>\nRegulating Crypto in the UK\n<p>The government further stated it is already working on crypto asset regulation, and proposed rules were put before parliament and debated last month. In its response, the government said:</p>\n\n<p>HM Treasury and the FCA [Financial Conduct Authority] will work with the industry to ensure crypto firms are made fully aware of the standards required for approval at the FSMA gateway.</p>\n<p>Further communications will be provided in due course to ensure standards for approval are clearly available to crypto firms operating in the UK.</p>\n\n<p>Regulators in the UK have made strides in crypto regulation to address global concerns over the industry&rsquo;s risks.</p>\n<p>The House of Lords recently passed the Financial Services and Markets Bill, which aims to regulate Bitcoin and crypto in the country.</p>\n<p>Deemed a &ldquo;Rocket Boost for the UK economy,&rdquo; the bill seeks to make a &ldquo;technologically advanced financial services sector&rdquo; that is &ldquo;open&rdquo; and will &ldquo;grow the economy.&rdquo;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-21T12:47:13.000Z",
    "title": "SENATOR leverages Ardor blockchain for urban planning",
    "url": "https://crypto.news/senator-leverages-ardor-blockchain-for-urban-planning/",
    "description": "SENATOR is leveraging the blockchain capacity of Ardor blockchain for urban planning policies to design sustainable last-mile operations"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T13:00:58.000Z",
    "title": "As Litecoin Transaction Volume Surge, Active Whales invest in InQubeta presale for massive gains",
    "url": "https://www.crypto-news-flash.com/as-litecoin-transaction-volume-surge-active-whales-invest-in-inqubeta-presale-for-massive-gains/?utm_source=rss&utm_medium=rss&utm_campaign=as-litecoin-transaction-volume-surge-active-whales-invest-in-inqubeta-presale-for-massive-gains",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T111956.414.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T111956.414.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T111956.414-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T111956.414-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the dynamic world of cryptocurrencies, opportunities for lucrative investments continue to pop up. As we see the transaction volume of Litecoin (LTC) surging, it&#8217;s also noteworthy to mention the recent interest of active crypto whales in the promising InQubeta presale. Are these separate events, or could they signify a broader trend in the crypto [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T12:51:30.000Z",
    "title": "Galaxy Digital CEO Mike Novogratz Praises Ripple’s Legal Triumph in Crypto World",
    "url": "https://www.crypto-news-flash.com/galaxy-digital-ceo-mike-novogratz-praises-ripples-legal-triumph-in-crypto-world/?utm_source=rss&utm_medium=rss&utm_campaign=galaxy-digital-ceo-mike-novogratz-praises-ripples-legal-triumph-in-crypto-world",
    "description": "<img width=\"1000\" height=\"563\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/pedrosek-Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/pedrosek-Ripple.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/pedrosek-Ripple-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/pedrosek-Ripple-768x432.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Mike Novogratz said that Ripple has indeed registered a historic win against the SEC and that the securities regulator should accept it. The Galaxy Digital CEO also called out the SEC for not providing clarity on crypto regulation in the US. Mike Novogratz, CEO of Galaxy Digital and former Goldman Sachs executive, recently shared his [...]"
  }
]