[
  {
    "source": "Cointelegraph",
    "date": "2024-03-14T10:05:56.000Z",
    "title": " Nigerian crypto community split over government&#039;s bid for Binance user data ",
    "url": "https://cointelegraph.com/news/nigerian-crypto-split-government-binance-user-data",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNGIzMTE1YjgtMTJjNi00Y2MwLTkwMmQtNmU2NWE5ZmZiNDJjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Chukwumaeze Dike, a crypto enthusiast and cybersecurity specialist, said he finds the request for the top 100 users surprising and doubts Binance will comply.</p>\n                    <p><p data-ct-non-breakable=\"true\">Nigerian cryptocurrency stakeholders are weighing in on the government’s request for Binance to disclose details about its top 100 users in the country amid a crackdown on the exchange. Opinions vary, with some supporting the government’s actions while others disagree.</p><p>In interviews with Cointelegraph, local crypto stakeholders shared their opinions about the situation. Crypto analyst Rume Ophi said that the government was well within its rights as requests like this are always made when the government is trying to investigate national security matters.</p><p>Ophi’s opinion, however doesn’t sit well with other local crypto enthusiasts who took to X to express their disagreement. Chukwumaeze Dike, a crypto enthusiast and cybersecurity specialist, <a href=\"https://twitter.com/chunkwumaeze/status/1767915118929625305\" target=\"_blank\" rel=\"noopener nofollow\">said</a> he finds the request for the top 100 users surprising and doubts Binance will comply.</p><p><a href=\"https://cointelegraph.com/news/nigerian-crypto-split-government-binance-user-data\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-14T10:00:00.000Z",
    "title": " BNB Chain to expand layer-2 ecosystem with new rollup service ",
    "url": "https://cointelegraph.com/news/bnb-chain-rollup-layer-2-ecosystem",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYmE3OWZlMjgtMzMzMC00MmIyLWI3NWYtMTVlNjU2YmI0ZDNhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The new rollup-as-a-service solution aims to support projects with the technical infrastructure to deploy layer-2 networks on the BNB Chain.</p>\n                    <p><p data-ct-non-breakable=\"true\">BNB Chain, the ecosystem powered by the BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) token, has unveiled a rollup service solution for building layer-2 blockchains on its network. </p><p>On March 14, BNB Chain announced its rollup-as-a-service (RaaS) solution to help projects build layer-2 networks on BNB Chain. The service will give projects access to the tech infrastructure required to deploy layer-2 networks on the blockchain, expanding BNB Chain’s ecosystem. </p><p>BNB Chain also explained that the service supports decentralized applications (DApps). This allows a wide range of project verticals, including blockchain gaming or decentralized finance (DeFi), to be deployed on the layer-2 networks. In addition, BNB Chain is also providing rollup management support and a “no-code” deployment option for projects that might not be familiar with coding. </p><p><a href=\"https://cointelegraph.com/news/bnb-chain-rollup-layer-2-ecosystem\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-14T09:39:54.000Z",
    "title": "Over $2 million in Ethereum stolen in sophisticated phishing scheme",
    "url": "https://cryptoslate.com/over-2-million-in-ethereum-stolen-in-sophisticated-phishing-scheme/",
    "description": "<p>A recent phishing attack has left a crypto investor reeling from a loss of 501 ETH, valued at approximately $2 million, staked through liquid restaking protocol Ether.Fi. On-chain data reveals that the theft occurred earlier today and involved two transactions. In one transaction, 426 ETH were siphoned, followed by another 75 ETH in a subsequent [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/over-2-million-in-ethereum-stolen-in-sophisticated-phishing-scheme/\">Over $2 million in Ethereum stolen in sophisticated phishing scheme</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-14T10:04:13.000Z",
    "title": "Navigating Change: How Conversational AI Reshapes Education & Employment",
    "url": "https://www.cryptopolitan.com/how-conversational-ai-reshapes-education/",
    "description": "In an era marked by rapid technological advancement and evolving job markets, the integration of innovative technology into education and employability programs is imperative.&#160; Conversational AI emerges as a transformative tool poised to reshape the landscape of workforce development, offering unparalleled potential in facilitating personalized learning experiences and streamlining support services. Conversational AI in education [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-14T09:50:46.000Z",
    "title": "Renewed Focus on AI Investments Signals Shifting Tech Landscape",
    "url": "https://www.cryptopolitan.com/renewed-focus-on-ai-investments-signals/",
    "description": "SoftBank Group Corp., the Japanese tech giant, is reportedly considering an investment in Mistral AI, a French company emerging as a leading player in Europe&#8217;s artificial intelligence (AI) landscape. Sources familiar with the matter revealed that SoftBank has shown interest in backing Mistral in its next funding round, potentially valuing the company at over $2 [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-14T09:43:45.000Z",
    "title": "Cosmos Price Prediction 2024-2033: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2024-2033 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? That&#8217;s the essential question, for now: how will this affect our Cosmos Price Prediction? How much is Cosmos worth? Today’s Cosmos price is $13.97, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-14T10:03:27.000Z",
    "title": "Euphoria Or False Dawn? Why The Ethereum $4,000 Party Might End Soon",
    "url": "https://www.newsbtc.com/all/euphoria-or-false-dawn-why-the-ethereum-4000-party-might-end-soon/",
    "description": "Amidst the tumultuous seas of the crypto market, Ethereum (ETH) finds itself navigating through waves of uncertainty after a period of bullish fervor. Investors who once rode high on the tide of optimism now brace themselves for potential stormy weather ahead. Related Reading: Zooming NEAR: Solid 75% Growth Sparks Crypto Frenzy The Bearish Shadow Looms The once bright horizon for Ethereum has dimmed as indicators point towards a shift in sentiment. A surge in interest in put options hints at growing apprehension among traders, seeking refuge from potential losses in speculative ventures. The rise in demand for these protective measures serves as a cautionary tale, signaling a departure from the exuberance that once characterized the Ethereum landscape. Ethereum&#8217;s Dencun Upgrade As the Ethereum community anticipates the much-awaited Dencun upgrade, optimism clashes with apprehension. Scheduled to deploy on the Ethereum mainnet, the upgrade promises to usher in a new era with EIP-4844, colloquially known as &#8220;protodanksharding,&#8221; poised to lower transaction costs on Layer 2. While this advancement holds promise, echoes of past disappointments linger, reminding investors of the unpredictability that accompanies major network upgrades. Influx of Capital Amidst Uncertainty Despite the looming shadows of uncertainty, the crypto market witnesses a significant influx of capital, with Bitcoin and Ethereum commanding the lion&#8217;s share of the pie. An infusion of approximately $83 billion into the market underscores the enduring allure of cryptocurrencies, even in times of ambiguity. Yet, amidst the influx, Ethereum&#8217;s fate hangs in the balance, teetering between the forces of optimism and apprehension. Ether market cap currently at $478 billion. Chart: TradingView.com The Ethereum ETF Conundrum Now, the looming specter of Ethereum ETF approval casts a shadow over the market, with odds dwindling according to Bloomberg ETF analysts. Despite waning prospects, the prospect of an ETF remains a beacon of hope for Ethereum enthusiasts, promising increased adoption and legitimacy. Yet, as the odds fluctuate, uncertainty pervades, leaving investors on edge, unsure of what the future holds. Related Reading: Bitcoin Hodlers Eye Long Term: $520 Million BTC Go To Cold Storage Analyst&#8217;s Insight In the midst of uncertainty, popular crypto analyst Ali Martinez offers insights into the shifting currents of the market. Martinez reveals a massive influx of roughly $83 billion, with Bitcoin and Ethereum accounting for $75 billion of the total money inflow, according to Glassnode. Current Market Snapshot Ethereum&#8217;s price charts reflect the ebb and flow of market sentiment. With a 2% increase in the past 24 hours,  stands at $3,966, a testament to the resilience of the cryptocurrency amidst turbulent times. Yet, fluctuations persist, with trading volume surging by 20% in the last 24 hours, underscoring the volatility that defines the crypto market. Source: Santiment Meanwhile, new addresses were still becoming interested in Ether. Alongside that, the overall count of holders who were amassing ETH had also increased, as shown in the chart above. Featured image from Polina Tankilevitch/Pexels, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-14T10:00:45.000Z",
    "title": "Gunning For New ATH: Ethereum (ETH) and Binance Coin (BNB) – Investors Jump on the InQubeta (QUBE) Presale for Staggering Gains",
    "url": "https://www.crypto-news-flash.com/gunning-for-new-ath-ethereum-eth-and-binance-coin-bnb-investors-jump-on-the-inqubeta-qube-presale-for-staggering-gains/?utm_source=rss&utm_medium=rss&utm_campaign=gunning-for-new-ath-ethereum-eth-and-binance-coin-bnb-investors-jump-on-the-inqubeta-qube-presale-for-staggering-gains",
    "description": "<img width=\"1200\" height=\"672\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-13T102233.929.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-13T102233.929.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-13T102233.929-300x168.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-13T102233.929-768x430.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-13T102233.929-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-13T102233.929-450x252.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />After Bitcoin (BTC) hit an all-time high (ATH) earlier this week—soaring past $72,000—eyes are on Ethereum (ETH) and Binance Coin (BNB), two top altcoins. With momentum on the rise and bulls having a field day, it is a matter of time before these top crypto coins register new peaks, making them some of the best [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-14T10:00:18.000Z",
    "title": "BNB Chain Looks to Expand L2 Ecosystem; Introduces RaaS to Streamline Establishment of New L2 Blockchains",
    "url": "https://www.crypto-news-flash.com/bnb-chain-looks-to-expand-l2-ecosystem-introduces-raas-to-streamline-establishment-of-new-l2-blockchains/?utm_source=rss&utm_medium=rss&utm_campaign=bnb-chain-looks-to-expand-l2-ecosystem-introduces-raas-to-streamline-establishment-of-new-l2-blockchains",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/en_wide_4_1710349239unBjs7JfNM.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/en_wide_4_1710349239unBjs7JfNM.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/en_wide_4_1710349239unBjs7JfNM-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/en_wide_4_1710349239unBjs7JfNM-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/en_wide_4_1710349239unBjs7JfNM-150x90.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/en_wide_4_1710349239unBjs7JfNM-450x270.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />DUBAI, UAE, March 14th, 2024, Chainwire Rollup-as-a-Service (RaaS) will enable large-scale Dapps, enterprise and BNB Chain to establish custom L2s on BNB Smart Chain  BNB Chain, the community-driven blockchain ecosystem that includes the world’s largest smart contract blockchain, today unveiled its Rollup-as-a-Service (RaaS) solution for building Layer 2 blockchains (L2s) on BNB Chain. RaaS provides [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-14T09:44:37.000Z",
    "title": "Abu Dhabi to Host Landmark Bitcoin MENA Conference 2024",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/abu-dhabi-to-host-landmark-bitcoin-mena-conference-2024/",
    "description": "<p>This is a major milestone, introducing the largest Bitcoin conference to MENA for the first time. This event highlights cryptocurrency&#8217;s global rise and MENA&#8217;s growing role in the digital economy. MENA&#8217;s Leap into the Global Crypto Spotlight The Bitcoin MENA Conference 2024 aims to gather industry leaders, innovators, policymakers, and enthusiasts from across the globe. [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/abu-dhabi-to-host-landmark-bitcoin-mena-conference-2024/\">Abu Dhabi to Host Landmark Bitcoin MENA Conference 2024</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-14T09:59:26.000Z",
    "title": "Count On These 3 Altcoins To Explode When The Real Altseason Begins: Top Analyst",
    "url": "https://coinedition.com/count-on-these-3-altcoins-to-explode-when-the-real-altseason-begins-top-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/03/Pr1-159.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/03/Pr1-159.jpg 730w, https://coinedition.com/wp-content/uploads/2024/03/Pr1-159-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/03/Pr1-159-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/03/Pr1-159-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/03/Pr1-159-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/03/Pr1-159-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/03/Pr1-159-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/03/Pr1-159-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/03/Pr1-159-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/03/Pr1-159-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/03/Pr1-159-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/03/Pr1-159-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/03/Pr1-159-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/03/Pr1-159-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/03/Pr1-159-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/03/Pr1-159-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The cryptocurrency market has been on a wild ride recently, with Bitcoin leading the charge and setting the tone for the rest of the market. However, as the market matures and investors become more discerning, altcoins have begun to steal the spotlight. Among the thousands of altcoins in the market, three stand out as potential [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/count-on-these-3-altcoins-to-explode-when-the-real-altseason-begins-top-analyst/\">Count On These 3 Altcoins To Explode When The Real Altseason Begins: Top Analyst</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]