[
  {
    "source": "Cointelegraph",
    "date": "2023-10-20T14:00:00.000Z",
    "title": "Web3 game project allegedly hired actors to pose as executives in $1.6M exit scam",
    "url": "https://cointelegraph.com/news/web3-game-project-allegedly-hired-actors-to-pose-as-executives-in-exit-scam",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/fbb2ff60-330e-4d2f-805f-a7c5799de1ec.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>CertiK says Standard Cross Finance hired actors to pose as executives, then dumped tokens on investors, draining $1.6 million from the project’s liquidity pool.</p>\n                    <p><p>On Oct. 10, the development team for gaming project FinSoul carried out an alleged exit scam, siphoning away $1.6 million from investors through market manipulation, according to a recent report from blockchain security platform CertiK shared with Cointelegraph. </p><p>The FinSoul team allegedly hired paid actors to pretend to be its executives, then raised funds for the sole purpose of developing a gaming platform. However, instead of actually creating the platform, the FinSoul team allegedly transferred $1.6 million in bridged Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) from investors to itself. Blockchain data indicates developers then laundered the funds through cryptocurrency mixer Tornado Cash. Surprisingly, this was not the first allegation of misconduct against FinSoul’s developers. </p><p>On May 23, decentralized finance (DeFi) project Fintoch <a href=\"https://finance.yahoo.com/news/fintoch-adopts-advanced-technology-develop-232000070.html\" target=\"_blank\" rel=\"noopener nofollow\">published</a> a press release claiming it had adopted “advanced technology to develop the FinSoul U.S.-based metaverse platform” and had gone “live.” The announcement stated that the company was using “advanced technologies such as Unreal Engine 5 and Cocos 2D” to develop “sandbox worlds, multiplayer sports, leisure experiences, player socializing, MMORPG” and other types of gaming content.</p><p>The same day, on-chain sleuth ZachXBT <a href=\"https://twitter.com/zachxbt/status/1661129110062788608\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that the original Fintoch DeFi project had performed an exit scam. The team had seemingly stolen $31.6 million and bridged it to Tron blockchain in an attempt to launder the funds, ZachXBT claimed. </p><p>In response, CertiK claims that the team “rebranded” in August, changing its name and social channels. “Fintoch” became “Standard Cross Finance (SCF).” CertiK produced an image showing the key executives of both Fintoch and Standard Cross Finance, who appear to be identical. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/a43e2ca1-6747-46f6-bee9-c64a927bf064.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Fintoch and SCF key executives. Source: CertiK</em></figcaption></figure><p>CertiK claims to have verified the real names of the persons listed as the CEO, chief operating officer and chief financial officer of the project. According to it, these “executives” are actually actors who work in the entertainment industry. In addition, CertiK claims that the project’s chief technology officer was listed on a promotional poster for an entertainment company, providing evidence that he is also a paid actor. It could not determine the identities of the other two people claimed to be “executives.” </p><p>The rebranded “Standard Cross Finance” team continued to promote FinSoul on YouTube and Telegram, the report states. Its marketing efforts included a video depicting an alleged “R&amp;D Headquarters,” later revealed to be an office building on East Hamilton Avenue in Campbell, California. It also produced a video of an alleged promotional event in Vietnam.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The team page on the Fintoch website names “Bobby Lambert” as the CEO when in reality he does not exist and is a paid actor.  <br><br>Previously both the Singapore Government and Morgan Stanley issued warnings about this investment scheme. <a href=\"https://t.co/SLxvOCPj1s\">pic.twitter.com/SLxvOCPj1s</a></p>&mdash; ZachXBT (@zachxbt) <a href=\"https://twitter.com/zachxbt/status/1661129119806156802?ref_src=twsrc%5Etfw\">May 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to blockchain data, the project <a href=\"https://bscscan.com/tx/0xd3ed4cf5c276ba51845b11b10e61eafcb2dbb2e14a492662cfd18ebbc1b7caa0\" target=\"_blank\" rel=\"noopener nofollow\">deployed</a> its token contract to the BNB Smart Chain network on Oct. 10. At the time of deployment, 100 million FinSoul (FSL) tokens were minted and transferred into the deployer account. The deployer then sent 3 million FSL to other accounts through multiple transactions, leaving 97 million remaining in its possession. One of the transfers was for 210,000 FSL to an <a href=\"https://bscscan.com/address/0xDE3E5ffa9aF0bb3b2bAD2158eaC42bcB67B24de6\" target=\"_blank\" rel=\"noopener nofollow\">address</a> that subsequently used the tokens to <a href=\"https://bscscan.com/tx/0xe56aa566332a585b04842224994af8ac7307a7dea993c9867e5fe038aaa47901\" target=\"_blank\" rel=\"noopener nofollow\">create</a> a liquidity pool for FSL on PancakeSwap. From that point on, this pool was used by traders to buy and sell FSL.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/cardano-stabledcoin-project-gambled-away-investors-money-before-rug\"><strong>Cardano stablecoin project gambled away investors’ money before rug: Report</strong></a></em></p><p>Data from DEX Screener shows that the price of FSL was initially set at $0.3911 per token on Oct. 10 at 6:30 am UTC. Over the next few hours, it rose to $17.5774, then retreated from this peak and came to stabilize at around $5 for the next few hours. Then, between 4:30 pm and 5:00 pm UTC, the price suddenly <a href=\"https://dexscreener.com/bsc/0xab3c70b89569afc91e9add36698856c95b11adf6\" target=\"_blank\" rel=\"noopener nofollow\">collapsed</a>, falling from approximately $5 to near zero.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/482323f8-88a0-4050-ba66-dbeb7ad3047d.png\"  /><figcaption style=\"text-align: center;\">FSL prices suddenly declined to near zero between 4:30 and 5 pm on October 10. Source: DEX Screener.</figcaption></figure><p>The two events appear to have occurred between 4:25 pm and 4:35 pm UTC on Oct. 10, which may explain the sudden price decline. At 4:25 pm, the FSL deployer account transferred the remaining 97 million FSL to another <a href=\"https://bscscan.com/address/0x7249B903DA533358c897784438b87Bc94b402352\" target=\"_blank\" rel=\"noopener nofollow\">address</a>. At 4:35 pm, this account <a href=\"https://bscscan.com/tx/0x792515002eaeb73da6ca36b535ae50b3e95c69b74c1a39beea90ff31c2bed5c1\" target=\"_blank\" rel=\"noopener nofollow\">sold</a> all 97 million tokens into the liquidity pool, moving $1.6 million worth of Binance-pegged USDT from the liquidity pool into this account. This sale represented 32.33x the amount of FSL coins that had previously been circulating. This account subsequently <a href=\"https://bscscan.com/address/0x7249b903da533358c897784438b87bc94b402352\" target=\"_blank\" rel=\"noopener nofollow\">transferred</a> the drained funds to Tornado Cash through a series of transactions.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/0bcd1a2e-c7a3-47c1-b41b-1097e9deb932.png\"  /><figcaption style=\"text-align: center;\">FSL attacker depositing funds to Tornado Cash. Source: BSCScan.</figcaption></figure><p>According to CertiK, the Standard Cross Finance team has managed to convince investors to once again invest in its project, despite twice draining funds from investors. It has now relaunched FSL with a new token <a href=\"https://bscscan.com/address/0xcA7023FF89Cd3DD05DeDfeB6720611Fdf26dFF08\" target=\"_blank\" rel=\"noopener nofollow\">contract</a>. At the time of writing, DEX Screener <a href=\"https://dexscreener.com/bsc/0x136c60a66f6fccbeb5290bd0c8fad54342529f4f\" target=\"_blank\" rel=\"noopener nofollow\">shows</a> that the new version of FSL is valued at $1.29 per coin.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/bf91adad-3708-4119-b792-031951ff31c4.png\"  /><figcaption style=\"text-align: center;\">Finsoul (FSL) “V2” price. Source: DEX Screener.</figcaption></figure><p>Cointelegraph contacted the Standard Cross Finance team but did not receive a response by the time of publication.</p><p>The story of FinSoul serves as a cautionary reminder that crypto investors should investigate new projects before committing funds to them. If CertiK’s report is to be believed, it implies that a scam team was able to trick investors, not just once, but twice, and is currently attempting a third fraud. Investors should remember to exercise due diligence before investing in projects that do not have a functioning blockchain project.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/pond0x-dex-claims-100-million-trading-volume-critics-allege-scam\"><strong>Pond0x DEX claims $100M in trading volume as critics allege it’s a scam</strong></a></em></p><p>“Rug pulls,” or exit scams, have posed a continuing problem in the world of decentralized finance. Arbitrum-based protocol Xirtam allegedly stole over $3 million from investors using a token sale over the summer. In this instance, Binance managed to <a href=\"https://cointelegraph.com/news/binance-creates-smart-contract-refund-users-affected-rug-pull\">freeze the funds and return them to users</a> via a smart contract beginning on Sept. 6.</p><p>However, most rug-pull victims are not so lucky. In June, DeFi project Chibi Finance <a href=\"https://cointelegraph.com/news/chibi-finance-1-million-alleged-rug-pull-how-it-happened\">removed over $1 million of its users’ funds</a> through a “panic” function, and these funds have yet to be recovered. In 2021, the PopcornSwap exit scam <a href=\"https://cointelegraph.com/news/binances-indecision-to-freeze-bnb-wallets-drew-controversy-in-this-11m-rug-pull\">resulted in over $11 million in losses</a> to investors and led to criticism of the BNB Chain development team that still continues to this day.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/web3-game-project-allegedly-hired-actors-to-pose-as-executives-in-exit-scam&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-20T13:45:08.000Z",
    "title": "Bitfinex documentary on the rise of Bitcoin in El Salvador to premiere in Lugano",
    "url": "https://cryptoslate.com/bitfinex-documentary-on-the-rise-of-bitcoin-in-el-salvador-to-premiere-in-lugano/",
    "description": "<p>Bitfinex is set to debut a new documentary, &#8220;Don&#8217;t Trust…Verify,&#8221; on Oct. 22 in Lugano, Switzerland, presenting an in-depth exploration of Bitcoin adoption in El Salvador and the potential implications for the country&#8217;s future as reported in the company&#8217;s press release. The 45-minute documentary sheds light on the transformative impact of Bitcoin on El Salvador [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitfinex-documentary-on-the-rise-of-bitcoin-in-el-salvador-to-premiere-in-lugano/\">Bitfinex documentary on the rise of Bitcoin in El Salvador to premiere in Lugano</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-20T14:03:21.000Z",
    "title": "Ethereum (ETH) and Ripple (XRP) Price Prediction: Will Everlodge (ELDG) Surge in the Next Bull Run?",
    "url": "https://cryptodaily.co.uk/2023/10/ethereum-eth-and-ripple-xrp-price-prediction-will-everlodge-eldg-surge-in-the-next-bull-run",
    "description": "While the cryptocurrency market continues to grow, there are exciting newcomers on the scene, and one such standout is Everlodge (ELDG). While established giants like Ethereum (ETH) and Ripple (XRP) have long been dominant players, Everlodge offers a fresh crypto perspective. However, how will they all perform before 2023 ends? This article will answer that question."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-20T13:53:51.000Z",
    "title": "ChatGPT's 2024 Price Prediction for Tokens Under $5 - Stellar, Everlodge, Axie Infinity",
    "url": "https://cryptodaily.co.uk/2023/10/chatgpts-2024-price-prediction-for-tokens-under-5-stellar-everlodge-axie-infinity",
    "description": "While major players like Bitcoin continue to make headlines, newer tokens with promising potential have risen up lately. Luckily, we have ChatGPT to pick three coins that are valued under $5. They are Stellar, Axie Infinity, and Everlodge. In this article, we will look at what ChatGPT has to say about its price movements in 2024."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-20T14:00:52.000Z",
    "title": "Matrixport Says Bitcoin Is Headed For $56,000, Here’s The Driver",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-headed-for-56000/",
    "description": "Crypto financial services platform Matrixport has predicted that an approval of a spot Bitcoin ETF by the US Securities and Exchange Commission (SEC) could push the price of Bitcoin between $42,000 and $56,000 per unit. BTC, the world&#8217;s largest cryptocurrency, has experienced notable increases in value throughout the current week, with the aim of surpassing the significant threshold of $30,000.  The cryptocurrency has been influenced by the operations of a spot Bitcoin Exchange Traded Fund (ETF) as investors continue to await approval to onboard institutional and mainstream exposure to the digital asset.  Bitcoin Is Headed For $56,000 Matrixport conducted an analysis in its newly released report, examining the potential effects of a spot Bitcoin exchange-traded fund (ETF) on the cryptocurrency market, with a specific focus on BTC. Applications for these investment vehicles have gained momentum in recent months, with many now expecting a green light from the SEC. Related Reading: When Will The Bitcoin Bear Market End? US Mega Bank Has The Answer The report draws a parallel close to the $120 billion precious metals ETF industry. If just 10–20% of investors in precious metal ETFs diversified their holdings into Bitcoin ETFs, it would result in an influx of $12b billion to $24 billion into these investment vehicles. According to Matrixport, an approval, particularly a BlackRock Bitcoin ETF application, would see leading stablecoin USDT increase by as much as $50 billion in market cap. This, in turn, would lead to Bitcoin’s price rising to $56,000, with Tether acting as an intermediary facilitating the inflow of investments to BTC.  “Our earlier reports analysed the 15,000-strong US registered investor advisor (RIA) community overseeing around $5 trillion. This group holds immense potential, and even a modest 1% allocation recommendation for Bitcoin would usher in around $50 billion in inflows,” the report said. A lesser influx of $24 billion into Tether would see BTC rise to $42,000 in the short term. With BTC currently trading at $29,370 with a market cap of $625.03 billion, this represents an increase of 90% and 43% in both scenarios.  BTC readies to break $30,000 &#124; Source: BTCUSD on Tradingview.com What’s Next For BTC? Is A Rally Inevitable? The price of Bitcoin has always reacted to news regarding spot Bitcoin ETFs. Just news of applications from BlackRock, Fidelity, and other investment companies sent BTC surging. Recently, rumors that the SEC had approved BlackRock’s ETF application sent the industry into a frenzy, and $74 million worth of BTC positions were liquidated in just a few minutes. Related Reading: Bitcoin Maximalist Calls Ethereum ‘Garbage’, Here’s Why There&#8217;s no denying the amount of capital a spot Bitcoin ETF would unlock for the crypto industry. If approved, a spot Bitcoin ETF could unlock a massive inflow of capital from institutional investors, up to $17.7 trillion from financial institutions. According to Fundstrat co-founder Tom Lee, spot ETFs could push BTC to $150,000 or maybe even further by the end of next year. Featured image from Forkast News, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-20T13:57:12.000Z",
    "title": "SafePal Price Prediction 2023-2030: Will SFP Price Hit $1 Soon?",
    "url": "https://coinedition.com/safepal-sfp-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/SafePal-SFP-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SafePal-SFP-Price-Prediction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/SafePal-SFP-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/SafePal-SFP-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/SafePal-SFP-Price-Prediction-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/SafePal-SFP-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/SafePal-SFP-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/SafePal-SFP-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>SafePal is a blockchain project that was launched in 2018. The native token of the SafePal community is called SFP. SafePal cryptocurrency wallet is a free, secure, decentralized, and easy-to-use application for managing over 10,000 cryptocurrencies. With the SafePal app, you can easily store, send, receive, buy, and trade cryptocurrencies while enjoying a smooth and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/safepal-sfp-price-prediction/\">SafePal Price Prediction 2023-2030: Will SFP Price Hit $1 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-20T13:57:00.000Z",
    "title": "Crypto Investigator Accuses Ethereum Co-Founder For Bribing SEC",
    "url": "https://coinedition.com/crypto-investigator-accuses-ethereum-co-founder-for-bribing-sec/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/SEC_Must_Turn_Over_Emails_About_Ethereum—But_It_Wont_Help_Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SEC_Must_Turn_Over_Emails_About_Ethereum—But_It_Won’t_Help_Ripple\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/SEC_Must_Turn_Over_Emails_About_Ethereum—But_It_Wont_Help_Ripple.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/SEC_Must_Turn_Over_Emails_About_Ethereum—But_It_Wont_Help_Ripple-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/SEC_Must_Turn_Over_Emails_About_Ethereum—But_It_Wont_Help_Ripple-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/SEC_Must_Turn_Over_Emails_About_Ethereum—But_It_Wont_Help_Ripple-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/SEC_Must_Turn_Over_Emails_About_Ethereum—But_It_Wont_Help_Ripple-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Over 20 former employees of ConsenSys filed a lawsuit against the blockchain company&#8217;s co-founder, Joseph Lubin, according to the latest report by Bloomberg. The staff claimed that they were deprived of the stock awards&#8217; value, which originally enticed them to join the firm. The lawsuit highlighted that in 2020, Lubin transferred assets from ConsenSys AG, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-investigator-accuses-ethereum-co-founder-for-bribing-sec/\">Crypto Investigator Accuses Ethereum Co-Founder For Bribing SEC</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-20T13:44:10.000Z",
    "title": "Tether USDT Frontman to Inherit $84B Third-Largest Crypto Project",
    "url": "https://coinedition.com/tether-usdt-frontman-to-inherit-84b-third-largest-crypto-project/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Tether-Mints-1B-USDT.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Tether Mints 1B USDT\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Tether-Mints-1B-USDT.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Tether-Mints-1B-USDT-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Tether-Mints-1B-USDT-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Tether-Mints-1B-USDT-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Tether-Mints-1B-USDT-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Tether-Mints-1B-USDT-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Paolo Ardoino, the Chief Technology Officer of the USDT stablecoin firm Tether, is about to become a more prominent figure in the crypto industry come December this year. In particular, Ardoino will be assuming the CEO role in Tether, the third largest crypto project, to manage over $84 billion in stablecoins. While Tether&#8217;s top leadership [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/tether-usdt-frontman-to-inherit-84b-third-largest-crypto-project/\">Tether USDT Frontman to Inherit $84B Third-Largest Crypto Project</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]