[
  {
    "source": "CryptoSlate",
    "date": "2023-07-19T00:05:57.000Z",
    "title": "Do Kwon, Sam Bankman-Fried, and Elon Musk among the high-profile crypto wallet bounties on Arkham’s Intel Exchange",
    "url": "https://cryptoslate.com/do-kwon-sbf-and-elon-musk-crypto-wallets-among-135k-of-arkham-bounties/",
    "description": "<p>Arkham Intelligence&#8217;s Intel Exchange, which launched on July 18, is offering thousands of dollars of crypto rewards for those who are able to identify high-profile wallets, including those of Elon Musk, Do Kwon, and Sam Bankman-Fried. Among the rewards that have been offered by various users have are 10,000 ARKM ($6,587) for Terra founder Do [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/do-kwon-sbf-and-elon-musk-crypto-wallets-among-135k-of-arkham-bounties/\">Do Kwon, Sam Bankman-Fried, and Elon Musk among the high-profile crypto wallet bounties on Arkham&#8217;s Intel Exchange</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-19T00:00:26.000Z",
    "title": "Chainlink Price Pattern Formation: What It Means For Its Price Action",
    "url": "https://www.newsbtc.com/news/chainlink/chainlink-recent-pattern-formation-what-it-means-for-its-price-movement/",
    "description": "In recent trading sessions, Chainlink (LINK) has exhibited a bullish trend. It experienced a significant rebound from its $5 support level and has since continued on an upward trajectory. Related Reading: Litecoin Whales Deposit Big To Exchanges, Bearish Sign? Over the past week, LINK has surged more than 12%, although its daily chart indicates a slowdown in gains. The coin formed a bullish reversal pattern, driving a substantial price surge. The technical outlook for LINK reflects bullish strength, albeit with a slight decline in demand and accumulation on the chart. In recent trading sessions, LINK has formed a pattern that suggests a potential reversal in price direction. To prevent this reversal, it is crucial for LINK to maintain its upward movement and surpass immediate resistance levels. Additionally, a slight decline in market capitalization indicates a decrease in buying strength. Chainlink Price Analysis: One-Day Chart At the time of writing, Chainlink (LINK) was trading at $6.90. The coin has demonstrated significant bullish strength following its recent reversal from the $5 level, driven by the formation of an inverted head and shoulders pattern in the last week. However, despite the upward surge, LINK may encounter resistance around the $7.30 mark, which has historically acted as a strong ceiling for the coin. This resistance is further supported by the formation of a double-top pattern (marked in red), which is considered a bearish signal. As a result, there is a possibility that LINK may experience a decline towards the local support level of $6.60 and potentially even further to $5.80 before attempting a recovery once again. Technical Analysis During the formation of the double-top pattern, there was a notable decline in buying strength, suggesting an impending bearish price movement. The Relative Strength Index (RSI) indicated a bearish divergence, indicating a decrease in demand. Although the RSI remained above the half-line, readings indicated a fading buying strength. Despite this, LINK has managed to stay above the 20-Simple Moving Average (SMA) line, indicating that buyers still have control over price momentum. However, if there is a drop from the current price level, it could lead to LINK falling below the 20-SMA (red), which could bring sellers back into the market. On the one-day chart, the altcoin has exhibited buy signals, although these signals have been experiencing a slight decline. The Moving Average Convergence Divergence (MACD) indicator, which reflects price momentum and trend reversals, has formed declining green histograms, suggesting a potential decrease in buy signals. Related Reading: This Under-The-Radar Coin Just Beat The Top 100 Cryptocurrencies With 120% Explosion Additionally, the Bollinger Bands, which indicate volatility, are wide open, indicating the potential for significant price volatility in the upcoming trading sessions. Featured image from UnSplash, charts from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-19T00:00:24.000Z",
    "title": "Dogecoin (DOGE) on the Edge of Following XRP’s Big Breakout Rally, Says Crypto Strategist – Here’s His Target",
    "url": "https://dailyhodl.com/2023/07/18/dogecoin-doge-on-the-edge-of-following-xrps-big-breakout-rally-says-crypto-strategist-heres-his-target/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/dogecoin-on-the-edge.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/dogecoin-on-the-edge.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/dogecoin-on-the-edge.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/dogecoin-on-the-edge.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/dogecoin-on-the-edge.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/dogecoin-on-the-edge.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/dogecoin-on-the-edge.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto analyst Michaël van de Poppe thinks that top memecoin Dogecoin (DOGE) is setting up to follow the explosive XRP rally from last week. A few days ago, the cross-border payments solution XRP went on a massive tear, rallying by over 73% in less than 24 hours after Judge Analisa Torres ruled Ripple’s automated, open [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/18/dogecoin-doge-on-the-edge-of-following-xrps-big-breakout-rally-says-crypto-strategist-heres-his-target/\">Dogecoin (DOGE) on the Edge of Following XRP’s Big Breakout Rally, Says Crypto Strategist – Here’s His Target</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]