[
  {
    "source": "CryptoGlobe",
    "date": "2023-12-12T19:27:48.000Z",
    "title": "S&P Global Ratings Casts Doubt on Tether’s Stability in New Stablecoin Assessment",
    "url": "https://www.cryptoglobe.com/latest/2023/12/sp-global-ratings-casts-doubt-on-tethers-stability-in-new-stablecoin-assessment/",
    "description": "S&amp;P Global Ratings has announced the launch of its stablecoin stability assessment. S&amp;P Global Ratings, a division of S&amp;P Global Inc. (NYSE: SPGI), is a leading provider of independent credit risk research. The firm publishes credit ratings on debt issued by various entities across multiple sectors. With a global team of credit analysts and a […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-12T19:18:21.000Z",
    "title": "Axelar Powers Vertex's Move Towards Cross-Chain Interoperability",
    "url": "https://cryptodaily.co.uk/2023/12/axelar-powers-vertexs-move-towards-cross-chain-interoperability",
    "description": "Axelar Powers Vertex's Move Towards Cross-Chain Interoperability"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-12T19:18:27.000Z",
    "title": "Axelar Powers Vertex’s Move Towards Cross-Chain Interoperability",
    "url": "https://www.cryptopolitan.com/axelar-powers-vertexs-move-towards-cross-chain-interoperability/",
    "description": "New York, USA, December 12th, 2023, Chainwire The top derivatives DEXs and spot DEXs are now all using Axelar network for cross-chain connections Vertex Protocol, one of the most innovative and fast-growing DEXs in Web3, is now using Axelar network and Squid to power cross-chain collateral deposits. The integration was announced today on Twitter. Vertex [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-12T19:18:51.000Z",
    "title": "Floki surges 4% following announced campaign with TokenFi",
    "url": "https://crypto.news/floki-surges-campaign-tokenfi/",
    "description": "Popular memecoin FLOKI surged nearly 4% in an hour following the announcement of a two-month marketing campaign with TokenFi in Hong Kong."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-12T19:30:42.000Z",
    "title": "Bitcoin Rushes To Exchanges, But This Sign Remains Positive For The Bulls",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-flows-exchanges-sign-positive-bulls/",
    "description": "On-chain data shows an increasing trend of Bitcoin moving to exchanges, a typical bearish sign, but another signal still remains optimistic for the bulls. Bitcoin Exchange Inflows Are Up, But So Are USDT Deposits According to data from the on-chain analytics firm Santiment, BTC has been flowing into exchanges recently. The relevant indicator here is the &#8220;supply on exchanges,&#8221; which keeps track of the percentage of a cryptocurrency&#8217;s total circulating supply that&#8217;s currently sitting in the wallets of all centralized exchanges. When the value of this metric goes up, it means that the investors are making net deposits of the asset into these platforms, while a decline implies outflows are taking place. Related Reading: Crypto Market Crashes: Traders React With “Buy The Dip” Calls What effect either of these trends might have on the market depends on the type of cryptocurrency in question. Santiment has shared the below chart, which shows how the supply on exchanges has recently changed for four assets: Bitcoin, Ethereum (ETH), Tether (USDT), and USD Coin (USDC). The trends in the exchange supplies of the different top cryptocurrencies &#124; Source: Santiment on X As displayed in the above graph, the Bitcoin and Ethereum exchange supplies had both been on the decline earlier, but recently, BTC has diverged from this downtrend and registered some net deposits. These deposits first started after BTC finished its rally to $44,000 and took to sideways movement. Generally, one of the main reasons why holders might deposit their coins to exchanges is for selling purposes, so these recent inflows can be a sign that selling has been taking place. The uptrend in the supply on exchanges also became a bit sharper in the leadup to the asset&#8217;s latest plunge, suggesting that the inflows have indeed been adding to the selling pressure. From the chart, it&#8217;s also visible that the Bitcoin supply on exchanges hasn&#8217;t yet reversed its trend, a potential indication that selling hasn&#8217;t completely exhausted yet. Meanwhile, Ethereum has continued to see supply exit these central entities, implying that investors of the cryptocurrency are possibly still participating in net accumulation. Something that could prove to be positive for BTC, though, is the fact that the Tether supply on exchanges has risen since the plunge. Investors usually make use of stablecoins like USDT and USDC whenever they want to escape the volatility associated with coins like BTC and ETH, but such investors generally only do this as a temporary measure. When the holders plan to leave the cryptocurrency sector as a whole, they do so through fiat instead. Opting for stablecoins instead, thus, means that they intend to stay in the market and possibly eventually return back towards the volatile side. Sizeable swaps from stables into Bitcoin and others can naturally provide a buying boost to their prices, so exchange inflows of them can be a bullish sign for these volatile assets. Related Reading: BONK Soars 18%, But Analyst Warns Of Impending Correction The most bullish combination is when BTC rallies while the USDT exchange supply does the same, as such a trend suggests that fresh capital is entering into the sector. In the current case, the Tether exchange supply has gone up at the expense of BTC&#8217;s price, so only a rotation of capital has occurred. Nonetheless, the fact that not all capital has exited the sector as a whole can still be an optimistic sign for the rally&#8217;s return. BTC Price Bitcoin had plunged towards $40,000 yesterday, but the coin has already made some swift recovery as it&#8217;s now trading around the $41,700 level. Looks like BTC has made some recovery from its lows &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-12T19:27:00.000Z",
    "title": "Judgment on Ripple’s Case Exposed Howey Test Limitations: Experts",
    "url": "https://coinedition.com/judgment-on-ripples-case-exposed-howey-test-limitations-experts/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Settlement-In-SEC-vs-Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Judgment on Ripple’s Case Exposed Howey Test Limitations: Experts\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Settlement-In-SEC-vs-Ripple.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Settlement-In-SEC-vs-Ripple-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Settlement-In-SEC-vs-Ripple-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Settlement-In-SEC-vs-Ripple-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Settlement-In-SEC-vs-Ripple-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Settlement-In-SEC-vs-Ripple-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Web3 experts have highlighted the procedural and factual differences between the handling of Ripple’s case against the Securities and Exchange Commission (SEC) and the Terraform case, as well as the limitations of the Howey Test.  In a recently published article, Alex Drylewski, co-head of Skadden, Arps, Slate, Meagher &#38; Flom Web3 and digital assets group, [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/judgment-on-ripples-case-exposed-howey-test-limitations-experts/\">Judgment on Ripple’s Case Exposed Howey Test Limitations: Experts</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-12T19:30:19.000Z",
    "title": "BitMart Lists Zero-Knowledge DeFi Pioneer Panther Protocol’s ZKP",
    "url": "https://dailyhodl.com/2023/12/12/bitmart-lists-zero-knowledge-defi-pioneer-panther-protocols-zkp/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/Panther-Protocol-Industry-Announcement-Featured-Image-Template.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/Panther-Protocol-Industry-Announcement-Featured-Image-Template.jpg 1500w, https://dailyhodl.com/wp-content/uploads/2023/12/Panther-Protocol-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/12/Panther-Protocol-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/12/Panther-Protocol-Industry-Announcement-Featured-Image-Template.jpg?resize=768,768 768w, https://dailyhodl.com/wp-content/uploads/2023/12/Panther-Protocol-Industry-Announcement-Featured-Image-Template.jpg?resize=1024,1024 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/Panther-Protocol-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/12/Panther-Protocol-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w, https://dailyhodl.com/wp-content/uploads/2023/12/Panther-Protocol-Industry-Announcement-Featured-Image-Template.jpg?resize=750,750 750w, https://dailyhodl.com/wp-content/uploads/2023/12/Panther-Protocol-Industry-Announcement-Featured-Image-Template.jpg?resize=1140,1140 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>December 12, 2023 – Gibraltar, Gibraltar Panther Protocol is excited to announce its ZKP listing on BitMart, a leading cryptocurrency exchange operating in over 180 countries. This listing is part of Panther Protocol&#8217;s ongoing effort focused on strategic partnerships and exchange listings before its V1 mainnet launch aimed at providing improved accessibility, a variety of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/12/bitmart-lists-zero-knowledge-defi-pioneer-panther-protocols-zkp/\">BitMart Lists Zero-Knowledge DeFi Pioneer Panther Protocol’s ZKP</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]