[
  {
    "source": "NewsBTC",
    "date": "2023-10-10T00:00:08.000Z",
    "title": "Solana Outshines Bitcoin? A Dive Into Last Week’s Crypto Asset Inflows",
    "url": "https://www.newsbtc.com/news/solana-outshines-bitcoin-a-dive-into-last-weeks/",
    "description": "Last week marked a noteworthy surge for Solana in inflows, leading the pack in altcoin investment interests and outshining Bitcoin. Solana&#8217;s recent performance particularly placed it in the spotlight as it amassed roughly $24 million, the altcoin registered its largest inflow since March 2022, according to a recent report from Coinshares. A Closer Look: Dissecting The Solana Inflow Surge Diving into the numbers, the broader digital-asset investment domain observed net inflows for the second consecutive week, accumulating a significant $78 million, showcasing a bullish sentiment reminiscent of July&#8217;s performance. Related Reading: Will October Be Bitcoin’s Golden Month Again? A Dive Into A Decade Of Bullish Trends While Bitcoin, the quintessential crypto giant, continued to dominate, Solana grabbed headlines. As highlighted by James Butterfill, Head of Research, Solana&#8217;s re-emergence as a sought-after altcoin signifies its growing appeal among digital investors, especially in light of recent Ethereum futures ETF product launches. According to the report, with a noteworthy track record for 2023, Solana funds reported inflows for 28 weeks, with a mere four weeks registering outflows. Always a major player, Bitcoin recorded inflows of $43 million. The report disclosed that a certain subset of investors, potentially riding on Bitcoin&#8217;s recent price momentum, initiated positions in short-bitcoin products, leading to an inflow of $1.2 million within the week. Diverging Investment Patterns: Europe Leads While ETH ETFs Underwhelm Geographically, Europe continued its digital asset supremacy, accounting for 90% of the total inflows. On the contrary, the combined inflows from the US and Canada totaled a mere $9 million. According to Butterfill, this noticeable regional disparity in investment sentiments underscores evolving market dynamics and investor preferences. Adding to the digital fervor, trading volumes for exchange-traded products surged by 37%, settling at $1.13 billion for the week. Trusted exchanges dealing with Bitcoin also witnessed a 16% jump in trading volume. However, it wasn’t all sunshine and rainbows. The recent US launch of six Ethereum futures ETFs raked below $10 million. While seemingly substantial, Butterfill termed the response as showcasing a “tepid appetite,” particularly when juxtaposed against the $1 billion amassed by Bitcoin futures ETFs in their inaugural week back in 2021. However, Butterfill attributed this difference more to the contrasting market environments and the &#8220;poor investor appetite&#8221; for digital assets rather than a direct reflection of the asset&#8217;s potential. Related Reading: Ethereum ETFs Face Lackluster Debut From Small Investors: Is The Hype Fizzling Out? Furthermore, regardless of the recorded positive inflows from Solana last week, the altcoin is currently facing a bloodbath along with Bitcoin. Notably, Solana has declined by nearly 10% in the past week and 4.5% in the past 24 hours, with a market price of $22.30 at the time of writing. &#160; In contrast, Bitcoin has also shed its portion of losses, down by 2.9% in the past 7 days and 1.4% in the past day, with a trading price currently at $27,518. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-10T00:00:55.000Z",
    "title": "$77,800,000,000 Asset Manager Warns Future Is Uncertain for Avalanche, Says AVAX Facing Multiple Headwinds",
    "url": "https://dailyhodl.com/2023/10/09/77800000000-asset-manager-warns-future-is-uncertain-for-avalanche-says-avax-facing-multiple-headwinds/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/avax-exceeds-monthly-active.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/avax-exceeds-monthly-active.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/avax-exceeds-monthly-active.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/avax-exceeds-monthly-active.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/avax-exceeds-monthly-active.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/avax-exceeds-monthly-active.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/avax-exceeds-monthly-active.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Investment giant VanEck is weighing in on Ethereum (ETH) rival Avalanche (AVAX), warning that the project faces numerous serious headwinds. In a new report on the digital asset markets, VanEck analysts say that on-chain activity on Avalanche&#8217;s C-Chain has collapsed to critical levels. VanEck notes how Avalanche generated about $11,000 in fees per day in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/09/77800000000-asset-manager-warns-future-is-uncertain-for-avalanche-says-avax-facing-multiple-headwinds/\">$77,800,000,000 Asset Manager Warns Future Is Uncertain for Avalanche, Says AVAX Facing Multiple Headwinds</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]