[
  {
    "source": "CoinDesk",
    "date": "2023-11-14T16:42:03.000Z",
    "title": "The IRS and the Rising Cost of Crypto Tax Compliance",
    "url": "https://www.coindesk.com/consensus-magazine/2023/11/14/the-irs-and-the-rising-cost-of-crypto-tax-compliance/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "David Kemmerer anticipates the unintended consequences of proposed new regulations on brokers reporting crypto transactions. Expensive “tax experts” are set to benefit financially, he says, even if ordinary investors won’t."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-14T16:41:57.000Z",
    "title": "Cathie Wood Speculates Gary Gensler's Political Ambitions Are Affecting Spot BTC ETF Judgement",
    "url": "https://www.coindesk.com/policy/2023/11/14/cathie-wood-speculates-gary-genslers-political-ambitions-are-affecting-spot-btc-etf-judgement/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Wood said Gensler's concerns that bitcoin is prone to market manipulation, one of the barriers to the approval of a spot BTC ETF in the U.S., belie his perfectly sound cryptocurrency knowledge."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-14T17:00:00.000Z",
    "title": "OKX launches Ethereum layer-2 testnet using ZK-based Polygon CDK",
    "url": "http://cointelegraph.com/news/okx-launches-ethereum-layer-2-testnet-using-zk-based-polygon-cdk",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/cd298270-bb4d-46c2-ab11-5acb8e593357.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The “X1” network will be part of the Polygon ecosystem and use zero-knowledge proofs to bridge assets from Ethereum.</p>\n                    <p><p>Crypto exchange OKX has launched a testnet for an upcoming Ethereum layer-2 network named “X1,” according to a Nov. 14 announcement. The network is being developed using the Polygon chain development kit (CDK) and will use zero-knowledge proofs to validate deposits and withdrawals between layers.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/3a5bf8ca-e8cc-4baa-a89f-0d23cbc628a8.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>OKX exchange interface. Source: OKX</em></figcaption></figure><p>OKX is the sixth-largest centralized crypto exchange by volume, with over $1.8 billion in trading volume per day, <a href=\"https://coinmarketcap.com/rankings/exchanges/\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to data from CoinMarketCap. Its token, OKB, has a current market cap of over $3.6 billion, making it one of the top 30 cryptocurrencies. When a mainnet version of the new network is launched, OKB will be the native coin used to pay gas fees on it, the announcement stated.</p><p>X1 is being developed using the Polygon CDK, potentially making it part of the broader Polygon ecosystem that includes Polygon zero-knowledge Ethereum Virtual Machine, Polygon PoS, Near, Manta Pacific and other networks. According to the announcement, OKX will also be a core contributor to the Polygon CDK software going forward and will “invest substantial engineering resources to enhance the technology stack for Ethereum scaling solutions.”</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/polygon-labs-near-announce-zk-prover-wasm-integration\"><strong>Polygon Labs and Near announce ZK prover for WASM integration</strong></a></em></p><p>OKX chief innovation officer Jason Lau claimed that the new network will help to onboard new users to Web3, stating:</p><blockquote>“X1 will be a key pillar of our efforts to educate and bring our users on-chain and into the world of Web3. This scalable and accessible network is perfect for developers, who can build on X1 to deliver user-friendly world-class consumer Web3 applications, all while maintaining interoperability with other networks and ecosystems.”</blockquote><p>OKX <a href=\"https://cointelegraph.com/news/okexchain-mainnet-enters-genesis-stage-10-million-okt-tokens-issued\">is also the creator of OKT Chain</a>, an Ethereum sidechain that uses OKB as its native coin. It isn’t the only exchange to build its own network: <a href=\"https://cointelegraph.com/news/binance-chain-launches-firm-expects-to-execute-mainnet-swap-on-april-23\">Binance launched BNB Chain in 2019</a>, and Coinbase <a href=\"https://cointelegraph.com/news/coinbase-base-network-officially-launched-heres-how-it-can-be-used\">launched its layer-2 “Base” network on Aug. 9</a>.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-14T17:00:00.000Z",
    "title": "Opyn DeFi protocol founders are leaving crypto after CFTC crackdown",
    "url": "http://cointelegraph.com/news/opyn-de-fi-protocol-founders-leaving-cryptocurrency-cftc-crackdown",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/c4e19308-f49a-4ca6-8f52-24cf79c66164.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Two of the founders of crypto options platform Opyn are stepping down from leadership roles to pursue other aims, but Opyn will continue under new leadership.</p>\n                    <p><p>Zubin Koticha and Alexis Gauba, two founders of the Opyn decentralized finance (DeFi) protocol, are <a href=\"https://twitter.com/snarkyzk/status/1724243580737499401\" target=\"_blank\" rel=\"noopener nofollow\">stepping</a> down from the project and “leaving crypto,” according to a statement from Koticha posted to social media on November 14. The statement comes approximately two months after Opyn settled an enforcement action against it from the US Commodity and Futures Trading Commision (CFTC).</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Hey Crypto Twitter,<br><br>It&#39;s been a while<br><br>This one&#39;s a tough one...<br><br>After the regulatory action against Opyn, <a href=\"https://twitter.com/AlexisGauba?ref_src=twsrc%5Etfw\">@alexisgauba</a> and I have made the decision that we are leaving crypto.<br><br>This is honestly really emotional for me and Alexis.</p>&mdash; zubin koticha (@snarkyzk) <a href=\"https://twitter.com/snarkyzk/status/1724243580737499401?ref_src=twsrc%5Etfw\">November 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In his statement, Koticha claimed that the decision was “really emotional” for the two of them. “We thought we were going to be in crypto for the rest of our lives,” Koticha explained. “But unfortunately and unexpectedly, this is the end of the road.” According to him, Opyn will continue under the leadership of head of research Andrew Leone, who is being promoted to CEO. </p><p>Koticha hinted that the two executives will be working on a new project, stating “As for me and Alexis - we got something new for y'all very soon.” However, this new project will not be crypto related, as the two “have made the decision that we are leaving crypto.”</p><p>Gauba <a href=\"https://twitter.com/AlexisGauba/status/1724243851144266088\" target=\"_blank\" rel=\"noopener nofollow\">shared</a> Koticha’s post from her own account, commenting “Always thought I’d be building in crypto for the rest of my life, so it’s really sad to be leaving.”</p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/opyn-removes-liquidity-from-uniswap-after-370k-stolen-in-defi-exploit\"><strong>Opyn Removes Liquidity From Uniswap After $370K Stolen in DeFi Exploit</strong></a></p><p>Opyn is an options trading platform that runs on the Ethereum network. Its development team is headquartered in San Francisco, CA. On September 7, the US CFTC announced that it was simultaneously <a href=\"https://cointelegraph.com/news/ctfc-issues-order-against-defi-protocols-opyn-zeroex-deridex\">issuing and settling an enforcement action</a> against Opyn and two other DeFi teams for allegedly operating an unregistered derivatives exchange. Opyn was ordered to pay a civil monetary penalty of $250,000 and “cease and desist” from violating US commodities trading laws. Attempting to open the Opyn interface from a US IP address now produces a “blocked” error page, and this redirection persists even when using many offshore VPN addresses.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/0cce544e-f5df-4867-88ea-188b4070860d.png\"  /><figcaption style=\"text-align: center;\"><em>Opyn “blocked” page. Source: Opyn.</em></figcaption></figure><p>The CFTC action against Opyn was controversial even within the commission itself, as commissioner Summer Mersinger <a href=\"https://cointelegraph.com/news/defi-enforcement-sparks-dissenting-opinion-cftc-commissioner\">wrote a dissenting opinion</a> claiming that the enforcement action should not have been taken.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-14T17:00:10.000Z",
    "title": "Ethereum and Solana lead DeFi surge as TVL and DEX activity soar",
    "url": "https://cryptoslate.com/ethereum-solana-lead-defi-surge-as-tvl-and-dex-activity-soar/",
    "description": "<p>The DeFi sector has experienced a significant increase in both activity and token prices, primarily driven by Bitcoin&#8217;s October rally. Central to understanding this landscape is the concept of Total Value Locked (TVL) and decentralized exchange (DEX) volumes, two critical metrics that offer insights into the health and trajectory of DeFi protocols. TVL, the aggregate [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ethereum-solana-lead-defi-surge-as-tvl-and-dex-activity-soar/\">Ethereum and Solana lead DeFi surge as TVL and DEX activity soar</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-11-14T17:03:52.000Z",
    "title": "Disney Unveils NFT Pin Collection & Trading Platform with Dapper Labs",
    "url": "https://cryptobriefing.com/disney-nft-pin-collection-trading-platform-dapper-labs/?utm_source=feed&utm_medium=rss",
    "description": "Disney unveils Disney Pinnacle, an NFT pin app allowing fans to discover, collect and trade digital Disney, Pixar &#038; Star Wars pins."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-14T17:11:01.000Z",
    "title": "Will GALA Be the Next Crypto to Skyrocket After the Latest US CPI Report?",
    "url": "https://cryptodaily.co.uk/2023/11/will-gala-be-the-next-crypto-to-skyrocket-after-the-latest-us-cpi-report",
    "description": "Explore the potential of GALA in the crypto market after recent US CPI data suggests a cooling inflation, possibly affecting the Fed's rate decisions. Dive into GALA's technical analysis and price predictions in this detailed look at its market performance and future outlook."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-14T17:05:30.000Z",
    "title": "Crypto shock as XRP jumps 12% on fake BlackRock news",
    "url": "https://www.cryptopolitan.com/crypto-shock-as-xrp-jumps-12/",
    "description": "Cryptocurrency investors witnessed a surge and subsequent retracement in Ripple&#8217;s XRP token value, triggered by the circulation of misleading information regarding BlackRock&#8217;s involvement in a spot Bitcoin ETF. In a whirlwind of market activity, Ripple&#8217;s XRP token encountered a rapid 12% surge within a brief one-hour window. The catalyst behind this abrupt price movement was ... <a title=\"Crypto shock as XRP jumps 12% on fake BlackRock news\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-shock-as-xrp-jumps-12/\" aria-label=\"More on Crypto shock as XRP jumps 12% on fake BlackRock news\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-14T16:52:34.000Z",
    "title": "ERC-4337: Hopes dashed, strains revealed in Ethereum’s smart account saga",
    "url": "https://www.cryptopolitan.com/erc-4337-hopes-dashed-strains-revealed-in-ethereums-smart-account-saga/",
    "description": "Smart account adoption of the ERC-4337 standard has fallen short of expectations, according to recent figures shared by Ethereum account abstraction advocate John Rising. The surprising decline in user engagement, coupled with low transaction activity and financial challenges for core infrastructure providers, paints a less-than-rosy picture for the touted technology. In a recent communication via ... <a title=\"ERC-4337: Hopes dashed, strains revealed in Ethereum&#8217;s smart account saga\" class=\"read-more\" href=\"https://www.cryptopolitan.com/erc-4337-hopes-dashed-strains-revealed-in-ethereums-smart-account-saga/\" aria-label=\"More on ERC-4337: Hopes dashed, strains revealed in Ethereum&#8217;s smart account saga\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-14T16:43:33.000Z",
    "title": "Blockchain payment firm Fnality surges with $95M backing from BNP Paribas and Goldman",
    "url": "https://www.cryptopolitan.com/blockchain-payment-firm-fnality-surges-with-95m-backing-from-bnp-paribas-and-goldman/",
    "description": "Global investment bank Goldman Sachs and French universal bank BNP Paribas have spearheaded a successful funding round for Fnality, a blockchain-based wholesale payments firm. The company secured £77.7 million ($95.09 million) in its second funding round, bringing its total capital raised to $158 million since 2019. Notable participants in this funding round included settlement houses ... <a title=\"Blockchain payment firm Fnality surges with $95M backing from BNP Paribas and Goldman\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blockchain-payment-firm-fnality-surges-with-95m-backing-from-bnp-paribas-and-goldman/\" aria-label=\"More on Blockchain payment firm Fnality surges with $95M backing from BNP Paribas and Goldman\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-14T16:43:25.000Z",
    "title": "OpenSea users targeted in phishing scam disguised as official NFT offers",
    "url": "https://crypto.news/opensea-users-targeted-in-phishing-scam-disguised-as-official-nft-offers/",
    "description": "In a Nov. 14 post on X from WuBlockchain, it was confirmed that several community users had reported they received phishing emails from an \"Opensea official.\""
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-14T17:00:35.000Z",
    "title": "BlackRock’s XRP ETF Filing, Everything You Need To Know",
    "url": "https://www.newsbtc.com/analysis/xrp/blackrock-xrp-etf-filing/",
    "description": "Since Monday, discussions around the mysterious BlackRock XRP ETF filing that appeared in Delaware have dominated the crypto space. The news of the filing was initially debunked by Bloomberg’s Eric Balchunas, but recent developments have raised suspicions that the filing was actually made by BlackRock. BlackRock XRP ETF Could Be Filed By Anyone One interesting revelation that has come from the BlackRock XRP ETF debacle is the fact that pretty much anyone can make an ETF Trust. Pro-XRP attorney Jeremy Hogan revealed this on X (formerly Twitter), saying that anyone could actually spoof an “XRP ETF” Trust. Related Reading: Ethereum Spot ETFs: BlackRock Takes The Fight To SEC With New Filing Hogan explains that while the filing is real, it is fraudulent and could be cheaply made with just $500. Apparently, all that is needed for such a Trust to appear on the Delaware Corp. Commission website is to fill out two documents. These include the ‘State of Delaware Certificate of Trust’ and the ‘State of Delaware &#8211; Division of Corporations’ documents. Then once the $500 fee is paid, Hogan says the filing then gets “a ‘placeholder’ on the state website.” The attorney reasons that whoever did this may have tried to replicate what happened when BlackRock filed for an Ethereum spot ETF. “criminal saw what happened with the Eth trust filing, files the XRP trust &#8220;filing,&#8221; buys $100k xrp on leverage, sells at 74 cents, and pockets 2-3 million dollars.” On the other end of this, Hogan also reasons that maybe “Blackrock has clients who want exposure to XRP and have begun the process.” Details Of The ‘Fake’ ETF Filing Another attorney, Fred Rispoli, also took to X (formerly Twitter) to give their own two cents on the BlackRock XRP ETF situation. Rispoli confirmed what Hogan said about anyone being able to fake such a filing and having it listed on the site. But other than that, the attorney went into the details of the filing. The XRP Trust filing reportedly matches the BlackRock Ethereum ETF filing with the exception of the name being changed and the date of the filing being different. However, the XRP Trust has a different registered agent than the BlackRock Bitcoin Trust but shares the same one with the Ethereum Trust. Related Reading: Renowned Economist Warns Of Bitcoin Crash Before Spot ETF Approvals Rispoli adds that only the BlackRock iShares Bitcoin filing is currently listed on the SEC’s Edgar site, which is where filings with the regulator are listed. There is no trace of an iShares Ethereum and XRP Trust. “However, the Bitcoin Delaware filing preceded the SEC Registration statement by 7 days (6/8/23, 6/15/23),” the attorney said. He also added that there were no trademarks filed by BlackRock for all its crypto trusts filed this year, including the Bitcoin, Ethereum, and XRP ones. However, this is not out of the ordinary since the asset manager does not trademark all of its products. Finally, Rispoli explains that even if the BlackRock XRP Trust filing were true, it wouldn’t be the first one. That actually goes to Grayscale, which ran an XRP Trust between 2018 and 2021. However, the asset manager discontinued this trust after the SEC sued Ripple over alleged securities violations. BlackRock rumors sends price surging &#124; Source: XRPUSD On Tradingview.com XRP Trust Filing Still Up Even though Bloomberg’s Eric Balchunas had said that an insider at BlackRock had denied that the asset manager filed the XRP Trust, the filing remained on the Delaware Corp. Commission website. Related Reading: Crypto Expert Reveals One Major Reason The XRP Price Will Do Well In The Bull Run This raised skepticism among investors who began to speculate that maybe the asset manager may have made the filing after all. “If it was fake, it would’ve been delisted by now,” WhaleWire said on X. It’s been over 6 hours, and the iShares $XRP Trust filing is still actively listed on the ICIS Delaware website. If it was fake, it would’ve been delisted by now. Also, in order to apply, you must have TWO notorized witnesses &#38; the Grantor MUST sign the documents, as well as… pic.twitter.com/Uup7wy0Xvp — WhaleWire (@WhaleWire) November 13, 2023 At the time of this writing, there is still no official word from BlackRock on whether the filing is legit or not. However, Eric Balchunas has stated that a BlackRock spokesperson has confirmed the filing is fake. Featured image from CryptoRank, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-14T17:03:57.000Z",
    "title": "Dogecoins (DOGE) Remarkable 10% Jump: Bullish Momentum or Time to Sell?",
    "url": "https://www.crypto-news-flash.com/dogecoins-doge-remarkable-10-jump-bullish-momentum-or-time-to-sell/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoins-doge-remarkable-10-jump-bullish-momentum-or-time-to-sell",
    "description": "<img width=\"1000\" height=\"664\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Doge\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5-768x510.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />DOGE value has risen significantly, with a 14.74 percent increase in 48 hours and a 15 percent spike in trading volume, indicating a critical phase in the digital currency market. Market sentiment is currently in the &#8216;Greed&#8217; category, suggesting potential overheating and risk of price correction despite positive technical indicators and on-chain metrics supporting a [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-14T17:01:33.000Z",
    "title": "cheqd Launches Creds Creator Studio: Create Verifiable Credentials to Increase Community Trust and Engagement",
    "url": "https://www.crypto-news-flash.com/cheqd-launches-creds-creator-studio-create-verifiable-credentials-to-increase-community-trust-and-engagement/?utm_source=rss&utm_medium=rss&utm_campaign=cheqd-launches-creds-creator-studio-create-verifiable-credentials-to-increase-community-trust-and-engagement",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/photo_2023-11-14_12-35-38_16999593214O5TdHuTOg.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/photo_2023-11-14_12-35-38_16999593214O5TdHuTOg.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/photo_2023-11-14_12-35-38_16999593214O5TdHuTOg-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/photo_2023-11-14_12-35-38_16999593214O5TdHuTOg-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/photo_2023-11-14_12-35-38_16999593214O5TdHuTOg-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Lisbon, Portugal, November 14th, 2023, Chainwire cheqd, the startup that enables users and organizations to gain control and portability of their data, has announced the availability of its Creds Creator Studio at the 2023 Web Summit in Lisbon. Kicking off with an initial six launch partners, Creds Creator Studio enables companies to create Verifiable Credentials [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-14T16:57:11.000Z",
    "title": "Ripple’s XRP Sees Record Whale Activity with 900 Million Coins in Play",
    "url": "https://www.crypto-news-flash.com/ripples-xrp-sees-record-whale-activity-with-900-million-coins-in-play/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-xrp-sees-record-whale-activity-with-900-million-coins-in-play",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-29T200247.261.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple(xrp)\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-29T200247.261.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-29T200247.261-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-29T200247.261-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />XRP whales are actively transferring large amounts of currency, indicating strong market activity and liquidity. Ripple&#8217;s legal victories and strategic partnerships are positively impacting XRP&#8217;s market standing and investor confidence. In recent developments within the cryptocurrency market, XRP has emerged as a standout for its increased whale activity and price performance. Over the past weekend, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-14T16:44:51.000Z",
    "title": "Shiba Inu (SHIB) Rockets Towards a 12% Price Surge – Crypto Investors Buckle Up",
    "url": "https://www.crypto-news-flash.com/shiba-inu-shib-rockets-towards-a-12-price-surge-crypto-investors-buckle-up/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-shib-rockets-towards-a-12-price-surge-crypto-investors-buckle-up",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shibarium\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-2048x1152.jpg 2048w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />With Shiba Inu (SHIB) price up 22 percent in the past four weeks after failing to retest this year’s lows, technical indicators point to an imminent breakout in the coming weeks as the altcoins slowly steal the show from Bitcoin. The Shiba Inu ecosystem has grown to a robust network consisting of committed web3 developers [...]"
  }
]