[
  {
    "source": "Cointelegraph",
    "date": "2023-11-09T08:53:32.000Z",
    "title": "Spanish regulators set precedent with crypto ad violations case  ",
    "url": "http://cointelegraph.com/news/spanish-regulators-precedent-crypto-ad-violations-case",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/1b2ad6ea-8d9e-4369-8943-a79ea7b2c076.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The National Securities Market Commission accuses Miolos of non-compliance with the cryptocurrency regulations established by the CNMV circular from January 2022.</p>\n                    <p><p>The principal financial regulator in Spain, the National Securities Market Commission (CNMV), has opened the first case on violating crypto promotion rules in the country. </p><p>As <a href=\"https://www.cnmv.es/webservices/verdocumento/ver?t=%7b9bbf6399-894a-459c-95a9-786b3a6bb724%7d\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> in the press release from Nov. 8, CNMV initiated “sanctioning proceedings” against Miolos S.L for two “massive” advertisement companies in September and November 2022. </p><p>The Commission accuses Miolos of non-compliance with the cryptocurrency regulations established by the CNMV circular from January 2022. Specifically, the company didn’t put any risk warnings and didn’t submit its campaigns for the CNMV’s authorization. The circular obliges companies to provide promo materials for a check at least ten days before publication. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/survey-65-percent-spaniards-not-interested-in-digital-euro\"><strong><em>Survey: 65% of Spaniards aren’t interested in using digital euro</em></strong></a></p><p>According to the press release, this is the first time CNMV opened sanctioning proceedings for non-compliance with crypto promotion regulations “to remind the public of the need to follow and respect them.” The Spanish regulator also reiterated the right of Miolos to defend itself against allegations. </p><p>Spain has said it intends to implement the first comprehensive European Union crypto framework, Markets in Crypto-Assets (MiCA) even earlier than the deadline for EU member states to <a href=\"https://cointelegraph.com/news/spain-implement-mica-six-months-before-july-2026-deadline\">provide legal certainty and investor protection</a>. </p><p>Meanwhile, stepping into the business of crypto promotion oversight, the country can draw some conclusions from the example of the United Kingdom. In the U.K., regulators’ eagerness to pursue the violations of the crypto promotion rules has led to a massive inability of businesses to <a href=\"https://cointelegraph.com/news/uk-fca-crypto-promotion-rules-breached-221-times\">comply with them</a> and the departure of several major i<a href=\"https://cointelegraph.com/news/defi-solana-marinade-uk-regulations\">nternational players</a> from the market. </p><p>At first, the Financial Conduct Authority (FCA) had to <a href=\"https://cointelegraph.com/news/uk-financial-watchdog-crypto-firms-january-2024-marketing-compliance\">extend the technical deadlines</a> for compliance to 2024 and then issue the “finalized non-handbook guidance,” once again <a href=\"https://cointelegraph.com/news/fca-releases-guidance-compliance-new-uk-crypto-asset-promotion-rules\">clarifying the compliance requirements</a>. </p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/interview-2-years-after-john-mcafee-death-wife-janice-broke-still-grieving/\"><strong><em>Exclusive: 2 years after John McAfee’s death, widow Janice is broke and needs answers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-09T08:45:05.000Z",
    "title": "AAA studio Ubisoft to develop Web3 gaming experience with Immutable ",
    "url": "http://cointelegraph.com/news/ubisoft-to-build-web3-games-with-immutable",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/68b02262-1131-4ca3-a0dc-d357113556eb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Blockchain gaming firm Immutable announces partnership with Ubisoft’s Strategic Innovation Lab to develop Web3 games. </p>\n                    <p><p>AAA gaming studio Ubisoft has partnered with blockchain game firm Immutable to collaborate on developing Web3 games through its Strategic Innovation Lab.</p><p>An announcement shared with Cointelegraph said the two studios will combine their expertise to intertwine mainstream gaming development quality with Web3-enabled functionality.</p><p>Nicolas Pouard, who heads up Ubisoft’s blockchain initiative, noted that Immutable’s existing blockchain infrastructure and its experience integrating decentralized functionality into games was a vital driver of the partnership:</p><blockquote>“We’re excited to partner with them and look forward to bringing that level of fluidness within a full-fledged game, so players only have to focus on the fun of the experience.” </blockquote><p>Immutable co-founder and CEO James Ferguson added that the collaboration marks an important milestone for the Web3 gaming sector.</p><p>“We couldn’t be more excited to explore with Ubisoft the benefits of Web3 and digital ownership for players. We plan to bring the full weight of our ecosystem to bear to ensure the partnership’s success,” Ferguson said.</p><p>The partnership comes off the back of successful demos of Immutable’s flagship titles, including Guild of Guardians, Metalcore, Shardbound and Infinite Victory. These various titles offer gamers different genres to explore that incorporate defining Web3 aspects like immutable ownership of in-game assets.</p><p><a href=\"https://cointelegraph.com/news/web3-gaming-investors-more-discerning-animoca-robby-yung\"><strong><em>Related: Web3 gaming investors more ‘choosy’ in crypto winter — Animoca’s Robby Yung</em></strong></a></p><p>Immutable also recently launched the test network of its zero-knowledge rollup (ZK-rollups) gaming solution Immutable zkEVM. ZK-rollups have been in the spotlight throughout 2023 as a significant layer 2 Ethereum scaling technology that enables high-throughput, low-cost transactions for decentralized applications, services and solutions.</p><p>The firm has rolled out two different ZK-based scaling solutions to date, including Immutable zkEVM which operates on Ethereum layer-2 Polygon, as well as Immutable X which is a separate rollup solution developed by ZK pioneers StarkWare.</p><p>Immutable’s gaming platform provides infrastructure for gaming studios to build games that run on the Ethereum blockchain. </p><p>Web3 games are beginning to break their way into the mainstream gaming space as 2024 looms. <a href=\"https://cointelegraph.com/news/illuvium-epic-games-mainstream-listing\">Cointelegraph exclusively reported</a> that Illuvium Labs will have its flagship gaming title Illuvium listed on mainstream gaming publisher Epic Games Store on Nov. 28, which is home to hugely popular games like Fortnite.</p><p><a href=\"https://cointelegraph.com/magazine/interview-2-years-after-john-mcafee-death-wife-janice-broke-still-grieving/\"><strong><em>Magazine: Exclusive: 2 years after John McAfee’s death, widow Janice is broke and needs answers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-09T09:03:09.000Z",
    "title": "American Lawyer John Deaton’s Crypto Shift: Betting Big on $XRP Over $ETH",
    "url": "https://www.cryptoglobe.com/latest/2023/11/american-lawyer-john-deatons-crypto-shift-betting-big-on-xrp-over-eth/",
    "description": "On November 8,  John Deaton, a prominent, highly-respected attorney closely monitoring the U.S. SEC’s lawsuit against FinTech firm Ripple, publicly shared the evolution of his cryptocurrency portfolio over the past three years, revealing a notable shift towards a stronger position in XRP compared to Ethereum (ETH). Deaton, Managing Partner of Deaton Law Firm, is the […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-09T08:41:37.000Z",
    "title": "Illuvium (ILV) Price Analysis: ILV Reacts As Illuvium Goes Mainstream With Epic Games Store Listing",
    "url": "https://cryptodaily.co.uk/2023/11/illuvium-ilv-price-analysis-ilv-reacts-as-illuvium-goes-mainstream-with-epic-games-store-listing",
    "description": "With its upcoming listing on the Epic Games Store, the blockchain-based game Illuvium could soon tap into an audience of millions of PC and mobile gamers."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-09T08:52:44.000Z",
    "title": "Cardano Considers Treasury Tax Cut: What Could It Mean for ADA Prices?",
    "url": "https://www.crypto-news-flash.com/cardano-considers-treasury-tax-cut-what-could-it-mean-for-ada-prices/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-considers-treasury-tax-cut-what-could-it-mean-for-ada-prices",
    "description": "<img width=\"1000\" height=\"668\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-768x513.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />With the Cardano treasury having reached over 1 billion in ADA using the 20 percent tax rate, a protocol change proposal (PCP) by earcoinpool has suggested now is the best time to reevaluate the rate to the original 5 percent.  The Cardano treasury was set during the early days to enable network developments that improve [...]"
  }
]