[
  {
    "source": "Decrypt",
    "date": "2023-06-07T20:47:00.000Z",
    "title": "Why 'Words With Friends' Creator Paul Bettner is 'Allergic' to Pay-to-Win NFTs",
    "url": "https://decrypt.co/videos/interviews/JkfOleb4/why-words-with-friends-creator-paul-bettner-is-allergic-to-pay-to-win-nfts",
    "description": "Words With Friends and Wildcard creator Paul Bettner tells Decrypt's Kate Irwin about his perspective on what to do when NFTs become in-game characters and assets."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-07T20:41:20.000Z",
    "title": "Puma Plots NFT Sneaker Drop With NBA's LaMelo Ball, Gutter Cat Gang",
    "url": "https://decrypt.co/143731/puma-plots-nft-sneaker-drop-nba-lamelo-ball-gutter-cat-gang",
    "description": "Sportswear brand Puma has partnered with NBA star LeMelo Ball to drop a limited edition pair of sneakers featuring Gutter Cat Gang branding."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-07T20:52:16.000Z",
    "title": "Blockchain Association members say courts will prove SEC, Gary Gensler wrong",
    "url": "https://cryptoslate.com/blockchain-association-members-say-courts-will-prove-sec-gary-gensler-wrong/",
    "description": "<p>Members of the Blockchain Association have commented on recent actions from the U.S. Securities and Exchange Commission (SEC). CEO says Gensler will be proven wrong The SEC sued Binance and Coinbase on June 5 and June 6, respectively. Blockchain Association CEO Kristin Smith commented on those events on June 6, stating: “The SEC doesn’t make [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/blockchain-association-members-say-courts-will-prove-sec-gary-gensler-wrong/\">Blockchain Association members say courts will prove SEC, Gary Gensler wrong</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T20:39:39.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-07T21:00:12.000Z",
    "title": "Bitcoin Bears Brace For The 50-Month MA Retest, Is A Rug Pull Imminent?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bears-brace-for-the-50-month-ma-retest-is-a-rug-pull-imminent/",
    "description": "Over the last 24 hours, Bitcoin (BTC), the largest cryptocurrency in the market by capitalization, has again failed to consolidate above the $27,000 level. This key resistance was lost at the beginning of the downtrend on May 8th and has not been breached. Additionally, the upper resistance level placed at $27,500 has also proven to be a challenge for BTC, as it has been unable to surpass it. According to the crypto analysis firm Material Indicators, the crypto market continues to be stimulated by the fear, uncertainty, and doubt (FUD) surrounding the industry. With thin bid liquidity, Bitcoin has been retesting the 200-Week Moving Average (MA).  Related Reading: LDO Leads Top Coins, Registers 6% Gains In One Day Bitcoin Faces Critical Test, Will The 200-Week MA Hold? According to Material Indicators, If the 200-Week MA does not hold, another retest of the 50-Month MA might be. Material Indicators suggest that if this happens, the liquidity and sentiment at the 50-Month MA will be stronger, potentially leading to a bullish market reversal. However, it is important to note that a &#8220;rug pull&#8221; at $25,000 &#8211; a sudden and significant drop in BTC&#8217;s price &#8211; could lead to a bearish market and further retest of the lower levels of $24,000 and $23,000. For the bulls, it is crucial to maintain control of the $27,000 level and push BTC&#8217;s price above the next significant resistance at $27,500. Doing so would allow the cryptocurrency to make another attempt at reaching the key psychological level of $30,000, which it has not achieved since April 19th. On the same note, according to Baro Virtual, a Crypto Quant author, the leverage ratio is overheating, potentially leading to a dip in BTC&#8217;s price to $24,000. The leverage ratio refers to the borrowed funds traders use to invest in BTC. When the leverage ratio increases, traders take on more debt to invest in the cryptocurrency. This can lead to a higher level of risk in the market, as a sudden drop in BTC&#8217;s price could trigger a significant amount of selling, resulting in a dip in price. BTC&#8217;s Bullish Engulfing Pattern Signals Buying Opportunities According to CJ, a cryptocurrency trader, there are several points that he is leaning into which could potentially provide opportunities for buying BTC. CJ notes that BTC has experienced a range of low deviation and reclaim and a daily bullish engulfing pattern. These indicators suggest that any dips into the FVG (fair value gap) are buying opportunities, with a target of $29,000-$30,000 liquidity. However, a close below $26,100 would be bearish for the cryptocurrency.  Bitcoin&#8217;s recent price movements have left traders and investors unsure of what to expect in the near term. While the cryptocurrency initially showed a bullish reaction to the fair value gap, with a bullish 4-hour candle, it is now retracing. It remains to be seen whether BTC can bounce back once again from its 200-week Moving Average or if a sudden and significant drop in price will push BTC into a new price regime and visit the lower levels.  Despite the uncertainty in the market, BTC is currently trading above key levels, and it needs to close above $26,000 to expect a further continuation of the uptrend. BTC&#8217;s gains in the past 24 hours have narrowed to only 0.8% after a recovery of 8% in the last few days. Related Reading: Bitcoin Realized Loss Remains Low Despite Volatility, What Does This Mean? Featured image from iStock, chart from TradingView.com"
  }
]