[
  {
    "source": "CoinDesk",
    "date": "2023-06-28T20:51:32.000Z",
    "title": "Ex-FTX Compliance Officer Sued for Allegedly Paying Off Would-Be Whistleblowers",
    "url": "https://www.coindesk.com/policy/2023/06/28/ex-ftx-compliance-officer-sued-for-allegedly-paying-off-would-be-whistleblowers/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "FTX's lawyers allege Daniel Friedberg allowed its executives' criminal activities to fly under the radar for years."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-28T20:42:04.000Z",
    "title": "Crypto Firms Swan, Coinbits Disclose Prime Trust Ties as Fallout Continues",
    "url": "https://decrypt.co/146601/swan-coinbits-disclose-prime-trust-ties-fallout-continues",
    "description": "While Swan got their users' funds out of Prime Trust in time, Coinbits has been forced to suspend most of its services."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-28T20:39:53.000Z",
    "title": "Digital Asset Manager 3IQ Adds Ethereum Staking to Two of Its Funds",
    "url": "https://decrypt.co/146571/digital-asset-manager-3iq-adds-ethereum-staking-two-funds",
    "description": "The firm’s two Ethereum ETFs will now be the first investment vehicles to offer a staking service. "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-28T21:00:52.000Z",
    "title": "Op-ed: Why the SEC should stay away from crypto (Part III)",
    "url": "https://cryptoslate.com/op-ed-why-the-sec-should-stay-away-from-crypto-part-iii/",
    "description": "<p>This article is the final part of a three-part series. We suggest reading parts one and two for context. As The Wall Street Journal highlighted in a recent article, Coinbase&#8217;s argument around their successful IPO presents a &#8220;novel&#8221; defense in court. As most of us are aware, when Coinbase went public, it had already listed several [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/op-ed-why-the-sec-should-stay-away-from-crypto-part-iii/\">Op-ed: Why the SEC should stay away from crypto (Part III)</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-28T21:00:41.000Z",
    "title": "BNB Market Cap Down By 25% In June Amidst Binance Regulatory Pressure",
    "url": "https://www.newsbtc.com/analysis/bnb/bnb-market-cap-down-by-25-in-june-amidst-binance-regulatory-pressure/",
    "description": "BNB, a native token of the Binance exchange, has seen a massive decline in its market shares following the global regulatory pressure on the trading platform.  Binance began experiencing regulatory troubles on June 5, when the United States Securities and Exchange Commission (SEC) filed a lawsuit against the exchange on the allegations of fraud and offering of unregistered securities, among others, and this has affected the performance of the cryptocurrency. BNB Loses $10 Billion In Market Cap Following the news of the SEC&#8217;s charges against Binance, its native cryptocurrency BNB, whose market value is tied to the broader performance of the trading platform, saw its market cap drop by 8%, shedding over $4 billion in a single day.  Related Reading: Bitcoin Correlation To Gold, Silver Drops To Cyclical Lows: Glassnode Asides from its struggles on US soil, Binance&#8217;s operations have also suffered some regulatory setbacks in parts of Europe in the last few weeks.  On June 17, the exchange announced the shutdown of its market in the Netherlands due to the inability to obtain a virtual asset service provider (VASP) from the Dutch authorities.  Furthermore, French authorities commenced an investigation into Binance France on the basis of alleged money laundering and illegal canvassing of clients.  Belgium became the latest country to join this growing list of disgruntled nations after its Financial Services and Markets Authorities (FSMA) issued an order directing Binance to cease its operations in the country immediately. Over the last 30 days, all these events have culminated in BNB losing over $12 billion in market shares, representing a staggering 25% decline in the token’s market cap. Moreover, the Binance Coin has also seen its market price fall from $316.56 to trade as low as $223.88 during this period. Although BNB did experience some resurgence in the general market uptrend that occurred last week, it has proven insignificant in turning around the token’s fortunes.  According to data from CoinMarketCap, the coin is exchanging hands at $234.11, with a 2.25% decline in the last 24 hours. Meanwhile, the token market cap now stands at $36 billion, retaining its position as the fourth biggest cryptocurrency in the market.  BNB Market Cap Valued At $36.17 Billion On The 1-Minute Chart &#124; Source: BNB Chart On Tradingview.com What Next For The Cryptocurrency? Following BNB&#8217;s recent negative price movements coupled with its status in the crypto space, there are bound to be high levels of speculation on the token&#8217;s next movements.  According to price prediction site Coincodex, investors&#8217; sentiments surrounding BNB remain bearish, reflecting the present concerns over the token’s fate amidst Binance growing regulatory troubles.  Related Reading: Whale Trades LINK And BNB For PEPE And ETH In High-Value Transaction Coincodex is predicting BNB to maintain its bearish trend, for now, to trade at $226.88 in 5 days, representing a 2.43% gain on the current market price. However, Coincodex is also backing BNB to embark on a market recovery soon as they predict the token to trade by $274.08 in the next 30 days.  That said, predictions are not considered investment advice, and investors are admonished to do their due diligence before engaging the market.  Featured Image: Forbes, chart from Tradingview.com."
  }
]