[
  {
    "source": "Cointelegraph",
    "date": "2023-08-03T14:40:49.000Z",
    "title": "BTC price risks new sub-$29K dip as Binance fears test Bitcoin bulls",
    "url": "https://cointelegraph.com/news/btc-price-risks-binance-fears-bitcoin-bulls",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/a67979c8-4673-4850-a496-9e717c892b35.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin is not done with short-term BTC price downside, analysis predicts, with overall volatility still among its lowest-ever levels.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) dipped below $29,000 on Aug. 3 as market concerns over largest global exchange Binance reignited BTC price downside.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/761014f4-82ae-4706-96e7-044b6f2b4063.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><h2>BTC price analysis \"expects\" support retest</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> showed BTC price action heading lower before a modest comeback into the Wall Street open.</p><p>Rumors over new United States legal action against Binance made for a disappointing 24 hours for Bitcoin bulls <a href=\"https://cointelegraph.com/news/bitcoin-btc-price-briefly-spikes-30k\">after a brief trip above $30,000</a>.</p><p>With the trading range still firmly in place, monitoring resource Material Indicators forecast a further bearish support retest to come.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Want to know what changed on the <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> Daily chart in the U.S. overnight hours?<br><br>According to the <a href=\"https://twitter.com/hashtag/TrendPrecognition?src=hash&amp;ref_src=twsrc%5Etfw\">#TrendPrecognition</a> algos, the probability of a downside move in the Daily TF increased from &gt;75% to &gt;84%.<br><br>Expecting to test support at the trendline. <a href=\"https://twitter.com/hashtag/NFA?src=hash&amp;ref_src=twsrc%5Etfw\">#NFA</a> <a href=\"https://t.co/FtR25ruHHr\">https://t.co/FtR25ruHHr</a> <a href=\"https://t.co/34v1OoZgp9\">pic.twitter.com/34v1OoZgp9</a></p>&mdash; Material Indicators (@MI_Algos) <a href=\"https://twitter.com/MI_Algos/status/1687089974296891392?ref_src=twsrc%5Etfw\">August 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“If you're surprised, confused or think the bi-directional volatility is over then you haven't been paying attention,” part of prior analysis <a href=\"https://twitter.com/MI_Algos/status/1686817704232026112\" target=\"_blank\" rel=\"noopener nofollow\">read</a>.</p><p>Popular trader Daan Crypto Trades meanwhile suggested that current BTC price behavior was merely the continuation of an all-too-familiar pattern.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The past few weeks have been all the same.<br><br>1. Price grinds down<br>2. Shorts get aggressive<br>3. Shorts get squeezed/Price goes up<br>4. Spot starts selling<br>5. Price rolls over.<br><br>Rinse &amp; Repeat.<br><br>Until spot starts bidding after these squeezes we&#39;ll just keep doing these full retraces. <a href=\"https://t.co/vGgKUFI00f\">pic.twitter.com/vGgKUFI00f</a></p>&mdash; Daan Crypto Trades (@DaanCrypto) <a href=\"https://twitter.com/DaanCrypto/status/1686768093786263553?ref_src=twsrc%5Etfw\">August 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“I’ve said it before but I’ll say it again… The longer price hovers around here, the bigger the move following it, will be,” he <a href=\"https://twitter.com/DaanCrypto/status/1687098333511479297\" target=\"_blank\" rel=\"noopener nofollow\">added</a> on the day.</p><p>Others made light of the Binance narrative. Ki Young Ju, CEO of analytics platform CryptoQuant, argued that <a href=\"https://cointelegraph.com/news/us-doj-concerned-binance-run-prosecutors-fraud-charges\">panic over solvency issues</a> would turn out to be a non-event.</p><p>“I've heard about the 'bank run/insolvency risk on Binance' a hundred times for years, but their user balances always tell a different story,” he <a href=\"https://twitter.com/ki_young_ju/status/1686840787802226689/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">tweeted</a> alongside charts showing the exchange’s BTC and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) reserves.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/a3bcc461-80d0-4801-9097-92e852bdfc90.png\"  /><figcaption style=\"text-align: center;\"><em>Binance BTC, ETH reserves charts. Source: Ki Young Ju/Twitter</em></figcaption></figure><h2>Bitcoin volatility prepares to undercut stocks, gold</h2><p>Overall, however, Bitcoin volatility remains at historically-low levels.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-price-risks-25k-macro-new-analysis\">Bitcoin price risks $25K dip despite ‘macro pivot point’ — New analysis</a></em></strong></p><p>According to the Bitcoin Historical Volatility Index (BVOL), weekly volatility was headed toward record lows seen at the start of 2023.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/9208d58f-7113-4939-9519-8335b046eb8f.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Historical Volatility Index (BVOL) 1-week chart. Source: TradingView</em></figcaption></figure><p>This chimes with <a href=\"https://cointelegraph.com/news/bitcoin-price-bollinger-bands-echo-january-gains\">existing comparisons to January</a>, with Bollinger Bands data likewise echoing the period immediately prior to Bitcoin's Q1 breakout.</p><p>Dylan LeClair, senior analyst at digital asset fund UTXO Management, additionally noted that 10-day realized volatility was almost below that of U.S. stocks, bonds and gold.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">10-day realized volatility for <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcoin</a> near falling below average of stocks, bonds, and gold. <a href=\"https://t.co/QKq5HItY80\">pic.twitter.com/QKq5HItY80</a></p>&mdash; Dylan LeClair  (@DylanLeClair_) <a href=\"https://twitter.com/DylanLeClair_/status/1687098598507606016?ref_src=twsrc%5Etfw\">August 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-03T14:40:19.000Z",
    "title": "Binance Names New Deputy Chief Compliance Officer Amid Lawsuits, Regulatory Issues",
    "url": "https://cryptobriefing.com/binance-names-new-chief-compliance-officer/?utm_source=feed&utm_medium=rss",
    "description": "Binance, the global cryptocurrency exchange, has appointed Kristen Hecht to oversee compliance and Anti-Money Laundering initiatives, a move that comes amid escalating regulatory scrutiny that the exchange has been experiencing..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-03T15:00:00.000Z",
    "title": "Bitcoin Price Analysis:  Orbiting 29164 - 4 August 2023",
    "url": "https://cryptodaily.co.uk/2023/08/bitcoin-price-analysis-orbiting-29164-4-august-2023",
    "description": "<p>BTC/USD Orbiting 29164:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 4 August 2023</p>\n<p>Bitcoin (BTC/USD) awaited fresh technical guidance early in the Asian session as the pair recovered from the 28903.79 area and reached the 29253.85 area before receding back to the 28938.93 area.&nbsp; Trading activity has reverted to the 29164 area, a downside price objective related to recent selling pressure around the 30350.70 and 29686.41 areas.&nbsp; Additional downside price objectives linked to recent selling pressure include the 28432, 27979, 27409, 27246, and 26501 levels.&nbsp; Below the market, additional downside price objectives include the 28213, 28137, 27757, 27430, 27338, 27312, 26348, and 26199 levels.&nbsp; &nbsp;Also, the 28095.44 area represents the 23.6% retracement of the historic depreciating range from 69000 to 15460.&nbsp;&nbsp;</p>\n<p>Following recent upside activity, areas of technical support and potential buying pressure include the 28306, 27466, 26428, and 26272 levels.&nbsp; Traders are monitoring the recent depreciating range from 31862.21 to 28850 with upside retracement levels around the 30356, 30711, 31151, and 31217 areas.&nbsp; Above the market, upside price objectives include the 30526, 30611, 30762, and 31145 areas.&nbsp; Upside price objectives related to other levels of buying pressure include the 32125 and 33569 areas, and Stops are cited above additional upside price objectives around the 32043, 34531, 34658, and 35912 areas.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 200-bar MA (hourly) and above the 100-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 29263.29 and the&nbsp;100-bar MA&nbsp;(Hourly) at 29244.81.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is Bearishly below MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bullishly above MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-03T14:45:00.000Z",
    "title": "Analysts Predict a Viral Surge for Tradecurve: Huobi Token and Binance (BNB) Face New Riva",
    "url": "https://cryptodaily.co.uk/2023/08/analysts-predict-a-viral-surge-for-tradecurve-huobi-token-and-binance-bnb-face-new-riva",
    "description": "<p class=\"s6\">In the dynamic crypto landscape, a potential disruptor has emerged - Tradecurve. Analysts are predicting a viral surge for this newcomer, setting it up as a formidable rival to established players like Huobi Token (HT) and Binance (BNB). This article delves into this developing narrative, exploring the potential reasons behind Tradecurve's predicted rise and what it means for its competition.</p>\n<p>&gt;&gt;Register For The Tradecurve Presale&lt;&lt;</p>\nTradecurve (TCRV): The Viral Surge and Its Impact on Huobi Token (HT) and Binance (BNB)\n<p class=\"s6\">Signing up for crypto exchanges like Huobi and Binance can be a daunting task. There are endless KYC requirements, complex interfaces, and often long wait times. Enter Tradecurve: a trading platform that removes KYC requirements to enable anonymous transactions.</p>\n<p class=\"s6\">All that's required to sign up on Tradecurve is an email address and a crypto deposit. Once signed up, you can get instant exposure to crypto, forex, commodities, and company stocks. Tradecurve really is an all-in-one trading platform.</p>\n<p class=\"s6\">Tradecurve is introducing an array of features designed to give traders an edge in the market. Among these is copy trading, enabling traders to emulate the strategies of successful peers. Tradecurve also includes AI-assisted automated trading, staking for passive income, and substantial leverage of up to 500:1.</p>\n<p class=\"s6\">Market sentiment towards Tradecurve is overwhelmingly positive, as demonstrated by the successful sale of over 100 million tokens in the fourth phase of the presale. Now in phase 5 for $0.025 per token, market analysts predict that the price of TCRV could surge to well over $1.00 in the next year.</p>\n<p class=\"s6\">Some market watchers have even drawn comparisons between the potential growth trajectory of Tradecurve and the rise of Binance. The latter started at a mere $0.11 during its ICO phase and has since ballooned to over $600. If these predictions materialize, early TCRV investors could see significant returns once the token is listed on major exchanges.</p>\nHuobi (HT) Faces Regulatory Pressure\n<p class=\"s6\">Huobi, a top global cryptocurrency exchange, finds itself in choppy waters as its token price has plunged an alarming 93% to just $2.66. This steep Huobi decline is largely attributable to the crypto winter which has caused the entire digital asset market to suffer.</p>\n<p class=\"s6\">However, there is no denying that Huobi is under increasing pressure from regulators, as well as the competition. For instance, Huobi was forced to shut its operations in Malaysia, a market where it had been flourishing.</p>\n<p class=\"s6\">An analysis of Huobi's daily trading chart reveals a discernible descending triangle pattern, indicating that Huobi's price is trapped in a downward spiral. Although a reversal might be possible, breaking through the formidable $3.00 resistance level presents a substantial obstacle for the Huobi token.</p>\n<p class=\"s6\">Moreover, Tradecurve's debut in crypto trading could effectively take a slice of Huobi's market share away, eating into its profits and further depressing its token price.</p>\nBinance (BNB) Loses Ground To Tradecurve (TCRV)\n<p class=\"s6\">Navigating through a storm of regulatory scrutiny, Binance finds itself in a precarious position. It is wrestling with the enforcement measures taken by both the Markets in Crypto-Assets (MiCA) and the U.S. SEC.</p>\n<p class=\"s6\">The Binance token has nosedived from $308 on June 5th to a low of $221 within a few days. This is in the wake of these unsettling developments. The road ahead for Binance appears riddled with obstacles.Although, Binance has managed a modest recovery, trading at $245 at present, t</p>\n<p class=\"s6\">The future of Binance now hinges on its ability to navigate these regulatory challenges and regain the trust of its user base. Market analysts are closely watching the critical $200 support level for Binance, a threshold that has marked the lower bound of its trading range for the past year.</p>\n<p class=\"s6\">With Tradecurve's arrival, Binance faces a formidable new rival that is expected to siphon off some of its market share. Binance holders are already starting to sell their tokens to take part in the Tradecurve presale, further threatening the drop below $200.</p>\nFor more information about the Tradecurve (TCRV) presale:\n<p class=\"s11\">Website: https://tradecurve.io/</p>\n<p class=\"s11\">Buy presale: https://app.tradecurve.io/sign-up</p>\n<p class=\"s11\">Twitter: https://twitter.com/Tradecurveapp</p>\n<p class=\"s11\">Telegram: https://t.me/tradecurve_official</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-03T14:45:15.000Z",
    "title": "Rollman Management: Unlocking Crypto Success with Exclusive Insights from Rollman Capital, Rollman Mining, and a Network of 500+ Industry Experts",
    "url": "https://news.bitcoin.com/rollman-management-unlocking-crypto-success-with-exclusive-insights-from-rollman-capital-rollman-mining-and-a-network-of-500-industry-experts/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/photo_2023-08-03_16-36-18-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/photo_2023-08-03_16-36-18-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/photo_2023-08-03_16-36-18-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/photo_2023-08-03_16-36-18-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/photo_2023-08-03_16-36-18-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/photo_2023-08-03_16-36-18-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/photo_2023-08-03_16-36-18-1.jpg 900w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. Tallinn, Estonia, August 3, 2023 &#8211; Rollman Management, a trailblazing company renowned for its exclusive crypto insight, portfolio diversification, private crypto sales, education, and more, is excited to announce its expansion of services to empower retail and institutional investors globally. Backed by the proven expertise of Rollman Capital, a prominent hedge fund, and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T15:07:13.000Z",
    "title": "Best Twitter threads of the day – August 3rd",
    "url": "https://www.cryptopolitan.com/best-twitter-threads-of-the-day-august-3rd/",
    "description": "Is it censorship for Uniswap to delist tokens? Lazarus Group links stolen funds from the Harmony, Atomic Wallet, and Coinspaid/Alphapo hacks together on-chain Hong Kong debuts retail Crypto trading with HashKey and OSL"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T15:00:15.000Z",
    "title": "Top crypto tweets of the day – August 3rd",
    "url": "https://www.cryptopolitan.com/top-crypto-tweets-of-the-day-august-3rd/",
    "description": "Binance appoints former Kristen Hecht official as new Deputy Chief Compliance Officer Altcoins may bleed if ETH/BTC crashes This week at Binance (so far) Proshares files for Dual Bitcoin &#38; Ethereum futures strategy ETF Coinbase share has increased from 38% to 61% since its public launch in April 2023 DeFi trader turn $200k to $465 ... <a title=\"Top crypto tweets of the day &#8211; August 3rd\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-crypto-tweets-of-the-day-august-3rd/\" aria-label=\"More on Top crypto tweets of the day &#8211; August 3rd\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T14:41:52.000Z",
    "title": "NFT gas consumption decreases – What does this mean?",
    "url": "https://www.cryptopolitan.com/nft-gas-consumption-decreases-what-this-mean/",
    "description": "If you were navigating the Ethereum landscape two years ago, NFTs might have seemed to you like the fuel-hungry SUVs of the blockchain. Fast forward to today, and those very same NFT marketplaces are sipping gas like a hybrid economy car. This stark shift doesn&#8217;t just signify a change in numbers but mirrors a possible ... <a title=\"NFT gas consumption decreases &#8211; What does this mean?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nft-gas-consumption-decreases-what-this-mean/\" aria-label=\"More on NFT gas consumption decreases &#8211; What does this mean?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-03T14:55:07.000Z",
    "title": "Why The Uniswap (UNI) Token Is Almost Worthless: Researcher",
    "url": "https://www.newsbtc.com/analysis/uni/why-the-uniswap-uni-token-is-almost-worthless/",
    "description": "In an analysis, Anders Helseth, Vice President at K33 Research, has mounted a strong case against the viability of the Uniswap (UNI) token. His analysis pivots on the intriguing dynamics of the decentralized finance (DeFi) market, fundamentally challenging the current valuation and future potential of UNI. Helseth begins his argument with a seemingly straightforward question: &#8220;The Uniswap protocol generates significant trading fees, but will the UNI token ever capture its (fair) share?&#8221; His conclusion is emphatically negative. Is The Uniswap (UNI) Token Worthless? For context, UNI is a governance token for the Uniswap protocol, a decentralized exchange that earns a 0.3% fee on trades. However, as Helseth points out, the entire trading fee currently goes to liquidity providers, with UNI holders standing to gain only if governance votes permit fee dividends to UNI holders. Related Reading: Uniswap Delists HEX Token After SEC Deems It An “Unregistered Security” Even in a slow DeFi market, the fully diluted value of the UNI token is 15 times the annualized trading fees paid when using the protocol, currently around $6 billion. If the UNI token could capture all trading fees, it would arguably present an irresistible buy. However, Helseth makes a compelling argument to the contrary. &#8220;The UNI token currently captures 0% of the 0.3% trading fee, which entirely goes to liquidity providers,&#8221; Helseth says, emphasizing the token&#8217;s current lack of intrinsic value. The crux of his argument revolves around three players in the DeFi space: the users, the protocol (and hence UNI token), and the liquidity providers. According to Helseth, the interplay between these actors is detrimental to the UNI token&#8217;s potential for revenue generation. Helseth explains: The entire protocol can be exactly copied within minutes at virtually no cost. This argument implies that all the power lies with the liquidity providers in the fight for trading fees. The primary concern for users is liquidity and cost-effectiveness. If the same protocol can be replicated at a whim, users would inevitably gravitate towards the version with the most liquidity – to minimize slippage when executing trades. This dynamic significantly empowers liquidity providers who, unlike UNI holders, hold real, valuable tokens. Related Reading: Uniswap Launches UniswapX Protocol, Sparking 3% Surge In UNI’s Price In addition, even though switching to another smart contract may entail some costs, these are relatively low, reinforcing the bargaining power of liquidity providers. Concluding, Helseth states: &#8220;Given this relatively low cost of switching from the users&#8217; perspective, we cannot conclude with anything else than that the power lies with the liquidity providers. Hence, even though the Uniswap protocol generates significant trading fees, we believe the potential for the UNI token to capture any of this revenue to be almost non-existent.&#8221; At press time, the UNI price stood at $6.19 after being rejected at the 200-day EMA yesterday. Featured image from Guarda Wallet, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-03T14:59:35.000Z",
    "title": "Lido Finance Dominates Staking Industry With 28+% Market Share",
    "url": "https://coinedition.com/lido-finance-dominates-staking-industry-with-28-market-share/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Our_new_Ethereum_Staking_Market_Share_indicator_shows_how_staking.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Our_new_Ethereum_Staking_Market_Share_indicator_shows_how_staking.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Our_new_Ethereum_Staking_Market_Share_indicator_shows_how_staking-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Our_new_Ethereum_Staking_Market_Share_indicator_shows_how_staking-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Our_new_Ethereum_Staking_Market_Share_indicator_shows_how_staking-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Our_new_Ethereum_Staking_Market_Share_indicator_shows_how_staking-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Our_new_Ethereum_Staking_Market_Share_indicator_shows_how_staking-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Our_new_Ethereum_Staking_Market_Share_indicator_shows_how_staking-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Our_new_Ethereum_Staking_Market_Share_indicator_shows_how_staking-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Our_new_Ethereum_Staking_Market_Share_indicator_shows_how_staking-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Our_new_Ethereum_Staking_Market_Share_indicator_shows_how_staking-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Our_new_Ethereum_Staking_Market_Share_indicator_shows_how_staking-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Our_new_Ethereum_Staking_Market_Share_indicator_shows_how_staking-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Our_new_Ethereum_Staking_Market_Share_indicator_shows_how_staking-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Our_new_Ethereum_Staking_Market_Share_indicator_shows_how_staking-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Our_new_Ethereum_Staking_Market_Share_indicator_shows_how_staking-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Our_new_Ethereum_Staking_Market_Share_indicator_shows_how_staking-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Lido Finance remains the largest staking service in the cryptocurrency industry with more than 28% of the total market share, according to IntoTheBlock. The market intelligence platform announced on Twitter earlier today that their new Ethereum Staking Market Share indicator shows how staking is distributed between services. The staking market share indicator showed that Coinbase [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/lido-finance-dominates-staking-industry-with-28-market-share/\">Lido Finance Dominates Staking Industry With 28+% Market Share</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-03T14:51:41.000Z",
    "title": "BitBoy Crypto Uncovers Secret Crypto Takeover Plan by SEC and Prometheum",
    "url": "https://coinedition.com/bitboy-crypto-uncovers-secret-crypto-takeover-plan-by-sec-and-prometheum/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Unveiling-Gary-Genslers-Secret-Plan.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Unveiling-Gary-Genslers-Secret-Plan.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Unveiling-Gary-Genslers-Secret-Plan-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Unveiling-Gary-Genslers-Secret-Plan-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Unveiling-Gary-Genslers-Secret-Plan-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Unveiling-Gary-Genslers-Secret-Plan-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Unveiling-Gary-Genslers-Secret-Plan-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Unveiling-Gary-Genslers-Secret-Plan-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Unveiling-Gary-Genslers-Secret-Plan-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Unveiling-Gary-Genslers-Secret-Plan-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Unveiling-Gary-Genslers-Secret-Plan-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Unveiling-Gary-Genslers-Secret-Plan-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Unveiling-Gary-Genslers-Secret-Plan-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Unveiling-Gary-Genslers-Secret-Plan-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Unveiling-Gary-Genslers-Secret-Plan-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Unveiling-Gary-Genslers-Secret-Plan-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Unveiling-Gary-Genslers-Secret-Plan-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent YouTube video, crypto influencer BitBoy Crypto discussed a development involving the crypto startup Prometheum and its alleged connections to U.S. Securities and Exchange Commission (SEC). BitBoy Crypto raised suspicions about a potential secret crypto takeover plan orchestrated by Gensler and Prometheum, presenting evidence to support these claims. BitBoy Crypto scrutinized the potential [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitboy-crypto-uncovers-secret-crypto-takeover-plan-by-sec-and-prometheum/\">BitBoy Crypto Uncovers Secret Crypto Takeover Plan by SEC and Prometheum</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-03T14:47:06.000Z",
    "title": "Bitcoin Has Less Than 24 Hours to Survive a Price Dump: Analyst",
    "url": "https://coinedition.com/bitcoin-has-less-than-24-hours-to-survive-a-price-dump-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-Bulls-Have-24-HOURS-To-REVERSE-This.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-Bulls-Have-24-HOURS-To-REVERSE-This.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-Bulls-Have-24-HOURS-To-REVERSE-This-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-Bulls-Have-24-HOURS-To-REVERSE-This-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-Bulls-Have-24-HOURS-To-REVERSE-This-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-Bulls-Have-24-HOURS-To-REVERSE-This-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-Bulls-Have-24-HOURS-To-REVERSE-This-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-Bulls-Have-24-HOURS-To-REVERSE-This-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-Bulls-Have-24-HOURS-To-REVERSE-This-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-Bulls-Have-24-HOURS-To-REVERSE-This-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-Bulls-Have-24-HOURS-To-REVERSE-This-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-Bulls-Have-24-HOURS-To-REVERSE-This-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-Bulls-Have-24-HOURS-To-REVERSE-This-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-Bulls-Have-24-HOURS-To-REVERSE-This-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-Bulls-Have-24-HOURS-To-REVERSE-This-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-Bulls-Have-24-HOURS-To-REVERSE-This-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-Bulls-Have-24-HOURS-To-REVERSE-This-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Cryptocurrency analyst and Crypto Banter presenter, famously known as Sheldon The Sniper, thinks the Bitcoin market is in a depression phase. Despite noting the current Bitcoin market situation could be demotivating, Sheldon believes the bull run could start any moment. In a recent Crypto Banter video session on YouTube, Sheldon noted that Bitcoin is sitting [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-has-less-than-24-hours-to-survive-a-price-dump-analyst/\">Bitcoin Has Less Than 24 Hours to Survive a Price Dump: Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]