[
  {
    "source": "Cointelegraph",
    "date": "2023-11-28T04:24:47.000Z",
    "title": "Vitalik Buterin: AI may surpass humans as the 'apex species'",
    "url": "http://cointelegraph.com/news/ethereum-vitalik-buterin-ai-surpass-humans-apex-species",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/557b0e5a-18fc-417a-b820-5be7d847ac90.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>“Even Mars may not be safe” if superintelligent AI turns against humanity,  warns Ethereum co-founder Vitalik Buterin.</p>\n                    <p><p>Super-advanced artificial intelligence, left unchecked, has a “serious chance” of surpassing humans to become the next “apex species” of the planet, according Ethereum co-founder Vitalik Buterin. </p><p>But that will boil down to how <a href=\"https://cointelegraph.com/news/worldcoin-token-launch-sparks-response-from-vitalik-buterin\">humans potentially intervene with AI developments</a>, he said. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">New monster post: my own current perspective on the recent debates around techno-optimism, AI risks, and ways to avoid extreme centralization in the 21st century.<a href=\"https://t.co/6lN2fLBUUL\">https://t.co/6lN2fLBUUL</a> <a href=\"https://t.co/h5aIyFNCoh\">pic.twitter.com/h5aIyFNCoh</a></p>&mdash; vitalik.eth (@VitalikButerin) <a href=\"https://twitter.com/VitalikButerin/status/1729251808936362327?ref_src=twsrc%5Etfw\">November 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In a Nov. 27 blog post, Buterin, seen by some as a thought leader in the cryptocurrency space, <a href=\"https://vitalik.eth.limo/general/2023/11/27/techno_optimism.html#brighteststar\" target=\"_blank\" rel=\"noopener nofollow\">argued</a> AI is “fundamentally different” from other recent inventions — such as social media, contraception, airplanes, guns, the wheel, and the printing press — as AI can create a new type of “mind” that can turn against human interests, adding: </p><blockquote>“AI is [...] a new type of mind that is rapidly gaining in intelligence, and it stands a serious chance of overtaking humans' mental faculties and becoming the new apex species on the planet.”</blockquote><p>Buterin argued that unlike climate change, a man-made pandemic, or nuclear war, superintelligent AI could <a href=\"https://cointelegraph.com/news/ai-experts-sign-doc-comparing-risk-of-extinction-from-ai-to-pandemics-nuclear-war\">potentially end humanity and leave no survivors</a>, particularly if it ends up viewing humans as a threat to its own survival. </p><blockquote>“One way in which AI gone wrong could make the world worse is (almost) the worst possible way: it could literally cause human extinction.”</blockquote><p>“Even Mars may not be safe,” Buterin added.</p><p>Buterin <a href=\"https://aiimpacts.org/2022-expert-survey-on-progress-in-ai/#Extinction_from_AI\" target=\"_blank\" rel=\"noopener nofollow\">cited</a> an August 2022 survey from over 4,270 machine learning researchers who estimated a 5-10% chance that AI kills humanity.</p><p>However, while Buterin stressed that claims of this nature are “extreme,” there are also ways for humans to prevail.</p><h3>Brain interfaces and  techno-optimism</h3><p>Buterin suggested integrating brain-computer interfaces (BCI) to offer humans more control over powerful forms of AI-based computation and cognition. </p><p>A BCI is a communication pathway between the brain's electrical activity and an external device, such as a computer or robotic limb.</p><p>This would reduce the two-way communication loop between man and machine from seconds to milliseconds, and more importantly, ensure humans retain some degree of “meaningful agency” over the world, Buterin said.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/0337437d-af52-4d3c-8e76-782354269e69.png\"  /><figcaption style=\"text-align: center;\"><em>A diagram depicting two possible feedback loops between humans and AI. Source: Vitalik.eth</em></figcaption></figure><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/how-ai-changing-crypto-hype-reality\"><strong><em>How AI is changing crypto: Hype vs. reality </em></strong></a></p><p>Buterin suggested this route would be “safer” as humans could be involved in each decision made by the AI machine. </p><blockquote>“We [can] reduce the incentive to offload high-level planning responsibility to the AI itself, and thereby reduce the chance that the AI does something totally unaligned with humanity's values on its own.”</blockquote><p>The Ethereum co-founder also suggested “active human intention” to take AI in a direction that benefits humanity, as maximizing profit doesn’t always lead human down the most desirable pathway.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Human beings are deeply good. <a href=\"https://t.co/AbOfd75IJ4\">pic.twitter.com/AbOfd75IJ4</a></p>&mdash; vitalik.eth (@VitalikButerin) <a href=\"https://twitter.com/VitalikButerin/status/1729251908617990278?ref_src=twsrc%5Etfw\">November 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Buterin concluded that “we, humans, are the brightest star” in the universe, as we’ve developed technology to expand upon human potential for thousands of years, and hopefully many more to come:</p><blockquote>“Two billion years from now, if the Earth or any part of the universe still bears the beauty of Earthly life, it will be human artifices like space travel and geoengineering that will have made it happen.”</blockquote><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/use-case-ai-crypto-money-payments/\"><strong><em>Real AI use cases in crypto, No. 1: The best money for AI is crypto</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-28T04:35:43.000Z",
    "title": "Revealing Trailblazers of Innovation in the AWS Partner Of The Year Awards 2023",
    "url": "https://www.cryptopolitan.com/aws-partner-of-the-year-awards-2023/",
    "description": "In a revelation at AWS re:Invent 2023, Amazon Web Services celebrated the prowess of its partner ecosystem, unveiling the winners of the coveted AWS Partner Of The Year awards. Among the illustrious awardees were global giants such as Tata Consultancy Services (TCS), Presidio, Capgemini, and Slalom, who emerged victorious in their respective categories. The awards, ... <a title=\"Revealing Trailblazers of Innovation in the AWS Partner Of The Year Awards 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aws-partner-of-the-year-awards-2023/\" aria-label=\"More on Revealing Trailblazers of Innovation in the AWS Partner Of The Year Awards 2023\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-28T04:10:50.000Z",
    "title": "Ethereum Bears Keep Pressing, Why ETH Price Might Revisit This Key Support",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-bears-pressing-1920/",
    "description": "Ethereum price is moving lower from $2,130. ETH is showing a few bearish signs and might decline toward the $1,920 support zone. Ethereum is slowly moving lower below the $2,060 zone. The price is trading below $2,060 and the 100-hourly Simple Moving Average. There is a major bearish trend line forming with resistance near $2,040 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move down toward the $1,920 support zone. Ethereum Price Extends Decline Ethereum price started a fresh decline after it struggled near $2,130. ETH formed a high at $2,132 and started a downward movement. There was a move below the $2,100 and $2,080 levels, like Bitcoin. The price even spiked below the $2,000 support. A low was formed near $1,986 and the price is now consolidating losses. There was a minor recovery wave above the $2,020 level. Ether climbed above the 23.6% Fib retracement level of the recent drop from the $2,132 swing high to the $1,986 low. Ethereum is now trading below $2,060 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $2,040 zone. There is also a major bearish trend line forming with resistance near $2,040 on the hourly chart of ETH/USD. The first key resistance is near the $2,060 level or the 50% Fib retracement level of the recent drop from the $2,132 swing high to the $1,986 low. The next resistance sits at $2,100. A clear move above the $2,100 level could send the price toward the $2,135 resistance zone. Source: ETHUSD on TradingView.com The next resistance is near $2,150, above which the price could aim for a move toward the $2,200 level. Any more gains could start a wave toward the $2,250 level. More Losses in ETH? If Ethereum fails to clear the $2,040 resistance, it could start a fresh decline. Initial support on the downside is near the $2,000 level. The next key support is $1,985. A downside break below $1,985 might send Ether toward the $1,920 support. The key support is now at $1,885, below which there is a risk of a move toward the $1,820 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,985 Major Resistance Level – $2,040"
  }
]