[
  {
    "source": "Cointelegraph",
    "date": "2024-02-07T21:18:42.000Z",
    "title": " TradeStation Crypto settles charges by SEC, 26 states over asset lending ",
    "url": "https://cointelegraph.com/news/trade-station-crypto-settles-charges-sec-26-states-asset-lending",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNzA3M2RlNjktNjA3Yi00MGQ5LThkNmEtMDgxOWMyMzA3MjNiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The subsidiary of Japanese Monex Group had already said it would cease providing services in the United States. </p>\n                    <p><p>Trading platform TradeStation Crypto settled with the United States Securities and Exchange Commission (SEC) and a taskforce of state regulators for failing to register an interest-bearing lending product on Feb. 6. The SEC and 26 states will split $3 million in penalties from the case. </p><p>Between August 2020 and June 30, 2022, TradeStation Crypto offered “a crypto lending product that allowed U.S. investors to deposit or purchase crypto assets in a TradeStation account in exchange for the company’s promise to pay interest,” the SEC <a href=\"https://www.sec.gov/news/press-release/2024-16?utm_medium=email&amp;utm_source=govdelivery\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a statement. TradeStation had complete discretion over how the assets were used to generate revenue to pay interest to investors, it added. </p><p>The SEC issued a consent order finding that the product was an unregistered security. TradeStation Crypto did not admit to or deny the SEC findings.</p><p><a href=\"https://cointelegraph.com/news/trade-station-crypto-settles-charges-sec-26-states-asset-lending\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-07T21:30:42.000Z",
    "title": "Ark and 21Shares amend spot Ethereum ETF with cash creation/redemption policy",
    "url": "https://cryptoslate.com/ark-and-21shares-amend-spot-ethereum-etf-with-cash-creation-redemption-policy/",
    "description": "<p>Ark Invest and 21Shares amended their joint application for a spot Ethereum exchange-traded fund (ETF) in a Feb. 7 S-1 filing. According to one section, financial firms that are allowed to purchase and redeem ETF shares will only have access to cash creations and redemptions. They will not have access to in-kind creations and redemptions [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ark-and-21shares-amend-spot-ethereum-etf-with-cash-creation-redemption-policy/\">Ark and 21Shares amend spot Ethereum ETF with cash creation/redemption policy</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-07T21:30:48.000Z",
    "title": "Federal Reserve Ends Enforcement Action Against FTX-Connected Farmington State Bank",
    "url": "https://news.bitcoin.com/federal-reserve-ends-enforcement-action-against-ftx-connected-farmington-state-bank/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/federal_reserve_farmington_bank-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Federal Reserve Terminates Enforcement Action of FTX-Linked Farmington Bank\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/federal_reserve_farmington_bank-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/federal_reserve_farmington_bank-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/federal_reserve_farmington_bank-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/federal_reserve_farmington_bank-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/federal_reserve_farmington_bank-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/federal_reserve_farmington_bank-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/federal_reserve_farmington_bank.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Federal Reserve terminated its enforcement action against Washington-based Farmington State Bank, previously known as Moonstone Bank and linked to FTX&#8217;s Alameda Research. Federal Reserve Terminates Enforcement Action of FTX-Linked Farmington Bank The Federal Reserve Board has officially concluded its enforcement actions against Farmington State Bank and its parent company, FBH Corporation. This termination marks [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-07T21:31:21.000Z",
    "title": "Craig Wright trial day 3: Wright presents 2008 documents citing Bitcoin Cash",
    "url": "https://crypto.news/craig-wright-trial-bitcoin-cash/",
    "description": "On the third day of Cryptocurrency Open Patent Alliance (COPA) v. Craig Wright, the defendant presented a document referring to Bitcoin Cash (BCH) dating back to 2008."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-07T21:25:43.000Z",
    "title": "Former bank CEO Charged in $47m crypto embezzlement case",
    "url": "https://crypto.news/former-bank-ceo-charged-in-47m-crypto-embezzlement-case/",
    "description": "The ex-CEO of Heartland Tri-State Bank in Kansas has been indicted for allegedly diverting $47.1 million from the bank's reserves into cryptocurrency investments."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-07T21:30:53.000Z",
    "title": "Bitcoin On The Brink: Is A “Big Move” Imminent?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-on-the-brink-is-a-big-move-imminent/",
    "description": "The state of Bitcoin (BTC) price action across multiple time frames has analysts at the edge of their seats. As of February 7, various technical formations suggest that the leading crypto appears poised for a critical breakout from the current consolidation.  Is Bitcoin Preparing For A Big Move? Taking to X, Mags thinks Bitcoin is in for a &#8220;big move,&#8221; considering the candlestick arrangement in the weekly chart. The analyst notes that prices have been moving horizontally in the past nine weeks, falling within the expected range.  The Bitcoin market has ranged between 8 and 30 weeks in the past. So far, the current consolidation has lasted for nine weeks. Amid this, Bitcoin prices have tested both sides of the range with notable &#8220;fake-outs.&#8221;  Related Reading: XRP Bulls Looming: Analyst Predicts 400X With Historical Trend In light of the current state of affairs in the Bitcoin market, Mags is confident that the prolonged consolidation suggests that the coin, guided by history, could edge higher.  Beyond the ranging market, another analyst notes that the Bitcoin 3-day Bollinger Bands, a technical indicator that measures volatility, is narrowing. The squeeze, the trader notes, is at historical levels, often followed by a breakout. However, as it is, how prices will evolve in the weeks and months ahead remains uncertain. Adding to the intrigue, Jason Goepfert on X points out that the S&#38;P 500, a stock market index, is currently within 0.35% of its 3-year high. The uptrend is clear even though less than half of all stocks constituting the index are trading above their 10-day moving average.  Related Reading: VeChain Ready For Big Moves: Analyst Identifies Key Factors That Will Drive VET To New ATH At the same time, less than 60% are above their 50-day moving average, and fewer than 70% are above their 200-day moving average. This rare confluence suggests that the financial market could be at a critical turning point, possibly impacting crypto. Eyes On Spot ETF Issuers And United States Federal Reserve Only time will tell whether Bitcoin will rally or tank from spot rates. However, what&#8217;s evident is that the Bitcoin uptrend remains clear, with fundamentals aligning to support optimistic bulls. To illustrate, spot Bitcoin ETF issuers are buying more coins from the market. At the same time, the excitement around the upcoming Bitcoin halving event is adding fuel to the optimism. The broader market is also watching the United States Federal Reserve. Market consensus is that the central bank will slash interest rates in March 2024 and embark on quantitative easing. With more money circulating, some will find their way to Bitcoin, driving prices to record highs of $69,000 or beyond in the coming months. Feature image from iStock, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-07T21:35:49.000Z",
    "title": "The Future of Digital Identification: Argentina Leads with zkSync-powered QuarkID",
    "url": "https://www.crypto-news-flash.com/the-future-of-digital-identification-argentina-leads-with-zksync-powered-quarkid/?utm_source=rss&utm_medium=rss&utm_campaign=the-future-of-digital-identification-argentina-leads-with-zksync-powered-quarkid",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/gustavo-sanchez-yhhVap-uWvo-unsplash.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"argentina-bandera-cielo-azul-fondo\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/gustavo-sanchez-yhhVap-uWvo-unsplash.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/gustavo-sanchez-yhhVap-uWvo-unsplash-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/gustavo-sanchez-yhhVap-uWvo-unsplash-1200x800.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/gustavo-sanchez-yhhVap-uWvo-unsplash-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/gustavo-sanchez-yhhVap-uWvo-unsplash-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/gustavo-sanchez-yhhVap-uWvo-unsplash-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/gustavo-sanchez-yhhVap-uWvo-unsplash-450x300.jpg 450w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Buenos Aires is set to revolutionize citizen identification with a blockchain-based system, leveraging zkSync through QuarkID for enhanced security and privacy. This innovative approach connects with Ethereum, Polygon, and Rootstock, marking a significant leap in technological interoperability and digital identity management. Buenos Aires is preparing to implement a citizen identification system based on blockchain technology, [...]"
  }
]