[
  {
    "source": "Cointelegraph",
    "date": "2024-02-07T20:23:13.000Z",
    "title": " Huawei researchers say giving AI a ‘body’ is the next step toward human-level agents ",
    "url": "https://cointelegraph.com/news/huawei-researchers-artificial-intelligence-ai-body-next-fundamental-step-human-level",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYzg0YzlhNTAtZTkwZS00ZjViLWI1YjQtY2JkZDJlNmY0MDc5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Having a body, the researchers argue, will allow AI to understand action, memory, and experience better.</p>\n                    <p><p>A team of researchers from Huawei’s Noah’s Ark Lab in Paris recently published pre-print research outlining a potential framework for “embodied artificial intelligence” (E-AI), something they say will serve as the “next fundamental step in the pursuit of artificial general intelligence (AGI).”</p><p>AGI, sometimes called “human-level AI” or “strong AI,” typically refers to an artificial intelligence (AI) system capable of performing any task given the necessary resources. While there’s no clear scientific consensus as to what, exactly, would qualify a given AI system for consideration as a general intelligence, companies such as OpenAI have been founded solely for the purpose of pursuing this technology. </p><p>Upon the advent of generative pre-trained transformer (GPT) technology in the late 2010s, many experts working on AGI adopted the mantra that “scale is all you need” — meaning they believed transformers, at scales beyond what was currently possible, will eventually lead to an AGI model. </p><p><a href=\"https://cointelegraph.com/news/huawei-researchers-artificial-intelligence-ai-body-next-fundamental-step-human-level\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-07T20:21:24.000Z",
    "title": "Abu Dhabi Global Market partners with Solana Foundation to drive web3 adoption in UAE",
    "url": "https://cryptoslate.com/abu-dhabi-global-market-partners-with-solana-foundation-to-drive-web3-adoption-in-uae/",
    "description": "<p>The Abu Dhabi Global Market (ADGM) has signed a Memorandum of Understanding (MOU) with the Solana Foundation to drive the adoption of Distributed Ledger Technology (DLT) solutions and propel blockchain innovation, according to a Feb. 7 press release. The announcement comes on the heels of ADGM&#8217;s pioneering introduction of the DLT Foundations Regulations, a global [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/abu-dhabi-global-market-partners-with-solana-foundation-to-drive-web3-adoption-in-uae/\">Abu Dhabi Global Market partners with Solana Foundation to drive web3 adoption in UAE</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  }
]