[
  {
    "source": "Cointelegraph",
    "date": "2023-06-02T13:18:27.000Z",
    "title": "Europe’s right-wing political groups find cause in crypto ",
    "url": "https://cointelegraph.com/news/europe-s-right-wing-political-groups-find-cause-in-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/5727ee4a-b918-4f31-866b-2fd535dc7f5a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Right-wingers are often advocates of Bitcoin, especially the decentralized nature of the currency. But does that mean crypto is a right-wing thing? </p>\n                    <p><p>The European crypto scene has gained significant traction over the past few years, with a surge in the interest in and adoption of <a href=\"https://cointelegraph.com/news/3-takeaways-from-the-european-union-s-mica-regulations\">cryptocurrencies and blockchain technology</a>. While the crypto industry is often associated with decentralization, innovation and financial freedom, it is not immune to various political ideologies and influences, and right-wing movements are no exception.</p><p>The attraction of cryptocurrencies for right-wing politicians in Europe can stem from several factors. Right-wing ideologies often prioritize individual freedoms and limited government intervention. Cryptocurrencies, with their decentralized nature, offer the potential for financial sovereignty by allowing individuals to have control over their money without relying on traditional financial systems or government regulations.</p><p>Right-wing politicians also may perceive cryptocurrencies as a way to challenge the existing financial establishment and its perceived biases or control. Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), in particular, emerged <a href=\"https://cointelegraph.com/learn/what-is-bitcoin-a-beginners-guide-to-the-worlds-first-cryptocurrency\">after the 2008 financial crisis</a>, a crisis that led many to lose trust in traditional financial institutions and governmental monetary policies. </p><p>In addition, many became concerned about central banks and their influence on monetary policy, and Bitcoin’s decentralized nature appealed to those who advocate alternative monetary systems outside of central bank control.</p><h3>Bitcoin as an “alternative for Germany”</h3><p>For example, a German exit from the euro and a return to the Deutschmark (the country’s former currency) is a well-known demand of the right-wing populist political party Alternative for Germany (AfD). Although there is no official or clear strategy within the anti-euro party regarding cryptocurrencies, some members have clearly expressed their positive attitude toward Bitcoin. </p><p>For instance, AfD leader Alice Weidel has <a href=\"https://www.vice.com/de/article/zmwyzj/alice-weidel-macht-jetzt-wohl-in-bitcoin-und-sorgt-fur-arger-in-der-krypto-community?\" target=\"_blank\" rel=\"noopener nofollow\">attended</a> several Bitcoin conferences, called herself a “Bitcoin entrepreneur” and wanted to <a href=\"https://www.trustnodes.com/2018/02/24/alice-weidel-leader-alternative-germany-launch-bitcoin-startup\" target=\"_blank\" rel=\"noopener nofollow\">launch</a> a Bitcoin startup. Even Aaron Koenig, a German entrepreneur and the founder of the brick-and-mortar crypto exchange Bitcoin Exchange Berlin, was on the stage with Weidel, and both presented their view of “money without a state.”</p><p>The AfD’s prioritization of crypto is also evident in its behavior in the Bundestag, Germany’s parliament. On several occasions, the AfD has submitted “Kleine Anfragen” (literally, “small requests”) to the government. This instrument of parliamentary procedure requires an official response from the Bundestag and is often a way for opposition parties to demand accountability for specific actions or inquire as to why other measures were not taken.</p><p>For instance, the party <a href=\"https://www.bundestag.de/presse/hib/kurzmeldungen-934934\" target=\"_blank\" rel=\"noopener nofollow\">asked</a> a “small question” about crypto donations for Ukraine, how a cryptocurrency could replace the previous currency, what effects this would have on the banking system, and how much Bitcoin German federal authorities <a href=\"https://dserver.bundestag.de/btd/20/048/2004807.pdf\" target=\"_blank\" rel=\"noopener nofollow\">own</a>. AfD also <a href=\"https://afdbundestag.de/joana-cotar-bitcoin-darf-nicht-verboten-werden/\" target=\"_blank\" rel=\"noopener nofollow\">opposed</a> a proposed Bitcoin ban during <a href=\"https://cointelegraph.com/news/eu-officials-considered-bitcoin-trading-ban-to-enforce-proposed-mining-ban\">discussions among European lawmakers</a> last year.</p><blockquote class=\"twitter-tweet\"><p lang=\"de\" dir=\"ltr\">Verbotskultur der <a href=\"https://twitter.com/hashtag/Internet?src=hash&amp;ref_src=twsrc%5Etfw\">#Internet</a>-Ausdrucker: <a href=\"https://twitter.com/hashtag/Gr%C3%BCne?src=hash&amp;ref_src=twsrc%5Etfw\">#Grüne</a>, <a href=\"https://twitter.com/hashtag/SPD?src=hash&amp;ref_src=twsrc%5Etfw\">#SPD</a> und <a href=\"https://twitter.com/hashtag/Linke?src=hash&amp;ref_src=twsrc%5Etfw\">#Linke</a> wollen <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> verbieten! <a href=\"https://twitter.com/hashtag/mica?src=hash&amp;ref_src=twsrc%5Etfw\">#mica</a><br><br>Der <a href=\"https://twitter.com/hashtag/BTC?src=hash&amp;ref_src=twsrc%5Etfw\">#BTC</a> lässt sich nicht verbieten und auch wir bleiben dabei: <a href=\"https://twitter.com/hashtag/Krypto?src=hash&amp;ref_src=twsrc%5Etfw\">#Krypto</a>-Währungen sollten von staatlicher Regulierung verschont bleiben!<br><br>Mehr erfahren:<a href=\"https://t.co/LeSENUwW3Q\">https://t.co/LeSENUwW3Q</a> <a href=\"https://t.co/vW6QLKlP4k\">pic.twitter.com/vW6QLKlP4k</a></p>&mdash; AfD (@AfD) <a href=\"https://twitter.com/AfD/status/1503316978794209284?ref_src=twsrc%5Etfw\">March 14, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The concept of cryptocurrency is, in some places, being linked to the right-wing — and, in part, radical — positions of the AfD.</p><p>For years, some experts, such as David Golumbia — a digital studies professor at Virginia Commonwealth University who researches the politics of cryptocurrency — have warned that blockchain could be hijacked by right-wing and libertarian groups. </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/does-the-us-have-a-crypto-tax-loophole-problem\">Does the US have a crypto ‘tax loophole’ problem?</a></em></strong></p><p>In Golumbia’s view, blockchain technology and cryptocurrencies could be the <a href=\"https://map.derkontext.com/blockchain#m=10/298.60144/701.96237,p=95\" target=\"_blank\" rel=\"noopener nofollow\">realization</a> of their vision of a world without government control. As a former member of the Hayek Society, Weidel belongs to the radical economic liberal wing of her party. The Hayek Society is named after Austrian economist Friedrich August von Hayek, who was an advocate of an unfettered market with as little government intervention as possible.</p><h3>Support for crypto among Europe’s right-wing parties</h3><p>It’s not only German right-wing politicians who have voiced interest in Bitcoin and blockchain technology as potential disruptors of traditional financial systems, with the leaders of the Dutch right-wing parties Party for Freedom (PVV) and Forum for Democracy (FvD) — Geert Wilders and Thierry Baudet, respectively — also <a href=\"https://yourcryptolibrary.com/news/thierry-baudet-blockchain-creates-freedom/\" target=\"_blank\" rel=\"noopener nofollow\">speaking</a> positively on the subject.</p><p>Baudet even <a href=\"https://twitter.com/dldasilvarosa/status/1632743408593715200\" target=\"_blank\" rel=\"noopener nofollow\">wants</a> to make the Netherlands a Bitcoin hub and <a href=\"https://www.crypto-insiders.nl/nieuws/nft/thierry-baudet-brengt-als-eerste-politieke-partij-twee-nft-reeksen-uit/\" target=\"_blank\" rel=\"noopener nofollow\">released</a> two NFT series on the theme of his fight against World Economic Forum founder and CEO Klaus Schwab. Baudet is a fierce critic of the WEF, which he <a href=\"https://twitter.com/thierrybaudet/status/1615810344097615874?\" target=\"_blank\" rel=\"noopener nofollow\">believes</a> is leading the world in the wrong direction and causing serious threats to individual freedom.</p><blockquote class=\"twitter-tweet\"><p lang=\"art\" dir=\"ltr\"> <a href=\"https://t.co/W7twSHlO2K\">https://t.co/W7twSHlO2K</a></p>&mdash; Thierry Baudet (@thierrybaudet) <a href=\"https://twitter.com/thierrybaudet/status/1653886253874532359?ref_src=twsrc%5Etfw\">May 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Polish politician Jaroslaw Gowin and his center-right party, Agreement — formerly known as Poland Together — were part of the ruling United Right coalition from 2015 to 2021. For most of that period, Gowin served as deputy prime minister, as well as being a member of parliament. </p><p>When Gowin was the leader of the Agreement party, he <a href=\"https://bitcoin.pl/zjednoczona-prawica-wygrala-wybory-co-nas-czeka-w-kolejnej-kadencji-pod-katem-kryptowalut\" target=\"_blank\" rel=\"noopener nofollow\">expressed</a> a positive attitude toward cryptocurrencies, acknowledging their potential to promote financial innovation. The politician also consulted with many people from the industry about cryptocurrencies and blockchain. For example, the party held a meeting where Prime Minister Gowin listened to the recommendations of industry experts, including economist Krzysztof Piech and Filip Pawczynski, president of the Polish Bitcoin Association.</p><p>Nigel Farage, a prominent figure in British politics and former leader of the right-wing pro-Brexit UK Independence Party, has also shown interest in cryptocurrencies. </p><p>In a 2022 interview with Cointelegraph, Farage — also a former member of the European Parliament — said he <a href=\"https://cointelegraph.com/news/bitcoin-to-become-trusted-means-of-exchange-in-eu-bitcoin-amsterdam-2022\">first became aware of Bitcoin 10 years ago</a> and shared his perspective on the potential future of Bitcoin adoption in Europe: “What happens in America first happens here [in Europe], too. There’s going to be a very, very big change here over the next two or three years, and it [Bitcoin] will become a trusted means of exchange.” </p><p>Farage also believes that Bitcoin has gained appeal as an alternative to the existing financial infrastructure, noting the latter’s inefficiency, high costs and slow speeds. </p><p>Other right-wing politicians haven’t made specific statements about cryptocurrencies but are still taking steps to embrace digital currencies. Viktor Orbán, the prime minister of Hungary and leader of the right-wing Fidesz party, and his government are currently <a href=\"https://www.bitcoinbazis.hu/english/hungary-plans-to-develop-its-own-central-bank-digital-currency/\" target=\"_blank\" rel=\"noopener nofollow\">considering</a> the potential benefits of launching a central bank digital currency. Hungary also appears to be warming up to crypto across the board, with the government revealing plans in 2021 to <a href=\"https://cointelegraph.com/news/hungary-plans-bitcoin-tax-cut-as-part-of-economic-recovery-program\">cut taxes on crypto trading</a> from 30.5% to 15% as part of an economic recovery program.</p><h3>Right-wing extremists rely on crypto payments</h3><p>Not only have right-wing politicians discovered cryptocurrencies, but right-wing extremist movements have also been utilizing crypto. In 2022, the Middle East Media Research Institute (MEMRI) <a href=\"https://www.memri.org/dttm/eye-storm-domestic-terrorists-using-cryptocurrency-part-ii-%E2%80%93-following-jihadis%E2%80%99-footsteps-neo\" target=\"_blank\" rel=\"noopener nofollow\">published</a> a report on the massive increase in the use of crypto payments by right-wing extremist groups in recent years.</p><p>Crypto payments are not a new tool for ultranationalists and European extremist groups proclaiming the superiority of the “white race” and advocating for a “white” Europe and North America. In fact, they are among the early adopters of the technology, accepting BTC donations as early as 2012, according to the MEMRI.</p><p>The United States-based Southern Poverty Law Center has further <a href=\"https://www.splcenter.org/cryptocurrency-report\" target=\"_blank\" rel=\"noopener nofollow\">compiled</a> a list of extremist groups accepting crypto donations.</p><p>Ultranationalist and extremist groups are actively using cryptocurrencies not only for reasons of convenience and ideology — and because they are being shut out of traditional and mainstream online banking systems — but also because funds held in crypto cannot be accessed or seized by anyone.</p><h3>So, is crypto a right-wing movement, then?</h3><p>Does this all mean that crypto in Europe is a right-wing thing? Not really.</p><p>While crypto itself is not inherently Right or Left, it is not without ideology, nor is it completely free of political positions — even if its political relations are indirect. Politicians can like it or hate it, regardless of their political persuasion, and support for cryptocurrencies among politicians is not limited to those leaning toward the Right. For example, the German liberal, pro-free market Free Democratic Party also <a href=\"https://cointelegraph.com/news/germany-s-2021-election-what-do-parties-think-of-crypto-and-blockchain\">advocates</a> for a friendly policy toward cryptocurrencies.</p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/increasing-number-of-divorce-proceedings-involve-crypto\">Increasing number of divorce proceedings involve crypto</a></em></strong></p><p>While the European crypto scene is not inherently right-wing, there are notable instances of right-wing influence within the community, according to the MEMRI report, which also states that it is crucial to address these concerns by fostering education, implementing regulations and ensuring that the crypto space remains inclusive, transparent and aligned with democratic principles. </p><p>MEMRI further stated that social media platforms and online communities need to take proactive steps to curb hate speech, misinformation and extremist content, while also promoting healthy, constructive dialogue.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-02T13:34:30.000Z",
    "title": "Marathon Digital increased its production by 77% to 1,245 BTC in May",
    "url": "https://cryptoslate.com/marathon-digital-increased-its-production-by-77-to-1245-btc-in-may/",
    "description": "<p>Marathon Digital Holdings mined a record-high number of Bitcoin (BTC) in May, increasing its production by 77% compared to April 2023. The mining firm produced 1,245 BTC in May — up 366% from May 2022. Marathon’s chairman and CEO Fred Thiel explained that the spike in BTC production was a direct result of the increase [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/marathon-digital-increased-its-production-by-77-to-1245-btc-in-may/\">Marathon Digital increased its production by 77% to 1,245 BTC in May</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-02T13:30:39.000Z",
    "title": "Elon Musk Faces Insider Trading Accusations in Dogecoin Lawsuit Over Twitter Logo Change",
    "url": "https://news.bitcoin.com/elon-musk-faces-insider-trading-accusations-in-dogecoin-lawsuit-over-twitter-logo-change/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/muskkkk-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Elon Musk Faces Insider Trading Accusations in Dogecoin Lawsuit Over Twitter Logo Change\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/muskkkk-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/muskkkk-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/muskkkk-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/muskkkk-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/muskkkk-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/muskkkk-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/muskkkk.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Elon Musk, the CEO and product architect of Tesla, has been accused of insider trading in a class-action lawsuit involving the meme coin dogecoin (DOGE). The plaintiffs accuse Musk of inflating the price of DOGE by 30% when he changed Twitter&#8217;s blue bird logo &#8220;to the Dogecoin Shiba Inu logo.&#8221; Tesla’s CEO Accused of Insider [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-02T13:20:31.000Z",
    "title": "Litecoin Breaks $95 As Whale Transactions Spike",
    "url": "https://www.newsbtc.com/news/litecoin/litecoin-breaks-95-as-whale-transactions-spike/",
    "description": "Litecoin has recently managed to break past the $95 mark as on-chain data shows the whales have become active on the network. Litecoin Has Surged After Spike In Whale Activity According to data from the on-chain analytics firm Santiment, the current whale activity is the highest it has been since January. The relevant indicator here is the &#8220;whale transaction count,&#8221; which measures the total number of transfers taking place on the Litecoin network that involve the movement of coins worth at least $100,000. Since such transactions are quite large in scale, generally only the whale entities are capable of making them. Thus, this indicator can provide us with an idea about the number of transfers that these humongous holders are making on the blockchain. Due to the sheer number of coins involved in each of these transfers, if a large amount of them take place at once, the market can register noticeable fluctuations. So, whenever the whale transaction count has a high value, the price of LTC becomes more probable to display volatility. On the other hand, when this metric has low values, the price may stay relatively calm, as it suggests that the whales aren&#8217;t making too many moves on the market right now. Now, here is a chart that shows the trend in the Litecoin whale transaction counts over the last six months or so: The value of the metric seems to have been quite high in recent days &#124; Source: Santiment on Twitter As shown in the above graph, the Litecoin whale transaction count has observed a large spike recently. This means that whales have ramped up their transfer activity in the last couple of days. Related Reading: XRP Hype Spikes As Price Surges 12%, Is This A Top Signal? At the peak of this spike, the indicator had reached its highest level since January 26, 2023. These high values have come as the price has been going up, and since they have taken place, the uptrend has only continued further, with LTC managing to break past $95. Generally, when whales become active, the price volatility can go either way as the transaction count metric only tells us about the pure number of transfers happening on the chain and not about whether they are buying or selling moves. However, as the price has seemingly continued to rise following this latest spike, it may appear that the Litecoin whales could be supportive of the current uptrend. The chart also includes the data for the transaction volume, which is a measure of the daily total amount of LTC that is registering some movement on the blockchain. Related Reading: Bitcoin Price Faces Confluence of Bearish Factors And Could Decline Heavily This indicator has also seen a rapid increase recently, suggesting that users are moving around large amounts on the network currently. Such a trend is generally a sign of activity being high throughout the network and is often constructive for the price. This new surge in the price of Litecoin has come as the halving, an event where the coin&#8217;s block rewards will be permanently cut in half, is just a couple of months away now. LTC Price At the time of writing, Litecoin is trading around $95, up 9% in the last week. Looks like the asset has seen a rise recently &#124; Source: LTCUSD on TradingView Featured image from Michael Förtsch on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-02T13:32:59.000Z",
    "title": "The ‘Bitcoin President’ Advocates BTC as the Perfect Global Base Currency for All – Joe Biden Should Take Inspiration from This",
    "url": "https://www.crypto-news-flash.com/the-bitcoin-president-advocates-btc-as-the-perfect-global-base-currency-for-all-joe-biden-should-take-inspiration-from-this/?utm_source=rss&utm_medium=rss&utm_campaign=the-bitcoin-president-advocates-btc-as-the-perfect-global-base-currency-for-all-joe-biden-should-take-inspiration-from-this",
    "description": "<p>Democratic presidential candidate Robert F Kennedy Jr has admitted Bitcoin has intrinsic value and the government should not launch CBDC. Kennedy slammed the SEC for not being crypto-neutral in regulating the nascent industry. The United States 2024 presidential race has been gaining more momentum as popular political figures enter the primaries for the Democrats and [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/the-bitcoin-president-advocates-btc-as-the-perfect-global-base-currency-for-all-joe-biden-should-take-inspiration-from-this/\">The &#8216;Bitcoin President&#8217; Advocates BTC as the Perfect Global Base Currency for All &#8211; Joe Biden Should Take Inspiration from This</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-02T13:21:42.000Z",
    "title": "Dogecoin, Cardano, and Tradecurve Price Predictions",
    "url": "https://www.crypto-news-flash.com/dogecoin-cardano-and-tradecurve-price-predictions/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-cardano-and-tradecurve-price-predictions",
    "description": "<p>The sentiment of the crypto market was generally bullish throughout the first quarter of 2023. Things quickly changed in the second quarter, with digital assets spending most of the last two months correcting and consolidating. With cryptocurrency market analysts still agreeing that the industry could be in the early phases of another bull cycle, digital [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/dogecoin-cardano-and-tradecurve-price-predictions/\">Dogecoin, Cardano, and Tradecurve Price Predictions</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-02T13:14:56.000Z",
    "title": "Top 8 Cryptocurrency Trends to Watch Out for in 2023",
    "url": "https://www.crypto-news-flash.com/top-8-cryptocurrency-trends-to-watch-out-for-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=top-8-cryptocurrency-trends-to-watch-out-for-in-2023",
    "description": "<p>It would be outright dishonest to say that today&#8217;s world of cryptocurrency is where people in May 2028 expected it to be. It did hit a rough patch, and, at the moment, no one knows how long this bearish market will last. However, there are a few trends that might turn this thing around. Here [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/top-8-cryptocurrency-trends-to-watch-out-for-in-2023/\">Top 8 Cryptocurrency Trends to Watch Out for in 2023</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-02T13:27:13.000Z",
    "title": "Trendin Announces the Launch of Sentience Bot and $TREND token",
    "url": "https://coinedition.com/trendin-announces-the-launch-of-sentience-bot-and-trend-token/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Trendin_Revolutionizes_Crypto_Space_with_AI_Conceived_Token_and-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Trendin_Revolutionizes_Crypto_Space_with_AI_Conceived_Token_and-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Trendin_Revolutionizes_Crypto_Space_with_AI_Conceived_Token_and-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Trendin_Revolutionizes_Crypto_Space_with_AI_Conceived_Token_and-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Trendin_Revolutionizes_Crypto_Space_with_AI_Conceived_Token_and-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Trendin_Revolutionizes_Crypto_Space_with_AI_Conceived_Token_and-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Trendin_Revolutionizes_Crypto_Space_with_AI_Conceived_Token_and.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Trendin, a crypto project that uses Artificial Intelligence (AI) in the cryptocurrency space, announced that the launch of its AI-Conceived Token and Trendin Bot (V2) would occur next week. On its official Twitter page, Trendin claimed the launch of $TREND, its token, and Trendin Sentience, the upgraded version of Trendin Bot, would revolutionize the crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/trendin-announces-the-launch-of-sentience-bot-and-trend-token/\">Trendin Announces the Launch of Sentience Bot and $TREND token</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-02T13:20:00.000Z",
    "title": "AI Military Drone Kills Operator, Turns Down Comms to Complete Mission",
    "url": "https://coinedition.com/ai-military-drone-kills-operator-turns-down-comms-to-complete-mission/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/The-Air-Force-trained-an-AI-drone-to-destroy-SAM-sites-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/The-Air-Force-trained-an-AI-drone-to-destroy-SAM-sites-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/The-Air-Force-trained-an-AI-drone-to-destroy-SAM-sites-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/The-Air-Force-trained-an-AI-drone-to-destroy-SAM-sites-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/The-Air-Force-trained-an-AI-drone-to-destroy-SAM-sites-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/The-Air-Force-trained-an-AI-drone-to-destroy-SAM-sites-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/The-Air-Force-trained-an-AI-drone-to-destroy-SAM-sites.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>A United States military drone powered by artificial intelligence (AI) unexpectedly targeted its human operators during a simulated flight. The autonomous equipment took a drastic measure, opting to &#8220;kill&#8221; its operator to ensure unhindered progress toward achieving its main mission. At the RAeS Future Combat Air &#38; Space Capabilities Summit in London, Colonel Tucker &#8220;Cinco&#8221; [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ai-military-drone-kills-operator-turns-down-comms-to-complete-mission/\">AI Military Drone Kills Operator, Turns Down Comms to Complete Mission</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]