[
  {
    "source": "CoinDesk",
    "date": "2024-01-16T20:32:19.000Z",
    "title": "Crypto Can Be a Coordination Layer for Artificial Intelligence",
    "url": "https://www.coindesk.com/consensus-magazine/2024/01/16/crypto-can-be-a-coordination-layer-for-artificial-intelligence/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The mainstreaming of AI means compute power is at a premium. Decentralized Physical Infrastructure Networks (DePINs) can fill a gap, says Shayon Sengupta, at Multicoin Capital."
  },
  {
    "source": "CoinDesk",
    "date": "2024-01-16T20:25:20.000Z",
    "title": "Coinbase's SEC Clash Faces First Major Test as Judge Weighs Longshot Dismissal",
    "url": "https://www.coindesk.com/policy/2024/01/16/coinbases-sec-clash-faces-first-major-test-as-judge-weighs-longshot-dismissal/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Coinbase is about to make its case in a federal courtroom that the U.S. Securities and Exchange Commission (SEC) is wrong about its legal arguments that the crypto exchange has been trading unregistered securities. What the New York judge does next could have serious consequences for the wider industry's clashes with the regulator."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-16T20:33:17.000Z",
    "title": "Crypto Funds Gain $1.18 Billion Following Bitcoin ETFs Launch",
    "url": "https://decrypt.co/213074/crypto-funds-gain-1-18-billion-following-bitcoin-etfs-launch",
    "description": "Crypto investment products also saw $17.5 billion in net trading volume last week—an all-time high amid the Bitcoin ETF frenzy."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-16T20:31:49.000Z",
    "title": " Fake spot Bitcoin ETF tweet ‘likely wasn’t the SEC,’ says Blockchain Association director ",
    "url": "https://cointelegraph.com/news/fake-spot-bitcoin-etf-not-sec-blockchain-association",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMGRkZTkzNjEtZjZlZC00MGM3LWE0OTItNjM4ZTEyNDNjNjBkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ron Hammond said the inclusion of the Bitcoin logo and the graphics scheme suggested that the SEC had not been behind drafting a spot BTC ETF approval tweet.</p>\n                    <p><p>A fake tweet on social media platform X (formerly Twitter) that shook the crypto market on Jan. 9 likely wasn’t issued by the United States Securities and Exchange Commission (SEC), according to a director at the Blockchain Association.</p><p>In a Jan. 16 X thread, Blockchain Association director of government relations Ron Hammond <a href=\"https://twitter.com/RonwHammond/status/1747275695318090093\" target=\"_blank\" rel=\"noopener nofollow\">said</a> a tweet announcing the approval of a spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund — which the SEC claimed was “compromised” — was unlikely to have been issued by the commission. Many online speculated that someone at the SEC had prematurely released the tweet announcing the ETF approval, given that the commission officially filed on Jan. 10.</p><p>“When the news broke it was a mistweet, many in DC instantly thought it was a comms blunder,” said Hammond. “For major events like the ETF announcement, usually agencies/firms spend hours refining tweets so the idea of someone accidentally pressing send would make sense.”</p><p><a href=\"https://cointelegraph.com/news/fake-spot-bitcoin-etf-not-sec-blockchain-association\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-16T20:22:05.000Z",
    "title": " Ethereum outperforms Bitcoin by 20%, but how long can ETH hold $2.5K support? ",
    "url": "https://cointelegraph.com/news/ethereum-outperforms-bitcoin-by-20-but-how-long-can-eth-hold-the-2-5k-support",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMzkwOGQxMzEtYTE5Ni00NTYwLTlkNjktNDk1ZTU1NGRjZjYyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>ETH’s rally is backed by increased on-chain activity and the markets’ anticipation of a network upgrade and spot ETF, but is this enough? </p>\n                    <p><p>Ethereum's native token, Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), rallied 20% between Jan. 8 and Jan. 11 but struggled to sustain the $2,600 level. The subsequent 3.5% correction down to $2,560 on Jan. 16 may have disappointed some bulls, but Ether's price has outperformed Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) by 19.5% since Jan. 8. Such gaps are quite uncommon and last occurred in October 2022.</p><p>Ether investors question if the $2,500 level will hold, given that the most obvious drivers are not expected in the short term, namely the <a href=\"https://cointelegraph.com/news/spot-ethereum-etf-next-for-sec-approval-analysts\">Ethereum spot exchange-traded fund (ETF)</a> and the planned <a href=\"https://cointelegraph.com/news/key-elements-to-watch-on-ethereum-network-roadmap\">Ethereum network upgrades</a>. From a bullish perspective, these events present an opportunity for Ether to further decouple from the remaining cryptocurrency market, but they also present a risk if it either backfires or is postponed.</p><p>The price of Ether outperforming Bitcoin by 15% or higher in a week is not something common, at least in the past two years. Besides the high correlation between the two cryptocurrencies, 2023 was marked by disappointment with Ethereum's declining total value locked (TVL) and persistently high gas fees, paving the way for competing blockchains. Meanwhile, Bitcoin benefited from the anticipation of a spot ETF approval, especially after <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">BlackRock joined the race in June 2023.</a></p><p><a href=\"https://cointelegraph.com/news/ethereum-outperforms-bitcoin-by-20-but-how-long-can-eth-hold-the-2-5k-support\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-16T20:08:51.000Z",
    "title": " Grayscale Bitcoin Trust ETF transfers another $376M in BTC as price stabilizes ",
    "url": "https://cointelegraph.com/news/grayscale-bitcoin-trust-etf-transfers-another-376-million-worth-btc-price-stabilizes",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYzY5Mjg5MDktNmM3Yi00ZGIxLTkyOTgtMDllMjkzZjhlNjdkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The GBTC fund sent another 8,730 BTC to Coinbase Prime as the Bitcoin price leveled out from earlier declines.</p>\n                    <p><p data-ct-non-breakable=\"true\">The Grayscale Bitcoin Trust (GBTC) transferred 8,730 Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), worth over $376 million, to Coinbase Prime deposit addresses on Jan. 16, according to data from blockchain analytics platform Arkham Intelligence. The transfers imply that the fund may have been forced to sell some of its Bitcoin as its share price declined. </p><p data-ct-non-breakable=\"true\">Some analysts have argued that outflows from the trust are weighing on Bitcoin’s price and are partially responsible for its decline over the past few days. Despite the outflows, the price of Bitcoin appears to have <a href=\"https://cointelegraph.com/bitcoin-price\">stabilized</a> during mid-day United States trading hours on Jan. 16.</p><p data-ct-non-breakable=\"true\">The Grayscale Bitcoin Trust is one of the largest single holders of BTC in the world. Prior to Jan. 11, most investors in the fund could not redeem their shares for Bitcoin or a cash equivalent. But beginning on Jan. 11, the trust was converted into an exchange-traded fund (ETF). </p><p><a href=\"https://cointelegraph.com/news/grayscale-bitcoin-trust-etf-transfers-another-376-million-worth-btc-price-stabilizes\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-16T19:51:35.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Anti-central bank digital currency (CBDC) presidential candidate Ron DeSantis came a distant second in the Republican Iowa Caucus race on Jan. 15. Meanwhile, Tether refuted the United Nations’ report on illicit activities conducted using Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>), and United States presidential candidate Vivek Ramaswamy has dropped out of the U.S. presidential race.</p><p>Florida governor and presidential hopeful Ron DeSantis finished a distant second behind former Presidnet Donald Trump in the Iowa Caucus race.</p><p>According to multiple reports, <a href=\"https://cointelegraph.com/news/florida-governor-cbdc-ban-second-iowa-caucus\">DeSantis received just 21% of the vote</a>, compared to Trump’s 51%. </p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-16T19:45:00.000Z",
    "title": " Multichain CEO resurfaces on Telegram as investors search for answers ",
    "url": "https://cointelegraph.com/news/multichain-ceo-resurfaces-telegram-investors-search-answers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZmVkZjA2Y2EtYWVjNi00NzkwLTk4MGQtOThhMTllMTZiODlkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Zhaojun's arrest by Chinese police in May 2023 led to the collapse of the $1.6 billion Multichain protocol.  </p>\n                    <p><p>Zhaojun He, co-founder and CEO of cross-chain bridging protocol Multichain, has resurfaced on Telegram for the first time since his unexplained and continuous detention by Chinese police last year.</p><p>According to user reports on Jan. 16, Zhaojun's Telegram profile now displays as \"last seen recently,\" compared to the previous \"last seen a long time ago,\" indicating user activity. The current message is only displayed for individuals who have been active on the social media platform within the past three days. The CEO's account posted no new messages.</p><p>\"Can still be the police office accessing his Telegram so it doesn't get auto-deleted,\" one user commented. \"But can also mean zj [Zhaojun] has access again to his phone.\" </p><p><a href=\"https://cointelegraph.com/news/multichain-ceo-resurfaces-telegram-investors-search-answers\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-16T20:00:33.000Z",
    "title": "Cantor CEO confirms Tether holds $86B in reserve to back its stablecoin USDT",
    "url": "https://cryptoslate.com/cantor-ceo-confirms-tether-holds-86b-in-reserve-to-back-its-stablecoin-usdt/",
    "description": "<p>Cantor Fitzgerald CEO Howard Lutnick told reporters that USDT issuer Tether does, in fact, have the billions of dollars it needs to meet the 1 to 1 reserve requirements for its stablecoin. Lutnick made the confirmation during an interview with Bloomberg at the World Economic Forum in Davos on Jan. 16. His statement comes as [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/cantor-ceo-confirms-tether-holds-86b-in-reserve-to-back-its-stablecoin-usdt/\">Cantor CEO confirms Tether holds $86B in reserve to back its stablecoin USDT</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-16T20:30:40.000Z",
    "title": "Cantor Fitzgerald CEO Foresees Bitcoin Rally at Next Halving, Affirms Tether’s Reserves are Solid",
    "url": "https://news.bitcoin.com/cantor-fitzgerald-ceo-foresees-bitcoin-rally-at-next-halving-affirms-tethers-reserves-are-solid/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/cf-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Cantor Fitzgerald CEO Foresees Bitcoin Rally at Next Halving, Affirms Tether&#039;s Reserves are Solid\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/cf-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/cf-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/cf-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/cf-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/cf-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/cf-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/cf.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Howard Lutnick, CEO of the renowned financial services company Cantor Fitzgerald, recently shared his insights on bitcoin and tether during an appearance at the World Economic Forum in Davos on Tuesday. Lutnick drew parallels between the fervor around spot gold exchange-traded funds (ETFs) and the anticipated trajectory of bitcoin. Howard Lutnick Projects Bitcoin Rally Post-Halving, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-16T20:16:07.000Z",
    "title": "EU tightens crypto regulations to combat financial crimes",
    "url": "https://www.cryptopolitan.com/eu-crypto-regulations-combat-financial-crimes/",
    "description": "The European Banking Authority (EBA) has issued new guidelines to combat financial crimes such as money laundering and terrorist financing. This move marks a pivotal step towards integrating digital asset transactions into the existing regulatory framework. Aligning crypto with anti-money laundering standards The EBA&#8217;s recent guidance extends the scope of the EU’s anti-money laundering and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-16T19:54:11.000Z",
    "title": "Solana users lose $4 million to airdrop scammers",
    "url": "https://www.cryptopolitan.com/solana-users-4-million-to-airdrop-scammers/",
    "description": "In recent weeks, a disturbing trend has emerged within the Solana ecosystem, where two malicious programs, Rainbow Drainer and Node Drainer, have successfully pilfered millions of dollars in crypto assets from unsuspecting users. According to a comprehensive analysis conducted by Scam Sniffer and the crypto analytics platform Dune, these nefarious actors have managed to abscond [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-16T19:52:16.000Z",
    "title": "Sui Price Prediction 2024-2033: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2024-2033 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin, capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-16T19:42:48.000Z",
    "title": "Indian exchanges seduce Binance and OKX users after FIU ban",
    "url": "https://www.cryptopolitan.com/indian-exchanges-binance-okx-users-fiu-ban/",
    "description": "In response to the Ministry of Finance Financial Intelligence Unit’s ban on offshore crypto exchanges like Binance and OKX, Indian crypto exchanges are stepping up to assist users in transferring their crypto assets from these banned platforms. With an estimated $4 billion invested by Indian investors in offshore exchanges, recent regulatory developments have raised concerns [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-16T19:57:12.000Z",
    "title": "ETHEREUM PRICE ANALYSIS & PREDICTION (January 16) – ETH Resumes Drops This Week After Losing 7% In Five Days, Can It Recover?",
    "url": "https://nulltx.com/ethereum-price-analysis-prediction-january-16-eth-resumes-drops-this-week-after-losing-7-in-five-days-can-it-recover/",
    "description": "Ethereum saw a big breakout last week but failed to sustain the momentum. The price rolled back quickly and ended the week in the red. It resumed selling today with a 2% loss with a market dominance of 18%. The $2,700 range, which has been much-anticipated in the past months [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-16T19:44:43.000Z",
    "title": "Grayscale Bitcoin ETF sees $579m in daily net outflows",
    "url": "https://crypto.news/grayscale-bitcoin-etf-sees-579m-in-daily-net-outflows/",
    "description": "According to reports from Bloomberg Intelligence, Grayscale’s Bitcoin ETF has experienced significant withdrawals, amounting to approximately $579 million."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-16T20:30:09.000Z",
    "title": "Bitcoin Has Large Resistance Wall Ahead: Here’s The Level To Watch",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-large-resistance-wall-ahead-level-watch/",
    "description": "On-chain data suggests Bitcoin has a large wall of resistance ahead of it currently. Here are the exact levels that make up this important range. A Large Amount Of Bitcoin Supply Was Purchased Between $42,700 &#38; $44,000 According to data from the market intelligence platform IntoTheBlock, BTC is sitting just below a significant on-chain resistance zone. In on-chain analysis, the strength of any resistance or support level is defined based on the number of coins acquired by the investors there. To any holder, their cost basis is naturally an important level; thus, they may be more prone to make some moves whenever the cryptocurrency&#8217;s spot price retests their profit-loss boundary. Related Reading: XRP Investors Become Fearful: Time To Buy? How the investors might react to such a retest can change depending on the direction of the retest. Holders at a loss can sometimes be desperate to exit the market, so if the price retests their cost basis (that is, the retest is happening from below), they might sell to at least be able to get back their investment. Such selling can provide resistance to the price. Only a few investors making such moves may not be relevant to the broader market. Still, if a significant number of traders acquired a large amount of BTC inside a narrow range, the reaction produced by a retest could be sizeable. On the other hand, investors who were in profit before the retest may look at dips in their cost basis as an opportunity to accumulate more, thinking that the price would go up again. This buying, when large enough, can support the asset. Now, here is a chart that shows how the various Bitcoin price ranges look like right now in terms of the amount of BTC that was acquired at them: The density of cost basis at the different price ranges above and below the current value of the asset &#124; Source: IntoTheBlock on X As is apparent from the graph, the $42,700 to $44,000 range hosts the cost basis of 2.68 million addresses, which acquired a total of 1.02 million BTC inside it. The average price of this range is around $43,400, which is above the current spot price of the cryptocurrency. &#8220;Uncertainty can cause these holders to sell into their break-even point, increasing resistance in a move up,&#8221; explains the analytics firm. If Bitcoin can break through this resistance, though, it may have an easier time exploring higher levels, as it offers less resistance. Related Reading: Dogecoin To See 24% Rally To $0.100 If This Holds: Analyst The chart shows that below the current spot price is the substantial $41,400 to $42,700 support range, which has helped cushion Bitcoin&#8217;s fall during the recent correction. Thus, even if the resistance zone rejects BTC, this support area may at least help it return for another go. BTC Price At the time of writing, Bitcoin is trading around the $43,200 level, down 8% in the past week. BTC has displayed boring price action in the last few days &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, IntoTheBlock.com"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-16T19:54:17.000Z",
    "title": "Cantor CEO Makes Gold And Bitcoin ETFs Comparison, Foresees True Rally With Halving",
    "url": "https://www.newsbtc.com/bitcoin-news/cantor-ceo-makes-gold-and-bitcoin-etfs-comparison-foresees-true-rally-with-halving/",
    "description": "In a highly anticipated development, the United States Securities and Exchange Commission (SEC) granted regulatory approval for 11 spot Bitcoin ETFs, sparking excitement within the crypto community.  However, despite initial expectations of a significant price surge, the Bitcoin market has experienced an 8% price drop since the ETFs began trading. Bitcoin ETFs To Unfold Impact Over Time?  Drawing a comparison with the launch of the first Gold ETF, Cantor Fitzgerald Asset Management CEO, Howard Lutnick, noted that the immediate rush to buy the asset did not materialize. Lutnick remarks that historical data from the launch of the Gold ETF, SPDR Gold Shares (GLD), reveals that substantial price appreciation took place over several years.  When GLD was introduced in November 2004, the price of gold stood at around $700. By December 2023, it had surged to an all-time high of $2,145. The gold market capitalization, estimated at $1 trillion to $2 trillion pre-ETF approval, ballooned to $16 trillion within a few years. Likewise, despite the initial hype surrounding the spot Bitcoin ETFs, experts suggest that the true impact of these ETFs will unfold over an extended period.  Related Reading: Bitwise CIO Equates Bitcoin ETF Impact To 1.4 Halvings: What This Means As reported by NewsBTC, market analysts at CoinShares estimate that the United States possesses around $14.4 trillion in addressable assets.  Assuming a conservative scenario where 10% of these assets invest in a spot Bitcoin ETF with an average allocation of 1%, it could potentially result in approximately $14.4 billion inflows within the first year. These significant inflows have the potential to propel the Bitcoin price to new highs and initiate a notable price uptrend. However, as Cantor CEO Howard Lutnick predicted, the halving event, expected to occur in April, remains the primary catalyst for Bitcoin&#8217;s growth. Dual Catalysts For Crypto Market Enthusiasm As the Bitcoin halving event approaches, analysis of past halvings reveals a pattern of substantial rallies leading up to the event, followed by a brief correction and consolidation period before a major bull run and peak. The peak typically occurs approximately 18 months after each halving, showcasing a consistent trend. The first halving occurred on November 28, 2012, reducing the block reward from 50 BTC to 25 BTC. At the time of the halving, the Bitcoin price was around $13.  However, within a year, it reached a peak of $1,152. Despite a subsequent fall in price to nearly $200 in 2015, critics declared the bursting of a bubble and the demise of Bitcoin. Yet, this trend would repeat in subsequent halving cycles. Related Reading: Crypto Community Raises Alarm Over Coinbase’s Dominance Of Bitcoin Held In Spot ETFs The second halving occurred on July 16, 2016, reducing the block reward to 12.5 BTC. At the time, Bitcoin was valued at $664.  The following year saw a peak of $17,760. Similarly, the third halving occurred on May 11, 2020, lowering the block reward to 6.25 BTC. Bitcoin was priced at $9,734 during the halving and peaked at $69,000 the following year. Based on the historical cycles, it is evident that the upcoming halving scheduled for April 2024 will be a significant catalyst for Bitcoin. However, it is important to note that Bitcoin ETFs will also play a crucial role.  These ETFs are expected to positively impact the cryptocurrency&#8217;s price and bring new inflows and interest to the crypto market. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-16T20:06:46.000Z",
    "title": "Dogecoin News: Elon Musk’s X Payments Scores Money Transmitter License in Utah – Bullish for DOGE?",
    "url": "https://www.crypto-news-flash.com/dogecoin-news-elon-musks-x-payments-scores-money-transmitter-license-in-utah-bullish-for-doge/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-news-elon-musks-x-payments-scores-money-transmitter-license-in-utah-bullish-for-doge",
    "description": "<img width=\"1806\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Dogecoin-DOGE-logo-with-blue-and-white-trading-chart-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Dogecoin-DOGE-logo-with-blue-and-white-trading-chart-background.\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Dogecoin-DOGE-logo-with-blue-and-white-trading-chart-background.jpg 1806w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Dogecoin-DOGE-logo-with-blue-and-white-trading-chart-background-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Dogecoin-DOGE-logo-with-blue-and-white-trading-chart-background-1024x680.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Dogecoin-DOGE-logo-with-blue-and-white-trading-chart-background-768x510.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Dogecoin-DOGE-logo-with-blue-and-white-trading-chart-background-1536x1021.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Dogecoin-DOGE-logo-with-blue-and-white-trading-chart-background-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Dogecoin-DOGE-logo-with-blue-and-white-trading-chart-background-450x299.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Dogecoin-DOGE-logo-with-blue-and-white-trading-chart-background-1200x797.jpg 1200w\" sizes=\"(max-width: 1806px) 100vw, 1806px\" />X Payments LLC, led by Elon Musk, secures a Money Transmitter License in Utah, advancing its digital banking ambitions in the United States. Despite licenses in multiple states, X Payments hasn&#8217;t activated its payment gateway yet, with no confirmed launch date.  X Payments LLC, a company under the leadership of tech mogul Elon Musk, has [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-16T19:59:44.000Z",
    "title": "Gold Price Soared 350% Post-ETF Approval: Is Bitcoin (BTC) Next to Rocket to $150,000?",
    "url": "https://www.crypto-news-flash.com/gold-price-soared-350-post-etf-approval-is-bitcoin-btc-next-to-rocket-to-150000/?utm_source=rss&utm_medium=rss&utm_campaign=gold-price-soared-350-post-etf-approval-is-bitcoin-btc-next-to-rocket-to-150000",
    "description": "<img width=\"1897\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Stacked-bitcoin-BTC-coins-with-computer-trading-chart-in-the-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Stacked-bitcoin-BTC-coins-with-computer-trading-chart-in-the-background\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Stacked-bitcoin-BTC-coins-with-computer-trading-chart-in-the-background.jpg 1897w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Stacked-bitcoin-BTC-coins-with-computer-trading-chart-in-the-background-300x190.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Stacked-bitcoin-BTC-coins-with-computer-trading-chart-in-the-background-1024x648.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Stacked-bitcoin-BTC-coins-with-computer-trading-chart-in-the-background-768x486.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Stacked-bitcoin-BTC-coins-with-computer-trading-chart-in-the-background-1536x972.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Stacked-bitcoin-BTC-coins-with-computer-trading-chart-in-the-background-150x95.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Stacked-bitcoin-BTC-coins-with-computer-trading-chart-in-the-background-450x285.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Stacked-bitcoin-BTC-coins-with-computer-trading-chart-in-the-background-1200x759.jpg 1200w\" sizes=\"(max-width: 1897px) 100vw, 1897px\" />U.S. approves Bitcoin ETFs, sparking hopes for widespread cryptocurrency investment. Success of gold ETFs in the past draws parallels, with Bitcoin potentially reaching $100,000. Bitcoin Exchange-Traded Funds (ETFs) have recently secured regulatory approval in the United States. This milestone has generated tremendous excitement, with investors and industry experts speculating about the potential impact of these [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-16T19:45:10.000Z",
    "title": "UN Says Tether (USDT) Method of Choice for Money Launderers and Fraudsters Operating in South-East Asia",
    "url": "https://dailyhodl.com/2024/01/16/un-says-tether-usdt-method-of-choice-for-money-launderers-and-fraudsters-operating-in-south-east-asia/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/tether-method-of-choice.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/tether-method-of-choice.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/tether-method-of-choice.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/tether-method-of-choice.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/tether-method-of-choice.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/tether-method-of-choice.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/tether-method-of-choice.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Top stablecoin USDT is the method of choice for money launderers and fraudsters in East and Southeast Asia, according to the United Nations Office on Drugs and Crime (UNODC). The UNODC says in a new report that criminals in the region prefer to use the Tether-issued stablecoin on the Tron (TRON) blockchain due to its [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/16/un-says-tether-usdt-method-of-choice-for-money-launderers-and-fraudsters-operating-in-south-east-asia/\">UN Says Tether (USDT) Method of Choice for Money Launderers and Fraudsters Operating in South-East Asia</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-16T19:41:14.000Z",
    "title": "‘It’s a Certainty’ – Ripple CEO Brad Garlinghouse Says Other Crypto Assets Will Get Spot ETFs Just Like Bitcoin",
    "url": "https://dailyhodl.com/2024/01/16/its-a-certainty-ripple-ceo-brad-garlinghouse-says-other-crypto-assets-will-get-spot-etfs-just-like-bitcoin/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/asset-launches-etf-europe.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/asset-launches-etf-europe.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/asset-launches-etf-europe.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/asset-launches-etf-europe.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/asset-launches-etf-europe.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/asset-launches-etf-europe.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/asset-launches-etf-europe.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The chief executive officer (CEO) of Ripple Labs is certain that other cryptos will follow in Bitcoin&#8217;s (BTC) footsteps on their way to spot exchange-traded funds (ETFs). In a new interview with CNBC, Ripple CEO Brad Garlinghouse says the possibility of an Ethereum (ETH) ETF and others is a &#8220;certainty.&#8221; &#8220;It&#8217;s a certainty. I&#8217;m not [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/16/its-a-certainty-ripple-ceo-brad-garlinghouse-says-other-crypto-assets-will-get-spot-etfs-just-like-bitcoin/\">‘It’s a Certainty’ – Ripple CEO Brad Garlinghouse Says Other Crypto Assets Will Get Spot ETFs Just Like Bitcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]