[
  {
    "source": "CoinDesk",
    "date": "2023-06-16T13:50:09.000Z",
    "title": "Crypto Traders Flock to OTC Markets as Exchange Liquidity Dries Up Amid Regulatory Clampdown",
    "url": "https://www.coindesk.com/business/2023/06/16/crypto-traders-flock-to-otc-markets-as-exchange-liquidity-dries-up-amid-regulatory-clampdown/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "crypto traders flock to OTC"
  },
  {
    "source": "Decrypt",
    "date": "2023-06-16T13:57:38.000Z",
    "title": "Jack Dorsey Pledges $5M to Help Bitcoin Core Developers",
    "url": "https://decrypt.co/144932/jack-dorsey-pledges-5m-to-help-bitcoin-core-developers",
    "description": "The funding will come from his charity, Start Small, and will be disbursed $1 million at a time over the next five years."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-16T13:53:12.000Z",
    "title": "USDT issuer Tether responds to Chinese securities exposure reports",
    "url": "https://cointelegraph.com/news/usdt-tether-responds-to-chinese-securities-reports",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/e33a0285-0991-4965-a80f-7abaa80e53be.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>USDT issuer Tether said that they “do not condone” the behavior of the media outlets and highlighted that the materials presented do not reflect what Tether is at present. </p>\n                    <p><p>Stablecoin-issuer Tether has published a lengthy response to the reports that highlighted that the reserves of Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>), one of the largest stablecoins, once included securities issued by Chinese companies. </p><p>On June 16, mainstream media outlets like Bloomberg cast doubts on USDT by highlighting that the company once used held securities issued by Chinese state-owned firms. Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2023-06-16/biggest-crypto-stablecoin-was-once-backed-by-chinese-securities#xj4y7vzkg\" target=\"_blank\" rel=\"noopener nofollow\">cited</a> documents released by New York’s Attorney General (NYAG) and highlighted that USDT was once backed by securities from firms like the Industrial &amp; Commercial Bank of China, China Construction Bank Corp. and Agricultural Bank of China. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Everything You Need To Know About What We Shared With NYAG<br><br>Read more <a href=\"https://t.co/0O3P1tbtYq\">https://t.co/0O3P1tbtYq</a> <a href=\"https://t.co/pegeX2uNBN\">pic.twitter.com/pegeX2uNBN</a></p>&mdash; Tether (@Tether_to) <a href=\"https://twitter.com/Tether_to/status/1669683640161259520?ref_src=twsrc%5Etfw\">June 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On the same day, the USDT issuer responded to the reports saying that they were done without giving much attention. Tether wrote: </p><blockquote>“Ultimately Bloomberg, CoinDesk or any other media outlet’s decision to present this information to its readers was likely done in haste with little attention to current events or facts.”</blockquote><p>According to Tether, they “do not condone this behavior” and highlighted that their priorities lie with their customers. The stablecoin issuer also noted that the materials obtained by the media outlets do not represent what the company is at the present day. Tether said that the data sent to the media platforms were limited and are more than two years old. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-crypto-exchange-exits-netherlands\"><strong><em>Binance is leaving the Dutch market: Here’s when</em></strong></a></p><p>In addition, Tether also clarified that its exposure to Chinese commercial papers was liquid and all of the issuers were stable. The company also highlighted that the papers were also being used by some of the world’s biggest investment managers. “The Chinese banking-related commercial paper at issue was rated A1 or better,” they added. </p><p>The stablecoin issuer also noted that its exposure to commercial paper holdings was reduced to zero last year. According to Tether, they did not lose any money on any commercial paper. This includes commercial papers issued by Chinese firms. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-16T13:55:41.000Z",
    "title": "French authorities have been investigating Binance since February 2022",
    "url": "https://cryptoslate.com/french-authorities-have-been-investigating-binance-since-february-2022/",
    "description": "<p>French authorities have been investigating Binance for multiple alleged infractions since February 2022, according to a local news report. The Paris public prosecutor&#8217;s office told local media that the investigation against the largest crypto exchange is two-pronged. First, authorities are looking into whether Binance solicited French users and thereby operated without a license in the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/french-authorities-have-been-investigating-binance-since-february-2022/\">French authorities have been investigating Binance since February 2022</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-16T13:45:00.000Z",
    "title": "Dogecoin (DOGE) Price Analysis: Uwerx (WERX) Reaches Summit; Bleak DOGE Social Sentiment Raises Questions About Price Reversal",
    "url": "https://cryptodaily.co.uk/2023/06/dogecoin-doge-price-analysis-uwerx-werx-reaches-summit-bleak-doge-social-sentiment-raises-questions-about-price-reversal",
    "description": "<p>Dogecoin (DOGE) joins the list of several other tokens caught up in the price drops due to the recent US Securities and Exchange Commission&rsquo;s (SEC) lawsuit.&nbsp;</p>\n<p>Crypto analysts study the charts to see what this means for the meme coin while also discovering a new token, rising against all odds&mdash;Uwerx.&nbsp;</p>\n<p>This article explores what the SEC lawsuit could mean for Dogecoin (DOGE) while exploring the unique benefits Uwerx has to offer its users.&nbsp;</p>\nDogecoin (DOGE): The Fate of the Meme Coin\n<p>Dogecoin (DOGE), like several other tokens, has been caught in the SEC lawsuit against Binance and Coinbase. While several media platforms spread uncertainty and fear regarding Dogecoin (DOGE), crypto analysts take a different approach to the token&rsquo;s price predictions.</p>\n<p>Most media outlets have communicated that the recent sell-offs and price drops in Dogecoin (DOGE) forewarn investors of an even bleaker future. But crypto analysts have stated that the sell-offs and price drops were not driven by long-term traders but by short-term investors.&nbsp;</p>\n<p>According to industry experts, the fate of Dogecoin (DOGE) in the crypto market is less bleak than media outlets will lead most to believe.&nbsp;</p>\n<p>Today, Dogecoin (DOGE) sells at $0.061421, with a live market cap of $8,554,931,776. Dogecoin&rsquo;s (DOGE) market supply is presently at 139,736,336,384 DOGE. Due to market sentiments, Dogecoin (DOGE) is predicted to reach $0.092 by 2024.</p>\nUwerx (WERX): A Brighter Future\n<p>Uwerx is positioned to be the leading freelance platform globally. Uwerx is set to be different and preferable compared to other freelancing platforms. Considering Uwerx&rsquo;s increasing numbers, one might state that Uwerx is already meeting its goals.</p>\n<p>With over 6,200 sign-ups on the Uwerx platform, over 1,600 followers on Twitter, and over 1,600 subscribers to the Telegram community, the Uwerx platform is growing beyond all expectations. While other platforms might take this as a sign to work less hard, the Uwerx team remains unrelenting. With the current listing on CoinSniper and the scheduled Uwerx listing on Uniswap by the 1st of August, the Uwerx Team is doing all it can to ensure that Uwerx reaches its target audience.</p>\n<p>The confidence of the Uwerx team in expanding its reach can be traced to several factors. Firstly, Uwerx has successfully passed its audit approval by InterFi Network and SolidProof. This implies that the platform is excellent by all standards in the industry. In addition, Uwerx is set to only offer a 1% transaction fee, a very affordable fee compared to Upwork and Fiverr&rsquo;s 10 and 20%.&nbsp;</p>\n<p>Uwerx will also be offering its users incentivization and gamification features to serve as more motivation for their work. Uwerx will also put a 25-year liquidity lock in place for its tokens. Uwerx team tokens are included in the mix as team tokens have already been locked for nine months, further assuring Uwerx users of the security and stability of their tokens. Once Uwerx is unveiled on the 4th of August, 2023, contract ownerships will be renounced, thus eliminating the likelihood of scams and fraud.</p>\n<p>The Uwerx Vault has now been unveiled, allowing Uwerx users to store their tokens securely, just like staking, as they get rewarded dependent on the variables existing within the platform. The&nbsp; Alpha platform has also been unveiled, and Uwerx will soon be transitioning from the Alpha Platform to the Beta platform, allowing Uwerx users to test the platform for themselves. The Uwerx team encourages users to send their feedback via email to the Uwerx team at feedback@uwerx.network.&nbsp;</p>\n<p>On the 31st of July, 2023, when Uwerx&rsquo;s presale ends, WERX token holders will receive their tokens in a 6-week vesting period. Uwerx will also carry out a Test Airdrop when the Uwerx presale ends.&nbsp;</p>\nUwerx (WERX) Presale: Beyond the Stars\n<p>The Uwerx team has been in awe of Uwerx&rsquo;s incredible growth and sell-out of its presale. The first four stages of Uwerx&rsquo;s presale were all sold out in a very short time. The Uwerx team has also had to modify the critical token allocations due to the high demands for Uwerx.</p>\n<p>WERX tokens sell at $0.041 per token with a 15% bonus on all purchases. Considering that Uwerx will be launched officially on the 4th of August, this price is bound to increase soon.&nbsp;</p>\n<p>Click on any of the links to purchase your WERX tokens at $0.041 per token with a 15% bonus on your purchases.</p>\n<p>Presale:&nbsp; invest.uwerx.network</p>\n<p>Telegram: https://t.me/uwerx_network</p>\n<p>Twitter: https://twitter.com/uwerx_network</p>\n<p>Website: https://www.uwerx.network/</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T13:51:52.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T13:44:20.000Z",
    "title": "Sotheby’s auction nets $10.9M from confiscated NFT artwork",
    "url": "https://www.cryptopolitan.com/sothebys-auction-nets-10-9m-confiscated-nft/",
    "description": "Sotheby&#8217;s completed a second auction of non-fungible token (NFT) artwork from bankrupt hedge fund Three Arrows Capital, generating over $10.9 million in sales. The collection, featuring works by renowned generative artists, saw high-profile sales, including &#8220;The Goose&#8221; by Dmitri Cherniak, which sold for $6.2 million. &#8220;The Goose&#8221; NFT sells for $6.2m in heated bidding A ... <a title=\"Sotheby&#8217;s auction nets $10.9M from confiscated NFT artwork\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sothebys-auction-nets-10-9m-confiscated-nft/\" aria-label=\"More on Sotheby&#8217;s auction nets $10.9M from confiscated NFT artwork\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-16T14:00:10.000Z",
    "title": "Avorak preempts the US rejection of crypto by not forming US company before clear regulations",
    "url": "https://nulltx.com/avorak-preempts-the-us-rejection-of-crypto-by-not-forming-us-company-before-clear-regulations/",
    "description": "Amidst the SEC chaos, Avorak AI elicits a proactive approach to navigate the uncertain regulatory environment in the United States. Recognizing the potential complexities and challenges arising from unclear regulations, Avorak abstained from forming a company within the United States until regulatory clarity was achieved. As such, Avorak demonstrated a forward-thinking mindset and a commitment [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-16T14:00:45.000Z",
    "title": "Will Shiba Inu Price Soar? Tradecurve Set For Another Price Increase This Week",
    "url": "https://www.crypto-news-flash.com/will-shiba-inu-price-soar-tradecurve-set-for-another-price-increase-this-week/?utm_source=rss&utm_medium=rss&utm_campaign=will-shiba-inu-price-soar-tradecurve-set-for-another-price-increase-this-week",
    "description": "The crypto market is yet to recover from the 2022 crypto market winter which sent numerous tokens including Shiba Inu nose diving into the red region. Meanwhile, the Shiba Inu community is counting on the Shibarium project and increased burn rate to spark a crypto rally. This week, all eyes are on another project, Tradecurve&#8217;s [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-16T13:52:29.000Z",
    "title": "Polkadot Launches OpenGov: A New Era of Community Governance and Autonomy",
    "url": "https://www.crypto-news-flash.com/polkadot-launches-opengov-a-new-era-of-community-governance-and-autonomy/?utm_source=rss&utm_medium=rss&utm_campaign=polkadot-launches-opengov-a-new-era-of-community-governance-and-autonomy",
    "description": "The Polkadot network shared the exciting news on Twitter, highlighting the arrival of Polkadot OpenGov. OpenGov serves a dual purpose by empowering DOT holders and safeguarding the network.  Polkadot, a blockchain platform focused on Web3 interoperability, celebrated a major milestone with the launch of OpenGov. The Polkadot network shared the exciting news on Twitter, highlighting [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-16T14:05:00.000Z",
    "title": "Ripple, Peersyst Partner With Colombian Central Bank for Blockchain Project",
    "url": "https://coinedition.com/ripple-peersyst-partner-with-colombian-central-bank-for-blockchain-project/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Ripple-Peersyst-Partner-With-Colombian-Central-Bank-for-Blockchain-Project-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple, Peersyst Partner With Colombian Central Bank for Blockchain Project\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Ripple-Peersyst-Partner-With-Colombian-Central-Bank-for-Blockchain-Project-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Ripple-Peersyst-Partner-With-Colombian-Central-Bank-for-Blockchain-Project-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Ripple-Peersyst-Partner-With-Colombian-Central-Bank-for-Blockchain-Project.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Ripple and Peersyst Technology are partnering with the Central Bank of Colombia. The partnership will explore blockchain technologies and use cases in the country. The project will be supervised by the Directorate of Digital Government, MinTIC. Ripple and Peersyst Technology are partnering with the Central Bank of Colombia to explore blockchain technologies and use cases. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ripple-peersyst-partner-with-colombian-central-bank-for-blockchain-project/\">Ripple, Peersyst Partner With Colombian Central Bank for Blockchain Project</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-16T13:55:31.000Z",
    "title": "GMX Price Prediction 2023-2030: Will GMX Price Hit $100 Soon?",
    "url": "https://coinedition.com/gmx-price-prediction/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2022/12/GMX-GMX-Price-Prediction-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"GMX-(GMX)-Price-Prediction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/GMX-GMX-Price-Prediction-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/GMX-GMX-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/GMX-GMX-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/GMX-GMX-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/GMX-GMX-Price-Prediction-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2022/12/GMX-GMX-Price-Prediction.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The concept of decentralization has grown as users realize its importance as time passes. GMX allows users access to decentralization features through its spot and perpetual exchange. Moreover, GMX enables trading with BTC, ETH, and various other top cryptocurrencies directly from the user&#8217;s wallet. GMX consists of two tokens that help in empowering their ecosystem. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/gmx-price-prediction/\">GMX Price Prediction 2023-2030: Will GMX Price Hit $100 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-16T13:48:00.000Z",
    "title": "Coinbase CLO Paul Grewal Remains Confident Amid SEC Shenanigans",
    "url": "https://coinedition.com/coinbase-clo-paul-grewal-remains-confident-amid-sec-shenanigans/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/coinbase-6-1-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/coinbase-6-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/coinbase-6-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/coinbase-6-1.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Faced with a combative regulator trying to sue the United States’ cryptocurrency industry into oblivion, one could be forgiven for imagining that top lawyers at Coinbase and Binance must have been feeling the heat this week. Not so, says Coinbase CLO Paul Grewal, who claimed that a June 15 meeting of CLOs at the University [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coinbase-clo-paul-grewal-remains-confident-amid-sec-shenanigans/\">Coinbase CLO Paul Grewal Remains Confident Amid SEC Shenanigans</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]