[
  {
    "source": "Decrypt",
    "date": "2024-02-22T21:51:17.000Z",
    "title": "Starknet Price Jumps After Ethereum Scaler Bows to Pressure Over Token Unlock Schedule",
    "url": "https://decrypt.co/218626/starknet-ethereum-scaler-revises-token-unlock-schedule",
    "description": "Starkware creator StarkNet announced Thursday that it will gradually allocate tokens to contributors and investors following backlash."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-22T21:48:44.000Z",
    "title": "‘We're Promising Nothing’: Telegram Game Notcoin Has 25 Million Players and a Soon-to-be-Real Token",
    "url": "https://decrypt.co/218610/telegram-game-notcoin-25-million-players-token",
    "description": "Notcoin players have mined trillions of virtual coins by tapping in Telegram. Co-creator Sasha Plotvinov explains what comes next."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-22T21:43:47.000Z",
    "title": " Nayib Bukele’s party takes supermajority in legislature amid voter fraud allegations ",
    "url": "https://cointelegraph.com/news/el-salvador-nayib-bukele-party-supermajority-legislature",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZWFiMzJiYTQtZjJlZS00MWJhLTkwMmEtYTYwNGEzZjgzOTBlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The El Salvador president claimed victory before the official results were released, but opposition groups have alleged voter fraud and manipulation.</p>\n                    <p><p>New Ideas, the ruling party of reelected pro-Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) El Salvador President <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/nayib-bukele\">Nayib Bukele</a>, has secured a supermajority of seats in the country’s legislature.</p><p>On Feb. 20, the body overseeing El Salvador’s elections <a href=\"https://info2024.tse.gob.sv/noticia/2024/El-Organismo-Colegiado-informa-resultados-de-elecci%C3%B3n-legislativa\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> the New Ideas party had won 54 out of the 60 seats in the legislature, ensuring Bukele would have the political means to continue his agenda. The results were part of the country’s elections held on Feb. 4. Bukele <a href=\"https://cointelegraph.com/news/el-salvador-exit-polls-show-nayib-bukele-to-win-election\">claimed victory on Feb. 5</a> before the official results were released, suggesting the New Ideas party had won 58 seats instead of 54.</p><p>Despite the president’s claims of victory in the legislature, opposition groups have been calling for the results to be voided, alleging voter fraud. Vamos, Nuestro Tiempo and Nationalist Republican Alliance reportedly <a href=\"https://diario.elmundo.sv/politica/vamos-nt-y-arena-piden-al-tse-nulidad-de-elecciones-legislativas-porque-se-falseo-voluntad-popular\" target=\"_blank\" rel=\"noopener nofollow\">found</a> 69 “anomalies” in the electoral process. The Farabundo Marti National Liberation Front party <a href=\"https://www.elsalvador.com/noticias/nacional/fmln-tambien-pide-la-nulidad-de-elecciones-legislativas/1124184/2024/\" target=\"_blank\" rel=\"noopener nofollow\">made</a> similar fraud and voter manipulation allegations.</p><p><a href=\"https://cointelegraph.com/news/el-salvador-nayib-bukele-party-supermajority-legislature\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-22T22:00:17.000Z",
    "title": "Congressman Emmer raises concerns over Biden administration’s “information collection regime” targeting BTC miners",
    "url": "https://cryptoslate.com/congressman-emmer-raises-concerns-over-biden-administrations-information-collection-regime-targeting-btc-miners/",
    "description": "<p>House Majority Whip Tom Emmer warned on Feb. 22 that government agencies under the Biden administration are beginning to collect data on Bitcoin mining firms. In a letter to the Office of Management and Budget (OMB), Emmer acknowledged that the OMB approved and expedited a request from the Energy Information Administration (EIA) that imposes a [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/congressman-emmer-raises-concerns-over-biden-administrations-information-collection-regime-targeting-btc-miners/\">Congressman Emmer raises concerns over Biden administration&#8217;s &#8220;information collection regime&#8221; targeting BTC miners</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-22T21:40:25.000Z",
    "title": "Reddit holds Bitcoin, Ether, Matic on balance sheet per IPO filing",
    "url": "https://crypto.news/reddit-bitcoin-ether-matic-ipo-filing/",
    "description": "Reddit said it acquired major cap cryptocurrencies, including Bitcoin, for varying reasons and has received digital asset payments for limited services since at least 2022. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-22T22:00:36.000Z",
    "title": "Analyst: Bitcoin Has Never Been This Bullish, What’s Next?",
    "url": "https://www.newsbtc.com/bitcoin-news/analyst-bitcoin-has-never-been-this-bullish-whats-next/",
    "description": "While Bitcoin treads water around $50,000, with some predicting a slump, one analyst on X is swimming against the current, claiming the coin has &#8220;never been this bullish.&#8221; The coin is bullish despite cooling off from 2024 highs above $54,000. Analyst: Bitcoin Is Bullish, Here&#8217;s Why The analyst Mags argues that Bitcoin is, at spot rates, defying historical patterns and showing bullish signals, especially looking at the candlestick arrangements. Specifically, Bitcoin recently closed a weekly candle above the 0.618 Fibonacci level before the next halving event. Mags said this is the first time in the four-year cycle.  Related Reading: Ethereum Breaks Back Above $3,000, Will FOMO Lead To Top Again? Therefore, though Bitcoin prices have been moving horizontally in the past few trading days, with fears of price slumps, the development in the weekly chart is overly bullish. Further bolstering their optimism, Mags points to the increasing demand for Bitcoin from institutional investors following the launch of spot Bitcoin exchange-traded funds (ETFs).  Wall Street heavyweights, including Fidelity, issue some of these products. BitMEX Research data shows that spot ETFs continue to siphon more and more coins from circulating supply, sending them to custodians, like Coinbase Custody, for safekeeping. These coins will likely be released in the coming years, not months. Besides institutional interest, optimism for more price gains also stems from the absence of retail interest at spot rates. Data from Coinbase shows that unlike the spike in interest that drove Bitcoin to $70,000, mainly at the back of retailers, BTC prices are up, but the dynamics are changing.  Will Retailers Take BTC To New Levels? Solid data reveals that retailers are mostly not interested in the coin at spot rates, looking at the amount retailers have been spending on the coin. By Q4 2021, retailers acquiring Bitcoin via Coinbase spent roughly $177 billion. However, this figure sharply fell throughout 2022 during the bear market, finding support in H2 2023. Related Reading: Is Ripple Dumping Millions Of XRP? CTO Addresses Reasons Behind $34 Million Transaction Then, according to exchange data shared by Will Clemente on X, retailers began loading the coin from Q3 2023. The figure has risen to around $39 billion in Q1 2024&#8211;less than 25% of Q4 2021 volumes. How retailers will impact the price of Bitcoin in the future is yet to be seen. In the past, retail fear of missing out (FOMO) has been a critical price driver. Presently, CoinStats sentiment tracker, Fear &#38; Greed indicator, stands at 74, at &#8220;greed&#8221; territory, down from &#8220;extreme greed&#8221; on February 22. This reduction could be possible because of the fake breakout that lifted Bitcoin above $53,000. The coin has support at $50,500 but generally remains in a bullish pattern. Feature image from DALLE, chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-22T21:42:00.000Z",
    "title": "Former SEC Attorney Joins Pro-Crypto Law Firm As a Defendant",
    "url": "https://coinedition.com/former-sec-attorney-joins-pro-crypto-law-firm-as-a-defendant/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/How-Large-Is-the-SEC-Cast-Net-Radius.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Former SEC Attorney Joins Pro-Crypto Law Firm As a Defendant\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/How-Large-Is-the-SEC-Cast-Net-Radius.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/How-Large-Is-the-SEC-Cast-Net-Radius-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/How-Large-Is-the-SEC-Cast-Net-Radius-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/How-Large-Is-the-SEC-Cast-Net-Radius-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/How-Large-Is-the-SEC-Cast-Net-Radius-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/How-Large-Is-the-SEC-Cast-Net-Radius-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Former SEC enforcement attorney Ladan Stewart has joined the Global law firm White &#038; Case LLP. Stewart would henceforth counsel crypto industry players and defend them against regulatory or private actions. Joel Cohen believes the firm would explore Stewart’s capacity based on her former role at the SEC. Former U.S. Securities and Exchange Commission (SEC) [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/former-sec-attorney-joins-pro-crypto-law-firm-as-a-defendant/\">Former SEC Attorney Joins Pro-Crypto Law Firm As a Defendant</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]