[
  {
    "source": "Decrypt",
    "date": "2023-08-17T12:13:53.000Z",
    "title": "Philippine National Police Issues Warning Against Play-to-Earn Crypto Games",
    "url": "https://decrypt.co/152787/philippine-national-police-issues-warning-against-play-to-earn-crypto-games",
    "description": "Besides scams and hacks, Philippines' authorities have also warned of the expensive barrier to entry for some play-to-earn crypto games."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-17T12:15:00.000Z",
    "title": "Open Campus, TinyTap, and Code Green Tackle Climate Change",
    "url": "https://cryptodaily.co.uk/2023/08/open-campus-tinytap-and-code-green-tackle-climate-change",
    "description": "<p>&nbsp;</p>\n<p>The latest partnership is an extension of Open Campus&rsquo; mission to educate and raise awareness on issues of climate change and environmental conservation.&nbsp;</p>\n<p>This July, Open Campus, a community-led Web 3 educational content platform, announced the launch of their #ClimateChange4Kids campaign on X (formerly Twitter) to educate the upcoming generations on the importance of protecting our planet. To extend its efforts, Open Campus is now in partnership with its affiliate, TinyTap and Code Green, a Web 3 organization leveraging blockchain and art to help conserve the environment, to create educational content on climate change.&nbsp;</p>\n<p>The strategic partnership aims to extend knowledge and awareness of climate change via the Open Campus platform, providing creators, educators and teachers with a decentralized platform to create interactive educational games and earn from their content.&nbsp;</p>\n<p>While several parts of the world face extreme temperatures and wildfires, such an initiative could be a crucial step in imparting knowledge on how to stop it.&nbsp; Code Green, TinyTap and Open Campus come together in a mission to educate younger generations &ndash; in an engaging and interactive way &ndash; on climate change. Furthermore, the initiative extends the belief in &ldquo;the power of education to shape a more sustainable future&rdquo;, a mission also shared by the&nbsp; United Nations Convention to Combat Desertification (UNCCD).&nbsp;</p>\n\n<p>\"By combining education, technology, and gaming, we're creating a unique platform to engage children and empower them with the knowledge and awareness to tackle this urgent crisis for our planet,&rdquo; Inna Modja, CEO of Code Green and Goodwill Ambassador for the UNCCD, said.</p>\n\nOpen Campus, TinyTap and Code Green launch NFT Giveaway&nbsp;\n<p>In light of the new collaboration, TinyTap will create a new climate change-centred course and integrate some elements of Code Green&rsquo;s game HEALV3RSE, available on The Sandbox. Featured on the UNCCD website, HEALV3RSE is a metaverse game that allows users to play, learn about the planet, and have a real-world impact. The game&rsquo;s avatars and NFT will feature in the lessons to incentivize learners and enhance the overall quality of the course, the press statement reads.&nbsp;</p>\n<p>Through various levels of the game, players discover facts about the environment, make eco-friendly choices to help their virtual planet and perform healing actions. The &lsquo;Play To Heal&rsquo; model enhances the game and gives players a novel experience as they participate in healing actions for our planet, such as planting trees, cleaning oceans, and installing solar panels.&nbsp;</p>\n<p>In addition, Open Campus and Code Green are launching a giveaway to promote the new course. Players who participate in the giveaway campaign have a chance to win up to 100 HEALV3RSE avatars and equipment NFTs. Follow-up details on the giveaway will be posted on Open Campus X (fmr. Twitter) page.</p>\n<p>The latest strategic partnership follows the successful launch of &lsquo;Climate Change for Kids&rsquo; in July, aiming to enhance awareness of climate change, especially in younger generations. The #ClimateChange4Kids initiative has seen tremendous support worldwide, with over 200,000 impressions on X. Lastly, Open Campus&rsquo; recent partnership with Cloud Co Entertainment saw the company get a license to use the image of Care Bears, one of the most popular children's products line.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T12:37:22.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 How much is MATIC worth? The current price of Polygon is $0.62. Over the past 24 hours, it has seen a trading volume of $1.16 billion. With a market capitalization of $6.15 billion, Polygon holds a market dominance of 0.51%. However, the MATIC price has experienced a decrease of 1.41% in ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T12:28:06.000Z",
    "title": "Norway central bank hikes rate to 4% to combat high inflation",
    "url": "https://www.cryptopolitan.com/norway-central-bank-hikes-rate/",
    "description": "The Norway central bank announced its decision to increase the primary interest rate by twenty-five basis points in response to elevated inflation on Thursday. This move by Norges Bank takes the rate to 4%, a threshold not seen since 2008. The central bank pointed out that despite a slight decrease, inflation, which soared to 5.4% ... <a title=\"Norway central bank hikes rate to 4% to combat high inflation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/norway-central-bank-hikes-rate/\" aria-label=\"More on Norway central bank hikes rate to 4% to combat high inflation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T12:18:03.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the series of delisting fuelled by the ongoing United States SEC crackdown on major crypto platforms. Basically, it&#8217;s crypto winter in the summer as it stands. How do Cardano Price Prediction analysts steer in this turbulent crypto weather? ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T12:09:55.000Z",
    "title": "Is China doing anything to fix its economy?",
    "url": "https://www.cryptopolitan.com/is-china-doing-anything-to-fix-its-economy/",
    "description": "China, the globe&#8217;s second-largest powerhouse, appears to be on the edge of an economic precipice, with indications of a prolonged slump looming ominously on the horizon. To the consternation of many, a spiraling property conundrum casts a shadow on its financial stability. Yet, the world watches, eyebrow raised, as this colossal nation seemingly hesitates in ... <a title=\"Is China doing anything to fix its economy?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/is-china-doing-anything-to-fix-its-economy/\" aria-label=\"More on Is China doing anything to fix its economy?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-17T12:25:06.000Z",
    "title": "Crypto Payments Gain Ground In Canada As Confidence Grows",
    "url": "https://www.newsbtc.com/crypto/crypto-payments-in-canada/",
    "description": "A recent study by the Bank of Canada (BoC) revealed that crypto ownership in the country had slowed over the past two years. However, recent sentiment from Coinbase’s Country Director for Canada, Lucas Matheson, suggests Canadians are slowly warming up to crypto again.  Canadians Adopting Crypto Payments In a conversation with Cointelegraph, Matheson mentioned that Canadians’ outlook towards digital assets is changing as they adopt it to make daily transactions. This means that crypto in the country is garnering mass adoption as service providers and consumers are using it to facilitate payment of goods and services.  Related Reading: Shiba Inu DAO Gets Serious With New Advisory And Investment Firm Furthermore, Matheson believes that more daily use cases will arise that will be “digital asset-backed.” This belief could stem from the fact that the tokenized industry is rapidly growing with many real-world assets (RWA) being brought on-chain.  Many industries are expected to be disrupted with the help of blockchain technology and non-fungible tokens (NFTs). The E-commerce industry is one that Matheson has singled out to be significantly impacted by NFTs. He said the major use case would be “phygital” items, where fashion brands create the tokenized version of their physical products. Popular brands like Nike and Lacoste are known to have ventured into the metaverse with the introduction of their tokenized wear.  Coinbase And Key Regulations Integral Matheson emphasized the importance of regulatory certainty and how Coinbase is contributing to the crypto industry&#8217;s growth in Canada. According to him, the crypto exchange was working closely with the Canadian authorities to build trust and help them understand the role of digital assets in building a sustainable economy. Coinbase officially launched in the Canadian market on August 14. The company announced that it had partnered with local banks and payment platforms to ensure easy fiat on-ramp and make crypto more accessible to Canadians. Furthermore, Coinbase rolled out its Interac payment rails to enable local users “seamlessly deposit and withdraw funds (CAD) to and from their Coinbase wallets…” Meanwhile, Canada’s lawmakers have shown commitment to backing the crypto industry in the country by providing regulatory certainty to stakeholders in the industry. In June, the Canadian House of Commons Parliamentary Standing Committee on Industry and Technology published a report highlighting the positive impacts blockchain technology could have on the economy and the need to provide regulatory clarity and protect the interests of consumers.  Related Reading: Executives Of Crypto-Friendly Bank Silvergate Step Down As Lawsuits, Liquidation Rages On The report also proposed an innovative regulatory approach for cryptocurrencies, emphasizing how Canada could become a leader in the crypto economy.  With such efforts from Coinbase accompanied by regulatory certainty, Crypto adoption is bound to grow. Interestingly, the Ontario Securities Commission (OSC) claims that over 30% of Canadians plan to buy crypto by 2024. Market remains highly volatile following FOMC &#124; Source: Crypto Total Market Cap on Tradingview.com Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-17T12:35:03.000Z",
    "title": "Dogecoin (DOGE) and Ripple (XRP) Plummet to Lowest Levels in Weeks as Bearish Mood Persists",
    "url": "https://www.crypto-news-flash.com/dogecoin-doge-and-ripple-xrp-plummet-to-lowest-levels-in-weeks-as-bearish-mood-persists/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-doge-and-ripple-xrp-plummet-to-lowest-levels-in-weeks-as-bearish-mood-persists",
    "description": "<img width=\"1280\" height=\"866\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/bitcoin-BTC-XRP-SHIB-COINS-CRYPTO.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/bitcoin-BTC-XRP-SHIB-COINS-CRYPTO.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/bitcoin-BTC-XRP-SHIB-COINS-CRYPTO-300x203.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/bitcoin-BTC-XRP-SHIB-COINS-CRYPTO-1024x693.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/bitcoin-BTC-XRP-SHIB-COINS-CRYPTO-768x520.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/bitcoin-BTC-XRP-SHIB-COINS-CRYPTO-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Dogecoin and XRP continue bearish runs as they fall by 9 percent and 6 percent respectively in the last seven days.  An analyst, however, expects a comeback that could see XRP hitting $8.5 in just a few months.  The crypto market was in the past couple of weeks showing signs of an upward trend with [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-17T12:34:27.000Z",
    "title": "Litecoin and Polygon’s Growth: Yet, VC Spectra Shines Brightest on the Investment Horizon",
    "url": "https://www.crypto-news-flash.com/litecoin-and-polygons-growth-yet-vc-spectra-shines-brightest-on-the-investment-horizon/?utm_source=rss&utm_medium=rss&utm_campaign=litecoin-and-polygons-growth-yet-vc-spectra-shines-brightest-on-the-investment-horizon",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-45.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-45.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-45-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Despite the recent halving event of Litecoin (LTC) and Polygon (MATIC) proposing a token upgrade to their community, VC Spectra (SPCT) has emerged as a standout investment opportunity in the market. Let&#8217;s discover what sets VC Spectra (SPCT) apart from other investment projects in the market. Is it real-life utility or its profitability? &#62;&#62;BUY SPCT [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-17T12:22:22.000Z",
    "title": "Source Network Teams Up with Chainlink BUILD to Drive Web3 Decentralization",
    "url": "https://www.crypto-news-flash.com/source-network-teams-up-with-chainlink-build-to-drive-web3-decentralization/?utm_source=rss&utm_medium=rss&utm_campaign=source-network-teams-up-with-chainlink-build-to-drive-web3-decentralization",
    "description": "<img width=\"1200\" height=\"630\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Chainlink X SWIFT\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-300x158.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-1024x538.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-768x403.jpeg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-351x185.jpeg 351w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-24x13.jpeg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-36x19.jpeg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-48x25.jpeg 48w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Chainlink announced Source Network&#8217;s inclusion in the Chainlink BUILD program via Twitter.  Source Network, a Web3 data management layer, empowers users with ownership.  On Tuesday, Chainlink made an official announcement on Twitter, declaring the inclusion of Source Network into the Chainlink BUILD initiative. Source Network, a Web3-compatible data management layer, empowering end users with data [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-17T12:37:10.000Z",
    "title": "PEPE Bounces from 7-Day Low, Potential Breakout Looms",
    "url": "https://coinedition.com/pepe-bounces-from-7-day-low-potential-breakout-looms/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/a-whale-pepe.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/a-whale-pepe.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/a-whale-pepe-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/a-whale-pepe-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/a-whale-pepe-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/a-whale-pepe-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/a-whale-pepe-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/a-whale-pepe-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/a-whale-pepe-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/a-whale-pepe-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/a-whale-pepe-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/a-whale-pepe-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/a-whale-pepe-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/a-whale-pepe-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/a-whale-pepe-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/a-whale-pepe-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/a-whale-pepe-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Pepe&#8217;s (PEPE) price fell to a 7-day low of $0.000001148 in the last 24 hours as bulls failed to break through the intra-day high of $0.000001265. Despite the initial drop, Pepe&#8217;s price recovered slightly and settled around $0.000001196, a 4.62% drop from the intraday high at press time. This minor rebound suggests that there is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/pepe-bounces-from-7-day-low-potential-breakout-looms/\">PEPE Bounces from 7-Day Low, Potential Breakout Looms</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]