[
  {
    "source": "Cointelegraph",
    "date": "2024-02-12T04:51:17.000Z",
    "title": " Joe Biden posts &#039;laser eyes&#039; meme after Superbowl - but it&#039;s not about Bitcoin ",
    "url": "https://cointelegraph.com/news/joe-biden-posts-bitcoin-laser-eyes-meme-after-superbowl",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYTA5NjU1MmQtZmMxZC00MDQ2LWEzMWEtOWVhNWFlMDJhNmE2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>U.S. President Joe Biden’s laser-eyed social media posts after the Super Bowl are usually seen in online Bitcoin circles, but his meme wasn't about the cryptocurrency.</p>\n                    <p><p>United States President Joe Biden has unintentionally made himself a Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) ambassador, posting a laser-eye emblazoned picture of himself across his X and Instagram profiles.</p><p>The laser eyes phenomenon kicked off as part of a movement across social media to drive Bitcoin’s price to $100,000 by the end of 2021 — a goal that didn’t come to fruition. The most notable laser-eyed personalities once included NFL star <a href=\"https://www.cbsnews.com/boston/news/tom-brady-changes-twitter-picture-to-laser-eyes-for-bitcoin/\" target=\"_blank\" rel=\"noopener nofollow\">Tom Brady</a>, <a href=\"https://twitter.com/ParisHilton/status/1378055896996093954?lang=en\" target=\"_blank\" rel=\"noopener nofollow\">Paris Hilton</a>, and Elon Musk.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/real-life-doge-18-meme-going-to-the-moon/\">Real-life Doge at 18 — Meme that’s going to the moon</a></em></strong></p><p><a href=\"https://cointelegraph.com/news/joe-biden-posts-bitcoin-laser-eyes-meme-after-superbowl\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-12T04:58:16.000Z",
    "title": "Bitcoin Cash Price Solid 15% Gain: Signs Point to Fresh BCH Rally Ahead",
    "url": "https://www.newsbtc.com/analysis/bch/bitcoin-cash-price-gains-282/",
    "description": "Bitcoin Cash price rallied over 15% and broke the $275 resistance. BCH is now facing strong resistance near the $282 zone. Bitcoin cash price started a fresh surge above the $250 resistance. The price is trading above $265 and the 100 simple moving average (4 hours). There is a key bullish trend line forming with support at $258 on the 4-hour chart of the BCH/USD pair (data feed from Kraken). The pair could continue to move up if it clears the $282 resistance zone. Bitcoin Cash Price Rallies Above $270 After forming a base above the $232 level, Bitcoin Cash price started a steady increase. It broke the $245 resistance to enter a positive zone, like Bitcoin and Ethereum. There was a strong increase above the $250 and $265 resistance levels. The price gained over 15% and tested the $282 resistance. A high was formed near $283 and the price is now correcting gains. There was a move below the $275 level. The price tested the 23.6% Fib retracement level of the upward move from the $233 swing low to the $283 high. BCH is now showing positive signs above $260 and the 100 simple moving average (4 hours). Source: BCH/USD on TradingView.com There is also a key bullish trend line forming with support at $258 on the 4-hour chart of the BCH/USD pair. If there is another increase, the price might face resistance near $275. To continue higher, the price must settle above $282. The next major resistance is near $292, above which the price might accelerate higher toward the $300 level. Any further gains could lead the price toward the $320 resistance zone. Fresh Drop in BCH? If Bitcoin Cash price fails to clear the $275 resistance, it could start a fresh decline. Initial support on the downside is near the $265 level. The next major support is near the $258 level or the trend line. It is close to the 50% Fib retracement level of the upward move from the $233 swing low to the $283 high, where the bulls are likely to appear. If the price fails to stay above the $258 support, the price could test the $245 support. Any further losses could lead the price toward the $232 zone in the near term. Technical indicators 4-hour MACD – The MACD for BCH/USD is losing pace in the bullish zone. 4-hour RSI (Relative Strength Index) – The RSI is currently in the overbought zone. Key Support Levels – $265 and $258. Key Resistance Levels – $275 and $282."
  }
]