[
  {
    "source": "Decrypt",
    "date": "2023-06-09T15:21:18.000Z",
    "title": "Lone Star State ‘Will Be Silicon Valley’ of Crypto Thanks to Key Legislative Wins: Texas Blockchain Council President",
    "url": "https://decrypt.co/143962/texas-will-be-silicon-valley-crypto-thanks-key-legislative-wins-texas-blockchain-council-president",
    "description": "With the latest legislative session in Texas done and dusted, Bitcoin miners in the Lone Star state have struck digital gold."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-09T15:20:05.000Z",
    "title": "Kevin O’Leary doesn’t rule out criminal charges for Binance",
    "url": "https://cointelegraph.com/news/kevin-oleary-binance-sec-charges",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/30d46acf-3b7d-424b-b302-2ac43a315a5c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In an interview with Cointelegraph, Kevin O’Leary said he wouldn’t rule out the possibility of more serious charges against Binance and its CEO, Changpeng Zhao. </p>\n                    <p><p>Kevin O’Leary said the Securities and Exchange Commission levied some “serious” allegations in the 136-page charging document the agency issued against Binance on June 5, telling Cointelegraph in an interview that he believes founder and CEO Changpeng Zhao is in a “tough” spot.</p><p>O’Leary, a venture capitalist and CNBC personality known more colorfully as “Mr. Wonderful,” was an investor in crypto exchange FTX <a href=\"https://cointelegraph.com/news/regulators-face-public-ire-after-ftx-collapse-experts-call-for-coordination\">prior to its November collapse</a>, and has been open about <a href=\"https://www.cnbc.com/2022/12/08/ftx-spokesman-kevin-oleary-says-he-lost-15-million-crypto-payday.html\" target=\"_blank\" rel=\"noopener nofollow\">losing</a> $15 million from his gig as a paid spokesman for the company.</p><p>Some observers attribute FTX’s failure to a string of events that followed an exchange on Twitter between its 31-year-old founder and CEO, Sam Bankman-Fried, and Binance CEO Changpeng “CZ” Zhao — who briefly suggested, amid FTX’s collapse, that he was open to bailing the company out. But he quickly ruled out the possibility of making an offer, to Bankman-Fried’s chagrin — and, perhaps, to O’Leary’s bank account.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">You won, <a href=\"https://twitter.com/cz_binance?ref_src=twsrc%5Etfw\">@cz_binance</a>.<br><br>There&#39;s no need to lie, now, about the buyout.<br><br>We initiated conversations around buying you out, and we decided to do it because it was important for our business.<br><br>And while I was frustrated with your &#39;negotiation&#39; tactics, I chose to still do it.</p>&mdash; SBF (@SBF_FTX) <a href=\"https://twitter.com/SBF_FTX/status/1601191234034274304?ref_src=twsrc%5Etfw\">December 9, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>O’Leary nonetheless said he felt sympathy toward the 46-year-old CZ, whom the SEC has targeted with allegations that he mishandled customer funds by transferring them between entities he controlled — including north of $20 billion between Binance and a company called Merit Peak.</p><p>“They’re going after CZ personally,” O’Leary said. “That’s tough. I mean, you have to have a little compassion for him.”</p><p><strong>Cointelegraph: What should investors make of this lawsuit? Is it going to cripple the market? Do regulators have a case?</strong></p><p><strong>Kevin O’Leary: </strong>If you think about why the crypto market is “stuck,” why it’s not advancing, it’s because there’s no new money coming into it. There’s no institutional capital. […] And so, when you see a constant flood of litigation against exchanges and charges by regulators — that just scares away institutional money. </p><p>I think everybody’s figured that out, in addition to the regulators themselves — and the legislators and the lawmakers. They’re tired of the rogue nature of this space. They’re sick and tired of holding hearings when the next guy blows up with $6 billion. Their constituencies are mad. They’re just tired of it.</p><p>There’s no emotional support at all on the Hill [for crypto] anymore, because when it was a nascent<strong> </strong>industry, there was a lot of promise — but now it’s just fraud, and now it’s just opaqueness and lack of transparency and allegations of commingling customer accounts and all of this stuff. This is taking crypto “Mr. Wonderful” three years, and so everybody’s tired of it. They want to change the page. We’re seeing this movie play out every few months now.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-charges-are-a-tax-win-for-ftx-investors-who-lost-cash\"><strong><em>The outcome of SBF’s prosecution could determine how the IRS treats your FTX losses</em></strong></a></p><p>So, if finance is the last shoe to drop, so be it. Let’s get it over with, and we can start afresh. I think there’s a real tonality today within the institutional market about turning the page. If you have to sacrifice a few rogue operators, if these people are going to get charged and have to be litigated, so be it. I mean, we gotta move on.</p><p><strong>CT: We’re seeing a lot of allegations against Binance similar to those against FTX in terms of manufacturing trading volume, encouraging VIP customers to bypass </strong><a href=\"https://cointelegraph.com/news/aml-and-kyc-a-catalyst-for-mainstream-crypto-adoption\"><strong>Know Your Customer requirements</strong></a><strong> with VPNs, and transferring customer funds to the tune of $20 billion to another entity called Merit Peak. And its chief compliance officer even said at one point — according to the SEC — it was “operating as a fking unlicensed securities exchange in the USA.” What do you think are the odds of criminal charges coming out of this?</strong></p><p><strong>KO: </strong>It’s an unknown. But you’ve seen this movie before. Just last November, you saw this movie — they called it <em>FTX Day</em>. This is <em>FTX II</em>. I mean, I don’t know. Nobody knows. It’s all speculation, but these are serious charges, and there are a lot of them. If any of these allegations are true, that’s an extremely difficult place.</p><p>Plus, they’re going after CZ personally. That’s tough. I mean, you have to have a little compassion for him. He’s the founder of the world’s largest exchange. But I think he’s going to run out of oxygen in terms of just what jurisdictions are going to let him operate when the No. 1 regulator on Earth has made these allegations and filed these charges. This is not a good situation. There’s no good news here. I don’t know how anybody could make good news out of this.</p><p><strong>CT: There are two components in the case. Obviously, one is the allegation of misconduct. The second is the more basic element required for the SEC to pursue a case — which is the idea that Binance is a broker-dealer and clearing agency for securities. To that end, it alleged that some big cryptocurrencies are securities, such as Cardano’s ADA, Solana’s SOL and Algorand’s ALGO. How do you feel about that and the future of anything other than Bitcoin and Ether? Would you invest in them at this point?</strong></p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/opinion-barry-silbert-keeps-quiet-as-genesis-goes-down-in-flames\"><strong><em>Barry Silbert keeps quiet as Genesis goes down in flames</em></strong></a></p><p><strong>KO: </strong>Yes. It doesn’t change my investment thesis about crypto. In fact, this encourages me that we’ll get to an endpoint sooner in terms of getting regulation and getting the infrastructure to integrate it with the world’s financial services. I find this a very encouraging development because we’ve really got to turn the page. I’ve said it multiple times. But I’m an investor in Polygon. I’m an investor in Mysten [Labs] and [its token] Sui. I’m an investor in Bitcoin and Ethereum and many others.</p><p>I think the promise of modifying financial services is very intriguing and has great potential. I’m an investor in Circle and a user of it. These are all good advancements. What’s holding us back are the rogue operators and all of these allegations of lack of transparency. […] These charges, to be honest with you — this is getting boring. I mean, it’s just getting boring.</p><p>I’m tired of it. I think most institutional investors are tired of it. It’s just boring, and I’d like to see something else now. And so, if we have to sacrifice a few pioneers, who cares? I mean, it’s not like they didn’t see this coming. I mean, it’s obvious what’s happening here. And I think, at this point, let’s move on.</p><p><strong>CT: Do you see any daylight between the SEC’s case against Coinbase and its case against Binance?</strong></p><p><strong>KO: </strong>The charges are different. Coinbase has a different situation. It’s a public company. Its market cap was decimated [by the SEC suit], and the management there seems to want to keep taking on the SEC over and over and over again.</p><p>I would think at this point, if you’re a shareholder in that company, you may want to make some changes. I don’t think this is working as a strategy. […] I am not optimistic for the management team there.</p><p>I think the winds of change are gonna blow through that boardroom, and probably that’s a good thing. I think investors are done with this. There comes a point where you just have to realize you’re banging your head against a brick wall and you’ve got to resolve your issues with your regulator. You can’t keep doing this over and over and over again. The definition of madness is doing the same thing over and over and over again and expecting a different outcome. At this point, I think it’s over for them too.</p><p>I think we should thank the founders of that company. They were pioneers, but they clearly don’t have the maturity or skill set to operate in a regulated environment. […] I think at this point, they’re gonna have to work something out.</p><p><strong>CT: Do you think there's room after this for FTX to make a return to polite society, or to come out lookin more 'normal'?</strong></p><p><strong>KO:</strong> Well, the narrative on FTX is that it’s in the recovery phase. Allegedly, there's $7.2 billion of the $8 billion [that’s] been found. That's very encouraging. And so I would think we would want to go through the process of distributing that to the shareholders and the account holders and everything else.</p><p><strong>KO:</strong> I think, you know, the question of the allegations of that the comingling of the equity that was brought up in the Senate hearings … the speculation — and I'm one of the people that speculated it — did Binance intentionally bankrupt FTX by stripping their balance sheet of $2 billion in U.S. cash and 580 million in FTT tokens to put their competitor out of business so they could be the global monopoly? That's one scenario. Who knows if it's true? But I guess in impressing these charges and going into discovery, we're gonna learn a lot.</p><p>But again, it's the past. I mean, the, you gotta think about, OK, this is gonna go on and whatever happens, the finance happens, but it's not the future. That’s not the future. The future has great promise. I'm gonna start investing in regulated exchanges all around the world because all of these accounts are gonna have to go somewhere and they're going to want to go to a place where they're allowed to exist without being constantly threatened by regulators. </p><p>I've already invested in WonderFi up in Canada, that’s Bitbuy. I'm looking at a deal in Abu Dhabi. I’m looking in London. There are lots of regulated exchanges that never had a chance to make money because they were being beaten up by global behemoths that had no rules and no regulation and no cost of compliance. That's now shifting. I think it's gonna be interesting. I think you're gonna see, in 24 months, the value of these exchanges start to go up.</p><p><em>This interview was condensed for length and clarity.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-09T15:36:53.000Z",
    "title": "US DOJ charges 2 Russians with laundering over 600k Bitcoin",
    "url": "https://cryptoslate.com/us-doj-charges-2-russians-with-laundering-over-600k-bitcoin/",
    "description": "<p>The U.S. Department of Justice has charged two Russians, Alexey Bilyuchenko and Aleksandr Verner, for conspiring to launder 647,000 Bitcoin (BTC) stolen from their hack of Mt. Gox in 2011, according to a June 9 statement. The DOJ accused them of using their unauthorized access to Mt. Gox servers to transfer BTC to wallets controlled [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/us-doj-charges-2-russians-with-laundering-over-600k-bitcoin/\">US DOJ charges 2 Russians with laundering over 600k Bitcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-09T15:33:56.000Z",
    "title": "Realized losses outpace profits amid market turbulence after Binance, Coinbase lawsuits",
    "url": "https://cryptoslate.com/insights/realized-losses-outpace-profits-amid-market-turbulence-after-binance-coinbase-lawsuits/",
    "description": "<p>Quick Take In the past four days, Glassnode data suggests that Bitcoin holders have seen greater realized loss-taking than realized profit. Realized losses did get smaller throughout the week of June 5, suggesting the Binance lawsuit was a bigger trigger for selling than the Coinbase lawsuit from the SEC. Considering the SEC sued the two [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/realized-losses-outpace-profits-amid-market-turbulence-after-binance-coinbase-lawsuits/\">Realized losses outpace profits amid market turbulence after Binance, Coinbase lawsuits</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-09T15:30:15.000Z",
    "title": "Robinhood pulls the plug on MATIC, SOL, ADA amid SEC crackdown",
    "url": "https://cryptoslate.com/robinhood-pulls-the-plug-on-matic-sol-ada-amid-sec-crackdown/",
    "description": "<p>U.S.-based digital trading app Robinhood announced today that it will end support for three major cryptocurrencies on June 27 — Cardano (ADA), Polygon (MATIC), and Solana (SOL). The company advised users to sell or transfer their holdings before the deadline, at which point the tokens will be automatically sold and converted to buying power on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/robinhood-pulls-the-plug-on-matic-sol-ada-amid-sec-crackdown/\">Robinhood pulls the plug on MATIC, SOL, ADA amid SEC crackdown</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-09T15:13:42.000Z",
    "title": "Vitalik Outlines Three Transitions for Ethereum's future",
    "url": "https://cryptodaily.co.uk/2023/06/vitalik-outlines-three-transitions-for-ethereum-s-future",
    "description": "<p>In a recent blog post, Ethereum co-founder Vitalik Buterin has unveiled a roadmap consisting of three significant technical transitions that he believes are vital for ensuring the long-term success and sustainability of the Ethereum blockchain.</p>\nThree must-implement transitions\n<p>Buterin emphasises that these transitions, namely Layer 2 scaling, wallet security enhancement, and privacy measures, are essential in maintaining Ethereum's decentralised nature and for guaranteeing open and unrestricted access for all users.</p>\n<p>Failure to implement these transitions, warns Buterin, could potentially undermine Ethereum's viability as a robust and widely adopted platform.</p>\nLayer 2 scaling\n<p>The first transition focuses on scaling Layer 2 solutions. Over the past few years, Ethereum has witnessed the emergence of a Layer 2 ecosystem comprising solutions like Optimistic Rollup and Zero Knowledge-Rollup, which have effectively reduced transaction costs. However, as the majority of activities still occur on the main Ethereum network, further maturation and scaling of the Layer 2 space are necessary.</p>\n<p>Buterin highlights the potential consequences of neglecting Layer 2 scaling, including skyrocketing transaction fees during market expansion phases or bullish market trends. Such circumstances may lead users to seek centralised alternatives, posing a threat to Ethereum's decentralisation goals.</p>\n\n<p>\"The absence of the first transition, Layer 2 scaling, would render Ethereum vulnerable, with each transaction costing $3.75 ($82.48 during a bullish market). This would inevitably drive mass-market products to disregard the Ethereum chain and adopt centralized workarounds,\" Buterin explained.</p>\n\nWallet security\n<p>The second transition highlighted by Buterin centres around wallet security. Buterin expresses concern that potential security risks may discourage users from storing their funds and non-financial assets on the Ethereum network, driving them towards centralised exchanges as a safer alternative.</p>\n\n<p>\"Without the second transition, wallet security, Ethereum's success is compromised as users become hesitant to store their funds securely. This could result in a mass migration towards centralized exchanges,\" warns Buterin.</p>\n\n<p>To enhance wallet security, Buterin proposes a shift towards smart contract wallets with advanced features such as social recovery, similar to the concept of account abstraction. These enhanced wallets would offer improved security measures and an enhanced user experience.</p>\nPrivacy\n<p>The third and final transition emphasised by Buterin is privacy. He cautions that the absence of robust data privacy measures may discourage users from utilising Ethereum's capabilities fully. To address this concern, Buterin suggests the implementation of stealth address protocols, which would provide privacy features for Ethereum users.</p>\n<p>By integrating stealth address protocols, Ethereum would be able to offer enhanced privacy options, attracting users who value anonymity and data protection.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-09T15:30:56.000Z",
    "title": "Biggest Movers: SOL Slightly Higher, as XRP Collides With Key Resistance Level",
    "url": "https://news.bitcoin.com/biggest-movers-sol-slightly-higher-as-xrp-collides-with-key-resistance-level/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2149938833-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers:  SOL Nears $20.00, as XRP Collides With Key Resistance Level\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2149938833-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2149938833-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2149938833-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2149938833-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2149938833-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2149938833-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2149938833.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Solana moved towards the $20.00 mark on Friday, despite reports confirming that Robinhood was set to delist the token from its platform. In addition to solana, cardano and polygon were also removed. XRP also trended higher in today&#x2019;s session. Solana (SOL) Solana (SOL) moved close to the $20.00 level on Friday, despite news that Robinhood [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T15:15:36.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-09T15:30:23.000Z",
    "title": "Former SEC Chairman Deserves Appreciation From Ripple, Alderoty States",
    "url": "https://www.newsbtc.com/news/ripple/former-sec-chairman-deserves-appreciation-from-ripple-alderoty-states/",
    "description": "Ripple General Counsel Stuart Alderoty, recently acknowledged the former United States Securities and Exchange Commission (SEC) Chairman, Late Harvey Pitt, in a tweet expressing gratitude towards his contribution.   He added that Ripple owes a debt of gratitude to Harvey for providing a comprehensive description employed by the SEC to enforce compliance with securities laws. Alderoty further cites Pitt&#8217;s argument in the Tetragon vs. Ripple case, stating it is the court&#8217;s responsibility, not the commission&#8217;s, to decide if an asset qualifies as a security. Alderoty Highlights Pitt&#8217;s Report on SEC Lawsuit Process In the tweet, Alderoty added Pitt&#8217;s report in the Tetragon Fin. Grp. vs. Ripple lawsuit as an attachment. The Ripple general counsel drew attention to a comment Pitt made regarding the process of an enforcement action conducted by the SEC. Related Reading: Bitcoin Bearish Signal: Dormant 1,433 BTC Moves After 10+ Years Pitt’s report states an enforcement action begins when the SEC files a lawsuit against an entity in a federal court. He also noted that commissioners that vote to bring an enforcement action are minimally involved once the litigation commences. The former chairman clarified that once the SEC initiates legal proceedings, the commission&#8217;s role shifts to that of an advocate for its stance. Also, he emphasized that the court holds the ultimate authority to determine if the asset in question qualifies as a security. For context, Pitt died in Washington on May 30, 2023, at 78 years, due to a sudden illness. He became the SEC Chairperson in 2001 but resigned after 18 months due to various corporate scandals, including the notorious Enron scandal. Notably, Pitt served as the US Securities and Exchange Commission chairman under the reign of President George Bush. SEC vs. Ripple Legal Battle and Controversy Over Crypto Asset Securities It is worth noting that the lawsuit filed against Ripple by the SEC has lasted over two years, resulting in Ripple spending about $200 million to fight back. The SEC accuses Ripple of selling an asset as an unregistered security, while Ripple says the asset should be seen as a digital currency rather than a security. In addition to XRP, the SEC has recently designated various other crypto assets as securities.  This list includes ADA, CHZ, SOL, AXS, FIL, ICP, FLOW, NEAR, MATIC, VGX, SAND, DASH, BNB, BUSD, ATOM, MANA, ALGO, and COTI. Following the SEC&#8217;s decision to label multiple crypto assets as securities, the commission has encountered several criticisms from the crypto community. SEC Chair Gary Gensler had asserted that most crypto assets, excluding Bitcoin, are considered securities.  Nevertheless, Gensler did not explain how he reached this conclusion regarding the legal classification of these &#8220;most&#8221; cryptocurrencies. Meanwhile, in a recent tweet by Alderoty, he said that despite what Gensler said, the Securities and Exchange Commission does not have a magic regulatory wand to convert any token to securities. He added that he’s looking forward to how the Congress and Courts will follow up the case. Featured image from Pixabay and chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-09T15:30:03.000Z",
    "title": "Dogecoin Price Analysis: Are DOGE and Tradecurve Gearing Up For A Price Pump?",
    "url": "https://www.crypto-news-flash.com/dogecoin-price-analysis-are-doge-and-tradecurve-gearing-up-for-a-price-pump/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-price-analysis-are-doge-and-tradecurve-gearing-up-for-a-price-pump",
    "description": "<p>The crypto market is currently in a downtrend after starting the year on a bullish note. This comes after the US SEC went after top exchanges, Binance and Coinbase, accusing them of breaking Federal securities laws.  As predicted by many analysts and investors, the downtrend was short-lived and the market is already recovering. In addition, [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/dogecoin-price-analysis-are-doge-and-tradecurve-gearing-up-for-a-price-pump/\">Dogecoin Price Analysis: Are DOGE and Tradecurve Gearing Up For A Price Pump?</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-09T15:23:40.000Z",
    "title": "New Cardano-Based Decentralized Prediction Platform Enters The Market, Foreon Network",
    "url": "https://www.crypto-news-flash.com/new-cardano-based-decentralized-prediction-platform-enters-the-market-foreon-network/?utm_source=rss&utm_medium=rss&utm_campaign=new-cardano-based-decentralized-prediction-platform-enters-the-market-foreon-network",
    "description": "<p>Despite current controversies on its status, a new prediction protocol, Foreon Network has made its way into the Cardano protocol. Foreon Network has a goal of becoming the dominant Web3.0 prediction tool in 5 years. Foreon Network, an information market prediction platform which is based on the Cardano (ADA) blockchain is poised for outstanding growth [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/new-cardano-based-decentralized-prediction-platform-enters-the-market-foreon-network/\">New Cardano-Based Decentralized Prediction Platform Enters The Market, Foreon Network</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-09T15:20:31.000Z",
    "title": "Dogecoin is Down 10% This Week, Investors Put Their Hope In a New Hybrid Memecoin For Fast Recovery",
    "url": "https://www.crypto-news-flash.com/dogecoin-is-down-10-this-week-investors-put-their-hope-in-a-new-hybrid-memecoin-for-fast-recovery/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-is-down-10-this-week-investors-put-their-hope-in-a-new-hybrid-memecoin-for-fast-recovery",
    "description": "<p>Smart investors know well enough not to put all their eggs in one basket. This is why you see veteran investors investing in different coins in various niches. This strategy works to hedge your investment in the sense that if one doesn’t work, the other most likely will.  Dogecoin has left the majority of its [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/dogecoin-is-down-10-this-week-investors-put-their-hope-in-a-new-hybrid-memecoin-for-fast-recovery/\">Dogecoin is Down 10% This Week, Investors Put Their Hope In a New Hybrid Memecoin For Fast Recovery</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-09T15:15:08.000Z",
    "title": "Shiba Inu Poised for Significant Price Surge with Anticipated Metaverse Upgrades, Shibarium Release, and SHIB Burn – Is a Price Surge to $0.0001 Possible? Report",
    "url": "https://www.crypto-news-flash.com/shiba-inu-poised-for-significant-price-surge-with-anticipated-metaverse-upgrades-shibarium-release-and-shib-burn-is-a-price-surge-to-0-0001-possible-report/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-poised-for-significant-price-surge-with-anticipated-metaverse-upgrades-shibarium-release-and-shib-burn-is-a-price-surge-to-0-0001-possible-report",
    "description": "<p>Shiba Inu (SHIB) is set up for a massive rally driven by the upcoming metaverse, continued Shib burns, and the Shibarium release. SHIB has faced investment competition from up-and-coming memecoins such as PEPE and Cardano&#8217;s SNEK but remains by far more popular. Shiba Inu remains one of the most popular memecoins in the crypto market. [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/shiba-inu-poised-for-significant-price-surge-with-anticipated-metaverse-upgrades-shibarium-release-and-shib-burn-is-a-price-surge-to-0-0001-possible-report/\">Shiba Inu Poised for Significant Price Surge with Anticipated Metaverse Upgrades, Shibarium Release, and SHIB Burn &#8211; Is a Price Surge to $0.0001 Possible? Report</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-09T15:39:22.000Z",
    "title": "World Mobile Completes Field Tests in Africa",
    "url": "https://www.altcoinbuzz.io/product-release/world-mobile-completes-field-tests-in-africa/",
    "description": "<p>Decentralized wireless (DeWi) network operator, World Mobile, is close to releasing a full rollout of its communication services in Africa. The company, on June 8th, announced the completion of the field test of its DeWi technology in Nigeria, Mozambique, and Kenya. A large part of the African continent is without access to the internet. So, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/product-release/world-mobile-completes-field-tests-in-africa/\">World Mobile Completes Field Tests in Africa</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-09T15:15:53.000Z",
    "title": "A Historical Timeline of The SEC and Binance Story",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/a-historical-timeline-of-the-sec-and-binance-story/",
    "description": "<p>The US Securities and Exchange Commission (SEC) filed a lawsuit on Monday against Binance, and its founder and CEO, Changpeng Zhao over allegations that state they have violated federal securities laws. For those who have yet to catch up on the saga. Let me tell you that this is not the first time. In 2023, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/a-historical-timeline-of-the-sec-and-binance-story/\">A Historical Timeline of The SEC and Binance Story</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]