[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-13T11:53:21.000Z",
    "title": "Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?",
    "url": "https://www.cryptopolitan.com/rollbit-price-prediction/",
    "description": "Rollbit coin price prediction 2023-2032 Rollbit has quickly become one of the most popular crypto casinos and trading platforms. Launched in 2019, Rollbit offers a wide range of gaming, sports betting, futures trading, and NFT options for users. With no KYC requirements and support for numerous cryptocurrencies, Rollbit provides an easy entry into the world ... <a title=\"Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/rollbit-price-prediction/\" aria-label=\"More on Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-13T11:51:42.000Z",
    "title": "Shiba Inu Steals The Spotlight, Leaving Bitcoin Behind In A Week Of Price Surges",
    "url": "https://www.newsbtc.com/all/shiba-inu-steals-the-spotlight-leaving-bitcoin-behind-in-a-week-of-price-surges/",
    "description": "The Shiba Inu (SHIB) coin has exceeded even the top 10 established cryptocurrencies this week, posting a solid 15% increase that has captivated the attention of the cryptocurrency community. The notable ascent in SHIB&#8217;s price is closely associated with its current rate of burning, which has witnessed a significant upturn in the last 24 hours. Based on the Shibburn data, a total of 111,799,146 SHIB tokens have undergone incineration, leading to a substantial 57% surge as per the most recent update. Related Reading: Rising Star Hedera (HBAR) And Its 11% Climb – A Closer Look Shiba Inu Gets Price Boost From Burn Rate Throughout the course of the week, the burn rate of SHIB has exhibited a constant upward trend, closely aligning with its favorable price trajectory. The consistent pattern observed indicates the possibility of a steady and continuous increase in the price of the asset over a prolonged duration. This can be attributed to the natural expansion of trading volume inside the Shiba Inu ecosystem. SHIB burn rate. Source: Shibburn In the midst of current market trends, SHIB is demonstrating its ability to transcend its origins as a meme coin by exhibiting resilience, as evidenced by a significant 9.2% spike in price in the last 24 hours that resulted in its value reaching $0.00000940. SHIB weekend price action. Source: Coingecko Bitcoin, in comparison, was trading at $29,383, down a meager 0.1% in the last 24 hours, while managing to gain 1.3% in the last seven days, data from crypto market tracking site Coingecko shows, Sunday. BTC weekend price action. Source: Coingecko The current increase in value represents a noteworthy achievement for SHIB, as it has exhibited sustained development throughout the preceding week. Shibarium Launch Also Provides Big Price Lift  Furthermore, the imminent introduction of Shibarium, a Layer-2 protocol with advanced functionality, constructed on the Ethereum network, contributes to the heightened anticipation and price lift for SHIB. SHIB market cap at $6.2 billion in the weekly chart: TradingView.com Meanwhile, data obtained from Coinglass provides a compelling depiction of a notable increase in open interest observed in Binance&#8217;s SHIB futures market. The current surge has exhibited a tremendous growth rate, increasing by almost 100% in just one month. The substantial rise in open interest and market capitalization of SHIB indicates a considerable influx of capital. The historical context is interesting since it often aligns with instances of Bitcoin price swings. SHIB And Its Correlation To Bitcoin Related Reading: Polkadot Bearish Trends Set The Stage For Bullish Possibilities – Here’s Why Over the course of SHIB&#8217;s existence, there have been around seven occurrences in which its open interest surpassed the significant milestone of $100 million. Significantly, each of these instances coincided with fluctuations in the valuation of the alpha crypto, Bitcoin. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Advance Auto Parts"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-13T11:45:18.000Z",
    "title": "Trader Predicts Nearly 60% Rally for Altcoin That Exploded This Month but Warns No Crypto Bull Market in Sight",
    "url": "https://dailyhodl.com/2023/08/13/trader-predicts-nearly-60-rally-for-altcoin-that-exploded-this-month-but-warns-no-crypto-bull-market-in-sight/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/crypto-releases-proof-shell.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/crypto-releases-proof-shell.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/crypto-releases-proof-shell.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/crypto-releases-proof-shell.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/crypto-releases-proof-shell.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/crypto-releases-proof-shell.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/crypto-releases-proof-shell.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed trader says that a low-cap altcoin that started August on a high note is likely due for another round of rallies. Pseudonymous analyst The Flow Horse, formerly known as Cantering Clark, tells his 180,900 X followers that Yield Guild Games (YGG) could be gearing up for a big bounce. YGG, the native [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/13/trader-predicts-nearly-60-rally-for-altcoin-that-exploded-this-month-but-warns-no-crypto-bull-market-in-sight/\">Trader Predicts Nearly 60% Rally for Altcoin That Exploded This Month but Warns No Crypto Bull Market in Sight</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]