[
  {
    "source": "CryptoGlobe",
    "date": "2024-02-20T09:31:18.000Z",
    "title": "Can Gold Reach $3,000? Citi’s North America Head of Commodities Research Weighs In",
    "url": "https://www.cryptoglobe.com/latest/2024/02/can-gold-reach-3000-citis-north-america-head-of-commodities-research-weighs-in/",
    "description": "CNBC reports that Citi Research predicts three potential catalysts for a surge in gold prices, potentially reaching $3,000 an ounce within 12-18 months. Aakash Doshi, Citi’s Head of North American commodities research, identifies these catalysts as a rapid increase in central bank gold purchases, stagflation, or a severe global recession. Firstly, CNBC highlights Doshi’s view […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-20T09:30:25.000Z",
    "title": "Solana Integrates Filecoin to Enhance Historic Data Accessibility",
    "url": "https://news.bitcoin.com/solana-integrates-filecoin-to-enhance-historic-data-accessibility/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/9178629e-3365-4b6c-af8d-a46f826c4f99-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Solana Integrates Filecoin to Enhance Historical Data Accessibility\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/9178629e-3365-4b6c-af8d-a46f826c4f99-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/9178629e-3365-4b6c-af8d-a46f826c4f99-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/9178629e-3365-4b6c-af8d-a46f826c4f99-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/9178629e-3365-4b6c-af8d-a46f826c4f99-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/9178629e-3365-4b6c-af8d-a46f826c4f99-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/9178629e-3365-4b6c-af8d-a46f826c4f99-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/9178629e-3365-4b6c-af8d-a46f826c4f99.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Solana, one of the top proof-of-stake blockchains, has integrated Filecoin, a decentralized file-saving blockchain-based system, to make its block history accessible for third-party apps. According to Filecoin, this will allow Solana to achieve improved redundancy and scalability for part of its data set while leveraging a decentralized solution like Filecoin. Solana to Integrate Filecoin to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-20T09:22:01.000Z",
    "title": "Addressing the Digital Skills Gap in the Age of AI",
    "url": "https://www.cryptopolitan.com/the-digital-skills-gap-in-the-age-of-ai/",
    "description": "In today&#8217;s rapidly evolving digital landscape, the integration of advanced technologies such as artificial intelligence (AI) and automation into the workplace is no longer a distant future but a present reality. This shift has brought to light a significant skills gap in the global workforce, a challenge that businesses and leaders are urgently called to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-20T09:12:26.000Z",
    "title": "Nassim Nicholas Taleb Critiques ChatGPT’s Reliability for Expert Tasks",
    "url": "https://www.cryptopolitan.com/nassim-nicholas-taleb-criticizes-chatgpt/",
    "description": "In a recent commentary on X, formerly known as Twitter, Nassim Nicholas Taleb, the acclaimed author of &#8220;Black Swan,&#8221; shared his critical perspective on OpenAI&#8217;s ChatGPT. Taleb argued that the chatbot&#8217;s effectiveness is contingent upon the user&#8217;s depth of knowledge in the subject matter, highlighting that ChatGPT can produce errors only discernible by experts or [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-20T09:32:36.000Z",
    "title": "Livepeer Sees Surge 147% In Value Amidst Whale Trading Activities",
    "url": "https://nulltx.com/livepeer-sees-surge-147-in-value-amidst-whale-trading-activities/",
    "description": "Livepeer, the decentralized live video streaming network protocol, has witnessed a remarkable surge of 147% over the past week, reaching a yearly high of $20.4 within the last 24 hours.  This significant increase in value has sparked heightened market interest, particularly due to recent whale trading actions involving Livepeer (LPT) [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-20T09:27:44.000Z",
    "title": "Bitcoin’s Rally Sparks General Cryptocurrency Market Surge",
    "url": "https://nulltx.com/bitcoins-rally-sparks-general-cryptocurrency-market-surge/",
    "description": "Bitcoin&#8217;s recent impressive performance has been the driving force behind the significant rise in the cryptocurrency market, leaving investors reaping profits as digital currencies experience a sharp increase in value. The correlation between Bitcoin and stocks has notably strengthened over the past two months, indicating investor optimism surrounding the possibility [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-20T09:23:26.000Z",
    "title": "Polygon MATIC Experiences Range-Bound Trading Amidst Selling Pressure",
    "url": "https://nulltx.com/polygon-matic-experiences-range-bound-trading-amidst-selling-pressure/",
    "description": "Today, Polygon MATIC token is exhibiting a range-bound behavior, encountering slight selling pressure in the early trading hours. The selling pressure emanated from reports provided by Spotonchain, indicating that Wallet 0xa31, associated with the Hermez Network, deposited 3 million MATIC tokens ($2.85 million) to Kraken at an average price of $0.95 [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-20T09:18:50.000Z",
    "title": "Trader Strikes Gold With $SORA Cryptocurrency, Making Over 39 ETH",
    "url": "https://nulltx.com/trader-strikes-gold-with-sora-cryptocurrency-making-over-39-eth/",
    "description": "In a remarkable turn of events, a trader has seized a rare trading opportunity, reaping significant gains with the emerging cryptocurrency, SORA. According to insights shared by LookOnChain, the trader entered the market ahead of the curve, acquiring a substantial 16 million SORA tokens before the influx of other buyers, [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-20T09:13:33.000Z",
    "title": "Bitcoin ETF Trading Volume Surges Amidst Price Rally",
    "url": "https://nulltx.com/bitcoin-etf-trading-volume-surges-amidst-price-rally/",
    "description": "In a resurgence of activity, Bitcoin&#8217;s ETF trading volume has soared in mid-February, surpassing $1.8 billion per day across the seven most prominent ETFs: GBTC, IBIT, FBTC, ARKB, BTCO, BITB, and HODL.  This surge in trading volume coincided with Bitcoin&#8217;s breach of the $50,000 mark earlier this week, signaling a [&#8230;]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-20T09:36:14.000Z",
    "title": "Here’s All About the FixedFloat Hack",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/heres-all-about-the-fixedfloat-hack/",
    "description": "<p>FixedFloat became the latest crypto platform to suffer a hack. On-chain data shows that a hacker moved around $26 million worth of Bitcoin and Ethereum. Inside the FixedFloat Hack Incident The event was first reported on X, after which the FixedFloat team confirmed the situation, citing minor technical problems at first. The FixedFloat team said [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/heres-all-about-the-fixedfloat-hack/\">Here’s All About the FixedFloat Hack</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-20T09:23:24.000Z",
    "title": "The BEST $1500 Crypto Portfolio for 2024",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/the-best-1500-crypto-portfolio-for-2024/",
    "description": "<p>A simple question we get asked all the time at Altcoin Buzz. If you had $1500 to invest, what would you buy? Well today, after talking with our crack Research Team, here are 3 of our favorites from our crypto portfolio. Ready to see what we are buying? Let’s check it out. 1) Polkadot (DOT) [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/the-best-1500-crypto-portfolio-for-2024/\">The BEST $1500 Crypto Portfolio for 2024</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]