[
  {
    "source": "BTCManager",
    "date": "2023-10-16T20:47:08.000Z",
    "title": "Genesis ordered to comply with subpoena in TerraUSD collapse case",
    "url": "https://crypto.news/genesis-ordered-to-comply-with-subpoena-in-terrausd-collapse-case/",
    "description": "New York district judge orders crypto lender Genesis to produce documents related to the collapse of algorithmic stablecoin TerraUSD."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-16T21:00:15.000Z",
    "title": "Chainlink Whales Moved Around $150M In LINK Before Latest Surge: Data",
    "url": "https://www.newsbtc.com/news/chainlink/chainlink-whales-150m-link-latest-surge-data/",
    "description": "On-chain data shows the Chainlink whales showed some high activity right before the latest surge in the cryptocurrency took place. Chainlink Whales Made Moves Before LINK&#8217;s 3% Surge As pointed out by an analyst in a post on X, whales and institutional investors have shown an increasing amount of activity recently. The relevant indicator is the &#8220;large transactions volume&#8221; from the market intelligence platform IntoTheBlock, which keeps track of the aggregate volume of Chainlink transactions larger than $100,000. Generally, the whales and institutional entities are the only investors capable of shifting such a large amount with a single transaction. These holders carry large balances in their wallets, making them influential on the network. Related Reading: Crypto Shorts See Carnage As Bitcoin Surges Towards $28,000 When the value of this metric is high, it means that these humongous investors are moving around large amounts right now. Such a trend implies that these investors are participating in some trading activity. However, this metric alone can&#8217;t discern exactly what kind of activity it is, as both selling and buying transactions appear the same on the blockchain and count towards this volume. On the other hand, when the indicator has low values, it suggests that the whales and institutional players aren&#8217;t interested in the cryptocurrency as they aren&#8217;t making too many moves. Now, here is a chart that shows the trend in the Chainlink large transaction volume over the past few weeks: The value of the metric seems to have gone up in recent days &#124; Source: @ali_charts on X As displayed in the above graph, the Chainlink large transactions volume registered a spike recently, implying that the whales had been moving many tokens across the network. At the peak of this spike, the whales transferred around 20.38 million LINK within 24 hours. This stack would be worth over USD 150 million at the current exchange rate. It&#8217;s uncertain why these humongous holders suddenly showed so much activity, but perhaps the surrounding price action could hint at it. This spike was seen a few days back, and since then, Chainlink has observed some net uptrend. Thus, the timing of the transactions could suggest two likely possibilities. These large investors bought in anticipation of this rally (perhaps due to some inside information), or their buying is why the price surge found its appropriate fuel in the first place. Related Reading: Bitcoin Price Surges 7% In 10 Minutes On Fake iShares ETF News Either way, it&#8217;s a positive sign that the whales and institutional investors have recently participated in potential accumulation activity. In the coming days, this metric can be the one to keep an eye on, as further activity from these holders could signal that more volatile price action may be ahead. Once again, though, any future spikes could arise from both buying and selling, so they won&#8217;t necessarily be a bullish signal for Chainlink like this latest one turned out to be. LINK Price At the time of writing, Chainlink is trading around $0.74, up more than 3% in the past week. LINK seems to have observed some overall uptrend recently &#124; Source: LINKUSD on TradingView Featured image from Thomas Lipke Unsplash.com, charts from TradingView.com, IntoTheBlock.com"
  }
]