[
  {
    "source": "Cointelegraph",
    "date": "2023-11-14T19:28:40.000Z",
    "title": "Tornado Cash users file appeal over judgment in favor of US Treasury",
    "url": "http://cointelegraph.com/news/tornado-cash-appeal-judgment-us-treasury",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/686c8938-f07b-423a-8bc8-67dac7655990.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The six individuals, supported by crypto exchange Coinbase, have taken a case involving the U.S. Treasury sanctioning Tornado Cash to federal appellate court.</p>\n                    <p><p>A group of Tornado Cash users has filed an appeal in federal court following a ruling upholding the United States Treasury’s decision to add the cryptocurrency mixer to its list of sanctioned entities.</p><p>In a Nov. 13 filing in the U.S. Court of Appeals for the Fifth Circuit, lawyers representing plaintiffs Joseph Van Loon, Tyler Almeida, Alexander Fisher, Preston Van Loon, Kevin Vitale and Nate Welch <a href=\"https://assets.ctfassets.net/c5bd0wqjc7v0/49KnhoDGgUETyhM5hPJJsL/3259d3515cf898077d9dc5b948d06b8a/23.pdf\" target=\"_blank\" rel=\"noopener nofollow\">argued</a> that the U.S. Treasury “stretched [its] authority beyond recognition” in sanctioning Tornado Cash transactions. The filing came in response to an August decision by a Texas federal judge who <a href=\"https://cointelegraph.com/news/tornado-cash-lawsuit-judge-sides-treasury-request-summary-judgement\">ruled the crypto mixer</a> could be sanctioned under the regulatory purview of Treasury’s Office of Foreign Assets Control.</p><p>“The district court erred by concluding that the Department satisfied three of the requirements for a designation under [International Emergency Economic Powers Act] and the North Korea Act,” said the Nov. 13 filing. “[T]he Department’s action is contrary to law and in excess of statutory authority under the Administrative Procedure Act.”</p><p>According to the plaintiffs, smart contracts under Tornado Cash identified in the lawsuit were “immutable and ownerless” and failed to meet the U.S. Treasury’s regulatory definition of “property” subject to sanctions. The appeal also challenged Treasury’s definition of “interest,” claiming Tornado Cash has no “legal, equitable, or beneficial interest” in users’ smart contracts.</p><p>The filing was the latest legal move in a lawsuit first filed by the six individuals in September 2022. The U.S. Treasury’s Office of Foreign Assets Control added Tornado Cash to its Specially Designated Nationals list in August 2022, prompting criticism and outrage from many in the space.</p><p>Coinbase chief legal officer Paul Grewal said in a Nov. 13 X thread he supported the efforts of the plaintiffs, saying the appellate court would carefully consider the filing. The crypto exchange has been <a href=\"https://cointelegraph.com/news/crypto-investors-backed-by-coinbase-sue-u-s-department-of-treasury-after-tornado-cash-sanctions\">publicly supporting Van Loon</a> and the other plaintiffs since the September 2022 lawsuit.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Ordinary Americans do extraordinary and admirable things. With the support of <a href=\"https://twitter.com/coinbase?ref_src=twsrc%5Etfw\">@coinbase</a> and many others, today the Loon plaintiffs took their case to the 5th Cir. to challenge sanctions against the ownerless, immutable software known as Tornado Cash. <a href=\"https://t.co/jALDHx950v\">https://t.co/jALDHx950v</a> 1/6</p>&mdash; paulgrewal.eth (@iampaulgrewal) <a href=\"https://twitter.com/iampaulgrewal/status/1724197703616250094?ref_src=twsrc%5Etfw\">November 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Crypto advocacy group Coin Center, which filed its own lawsuit against the U.S. Treasury over Tornado Cash in October 2022, similarly lost its case in Florida federal court. The group filed an appeal in the U.S. Court of Appeals for the Eleventh Circuit on Nov. 6.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-privacy-pools-regulation\"><strong><em>Can crypto Privacy Pools help balance privacy and regulation?</em></strong></a></p><p>U.S. authorities have also pursued criminal charges against individuals involved with Tornado Cash. In August, the Justice Department charged co-founders Roman Storm and Roman Semenov with conspiracy to commit money laundering, conspiracy to commit sanctions violations and conspiracy to operate an unlicensed money-transmitting business. </p><p>Storm was <a href=\"https://cointelegraph.com/news/tornado-cash-arrested-tornado-cash-developer-released-on-bail\">released on a $2-million bond</a> following his arrest and pleaded not guilty to all charges in September, while Semenov was not in custody at the time of publication. Authorities in the Netherlands arrested Tornado Cash co-founder <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/alexey-pertsev\">Alexey Pertsev</a> for similar charges related to money laundering in August 2022. He was released in April 2023 to await trial.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\"><strong><em>Tornado Cash 2.0: The race to build safe and legal coin mixers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-14T19:27:42.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "http://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Disney launches NFT platform with Dapper Labs. In other news Bankrupt crypto firms FTX and BlockFi are permitted to move ahead with negotiations for their claims settlement, a judge has ruled. Meanwhile, someone has faked a BlackRock filing for an XRP trust.</p><h2>Disney launches NFT platform with Dapper Labs</h2><p>Disney and metaverse and NFT firm Dapper Labs, creators of the popular CryptoKitties DApp, have <a href=\"https://cointelegraph.com/news/disney-metaverse-launches-nft-web3-platform-dapper-labs\">joined forces to launch an NFT platform</a>.</p><p>Dubbed “Disney Pinnacle,” the marketplace will contain NFTs featuring iconic characters from Disney as well as those of its Star Wars and Pixar brands. </p><p>According to Dapper Labs CEO Roham Gharegozlou:</p><blockquote>“Fans anywhere will be able to collect dynamic pins on their phone and trade instantly and securely with each other no matter where they are in the world.”</blockquote><h3>FTX, BlockFi claims settlement allowed to proceed, judge declares</h3><p>Bankrupt crypto companies, FTX and BlockFi, have been <a href=\"https://cointelegraph.com/news/ftx-block-fi-claims-settlement-allowed-to-proceed\">allowed to proceed</a> in negotiations for their claims settlement, according to a new court filing.</p><p>On Nov. 13, United States bankruptcy judge Michael Kaplan ordered the end of an automatic holding placed on proceedings between the two firms. FTX debtors can now pursue their \"arguments, defenses, counterclaims, setoffs, or otherwise” concerning the BlockFi claims in the FTX bankruptcy proceeding.</p><p>Both entities filed for Chapter 11 bankruptcy status in November of 2022, after the implosion of FTX at the beginning of that month. BlockFi is estimated to have had around $355 million in funds frozen on the FTX platform, with an additional $671 million owed by Alameda Research.</p><p>The order also said that FTX debtors would have no right to “receive an affirmative distribution from the BlockFi Debtors” and that both parties should file a mediation with the Delaware Bankruptcy court as soon as possible.</p><p>Once such a mediation is filed, mediation will begin “no later” than Dec. 24, 2023.</p><h3>Hoax BlackRock XRP trust filing causes price rollercoaster</h3><p>XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) <a href=\"https://cointelegraph.com/news/xrp-spikes-falls-fake-blackrock-xrp-etf\">jumped and then dumped</a> within an hour on Nov. 13 as a BlackRock filing suggested the asset manager was creating an XRP exchange-traded product — which was quickly confirmed as fake.</p><p>X (Twitter) users picked up on a Delaware list of corporations website filing that showed BlackRock registered the “iShares XRP Trust” — a precursor to launching an exchange-traded fund (ETF).</p><p>XRP gained 12%, spiking to $0.73 within 30 minutes of the news of the filing. It then <a href=\"https://cointelegraph.com/news/ripple-xrp-price-market-cap-jumps-sec-ruling\">lost all its gains</a> in the half an hour after it was confirmed a fake by Bloomberg ETF analyst Eric Balchunas, who spoke with BlackRock.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/cbe1b50b-d859-4d82-af99-8dfc55dc4294.png\"  /><figcaption style=\"text-align: center;\"><em>XRP's price spike.Source: Cointelegraph Markets Pro</em></figcaption></figure><p>Balchunas speculated someone listed the XRP trust on the website by impersonating BlackRock managing director Daniel Schwieger.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This is false! Confirmed by BlackRock by me. Some whacko must have added using BlackRock executive name etc. Cmon man. <a href=\"https://t.co/cDpnycYwjQ\">pic.twitter.com/cDpnycYwjQ</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1724176255484829927?ref_src=twsrc%5Etfw\">November 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Bitcoin Magazine analyst Dylan LeClair was one of the first to initially  break the news. Balchunas and The Block also shared the listing on X in  now-deleted posts.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-14T19:15:40.000Z",
    "title": "Nasdaq files proposal seeking SEC rule change to allow spot Ethereum ETF",
    "url": "https://cryptoslate.com/nasdaq-files-proposal-seeking-sec-rule-change-to-allow-spot-ethereum-etf/",
    "description": "<p>Nasdaq filed a proposal with the SEC seeking approval to list BlackRock&#8217;s spot Ethereum exchange-traded fund (ETF) based on the regulator&#8217;s recent approval of ETH-based futures ETFs in October. The exchange proposed that the regulator allow it to create the iShares Ethereum Trust under its Nasdaq Rule 5711(d) — which governs the listing and trading of [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/nasdaq-files-proposal-seeking-sec-rule-change-to-allow-spot-ethereum-etf/\">Nasdaq files proposal seeking SEC rule change to allow spot Ethereum ETF</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-14T19:12:32.000Z",
    "title": "Market Dip Puts Solana (SOL) and Chainlink (LINK) to the Test, Who Will Emerge Stronger?",
    "url": "https://cryptodaily.co.uk/2023/11/market-dip-puts-solana-sol-and-chainlink-link-to-the-test-who-will-emerge-stronger",
    "description": "Dive into the dynamic battle between Solana (SOL) and Chainlink (LINK) as they navigate the choppy waters of the recent market dip. Our in-depth analysis sheds light on their current struggles and resilience, highlighting the rapid fluctuations of SOL and strategic maneuvers of LINK. Gain valuable insights into how these two cryptocurrencies are positioned to recover and possibly lead the market."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-14T19:32:14.000Z",
    "title": "The Current Impact of Generative AI on Journalism and Beyond",
    "url": "https://www.cryptopolitan.com/impact-of-generative-ai-on-journalism/",
    "description": "Generative artificial intelligence (AI) tools have rapidly become integrated into various professional domains, transforming the way tasks are approached and executed. In a recent interview with The Atlantic, Kevin Roose, a tech columnist for The New York Times and host of the podcast Hard Fork, provided insights into his experiences using generative AI tools and ... <a title=\"The Current Impact of Generative AI on Journalism and Beyond\" class=\"read-more\" href=\"https://www.cryptopolitan.com/impact-of-generative-ai-on-journalism/\" aria-label=\"More on The Current Impact of Generative AI on Journalism and Beyond\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-14T19:23:53.000Z",
    "title": "Senate Finance Committee Seeks Clarity on Federal Agencies’ Use of AI",
    "url": "https://www.cryptopolitan.com/senate-finance-committee-seeks-clarity/",
    "description": "In a move towards ensuring the responsible and secure utilization of artificial intelligence (AI) technologies within federal agencies, members of the Senate Finance Committee, including Senators Ron Wyden (D-Ore.) and Mike Crapo (R-Idaho), have issued letters to key government bodies. The letters, addressed to the Department of Homeland Security (DHS), U.S. Customs and Border Protection ... <a title=\"Senate Finance Committee Seeks Clarity on Federal Agencies&#8217; Use of AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/senate-finance-committee-seeks-clarity/\" aria-label=\"More on Senate Finance Committee Seeks Clarity on Federal Agencies&#8217; Use of AI\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-14T19:13:41.000Z",
    "title": "Unlocking Workforce Potential: AI-Powered Solutions for Closing Skill Gaps",
    "url": "https://www.cryptopolitan.com/unlocking-workforce-ai-powered-solutions/",
    "description": "In the ever-evolving landscape of Learning and Development (L&#38;D), the transformative influence of Artificial Intelligence (AI) is making significant strides. Organizations, once hesitant due to administrative complexities, are now leveraging AI to align skills with learning, paving the way for a more insightful and impactful approach to talent development. The pivotal role of skills in ... <a title=\"Unlocking Workforce Potential: AI-Powered Solutions for Closing Skill Gaps\" class=\"read-more\" href=\"https://www.cryptopolitan.com/unlocking-workforce-ai-powered-solutions/\" aria-label=\"More on Unlocking Workforce Potential: AI-Powered Solutions for Closing Skill Gaps\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-14T19:11:09.000Z",
    "title": "Disney teams up with Dapper Labs to launch innovative NFT platform Disney Pinnacle",
    "url": "https://www.cryptopolitan.com/disney-teams-launch-nft-platform-disney-pinnacle/",
    "description": "Disney has partnered with blockchain and metaverse company Dapper Labs to launch an innovative nonfungible token (NFT) platform named Disney Pinnacle. Set to revolutionize the way fans interact with their favorite characters, Disney Pinnacle promises to tokenize a century&#8217;s worth of iconic Disney and Pixar characters, along with the diverse array of heroes and villains ... <a title=\"Disney teams up with Dapper Labs to launch innovative NFT platform Disney Pinnacle\" class=\"read-more\" href=\"https://www.cryptopolitan.com/disney-teams-launch-nft-platform-disney-pinnacle/\" aria-label=\"More on Disney teams up with Dapper Labs to launch innovative NFT platform Disney Pinnacle\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-14T19:27:59.000Z",
    "title": "Hong Kong firm Boyaa plots $100m crypto scoop",
    "url": "https://crypto.news/hong-kong-firm-boyaa-plots-100m-crypto-scoop/",
    "description": "The Asian gaming giant pitched a 12-month plan to shareholders focused on accumulating Bitcoin, Ethereum, and other cryptocurrencies amid growing bullish sentiment in digital asset markets. Hong Kong e-gaming company Boyaa is lining up a move that would translate into&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-14T19:23:36.000Z",
    "title": "Cosmos and Chainlink price predictions: Meme Moguls rallying",
    "url": "https://crypto.news/cosmos-and-chainlink-price-predictions-meme-moguls-rallying/",
    "description": "Investors are exploring Meme Moguls amid key developments in Cosmos and Chainlink"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-14T19:16:46.000Z",
    "title": "What are the Different Types of Gambling Sites?",
    "url": "https://www.crypto-news-flash.com/what-are-the-different-types-of-gambling-sites/?utm_source=rss&utm_medium=rss&utm_campaign=what-are-the-different-types-of-gambling-sites",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/What-are-the-Different-Types-of-Gambling-Sites.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"What are the Different Types of Gambling Sites\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/What-are-the-Different-Types-of-Gambling-Sites.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/What-are-the-Different-Types-of-Gambling-Sites-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/What-are-the-Different-Types-of-Gambling-Sites-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/What-are-the-Different-Types-of-Gambling-Sites-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The world of online gambling is a vibrant tapestry of games, each offering its unique blend of excitement, skill, and chance. Whether you’re into the timeless appeal of slots or the strategic depth of poker, there&#8217;s something for every type of player. Understanding the nuances of each type of gambling site will enhance your overall [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-14T19:22:00.000Z",
    "title": "Golden Cross Forms on Cardano Amid Growing Bullish Momentum",
    "url": "https://coinedition.com/golden-cross-forms-on-cardano-amid-growing-bullish-momentum/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/Cardano_ADA_Is_Priced_More_Aggressively_Report_Shows.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano_ADA_Is_Priced_“More_Aggressively,”_Report_Shows\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/Cardano_ADA_Is_Priced_More_Aggressively_Report_Shows.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/Cardano_ADA_Is_Priced_More_Aggressively_Report_Shows-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/Cardano_ADA_Is_Priced_More_Aggressively_Report_Shows-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/Cardano_ADA_Is_Priced_More_Aggressively_Report_Shows-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/Cardano_ADA_Is_Priced_More_Aggressively_Report_Shows-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Cardano (ADA) has formed a crucial chart pattern that could signal the beginning of a significant price rally, according to ‘Zach Humphries’ on YouTube, an entrepreneur and crypto investor. In a recently uploaded video, Humphries noted that a golden cross, a pivotal technical pattern in cryptocurrency analysis, has formed on the Cardano chart. A golden [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/golden-cross-forms-on-cardano-amid-growing-bullish-momentum/\">Golden Cross Forms on Cardano Amid Growing Bullish Momentum</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]