[
  {
    "source": "CryptoGlobe",
    "date": "2023-09-14T04:54:09.000Z",
    "title": "Paxos Admits to Mistakenly Paying a $500K Fee for a Single Bitcoin Transaction",
    "url": "https://www.cryptoglobe.com/latest/2023/09/paxos-admits-to-mistakenly-paying-a-500k-fee-for-a-single-bitcoin-transaction/",
    "description": "Crypto firm Paxos has acknowledged that it was responsible for a Bitcoin transaction that incurred an unusually high fee of around $500,000 earlier this week. The company told Decrypt that the excessive fee was paid to the Bitcoin network on September 10, attributing the mistake to a bug that affected only one transfer. The issue […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-14T05:06:30.000Z",
    "title": "SOL Price Prediction: Solana At Make-Or-Break Moment, Key Levels To Watch",
    "url": "https://www.newsbtc.com/analysis/sol-price-prediction-solana-break-moment-20/",
    "description": "Solana is eyeing a fresh increase above the $19.00 resistance against the US Dollar. SOL price must settle above $19 and $20 to start a fresh increase. SOL price is attempting a bullish breakout above the $19 resistance against the US Dollar. The price is now trading below $20 and the 100 simple moving average (4 hours). There is a major bearish trend line forming with resistance near $18.80 on the 4-hour chart of the SOL/USD pair (data source from Kraken). The pair could gain bullish momentum if it settles above the trend line and $20. Solana Price Eyes Bullish Breakout In the past few days, Solana’s price extended its decline below the $22 support. SOL even traded below the $20 level to move further into a bearish zone. Finally, it tested the $17.40 zone. A low was formed near $17.37 and the price is now attempting a fresh increase, like Bitcoin and Ethereum. There was a move above the $18.50 resistance zone. The price even spiked above the 50% Fib retracement level of the downward move from the $20.60 swing high to the $17.37 low. However, the bears are protecting a close above the $19 resistance. There is also a major bearish trend line forming with resistance near $18.80 on the 4-hour chart of the SOL/USD pair. Solana is now trading below $20 and the 100 simple moving average (4 hours). On the upside, immediate resistance is near the $19.00 level. The first major resistance is near the $19.40 level or the 100 simple moving average (4 hours). It is close to the 61.8% Fib retracement level of the downward move from the $20.60 swing high to the $17.37 low. Source: SOLUSD on TradingView.com The next key resistance is near $20. A clear move above the $20 resistance might send the price toward the $21.20 resistance. Any more gains might send the price toward the $22 level. Another Decline in SOL? If SOL fails to settle above $19.00 and $19.40, it could start another decline. Initial support on the downside is near the $18.10 level. The first major support is near the $17.40 level. If there is a close below the $17.40 support, the price could decline toward the $16.50 support. In the stated case, there is a risk of more downsides toward the $15.00 support in the near term. Technical Indicators 4-Hours MACD – The MACD for SOL/USD is gaining pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $18.10, and $17.40. Major Resistance Levels – $19.00, $19.40, and $20.00."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-14T05:00:06.000Z",
    "title": "Shiba Inu Burn Rate Spikes, Toncoin Launches Swiss Non-profit, Pomerdoge Price Rallies",
    "url": "https://www.crypto-news-flash.com/shiba-inu-burn-rate-spikes-toncoin-launches-swiss-non-profit-pomerdoge-price-rallies/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-burn-rate-spikes-toncoin-launches-swiss-non-profit-pomerdoge-price-rallies",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T075633.277.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T075633.277.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T075633.277-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T075633.277-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Stay informed on the latest developments in the cryptocurrency world as the Shiba Inu burn rate surges by more than 330%. In other news, Toncoin (TON) has forayed into the Swiss non-profit sector to boost its DeFi ecosystem, while Pomerdoge (POMD) has embarked on an impressive price rally. Read on to find out more about [...]"
  }
]