[
  {
    "source": "Cointelegraph",
    "date": "2024-01-15T21:07:59.000Z",
    "title": " Microsoft launches Copilot Pro with custom GPTs and Office integration ",
    "url": "https://cointelegraph.com/news/microsoft-launches-copilot-pro-artificial-intelligencecustom-gpts-office-integration",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYTM0ZmUzZjQtOGJlOC00Y2M2LWIxMWYtNzEzN2YwOWQwYjhkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Copilot Pro brings business-level functionality to everyone, but it’ll cost $20 per month.</p>\n                    <p><p>Microsoft is launching Copilot Pro, a $20 subscription service bridging the gap between enterprise and free offerings for the company’s artificial intelligence (AI) assistance suite. </p><p>The new service will bring many features previously only available to enterprise customers to subscribers, including native integration with Office software including Excel, PowerPoint, and Word. </p><p>Copilot Pro will also feature access to “Copilot GPT Builder,” an interface that allows users to build and enable their own chatbot personas. </p><p><a href=\"https://cointelegraph.com/news/microsoft-launches-copilot-pro-artificial-intelligencecustom-gpts-office-integration\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-15T21:00:44.000Z",
    "title": "How Spot Bitcoin ETFs Could Catapult BTC Price To $500,000, According To This Crypto Trader",
    "url": "https://www.newsbtc.com/bitcoin-news/how-spot-bitcoin-etfs-could-catapult-btc-price-to-500000-according-to-this-crypto-trader/",
    "description": "Ash Crypto, a prominent figure in the crypto trading community, predicted that the US spot Bitcoin Exchange-Traded Funds (ETFs) could propel BTC&#8217;s price to $500,000. Bitcoin To Follow Gold&#8217;s ETF Success Story The rationale behind Ash Crypto’s forecast stems from a comparison with gold, whose market capitalization witnessed a significant surge after the introduction of its ETFs. Historically, gold&#8217;s market cap escalated from approximately $2 trillion before the ETFs to roughly $16 trillion over the following years. Related Reading: The Bitcoin Climax: Analyst Flags Market Peak Amid Spot ETF Hype Cooling Off Ash Crypto posits that with its finite supply and growing popularity, Bitcoin might not only replicate but potentially exceed gold’s post-ETF trajectory. Considering Bitcoin&#8217;s current market cap of around $840 billion, reaching even half of gold&#8217;s market cap would catapult BTC’s value to &#8220;$500,000 in the coming years.&#8221; Bitcoin is going to $500k after the Spot ETF is approval. Here is the evidence &#8211; When Gold ETF was approved, it’s mcap was around $2 Trillion. After ETF gold saw huge inflows of liquidity and reached $16 Trillion in few years. ( Don’t forget gold supply is not fixed, we… pic.twitter.com/uE6XKkHWtU — Ash Crypto (@Ashcryptoreal) January 14, 2024 The implications of Bitcoin&#8217;s rising market cap extend beyond the crypto sphere, encroaching on traditional financial markets. Ash Crypto points out the colossal market capitalizations of the global stock and bond markets, amounting to $109 trillion and $133 trillion, respectively. The crypto trader suggests that as Bitcoin continues to establish itself as a legitimate financial asset, it will likely absorb a significant portion of the market cap from these traditional markets. This belief is grounded in the notion that Bitcoin offers a &#8220;novel value proposition, aligning with the investment preferences of a new generation of investors.&#8221; Adding to this perspective, several trillion-dollar companies have begun promoting Bitcoin, signaling the advent of institutional investors in the crypto market. These developments indicate a growing recognition of Bitcoin as a mainstream financial asset, further supporting the potential for a significant increase in its market cap. The crypto trader noted: Now we have trillion dollar companies shilling Bitcoin for us with ads. Institutions are finally here and trillions are coming into crypto boyz!! Ash Crypto further emphasizes that the journey to an $8 trillion market cap is a &#8220;long-term&#8221; vision that won’t &#8220;happen overnight,&#8221; advising investors to maintain focus beyond the market&#8217;s short-term volatility. Global Mega Bank Foresees $200,000 Price Target Furthermore, echoing Ash Crypto’s bullish stance, Standard Chartered’s Head of Digital Assets Research, Geoff Kendrick, and Precious Metal Analyst, Suki Cooper, forecasted a six digit price target for Bitcoin. They project a potential target of $200,000 for Bitcoin, contingent upon an influx of $50 to $100 billion into the Spot Bitcoin ETFs. Their predictions draw parallels between the historical impact of Gold exchange-traded products (ETPs) and the expected trajectory of Spot Bitcoin ETFs, foreseeing a rapid development for the latter compared to the former. Related Reading: PlanB’s Triple Bitcoin Forecast: A Pre-Halving Surge, Post-ETF Rally, And Monumental Peak Ahead Meanwhile, over the past week, Bitcoin has shown bearish price action. The asset has notably plunged over 5% over this period and has continued to decline even in the past 24 hours by 1.1%, with a current trading price of $42,419 at the time of writing. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-15T21:00:13.000Z",
    "title": "Gary Gensler Says FBI and Homeland Security Investigating Hack of SEC’s X Account",
    "url": "https://dailyhodl.com/2024/01/15/gary-gensler-says-fbi-and-homeland-security-investigating-hack-of-secs-x-account/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/couple-who-btc-hack.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/couple-who-btc-hack.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/couple-who-btc-hack.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/couple-who-btc-hack.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/couple-who-btc-hack.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/couple-who-btc-hack.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/couple-who-btc-hack.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The Chair of the U.S. Securities and Exchange Commission (SEC) says that the Federal Bureau of Investigation (FBI) and Homeland Security are looking into last week’s hack of the regulatory body’s X account. In a new statement, SEC Chairman Gary Gensler says that the law enforcement agencies are now involved in the investigation of last [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/15/gary-gensler-says-fbi-and-homeland-security-investigating-hack-of-secs-x-account/\">Gary Gensler Says FBI and Homeland Security Investigating Hack of SEC’s X Account</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-15T20:55:20.000Z",
    "title": "Venture Capitalist Kevin O’Leary Says He Would Never Purchase a Bitcoin ETF – Here’s Why",
    "url": "https://dailyhodl.com/2024/01/15/venture-capitalist-kevin-oleary-says-he-would-never-purchase-a-bitcoin-etf-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/analyst-called-crash-flips.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/analyst-called-crash-flips.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/analyst-called-crash-flips.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/analyst-called-crash-flips.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/analyst-called-crash-flips.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/analyst-called-crash-flips.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/analyst-called-crash-flips.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Prominent Shark Tank investor Kevin O&#8217;Leary went on record last week saying that he would personally stay away from Bitcoin (BTC) exchange-traded funds (ETFs). In a new interview with Fox Business, the venture capitalist says that he believes the fees associated with holding Bitcoin ETFs aren&#8217;t worth it. However, O&#8217;Leary says the approval of the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/15/venture-capitalist-kevin-oleary-says-he-would-never-purchase-a-bitcoin-etf-heres-why/\">Venture Capitalist Kevin O’Leary Says He Would Never Purchase a Bitcoin ETF – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]