[
  {
    "source": "CoinDesk",
    "date": "2023-09-28T14:41:20.000Z",
    "title": "Major TradFi Player VanEck Readies Ethereum Futures ETF",
    "url": "https://www.coindesk.com/business/2023/09/28/major-tradfi-player-vaneck-readies-ethereum-futures-etf/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "VanEck Ethereum Strategy ETF (EFUT) will invest in ETH futures contracts traded on commodity exchanges registered with the CFTC."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-28T15:05:17.000Z",
    "title": "Judge denies final pre-trial request from Sam Bankman-Fried for temporary release",
    "url": "https://cointelegraph.com/news/judge-denies-sam-bankman-temporary-release",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/ccd80ee0-be5f-4303-9659-338adc78bdbd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The federal judge overseeing Sam Bankman-Fried's fraud case reportedly suggested the former FTX CEO might be a flight risk, given his young age and potential prison time.</p>\n                    <p><p>Former FTX CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried</a> (SBF) will remain in jail at least until the start of his Oct. 3 criminal trial following an order from a federal judge.</p><p>According to multiple reports on a Sept. 28 hearing in United States District Court for the Southern District of New York, Judge Lewis Kaplan denied a motion from SBF’s legal team <a href=\"https://cointelegraph.com/news/sam-bankman-frieds-lawyer-renews-request-for-temporary-release-from-jail\">requesting the former FTX CEO</a> be given temporary release in order to prepare for his trial. Bankman-Fried’s lawmakers had made repeated attempts to argue for release since Kaplan <a href=\"https://cointelegraph.com/news/judge-orders-sam-bankman-fried-bail-revoked-following-allegations-witness-intimidation\">revoked his bail</a> on Aug. 11, twice going to appellate court.</p><p>Kaplan reportedly <a href=\"https://twitter.com/jruss_jruss/status/1707398955930103930\" target=\"_blank\" rel=\"noopener nofollow\">suggested</a> that SBF might be a flight risk if “things begin to look bleak” at trial, considering his age and potential prison time. Though the judge denied SBF early release, he <a href=\"https://twitter.com/innercitypress/status/1707408732135768367\" target=\"_blank\" rel=\"noopener nofollow\">added</a> that the former FTX CEO will have the opportunity to arrive to court early on certain days to confer with his legal team.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-28T15:00:45.000Z",
    "title": "Bitcoin sees rising demand in the UK as British pound struggles",
    "url": "https://cryptoslate.com/bitcoin-sees-rising-demand-in-the-uk-as-british-pound-struggles/",
    "description": "<p>Understanding Bitcoin&#8217;s (BTC) valuation against various currencies isn&#8217;t merely a matter of numbers — it’s about grasping global economic tides, gauging investor sentiment, and pinpointing geopolitical fluctuations. By juxtaposing Bitcoin against different fiat currency trading pairs, we gain insights into regional economic health, investor behavior, and potential macroeconomic shifts. Recent market trends point to a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-sees-rising-demand-in-the-uk-as-british-pound-struggles/\">Bitcoin sees rising demand in the UK as British pound struggles</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-28T15:04:32.000Z",
    "title": "Amid Bearish Decline in Dogecoin (DOGE) and Stacks (STX), Investors Find Haven in Kangamoon (KANG)",
    "url": "https://cryptodaily.co.uk/2023/09/amid-bearish-decline-in-dogecoin-doge-and-stacks-stx-investors-find-haven-in-kangamoon-kang",
    "description": "In the constantly changing world of crypto, investors are constantly on the lookout for promising opportunities. Amid the persistent decline in Dogecoin (DOGE) and Stacks (STX), a new contender in Kangamoon has caught the eyes of savvy investors."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-28T14:58:55.000Z",
    "title": "Three Reasons Traders Are Adding Stacks (STX), Kangamoon (KANG) Filecoin (FIL) and to Their Crypto Portfolio",
    "url": "https://cryptodaily.co.uk/2023/09/three-reasons-traders-are-adding-stacks-stx-kangamoon-kang-filecoin-fil-and-to-their-crypto-portfolio",
    "description": "For top crypto investors who are constantly watching the market as it unfolds, finding a token that will guarantee high ROI in the short and long term is the goal. As a result, this article will explore the three reasons top crypto traders and investors are adding Stacks (STX), Filecoin (FIL), and Kangamoon (KANG) to their crypto portfolio."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-28T14:53:07.000Z",
    "title": "15 Most Promising Web3 Startups That Will Be On Everyone's Lips In 2024",
    "url": "https://cryptodaily.co.uk/2023/09/15-most-promising-web3-startups-that-will-be-on-everyones-lips-in-2024",
    "description": "In the fast-paced world of Web3, there's a new crop of startups that are ready to make a name for themselves in 2024."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T14:51:03.000Z",
    "title": "Revolutionary Tracking Method Unleashes the Power of AI to Monitor Animal Behavior",
    "url": "https://www.cryptopolitan.com/ai-tracking-method-monitor-animal-behavior/",
    "description": "In a groundbreaking development, scientists have introduced a cutting-edge non-invasive movement tracking method known as GlowTrack. This innovative technique utilizes fluorescent dye markers to train artificial intelligence (AI) systems for capturing the intricacies of movement, ranging from the digit of a single mouse to the complexity of the human hand. The implications of GlowTrack extend ... <a title=\"Revolutionary Tracking Method Unleashes the Power of AI to Monitor Animal Behavior\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-tracking-method-monitor-animal-behavior/\" aria-label=\"More on Revolutionary Tracking Method Unleashes the Power of AI to Monitor Animal Behavior\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-28T15:07:29.000Z",
    "title": "Thinking outside the rig: 5 creative ways to mine crypto",
    "url": "https://crypto.news/thinking-outside-the-rig-5-creative-ways-to-mine-crypto/",
    "description": "Cryptocurrency mining is not just about computer rigs. From Teslas and human heat to vintage tech and repurposed waste, delve into the most unusual crypto mining methods."
  },
  {
    "source": "BTCManager",
    "date": "2023-09-28T15:06:39.000Z",
    "title": "Snook launches on Arbitrum, to distribute USDC rewards",
    "url": "https://crypto.news/snook-launches-on-arbitrum-to-distribute-usdc-rewards/",
    "description": "Snook, a multiplayer game, is launching on Arbitrum, an Ethereum layer-2"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-28T14:53:21.000Z",
    "title": "Uniswap Foundation requests $62M to bolster development and hedge against volatility",
    "url": "https://crypto.news/uniswap-foundation-requests-62m-to-bolster-development-and-hedge-against-volatility/",
    "description": "The Uniswap Foundation has proposed a $62.37 million fund allocation, and an on-chain vote is scheduled for Oct. 4 to decide on it"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-28T14:44:02.000Z",
    "title": "Genesis went bankrupt months after Gemini reportedly withdrew $282M in crypto",
    "url": "https://crypto.news/genesis-went-bankrupt-months-after-gemini-reportedly-withdrew-282m-in-crypto/",
    "description": "Gemini Trust Co., a crypto exchange, reportedly withdrew $282 million from Genesis Global Holdco LLC months before Genesis filed for bankruptcy"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-28T15:00:33.000Z",
    "title": "Under-The-Radar Altcoin Soars Over 260% – Here’s Why",
    "url": "https://www.newsbtc.com/altcoin/under-the-radar-altcoin-soars-over-260/",
    "description": "The Loom Network (LOOM), a multichain interoperability platform geared towards scaling high-performance decentralized applications (DApps), has surprised many with a 264% rally in just a month. Adding to the excitement, the renowned crypto exchange platform, Gate.io, has recently announced its decision to list the altcoin LOOM for trading.  As of the latest figures from CoinGecko, LOOM stands at a trading price of $0.145481, marking an impressive 28% rally within the past 24 hours and a 148% surge over the last seven days. Gate.io Embraces Altcoin Momentum The surge in the altcoin value also comes as a surprise given its pivotal role within the Loom Network&#8217;s ecosystem. LOOM tokens are not only the backbone of the Loom Network&#8217;s mainnet, Basechain, but also serve as the currency for developers looking to host their DApps on Basechain. Additionally, validators and delegators stake their LOOM tokens to bolster the network&#8217;s security. Related Reading: Solana Bulls Struggle To Break $21 Barrier – What Lies Ahead? Blockchain analytics platform Santiment, known for its sharp eye on market trends, has detected LOOM&#8217;s remarkable ascent. According to the latest report, LOOM&#8217;s price reached levels not seen since December 2021, briefly surpassing the $0.126 mark before a minor correction.  Notably, the ratio of LOOM tokens on exchanges has plummeted by 20.8% in the past five days, now standing at 14.9%. This reduction in circulating supply on exchanges hints at the possibility of an extended rally for LOOM, as demand continues to outpace the available token supply. The Crypto Market&#8217;s Rapid Evolution The altcoin market is a dynamic and ever-changing landscape, where even lesser-known projects can swiftly rise to prominence under the right conditions, leading to substantial gains for investors. A separate report describing LOOM’s remarkable rally has once again highlighted this phenomenon.  LOOM, alongside ImmutableX (IMX) and Frontier (FRONT), has emerged as one of the top-performing cryptocurrencies of the week. This surge in popularity aligns with the growing demand for new crypto wallet addresses being created within the network. Bitcoin (BTC) is currently trading at $26.490. Chart: TradingView.com Insights and Implications As the crypto market continues to rise above expectaions, altcoins like LOOM are proving their mettle with significant price surges. The listing of LOOM on Gate.io signifies a growing recognition of the project&#8217;s potential. Price analysis suggests that LOOM&#8217;s rally may not be over, with strong indicators pointing toward further upward movement.  Related Reading: Shiba Inu At $0.0000072: Sellers Push For Breakout From Compact Zone Altcoin enthusiasts and investors will undoubtedly keep a keen eye on LOOM&#8217;s performance in the coming weeks as the cryptocurrency market remains as unpredictable as ever. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from iStock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-28T14:50:04.000Z",
    "title": "Shiba Inu Ignites Hopes with a Whopping 1,000% Burn Rate Uptick",
    "url": "https://www.crypto-news-flash.com/shiba-inu-ignites-hopes-with-a-whopping-1000-burn-rate-uptick/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-ignites-hopes-with-a-whopping-1000-burn-rate-uptick",
    "description": "<img width=\"512\" height=\"271\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-166.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-166.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-166-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-166-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The burn rate of Shiba Inu (SHIB) experienced a meteoric rise of 1,000%, a development that is closely being monitored by the market. The burn rate escalation hinted at a modest price recovery, breaking away from a previously observed bearish trend. Shiba Inu (SHIB), the decentralized meme token, has lately been enveloped in a whirl [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-28T14:48:26.000Z",
    "title": "Ripple Rides Economic Waves with Crypto-Enabled Payment Solutions",
    "url": "https://www.crypto-news-flash.com/ripple-rides-economic-waves-with-crypto-enabled-payment-solutions/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-rides-economic-waves-with-crypto-enabled-payment-solutions",
    "description": "<img width=\"1920\" height=\"1277\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"RIPPLE\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP-1536x1022.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />The blockchain payment company has identified loopholes in most markets that small enterprises are locked out of financial and banking services amid high interest rates and siloed cross-border solutions. Ripple recently noted that cross-border payments volume has reclaimed pre-pandemic levels but the high and rising interest rates pose a direct threat to present and future [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-28T15:02:00.000Z",
    "title": "Crypto Analyst Predicts SHIB to Overtake DOGE as Leading Meme Coin",
    "url": "https://coinedition.com/crypto-analyst-predicts-shib-to-overtake-doge-as-leading-meme-coin/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent tweet, crypto analyst Jake Gagain predicted that Shiba Inu will surpass Dogecoin as the leading meme coin network in the world. According to the crypto analyst, this will happen during the next crypto bull market. The statements of the analyst mirror the beliefs of people within the Shiba Inu community. So far [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-analyst-predicts-shib-to-overtake-doge-as-leading-meme-coin/\">Crypto Analyst Predicts SHIB to Overtake DOGE as Leading Meme Coin</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]