[
  {
    "source": "CryptoSlate",
    "date": "2023-09-20T11:10:46.000Z",
    "title": "Ripple CEO takes crypto regulatory clarity fight to Washington",
    "url": "https://cryptoslate.com/ripple-ceo-takes-crypto-regulatory-clarity-fight-to-washington/",
    "description": "<p>Ripple (XRP) CEO Brad Garlinghouse met with unnamed members of the U.S. Congress on Sept. 19 to discuss issues about regulatory clarity of the crypto industry. In a Sept. 19 post on social media platform X (formerly Twitter), Garlinghouse revealed that he was in  Washington, D.C., alongside other top executives of the crypto company, including [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ripple-ceo-takes-crypto-regulatory-clarity-fight-to-washington/\">Ripple CEO takes crypto regulatory clarity fight to Washington</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-20T11:27:46.000Z",
    "title": "OKX Achieves SOC 2 Type II Certification, Demonstrating its Industry-Leading User Safety, Security and Compliance Standards",
    "url": "https://cryptodaily.co.uk/2023/09/okx-achieves-soc-2-type-ii-certification-demonstrating-its-industry-leading-user-safety-security-and-compliance-standards",
    "description": "OKX, a leading crypto exchange and Web3 technology company, today announced that it has successfully completed the Service Organization Control (SOC) 2 Type II audit,"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-20T11:30:14.000Z",
    "title": "Kenyan Minister: US Government Recently Foiled Attempt to Detain Worldcoin Representatives",
    "url": "https://news.bitcoin.com/kenyan-minister-us-government-recently-foiled-attempt-to-detain-worldcoin-representatives/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2254987821-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Kenyan Minister: US Government Recently Foiled Attempt to Detain Worldcoin Representatives\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2254987821-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2254987821-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2254987821-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2254987821-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2254987821-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2254987821-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2254987821.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Kenyan law enforcement recently detained two Worldcoin executives as they attempted to depart the country. According to the Kenyan Interior Minister, the duo were eventually let go after the U.S. government&#8217;s intervention. U.S. Government Reportedly Intervenes in Worldcoin-Related Detainment Attempt The Kenyan Interior Minister Kithure Kindiki has said the U.S. government recently foiled local law [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-20T11:38:45.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.094, accompanied by a 24-hour trading volume of $61.59 million. The market capitalization stands at $49.13 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 0.17% increase. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-20T11:34:04.000Z",
    "title": "Chainlink co-founder on banks’ blockchain adoption challenges",
    "url": "https://www.cryptopolitan.com/chainlink-co-founder-on-banks-blockchain/",
    "description": "In a recent interview, Sergey Nazarov, co-founder of Chainlink, shed light on the challenges faced by traditional banks when it comes to adopting blockchain technology. He pointed out that, unlike startups, banks did not begin with blockchain technology as a foundational component, which puts them at a disadvantage in the race to adopt this transformative ... <a title=\"Chainlink co-founder on banks&#8217; blockchain adoption challenges\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-co-founder-on-banks-blockchain/\" aria-label=\"More on Chainlink co-founder on banks&#8217; blockchain adoption challenges\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-20T11:30:05.000Z",
    "title": "Ripple Stirs Debate By Shuffling $260 Million In XRP: What’s Behind The Move?",
    "url": "https://www.newsbtc.com/ripple-2/ripple-stirs-debate-shuffling-260-million-in-xrp/",
    "description": "Ripple Labs has once again become the focus of much scrutiny and debate within the XRP community. Recent data points to a series of high-volume XRP transactions totaling 506 million tokens, valued at approximately $260 million, carried out over the span of 19 days. What makes these transactions especially noteworthy is not just their sheer volume but also the repetitive nature and targeted destinations. Ripple Transaction Breakdown Between the end of August and mid-September, a total of 15 significant XRP transactions were initiated by two Ripple-controlled addresses. These transfers were diligently logged by Whale Alert, a reputable platform that tracks large crypto transactions. The initiation of this flurry was a 31 million XRP transaction on August 30. Of significant note is the consistent pattern observed in many of these transfers. On numerous occasions, amounts exceeding 29 million tokens were transferred to the U.K.-based exchange, Bitstamp. This has ignited curiosity given Ripple&#8217;s acquisition of a stake in Bitstamp earlier this year. The specifics of this deal remain undisclosed, but the recurrent transfer of significant XRP sums to the exchange&#8217;s wallets post-acquisition does warrant attention. Related Reading: Ripple CTO Explains Company’s Stance On Debunking Outrageous XRP Price Predictions The address responsible for the majority of these transactions to Bitstamp, although initially unidentified by Whale Alert, is believed to be directly associated with Ripple Labs. This has led to intense speculation within the community. The direct involvement of Bitstamp in these transactions, combined with Ripple&#8217;s known stake in the exchange, raises questions about the nature and intent of these transfers. Another Ripple-associated address was also active, executing two prominent transfers on September 11 and September 18, totaling 175 million XRP in mid-September. Of these, 100 million XRP was moved to a wallet linked with the Canadian SideShift crypto exchange. In a previous instance, similar transactions were observed from the Binance platform to Ripple&#8217;s wallets, but no clarifications were provided by either party at the time. Market Implications The magnitude of these transactions has understandably caused ripples in the market, leading to speculations about potential systemic selloffs. The recent acquisition of financial services entity Fortress by Ripple has further added fuel to the fire. Questions are being raised about whether Ripple could potentially be leveraging its XRP holdings to facilitate such acquisitions. Related Reading: This Latest Move Suggests SEC Lawsuit Against Ripple Is Pushing The Crypto Firm Outside The US Bill Morgan, an advocate in the XRP circle, queried the relationship between the XRP transactions and the acquisition of Fortress, hinting at the potential impact of such a move on XRP&#8217;s price. While these significant XRP transfers have undoubtedly stirred the crypto community, it&#8217;s essential to highlight that Ripple Labs has, in the past, regularly transferred large XRP sums for various operational reasons. &#8220;I wouldn’t want to think that Ripple sold a lot of XRP to fund this acquisition and bailing out of Fortress customers putting downward price pressure on XRP. But that couldn’t be the cause of the price fall today as the whole crypto market fell,&#8221; he tweeted. Currently, neither Ripple Labs nor Bitstamp has provided any official insight into these recent transactions, leaving room for speculation. As the crypto ecosystem awaits an official response, maybe the next quarterly report by Ripple will deliver answers when the companies presents news stats on its quarterly XRP sales. At press time, XRP traded at $0.5139. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-20T11:30:03.000Z",
    "title": "Ripple Goes DeFi: Orchestra Finance Launches New DEX on Testnet",
    "url": "https://www.crypto-news-flash.com/ripple-goes-defi-orchestra-finance-launches-new-dex-on-testnet/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-goes-defi-orchestra-finance-launches-new-dex-on-testnet",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP Lawyer\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The XRP Ledger welcomes new DeFi app, Orchestra Finance, to its testnet. XRPL&#8217;s anticipated XLS-30d upgrade could revolutionize its DeFi scene. The decentralized finance (DeFi) arena is undergoing a transformative shift as the XRP Ledger (XRPL) is enriched with emerging applications. Spearheading this movement is Orchestra Finance, a decentralized exchange (DEX) employing the Automated Market [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-20T11:17:50.000Z",
    "title": "BRICS Expansion: How New Members Shape Global Energy Dynamics and Why Bitcoin (BTC) Mining Enhances the Conglomerate’s Superiority",
    "url": "https://www.crypto-news-flash.com/brics-expansion-how-new-members-shape-global-energy-dynamics-and-why-bitcoin-btc-mining-enhances-the-conglomerates-superiority/?utm_source=rss&utm_medium=rss&utm_campaign=brics-expansion-how-new-members-shape-global-energy-dynamics-and-why-bitcoin-btc-mining-enhances-the-conglomerates-superiority",
    "description": "<img width=\"940\" height=\"530\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BRICS.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BRICS\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BRICS.png 940w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BRICS-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BRICS-768x433.png 768w\" sizes=\"(max-width: 940px) 100vw, 940px\" />BRICS has expanded from 5 member states to 11 with the new members strengthening the bloc&#8217;s security in global energy influence. It is estimated that the bloc will cover nearly 38.5 percent of the world&#8217;s GDP by 2028 and hold a vast amount of global resources. BRICS has recently added 6 new member states to [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-20T11:22:52.000Z",
    "title": "Buy THESE 2 Altcoins On The Next Major Crypto Sell-Off!",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/buy-these-2-altcoins-on-the-next-major-crypto-sell-off/",
    "description": "<p>There are only 2 ways to get rich in crypto. Either you get in early with gems or you play smart and buy the market dump. But the question is what should you buy during the market dump? It cannot be Bitcoin and Ethereum always. Let&#8217;s be honest who has that kind of money lying [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/buy-these-2-altcoins-on-the-next-major-crypto-sell-off/\">Buy THESE 2 Altcoins On The Next Major Crypto Sell-Off!</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-20T11:28:25.000Z",
    "title": "$120K Collected After Ben Armstrong Begs For Legal Funds On Twitter",
    "url": "https://coinedition.com/120k-collected-after-ben-armstrong-begs-for-legal-funds-on-twitter/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Ben_Armstrong_who_has_faced_a_vast_amount_of_backlash_over_the.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Lot of Dark and Unheard Things in FriendTech: Influencer\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Ben_Armstrong_who_has_faced_a_vast_amount_of_backlash_over_the.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Ben_Armstrong_who_has_faced_a_vast_amount_of_backlash_over_the-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Ben_Armstrong_who_has_faced_a_vast_amount_of_backlash_over_the-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Latest reports have confirmed that more than $120,000 has been collected by crypto influencer Ben Armstrong, popularly known as BitBoy Crypto. Just a few hours ago, Armstrong posted a video on Twitter discussing death threats and blackmail he has received from his media company, HIT Network. He also claimed that they had drained Armstrong of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/120k-collected-after-ben-armstrong-begs-for-legal-funds-on-twitter/\">$120K Collected After Ben Armstrong Begs For Legal Funds On Twitter</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]