[
  {
    "source": "CoinDesk",
    "date": "2024-02-29T15:00:00.000Z",
    "title": "Coinbase Adds 'Smart Wallet' Feature, So Lengthy Seed Phrases Aren't Needed",
    "url": "https://www.coindesk.com/tech/2024/02/29/coinbase-adds-smart-wallet-feature-so-lengthy-seed-phrases-arent-needed/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The smart wallet will be an addition to Coinbase Wallet SDK, and the embedded wallets feature will be powered by \"wallet as a service.\""
  },
  {
    "source": "CoinDesk",
    "date": "2024-02-29T15:00:38.000Z",
    "title": "Protocol Village: Max Howell's Tea Protocol Aims to Address Challenges in OSS Development",
    "url": "https://www.coindesk.com/tech/2024/02/28/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Feb. 29-March 6."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-29T14:54:53.000Z",
    "title": "Top 5 Meme Coins To Buy Before the 2024 Bitcoin Halving",
    "url": "https://cryptodaily.co.uk/2024/02/top-5-meme-coins-to-buy-before-the-2024-bitcoin-halving",
    "description": "Historically, Bitcoin's halving has been a major catalyst for a price rally, as evidenced by the 2021 crypto bull market. Shiba Inu and Dogecoin's massive rally to an all-time high of $0.00008845 and $0.7376 in 2021, shortly after Bitcoin's halving in May 2020, are notable examples in the meme coin space."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-29T14:40:42.000Z",
    "title": "Will Cardano (ADA) Double Soon? Latest Market Trends Suggest a Big Move!",
    "url": "https://cryptodaily.co.uk/2024/02/will-cardano-ada-double-soon-latest-market-trends-suggest-a-big-move",
    "description": "Explore the latest on Cardano (ADA) as it gears up for a potential surge in the crypto market. Dive into our analysis of ADA's current position, technical indicators, and the dual scenarios of bullish growth and bearish downturns. Stay informed about Cardano's promising journey and the factors driving its ascent in the dynamic world of digital currencies."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T15:01:40.000Z",
    "title": "Government Unveils Plans to Introduce Chatbots in Civil Service Overhaul",
    "url": "https://www.cryptopolitan.com/unveils-plans-to-introduce-chatbots/",
    "description": "In a bid to streamline operations and reduce costs, the UK government has announced plans to integrate chatbots into various sectors of the civil service, aiming to replace some human roles with artificial intelligence (AI). Deputy Prime Minister Oliver Dowden revealed the initiative, emphasizing its potential to save taxpayers millions of pounds while enhancing efficiency. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T15:00:00.000Z",
    "title": "Solana (SOL) Experiences Decline, While Borroe Finance Emerges as Investors’ Top Pick Amidst Bull Market",
    "url": "https://www.cryptopolitan.com/solana-sol-experiences-decline-while-borroe-finance-emerges-as-investors-top-pick-amidst-bull-market/",
    "description": "As Solana (SOL) navigates a recent decline, Brave&#8217;s integration with Solana for on-chain BAT rewards showcases a pioneering move in the blockchain. Meanwhile, Borroe Finance ($ROE) established itself as a leading choice with its innovative AI-driven NFT marketplace for Web3 funding. Let’s explore more about these DeFi companies. &#62;&#62;BUY $ROE TOKENS NOW&#60;&#60; Brave Integrates Solana [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T14:48:24.000Z",
    "title": "Gemini set to pay back 97% of customer assets – and the rest?",
    "url": "https://www.cryptopolitan.com/gemini-to-pay-back-97-of-customer-assets/",
    "description": "After a tumultuous period that saw Gemini&#8217;s Earn customers locked out of their investments, a beacon of hope shines through the fog. The New York State Department of Financial Services (NYDFS) and cryptocurrency exchange Gemini have finally shaken hands on a deal that promises to return over $1.1 billion to the hands of those who [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-29T15:08:31.000Z",
    "title": "9 ways to earn free crypto in 2024",
    "url": "https://crypto.news/best-ways-to-earn-crypto-for-free/",
    "description": "Discover the top ways to earn free crypto in 2024 at no initial cost. Explore opportunities and start building your portfolio today, from airdrops to crypto credit cards and staking. In the fast-paced world of cryptocurrency, the allure of earning&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-29T15:00:46.000Z",
    "title": "Dogecoin Rallies 50% To Beat Out Avalanche, BONK Overtakes PEPE",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-avalanche-bonk-pepe/",
    "description": "With altcoins finally catching up to Bitcoin, meme coins such as Dogecoin, BONK, and PEPE have been in the spotlight. This outperformance from these meme coins has pushed their standing in the crypto market further, putting them ahead of large competitors. Dogecoin Rallies 50% To Reclaim 9th Spot From Avalanche While Dogecoin did start out the week on a slow note, it picked up the pace on Wednesday after Bitcoin’s price rose to $64,000. This rally saw the DOGE price go from $0.09 to over $0.1 in a matter of hours, before the wipeout that sent Bitcoin below $60,000. Related Reading: Renowned Economist Says Bitcoin Isn’t Digital Gold, Then What Is It? Once the market recovered, Dogecoin began to move up once again, and by Thursday, its price touched above $0.13. This is the highest that the price has been since 2022 and it gave its market cap enough boost to not only re-enter the top 10 cryptocurrencies by market cap. But also to reclaim the 9th spot from Avalanche. Dogecoin’s price has risen 50% in the last week and pushed its market cap above $18.1 billion. Avalanche had been occupying the 9th spot on this list after rising from $10 to $40 in the last few months. However, its market cap of $16.64 billion falls behind DOGE, putting it in 10th place on the list. It is interesting to note that a week ago, Dogecoin had completely fallen out of the top 10 cryptocurrencies after Tron’s TRX saw its market cap rise. This will end up being short-lived as TRX has fallen out of the top 10 and now sits at 11th position with a market cap of $12.6 billion. BONK Beats Out PEPE In addition to Dogecoin, BONK, another meme coin, has also seen impressive growth during the time. According to data from Coinmarketcap, the BONK price has risen 30% in the last day to cross the $0.00002 threshold. Related Reading: MicroStrategy’s Bitcoin Holdings Balloons Above $10 Billion, Here’s How Much Profit It Has Made This outperformance comes in light of a notable surge in the daily trading volume of the meme coin. Its volume saw a 135% increase in the last day to reach $955 million. This rapid rise in volume suggests a rapid increase in investor interest in the coin, leading to its gains. BONK’s market rose to $1.81 billion as a result of this, which put it ahead of PEPE with a $1.22 billion market cap. BONK now holds the spot for the third-largest meme coin in the space behind Dogecoin and Shiba Inu. However, on the weekly chart, PEPE is outperforming BONK with 148% gains compared to BONK’s 74% gains. Following behind PEPE is dogwifhat (WIF) which rose 142.6% in the last week to reach an $820 million market cap. DOGE price rises to $0.129 &#124; Source: DOGEUSD on Tradingview.com Featured image from Gfinity Sports, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-29T14:54:53.000Z",
    "title": "What is Shiba Inu (SHIB)? A Deep Dive into its Role and Functionality in the Cryptocurrency Landscape",
    "url": "https://www.crypto-news-flash.com/what-is-shiba-inu-shib-a-deep-dive-into-its-role-and-functionality-in-the-cryptocurrency-landscape/?utm_source=rss&utm_medium=rss&utm_campaign=what-is-shiba-inu-shib-a-deep-dive-into-its-role-and-functionality-in-the-cryptocurrency-landscape",
    "description": "<img width=\"2127\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-trading-background-graphics.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shiba-Inu-SHIB-logo-with-trading-background-graphics\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-trading-background-graphics.jpg 2127w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-trading-background-graphics-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-trading-background-graphics-1024x578.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-trading-background-graphics-768x433.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-trading-background-graphics-1536x867.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-trading-background-graphics-2048x1155.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-trading-background-graphics-150x85.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-trading-background-graphics-450x254.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-trading-background-graphics-1200x677.jpg 1200w\" sizes=\"(max-width: 2127px) 100vw, 2127px\" />Shiba Inu (SHIB) is a decentralized, community-driven cryptocurrency that emerged as part of the wave of meme coins, drawing inspiration from the Dogecoin (DOGE) craze. It was created in August 2020 by an anonymous individual or group known as &#8220;Ryoshi.&#8221; Unlike traditional cryptocurrencies, which aim to solve specific financial or technical problems, Shiba Inu was [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-29T14:45:40.000Z",
    "title": "Bonk (BONK) Leads the Pack with 51% Surge: Solana-Based Meme Coin Surpasses PEPE, SHIB and DOGE",
    "url": "https://www.crypto-news-flash.com/bonk-bonk-leads-the-pack-with-51-surge-solana-based-meme-coin-surpasses-pepe-shib-and-doge/?utm_source=rss&utm_medium=rss&utm_campaign=bonk-bonk-leads-the-pack-with-51-surge-solana-based-meme-coin-surpasses-pepe-shib-and-doge",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/06/rocket-launch-67723_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/06/rocket-launch-67723_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/rocket-launch-67723_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/rocket-launch-67723_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/rocket-launch-67723_1920-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/rocket-launch-67723_1920-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/rocket-launch-67723_1920-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/rocket-launch-67723_1920-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/rocket-launch-67723_1920-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/rocket-launch-67723_1920-48x32.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Bonk is leading the crypto gains chart, netting 51% in the past day, the highest gains in the top 100 coins by market cap, and ahead of its rivals Dogecoin and Shiba Inu who trail closely behind as meme coins lead the entire market. Bonk&#8217;s trading volume is up 80% as investor interest surges, and [...]"
  }
]