[
  {
    "source": "Cointelegraph",
    "date": "2023-07-27T10:16:58.000Z",
    "title": "Twitter to X rebrand sparks debate over new name for ‘tweets’ ",
    "url": "https://cointelegraph.com/news/twitter-to-x-rebrand-sparks-debate-over-tweets",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/c25f6f9a-453a-4654-99d8-ed183146859b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Amid the new changes to the online social media platform now known as X, users have begun to debate on what to name the iconic posts formerly called tweets.   </p>\n                    <p><p>The social media platform formerly known as <a href=\"https://cointelegraph.com/news/twitter-bluebird-elon-musk-rebrands-x\">Twitter began its metamorphosis</a> from its iconic blue bird, tweet-centric operations, to its new form as ‘X’ on July 24. </p><p>X has replaced its bird logo with a simple white X, along with a color scheme shift from the trademark sky-blue to black and white. While links continue to read “twitter.com,” the web address “x.com” currently redirects over to the Twitter address. </p><blockquote class=\"twitter-tweet\"><p lang=\"zxx\" dir=\"ltr\"><a href=\"https://t.co/dxbsqwcYv7\">pic.twitter.com/dxbsqwcYv7</a></p>&mdash; Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1683877911315599360?ref_src=twsrc%5Etfw\">July 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Elon Musk, the owner of X and former CEO of the platform, said the rebrand is part of an entirely new strategy for the social media site. This includes turning it into a hub through which users can conduct their <a href=\"https://cointelegraph.com/news/elon-musk-says-x-will-offer-an-entire-financial-world-in-the-coming-months\">“entire financial world,”</a> according to Musk. </p><p>There has been a great deal of hype surrounding the changes on the platform, with many users <a href=\"https://cointelegraph.com/news/twitter-rebrand-to-x-elon-musk-everything-app\">left with mixed feelings</a> about the changes. Twitter began in 2006 and has created a legacy with its former branding, giving a new meaning to the words “tweet” and “tweeting.”</p><p>Some users have called the decision to rebrand “insane,” while stating that they will continue to call the platform by its old name. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">sorry dude, i’m still callin it twitter.</p>&mdash; Tiffany Fong (@TiffanyFong_) <a href=\"https://twitter.com/TiffanyFong_/status/1683181493290430464?ref_src=twsrc%5Etfw\">July 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Cointelegraph created a community survey on Twitter to poll readers and users of the platform what they believe the posts on the platform should be referred to with the options of “tweet,” “xeet” and a space for users to offer their own ideas. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Let’s decide, anons! What are we going to call it now?</p>&mdash; Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1683872419386195971?ref_src=twsrc%5Etfw\">July 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>At the time of writing, there have been 692 votes with “tweet” and “xeet” in a tie at 45%. Users offered up suggestions for post names which include “drops,” “crossings,” “xpresssions,” “tweex” and “Xtweets.”</p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/twitter-to-introduce-daily-limits-on-dms-for-unverified-accounts\"><strong><em>Twitter to impose daily limits on DMs for unverified accounts</em></strong></a></p><p>Other users across the internet have also offered up renaming possibilities, including various pop-culture references.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Twix <a href=\"https://t.co/aukUxocgbA\">pic.twitter.com/aukUxocgbA</a></p>&mdash; Domenico - Micro SaaS Guy (@DG_9_6) <a href=\"https://twitter.com/DG_9_6/status/1683401901675622410?ref_src=twsrc%5Etfw\">July 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Despite users’ guesses, Musk has yet to make any concrete comment as to the future of “tweets” on the platform. </p><p>Instead, trademark attorneys are already predicting that the branding shift to X <a href=\"https://cointelegraph.com/news/trademark-attorney-predicts-legal-fights-ahead-twitter-rebrand-x\">could spark lawsuits</a> costing upwards of millions over the coming years. </p><p>Attorney Josh Gerben said on July 25 via a thread on X, that other U.S.-based companies including Microsoft and Meta already are in possession of similar “x” trademarks for different products and services, while many others could also have grounds for similar lawsuits. </p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/twitter-to-x-rebrand-sparks-debate-over-tweets&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-human-digital-souls-agi-alignment-problem-replika/\"><strong><em>Experts want to give AI human ‘souls’ so they don’t kill us all</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-27T10:12:37.000Z",
    "title": "Dow Jones echoes 1987’s ‘Black Monday’ era with 13th consecutive positive close",
    "url": "https://cryptoslate.com/insights/dow-jones-echoes-1987s-black-monday-with-13th-consecutive-positive-close/",
    "description": "<p>Quick Take Overview of Recent Market Developments In an unprecedented movement, the Dow Jones index has notched its 13th consecutive positive close, a feat last witnessed in 1987. This year, interestingly, was marked by the infamous recession known as &#8216;Black Monday.&#8217; Today&#8217;s economic conditions appear to echo the patterns of that time, bringing back memories [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/dow-jones-echoes-1987s-black-monday-with-13th-consecutive-positive-close/\">Dow Jones echoes 1987&#8217;s &#8216;Black Monday&#8217; era with 13th consecutive positive close</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-27T10:30:00.000Z",
    "title": "Early EOS Investors Face Big Decision Ahead Of U.S. Class Action",
    "url": "https://cryptodaily.co.uk/2023/07/early-eos-investors-face-big-decision-ahead-of-us-class-action",
    "description": "<p>The EOS Network Foundation is forging ahead with a milestone legal challenge against former EOS developer Block.one, which it accuses of failing to uphold a promise to invest $1 billion in the project.&nbsp;</p>\n<p>In a legal update published July 26, ENF CEO Yves La Rose said the failure of Block.one to live up to its promises is one of the biggest issues facing the EOS Network community. Later that day, La Rose tweeted that the community has a choice of three legal avenues they can pursue in order to seek compensation from the developer.&nbsp;</p>\n<p>&nbsp;</p>\nDecision Time For EOS Investors\n<p>The first option is to join the ENF&rsquo;s existing U.S. class action lawsuit, which was filed against Block.one several years prior. According to La Rose, the ENF is on the verge of settling with Block.one for the sum of $22 million. EOS community members have until August 23, 2023 to decide whether they&rsquo;d like to join this class action suit, or opt out and pursue other legal options.&nbsp;</p>\n<p>By joining the class action, investors would forfeit their right to make any other future claims against Block.one. This is legally binding as the class action includes a clause that shields Block.one from any further action against it by those who participate. Those interested in either joining the suit or opting out should contact James Koutoulas at james@koutoulaslaw.com.</p>\n<p>Anyone who purchased EOS tokens or ERC-20 tokens directly from Block.one or certain cryptocurrency exchanges between June 26, 2017 and May 18, 2020 could be eligible to participate in the U.S. class action, La Rose said. More information on the lawsuit and its eligibility requirements can be found here.</p>\n<p>As an alternative, La Rose said Nemesis Venture Capital is pursuing a separate agreement with Block.one on behalf of EOS community members that choose to opt out of the ENF&rsquo;s class action. La Rose said it&rsquo;s likely that anyone interested in seeking compensation through this avenue would need to opt out of the U.S. lawsuit.&nbsp;</p>\n<p>The third option for investors is not guaranteed at this time. Apparently, the ENF is exploring the possibility of filing a separate claim against Block.one in the Cayman Islands, and once again, investors would need to opt out of the U.S. class action to pursue this alternative.&nbsp;</p>\n<p>Early EOS investors therefore face a tough decision. The ENF&rsquo;s U.S. class action is expected to settle on September 30, 2023 and is likely to result in participants receiving compensation soon. However, investors who decide to pursue one of the other legal alternatives could potentially receive much more, though there is a risk that the action may fail and they end up with nothing.&nbsp;</p>\nWhy Is This Happening?\n<p>&nbsp;</p>\n<p>The ENF has been engaged in a long and bitter struggle against Block.one to receive compensation for those who invested in EOS during its initial coin offering back in 2018. At the time, EOS raised a record $4.1 billion through the ICO. Many felt the network was uniquely positioned to rival Ethereum as the number one smart contract network.&nbsp;</p>\n<p>&nbsp;</p>\n<p>Unfortunately for EOS&rsquo;s backers, the project struggled to live up to its billing. A lack of development and a failure to meet the milestones on its original roadmap meant EOS fell behind not only Ethereum, but also many other emerging blockchains. By 2020, the EOS token&rsquo;s value had fallen to a fraction of its ICO price.&nbsp;</p>\n<p>&nbsp;</p>\n<p>The EOS community placed the blame on Block.one, the project&rsquo;s lead developer, saying it had failed to invest the promised $1 billion in the network. After waiting several years for Block.one to get its act together, the EOS community ultimately took matters into its own hands. This led to the birth of the EOS Network Foundation, led by La Rose, who was previously the CEO of an EOS block producer called EOS Nation. Soon after it was founded in August 2021, the ENF began plotting to displace Block.one and take control of the EOS network.&nbsp;</p>\n<p>La Rose collaborated with other EOS block producers on a plan to create a hard fork of the EOS network, which was done in September 2022, a day now known as &ldquo;EOS Independence Day&rdquo;.&nbsp;</p>\n<p>Since then, the ENF has focused its energy on revamping EOS so it can genuinely compete with Ethereum and other chains, and it has made great progress over the last two years. Even so, the ENF refused to let Block.one to escape punishment, pursuing legal action to force it to account for its lack of investment.&nbsp;</p>\nPossible Implications For Crypto?\n<p>The outcome of the ENF &ndash; Block.one dispute could have some serious consequences for the wider blockchain community, due to its focus on a developer not honoring its commitments to investors. Many times, crypto investors have had little to no recourse when they invest in projects that fail due to the lack of effort by its developers, or in some cases, outright scams. This case could therefore set a legal precedent that enables other investors to seek damages in similar situations.&nbsp;</p>\n<p>Ultimately, the outcome of the ENF&rsquo;s legal proceedings against Block.one could lead to major changes in the way crypto fundraising activities are conducted, hence the industry is watching very closely to see how it develops.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T10:24:36.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-27T10:21:06.000Z",
    "title": "Historically Litecoin Halving Event Price Expectation And Prediction",
    "url": "https://nulltx.com/historically-litecoin-halving-event-price-expectation-and-prediction/",
    "description": "Historically speaking, Litecoin&#8217;s price has increased significantly after each halving event. The first halving on August 25, 2015 saw the price of LTC increase by 13,900%, while the second halving on August 5, 2019 saw the price increase by 1030%. Historical Halving Events 2015 LTC Halving: The first LTC halving occurred on August 25, 2015, [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-27T10:27:24.000Z",
    "title": "Chainlink (LINK) Defies Crypto Market Slump With Impressive 10% Gains: A Closer Look At Its Resilience Amidst The Bearish Downturn",
    "url": "https://www.crypto-news-flash.com/chainlink-link-defies-crypto-market-slump-with-impressive-10-gains-a-closer-look-at-its-resilience-amidst-the-bearish-downturn/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-link-defies-crypto-market-slump-with-impressive-10-gains-a-closer-look-at-its-resilience-amidst-the-bearish-downturn",
    "description": "<img width=\"1038\" height=\"612\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1.png 1038w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1-300x177.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1-1024x604.png 1024w\" sizes=\"(max-width: 1038px) 100vw, 1038px\" />Chainlink (LINK) has gained significant attention with a 21% surge in the past 30 days and a 10% increase in the last 7 days, approaching $8.50, displaying relatively stable movements despite the market slump. The successful integration of Synthetix into the CCIP mainnet and other protocols drives LINK&#8217;s recent momentum, opening up various use cases [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-27T10:17:29.000Z",
    "title": "Unwavering Momentum: Borroe ($ROE) Shines as Monero (XMR) Encounters Major Downturn",
    "url": "https://www.crypto-news-flash.com/unwavering-momentum-borroe-roe-shines-as-monero-xmr-encounters-major-downturn/?utm_source=rss&utm_medium=rss&utm_campaign=unwavering-momentum-borroe-roe-shines-as-monero-xmr-encounters-major-downturn",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-27T130124.868.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-27T130124.868.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-27T130124.868-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-27T130124.868-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-27T130124.868-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-27T130124.868-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the fast-paced world of cryptocurrencies, the landscape is constantly shifting, with tokens vying for dominance and investor attention.  Monero (XMR), once heralded as a leading privacy-focused cryptocurrency, now encounters a significant downturn in its price trajectory. As market conditions evolve, investors are re-evaluating their positions and seeking alternative options that offer better growth potential [...]"
  }
]