[
  {
    "source": "Cointelegraph",
    "date": "2023-12-02T22:13:10.000Z",
    "title": " Coinbase market share grows outside US trading hours amid Binance saga: Report  ",
    "url": "https://cointelegraph.com/news/coinbase-market-share-binance-settlement",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNmUxNzVmZTgtZDdmMC00NDEyLTlkMzItM2M0MDhkNGRkYjMyLkpQRw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>According to Kaiko Research, Bybit experienced a rise in market share around the clock, whereas Coinbase witnessed significant growth outside of the United States trading hours. </p>\n                    <p><p >Following cryptocurrency exchange Binance reaching a substantial multi-billion-dollar settlement with United States regulators last week, an on-chain data analytics firm reported a surge in Coinbase's market share.</p><p >On November 21, Binance and the United States Department of Justice (DoJ) <a href=\"https://cointelegraph.com/news/binance-timeline-settlement-us-government\">reached a settlement</a> of $4.3 billion, settling allegations related to anti-money laundering.</p><p >However, the legal challenges have led to other crypto exchanges seeing an increase in market share, according to research firm Kaiko Research.</p><p >The firm recently published a <a href=\"https://research.kaiko.com/insights/binance-settlement\" target=\"_blank\" rel=\"noopener nofollow\">report</a> that indicates that Coinbase has seen an uptick in its trading volume, during the European trading day, outside the regular United States trading hours:</p><blockquote >“Coinbase’s share grew the most outside of U.S. trading hours (14-22 UTC), instead surging in the middle of the trading day in Europe and the beginning of the trading day in eastern Asia.”</blockquote><p >Meanwhile, Bybit is reportedly seeing significant changes across the entire day.</p><p >“Bybit is the immediate standout winner, gaining market share in every single hour and growing by more than 20% in 16 out of 24 hours,\" the report stated.</p><figure ><img src=\"https://s3.cointelegraph.com/uploads/2023-12/08bad6a9-dd6d-449a-a48e-91f32904caa2.png\"  /><figcaption style=\"text-align: center;\"><em>Percentage change in BTC market share. </p><p><a href=\"https://cointelegraph.com/news/coinbase-market-share-binance-settlement\">Read more</a></p></p>\n                \n            "
  }
]