[
  {
    "source": "CoinDesk",
    "date": "2023-07-03T07:46:00.000Z",
    "title": "AzukiDAO Votes on 'Reclaim' of 20K Ether After Botched Elementals NFT Mint",
    "url": "https://www.coindesk.com/web3/2023/07/03/azukidao-votes-on-reclaim-of-20k-ether-after-botched-elementals-nft-mint/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "“We have only been given a similar profile picture to that of the original Azuki holders,” the DAO proposal reads."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-03T08:00:37.000Z",
    "title": "Latam Insights — Argentina Settles IMF Payment in Yuan; Brazilian CBDC to Be Launched in 2024",
    "url": "https://news.bitcoin.com/latam-insights-argentina-settles-imf-payment-in-yuan-brazilian-cbdc-to-be-launched-in-2024/",
    "description": "<img width=\"696\" height=\"392\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1827932012-1.webp\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Latam Insights — Argentina Settles IMF Payments in Yuan; Brazilian CBDC to Be Launched in 2024\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" />Welcome to Latam Insights, a compendium of Latin America&#8217;s most relevant crypto and economic news during the last week. In this issue, Argentina settles part of its $44 billion debt with the International Monetary Fund (IMF) using the Chinese yuan, Central Bank of Brazil officials estimate the Brazilian central bank digital currency (CBDC) will be [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-03T08:08:47.000Z",
    "title": "Cameron Winklevoss slams SEC’s bitcoin ETF rejection",
    "url": "https://crypto.news/cameron-winklevoss-slams-secs-bitcoin-etf-rejection/",
    "description": "Cameron Winklevoss, a co-founder of Gemini, has expressed his disappointment with the recent decision by the US Securities and Exchange Commission (SEC) to reject a bitcoin exchange-traded fund (ETF). According to Winklevoss, this decision is a major setback for investors&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-03T08:00:00.000Z",
    "title": "PEPE falters as DigiToads presale raises over $ 5.8 million",
    "url": "https://crypto.news/pepe-falters-as-digitoads-presale-raises-over-5-8-million/",
    "description": "This article explores the progress of the DigiToads presale, which has raised over $5.8 million when PEPE struggles"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-03T07:57:13.000Z",
    "title": "False rumors of SEC’s Gary Gensler’s resignation fueled by AI",
    "url": "https://crypto.news/false-rumors-of-secs-gary-genslers-resignation-fueled-by-ai/",
    "description": "False rumors regarding the resignation of Gary Gensler, the chair of the US Securities and Exchange Commission (SEC), have once again caused a stir within the crypto community. This time, however, artificial intelligence (AI) seems to have played a role in generating and propagating misinformation."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-03T08:00:32.000Z",
    "title": "Institutional Investors Flock To Bitcoin: Are We Witnessing A Paradigm Shift?",
    "url": "https://www.newsbtc.com/news/bitcoin/institutional-investors-flock-to-bitcoin-paradigm-shift/",
    "description": "The Bitcoin market is experiencing a seismic shift, with recent data revealing fascinating trends that shed light on the evolving dynamics. From a significant decline in Bitcoin inflows to a historic drop in supply on exchanges, coupled with a surge in institutional fund accumulation, these developments highlight a maturing market and changing investor sentiment. Unprecedented Decline In Bitcoin Inflows and Supply The on-chain analytics service CryptoQuant has today published extremely interesting data on the behavior and cohorts of Bitcoin hodlers via Twitter. Over the past 612 days, Bitcoin has witnessed an 80% decline in the number of addresses recording inflows, which can be interpreted as selling activity. This decline reaches an even higher figure of 84% when measured from the peak in May 2021. These numbers even surpass the previous record set during the 2017 parabolic top, demonstrating the magnitude of the current trend. Both narrowly beat the second highest decline in addresses associated with inflows between the 2017 parabolic top into 2018 bear, at 78.5%. It is important to note that these figures do not account for addresses that have moved to self-custody or differentiate between miner activity and retail investors. This suggests that the decline in addresses associated with inflows may be even more significant than the data implies, potentially indicating a shift towards long-term holding strategies or alternative custodial methods. Related Reading: Binance CEO Goes Bullish On Bitcoin – What’s The Inside Scoop? In a parallel trend, the overall supply of Bitcoin on exchanges has been steadily shrinking since March 2020, marking a period of consistent decline that had not been witnessed before in Bitcoin&#8217;s history. This decline is not only significant in its duration but also in its depth, as Bitcoin reserves on exchanges have dropped by over 30%. CryptoQuant’s experts further note: March 2020 was the highest ever supply recorded on exchanges, and preceded by consistent ten years of supply growth. The 1200 days since, are the first period of consistent decline in Bitcoin&#8217;s history. [&#8230;] Retail traders and institutions are holding more Bitcoin than ever. This also indicates a major potential shift from active trading and speculative behavior towards long-term holding strategies. Institutional Fund Accumulation Signals Confidence As the decline in inflows and supply unfolds, another intriguing trend emerges: institutional fund accumulation, as observed by CryptoQuant. Institutional investors, including hedge funds, investment firms, and cryptocurrency private funds, are currently actively increasing their holdings of Bitcoin. Related Reading: Bitcoin Price Takes A Hit As SEC Deems Spot ETF Filings ‘Inadequate’ This exponential increase in fund holdings demonstrates a strong interest in acquiring Bitcoin, even at its current price level. Institutional investors often take a more patient and long-term approach compared to short-term traders who closely monitor price fluctuations. By closely monitoring fund holdings, investors can gain valuable insights into market sentiment and the confidence that institutional investors have in Bitcoin as a long-term asset. And the following chart by CryptoQuant is showing just that, an ultra bullish stance by institutions. The positive evolution of Bitcoin&#8217;s perception is probably further reinforced by recent developments in the regulatory landscape and the introduction of exchange-traded funds (ETFs). Regulatory frameworks, especially those being implemented by countries in the European Union with MiCA, are beneficial for the institutional Bitcoin adoption. Moreover, the filings and re-filings of Bitcoin spot ETFs by major financial institutions, including BlackRock and Fidelity, indicate a growing recognition of Bitcoin&#8217;s potential as a legitimate investment. These ETFs provide a more accessible and regulated way for investors to gain exposure to Bitcoin, potentially driving further institutional adoption and market growth. At press time, the BTC price stood at $30,716, remaining in its range between $29,800 and $31,000. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-03T08:00:59.000Z",
    "title": "Victorious in Value: TMS Network (TMSN) Unrivaled Gains Smother Aave (AAVE) and Aptos (APT)",
    "url": "https://www.crypto-news-flash.com/victorious-in-value-tms-network-tmsn-unrivaled-gains-smother-aave-aave-and-aptos-apt/?utm_source=rss&utm_medium=rss&utm_campaign=victorious-in-value-tms-network-tmsn-unrivaled-gains-smother-aave-aave-and-aptos-apt",
    "description": "At blockchain’s glorious peak, crypto projects like Aave (AAVE) and Aptos (APT) gave investors a glimpse of hope that eventually turned into a fad. However, TMS Network (TMSN) is leveling the playing field by providing seamless and profitable trading experience. Unlike Aave (AAVE)&#8217;s faltering liquidity market protocol and Aptos (APT)&#8217; failing Move-based network, TMS Network [...]"
  }
]