[
  {
    "source": "Cointelegraph",
    "date": "2024-02-12T04:15:53.000Z",
    "title": " In inflation-torn Argentina, locals use ‘crypto caves’ — and avoid Bitcoin ",
    "url": "https://cointelegraph.com/news/argentina-inflation-unofficial-exchange-crypto-caves",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZTM2NGQ0MDQtNzAyZS00ZmQzLTgzOGQtNDg0NTdlZjE4ZjA1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Argentines are using secret peer-to-peer crypto exchanges to buy U.S. dollar stablecoins as inflation continues to soar.</p>\n                    <p><p>Argentines are using black market exchanges, known locally as “crypto caves,” to buy U.S. dollar stablecoins in a bid to escape strict currency controls and triple-digit inflation of the Argentine peso (ARS), and are reportedly shunning Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) due to perceived volatility.</p><p>Crypto caves are underground peer-to-peer exchanges operating secretly and tucked away in “non-visible places,” CryptoMarket’s strategic alliances manager Guillermo Escudero told Cointelegraph.</p><p>Escudero said that locals can get a far better rate than the official exchange rate if they use such crypto caves. Local banks cannot officially accept dollars, so crypto wallets have become popular to store dollar-pegged stablecoins like Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>).</p><p><a href=\"https://cointelegraph.com/news/argentina-inflation-unofficial-exchange-crypto-caves\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-12T04:32:20.000Z",
    "title": "Ethereum Price Signals Uptrend Exhaustion But Dips Could Be Attractive",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-signals-exhaustion-2550/",
    "description": "Ethereum price is struggling to clear the $2,550 resistance. ETH could start a downside correction if there is a move below the $2,475 support. Ethereum is consolidating gains below the $2,550 resistance zone. The price is trading above $2,480 and the 100-hourly Simple Moving Average. There was a break below a connecting bullish trend line with support at $2,515 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it stays above the $2,475 support zone. Ethereum Price Remains Supported Ethereum price saw a steady increase after it broke the $2,420 resistance. ETH climbed above $2,450 and $2,500, but it underperformed Bitcoin. Finally, the bears appeared near the $2,550 zone. A high was formed near $2,536 and the price is now consolidating gains. There was a minor decline below the $2,500 level. There was also a break below a connecting bullish trend line with support at $2,515 on the hourly chart of ETH/USD. Ethereum is still trading above the 23.6% Fib retracement level of the recent increase from the $2,282 swing low to the $2,536 high. It is also trading above $2,480 and the 100-hourly Simple Moving Average. If there is a fresh increase, the price could surge above the $2,520 level. On the upside, the first major resistance is near the $2,550 level. The next major resistance is near $2,620, above which the price might rise and test the $2,680 resistance. Source: ETHUSD on TradingView.com If the bulls remain in action, they could even push the price above the $2,750 resistance. In the stated case, the price could rise toward the $2,800 level. Are Dips Supported In ETH? If Ethereum fails to clear the $2,550 resistance, it could start a downside correction. Initial support on the downside is near the $2,475 level and the 100 hourly SMA. The next key support could be the $2,460 zone. A clear move below the $2,460 support might send the price toward $2,400 or the 50% Fib retracement level of the recent increase from the $2,282 swing low to the $2,536 high. The main support could be $2,380. Any more losses might send the price toward the $2,280 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $2,475 Major Resistance Level – $2,550"
  }
]