[
  {
    "source": "CoinDesk",
    "date": "2023-06-27T19:22:32.000Z",
    "title": "Azuki 'Elementals' NFT Mint Sells Out in 15 Minutes, Raking in $38M",
    "url": "https://www.coindesk.com/web3/2023/06/27/azuki-elementals-nft-mint-sells-out-in-15-minutes-raking-in-38m/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Existing Azuki and BEANZ holders got first dibs on minting the collection, which sold out before making it to public sale."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-27T19:36:30.000Z",
    "title": "What Is Web3? A Decentralized Internet Via Blockchain Technology",
    "url": "https://decrypt.co/resources/what-is-web3-a-decentralized-internet-via-blockchain-technology",
    "description": "Web3 embraces the crypto ethos and is designed to be permissionless (no centralized gatekeepers), trustless (no need to place trust in a third party), and open to all (little-to-no censorship of individuals/ideas)."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-27T19:30:00.000Z",
    "title": "Bitfinex launches P2P trading platform in Venezuela, Argentina and Colombia",
    "url": "https://cointelegraph.com/news/bitfinex-launches-p2p-trading-platform-venezuela-argentina-and-colombia",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/a0c89027-d87e-4250-b715-69c0740a4a39.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The launch announcement followed expansion moves by Bitfinex into El Salvador and Chile through licensing and partnerships, respectively.</p>\n                    <p><p>Digital asset exchange Bitfinex has launched a peer-to-peer (P2P) trading platform in Venezuela, Argentina and Colombia.</p><p>In a June 27 announcement, the crypto exchange <a href=\"https://blog.bitfinex.com/media-releases/bitfinex-launches-peer-to-peer-platform-bitfinex-p2p-in-venezuela-argentina-and-colombia/\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it had started the “Bitfinex P2P” platform allowing users in the South American nations to buy and sell Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>), Tether’s euro-pegged stablecoin EURT and Tether Gold (XAUT). Bitfinex chief technology officer Paolo Ardoino suggested the expansion into the three countries was part of the firm’s efforts to promote digital asset-related financial services in Latin America.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Something BIG is happening! <a href=\"https://twitter.com/hashtag/BitfinexP2P?src=hash&amp;ref_src=twsrc%5Etfw\">#BitfinexP2P</a> is redefining P2P trading, driving economic growth, and promoting financial inclusivity in LATAM. <br><br>Learn more: <a href=\"https://t.co/xHloxLnbTh\">https://t.co/xHloxLnbTh</a> <a href=\"https://t.co/gw2Y9X4CfP\">pic.twitter.com/gw2Y9X4CfP</a></p>&mdash; Bitfinex (@bitfinex) <a href=\"https://twitter.com/bitfinex/status/1673708503788138497?ref_src=twsrc%5Etfw\">June 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/peer-to-peer-crypto-exchanges-struggle-to-navigate-shifting-legal-landscape\"><strong><em>Peer-to-peer crypto exchanges struggle to navigate shifting legal landscape</em></strong></a></p><p>The launch announcement followed Bitfinex’s El Salvador arm <a href=\"https://cointelegraph.com/news/bitfinex-securities-el-salvador-receives-digital-asset-service-provider-license-in-el-salvador\">receiving a digital asset service provider license</a> from the country’s National Digital Asset Commission in April. The exchange also partnered with Chile-based crypto platform OrionX in May, aiming to support local education programs and financial literacy.</p><p>P2P crypto exchange LocalBitcoins, which provided services to many residents of Latin America, <a href=\"https://es.cointelegraph.com/news/localbitcoins-closes-down-the-p2p-crypto-exchange-service\">shuttered its operations</a> in February after more than 10 years. Paxful, another platform popular in the region, <a href=\"https://cointelegraph.com/news/paxful-closing-ceo-blames-staff-departures-regulatory-challenges\">suspended operations</a><a href=\"https://cointelegraph.com/news/paxful-closing-ceo-blames-staff-departures-regulatory-challenges\"> in April</a> but announced in May it was back online.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/cryptocurrency-trading-addiction-what-to-look-out-for-and-how-it-is-treated/https://cointelegraph.com/magazine/cryptocurrency-trading-addiction-what-to-look-out-for-and-how-it-is-treated/https://cointelegraph.com/magazine/cryptocurrency-trading-addiction-what-to-look-out-for-and-how-it-is-treated/\"><strong><em>Cryptocurrency trading addiction: What to look out for and how it is treated</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-27T19:25:50.000Z",
    "title": "EDX Markets reportedly drops Paxos as planned custodial partner",
    "url": "https://cryptoslate.com/edx-markets-reportedly-drops-paxos-as-planned-custodial-partner/",
    "description": "<p>EDX Markets, a nascent crypto exchange supported by Charles Schwab, Fidelity, and Citadel Securities, has reportedly ended its intended association with Paxos and is nearing an agreement with Anchorage Digital, according to Bloomberg. Previously, EDX Markets had announced a partnership with Paxos in October of last year. The New York-based blockchain firm, known for issuing [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/edx-markets-reportedly-drops-paxos-as-planned-custodial-partner/\">EDX Markets reportedly drops Paxos as planned custodial partner</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T19:29:39.000Z",
    "title": "Riot Platforms increases its mining capacity with new purchases",
    "url": "https://www.cryptopolitan.com/riot-platforms-increases-capacity-purchases/",
    "description": "Riot Platforms, a prominent player in the Bitcoin mining industry, has recently made a significant investment to enhance its operations. The company has acquired 33,280 state-of-the-art Bitcoin mining rigs, procured from leading manufacturer MicroBT. The purchase, valued at $162.9 million, is aimed at bolstering Riot Platforms’ self-mining capacity ahead of Bitcoin’s anticipated halving cycle in ... <a title=\"Riot Platforms increases its mining capacity with new purchases\" class=\"read-more\" href=\"https://www.cryptopolitan.com/riot-platforms-increases-capacity-purchases/\" aria-label=\"More on Riot Platforms increases its mining capacity with new purchases\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T19:27:42.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T19:15:27.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-27T19:19:32.000Z",
    "title": "BTC whales continue to ‘hodl’ despite low volatility ",
    "url": "https://crypto.news/btc-whales-continue-to-hodl-despite-low-volatility/",
    "description": "A Bitfinex Alpha report reveals a steady accumulation of bitcoin by long-term investors, reflecting a strong demand while creating a complex market environment. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-27T19:30:11.000Z",
    "title": "BTC Continues Uptrend As Fidelity Plans To Submit Bitcoin Spot ETF Filing",
    "url": "https://www.newsbtc.com/bitcoin-news/btc-uptrend-fidelity-to-submit-bitcoin-spot-etf-filing/",
    "description": "Financial market titan Fidelity is reportedly preparing to throw its hat into the Bitcoin exchange-traded fund (ETF) ring. An insider source reveals that the asset management colossus is in the advanced stages of preparing a filing for a spot Bitcoin ETF. If true, this move would make Fidelity the latest entrant into the burgeoning field of issuers vying to be the first to launch such a product. This potential development follows BlackRock&#8217;s recent ETF proposal. BlackRock&#8217;s move, announced on June 15, has ignited a flurry of activity among asset managers eager to introduce their own spot BTC funds. With a filing potentially submitted as early as Tuesday, Fidelity seems set to follow suit. Fidelity In The Bitcoin ETF Spotlight Fidelity&#8217;s rumored filing marks its second foray into Bitcoin ETF territory. In 2021, the company initially submitted a proposal for a Bitcoin spot exchange-traded fund dubbed the Wise Origin Bitcoin Trust. However, the United States Securities and Exchange Commission (SEC) rejected the filing in early 2022. Related Reading: BlackRock Inches Closer To Launching Bitcoin ETF: Potential Impact On BTC Price The introduction of a spot Bitcoin ETF is seen as a pivotal moment in the market, offering investors exposure to BTC without the necessity of handling the asset itself. Didar Bekbauov Bekbauov, founder and CEO of Bitcoin mining company Xive told NewsBTC the renewed clamor for Bitcoin ETF is hinged on three key factors. Bekbauov noted: Firstly, it is the provision for a large number of investors from traditional stock markets to invest in Bitcoin. Secondly, the possibility of a huge amount of capital flow into the ETF which will overflow into Bitcoin which, in turn, will push the price of Bitcoin up. Also, another factor driving the hype is that more people, more investors and large investment companies are considering Bitcoin as a serious investment. Indeed, Fidelity is a comparable giant in the financial world. Boasting tens of millions of retail brokerage clients and $11 trillion in administrated assets, the company has long been a player in the crypto space. Since 2018, Fidelity has provided institutional custody and trading services. Moreover, it has been offering fund products to European clients via Fidelity International since February 2022. BTC Continous Uptrend Fuels Market Optimism As Fidelity&#8217;s potential ETF filing is currently in anticipation, Bitcoin&#8217;s price action over the past week adds a layer of intrigue to the narrative. BTC has seen an uptrend, with the asset marking a 14.9% increase over the same period. At the time of writing, Bitcoin currently trades at $30,822 nearing the $31,000 region. The asset is currently up 0.6% in the last 24 hours with a 24-hour trading volume of $15.9 billion. It is worth noting that the uptrend is in tune with the increased interest from institutional players such as Fidelity and BlackRock. Particularly, it&#8217;s a reflection of growing confidence in the long-term prospects of the digital asset, providing further evidence that BTC is fast becoming a mainstay in the broader investment landscape. Related Reading: Crypto Analyst Predicts: Bitcoin (BTC) To Reach $69,000 And Above In 2023 While the imminent filing for a Bitcoin ETF by Fidelity remains unofficial, its potential impact on the financial landscape cannot be overstated. Not only could it cement Bitcoin&#8217;s place in the mainstream investment universe, but it could also underscore the growing recognition and acceptance of cryptocurrency in the world of traditional finance. Featured image from iStock, Chart from TradingView"
  }
]