[
  {
    "source": "CoinDesk",
    "date": "2023-08-16T09:29:59.000Z",
    "title": "Bitcoin Vapid, Gold Weakens as Russian Ruble and Argentinian Peso Crash",
    "url": "https://www.coindesk.com/markets/2023/08/16/bitcoin-vapid-gold-weakens-as-russian-ruble-and-argentinian-peso-crash/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Ruble and Peso crash represent signs of crack in the global market, per one observer. So far, there has been little demand for perceived havens like bitcoin and gold."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-16T09:36:13.000Z",
    "title": "New financial document shows that President Trump is an Ethereum whale",
    "url": "https://cryptoslate.com/new-financial-document-shows-that-president-trump-is-an-ethereum-whale/",
    "description": "<p>New financial documents show that former U.S. President Donald Trump is an Ethereum (ETH) whale holding $2.8 million worth of the digital asset in a cryptocurrency wallet. The new documents were obtained by Citizens for Responsibility and Ethics in Washington (CREW) and supersedes a previous filing from April that showed that the former President held [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/new-financial-document-shows-that-president-trump-is-an-ethereum-whale/\">New financial document shows that President Trump is an Ethereum whale</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-16T09:30:11.000Z",
    "title": "Singapore Announces Stablecoin Rules, MAS to Label Regulated Tokens",
    "url": "https://news.bitcoin.com/singapore-announces-stablecoin-rules-mas-to-label-regulated-tokens/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1239743488-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Singapore Announces Stablecoin Rules, MAS to Label Regulated Tokens\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1239743488-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1239743488-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1239743488-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1239743488-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1239743488-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1239743488-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1239743488.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Monetary Authority of Singapore (MAS) unveiled regulations aimed at ensuring the value stability of each stablecoin regulated in the city-state. Under the new rules, issuers that want their fiat-pegged tokens to be labeled as “MAS-regulated” will have to meet certain requirements. Singapore to Require Stablecoin Issuers to Maintain Minimum Base Capital and Liquid Assets [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T09:21:43.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-16T09:26:40.000Z",
    "title": "Ethereum analysts bullish, Pomerdoge token holders double in one week",
    "url": "https://crypto.news/ethereum-analysts-bullish-pomerdoge-token-holders-double-in-one-week/",
    "description": "The ongoing Pomerdoge presale is gaining traction, with the number of POMD holders doubling in one week"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-16T09:25:53.000Z",
    "title": "Blockstream to raise $50m to expand ahead of next BTC halving",
    "url": "https://crypto.news/blockstream-to-raise-50m-to-expand-ahead-of-next-btc-halving/",
    "description": "Major crypto mining firm Blockstream looks to raise $50 million to acquire mining equipment in anticipation of the next Bitcoin (BTC) halving. During a recent interview with Cointelegraph, Blockstream&#8217;s mining sales head James Macedonio said that the firm wants to&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-16T09:15:08.000Z",
    "title": "SoFi’s сrypto business in jeopardy amid US regulatory concerns",
    "url": "https://crypto.news/sofis-%d1%81rypto-business-in-jeopardy-amid-us-regulatory-concerns/",
    "description": "Fintech firm SoFi declared it may be &#8220;forced to cease trading in certain types of assets&#8221; amid the US regulatory hurdle. In a recent filing with the United States Securities and Exchange Commission (SEC), SoFi outlined several regulatory risks related&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-16T09:12:48.000Z",
    "title": "ChatGPT recommends Aave, Avalanche, Everlodge defi tokens for August",
    "url": "https://crypto.news/chatgpt-recommends-aave-avalanche-everlodge-defi-tokens-for-august/",
    "description": "Aave, Avalanche, and Everlodge are recommended by ChatGPT for August. Each can add value and potential to the sphere. ELDG presale is ongoing"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-16T09:11:20.000Z",
    "title": "Cardano price still in red despite sharks and whales actions",
    "url": "https://crypto.news/cardano-price-still-in-red-despite-sharks-and-whales-actions/",
    "description": "Cardano (ADA) whales boost activity, driving transactions up despite the price still under $0.28. Data from the market intelligence platform Santiment shows that Cardano (ADA) sharks and whales have been making notable moves while the price is still below $0.28.&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-16T09:30:13.000Z",
    "title": "Binance To Delist These Three Tokens In August Due to Non-Compliance",
    "url": "https://www.newsbtc.com/binance/binance-to-delist-these-three-tokens-in-august-due-to-non-compliance/",
    "description": "The world&#8217;s largest exchange Binance announced on Tuesday, August 15, intentions to delist three tokens from its trading platform. According to the exchange&#8217;s official statement, it regularly conducts a periodic review of all cryptocurrencies and trading products on its platform, ensuring they are of the highest standards in order to protect its customers’ interests. This review is based on certain factors, including trading volume and liquidity, network stability, network security against attacks, and the project’s team commitment, among others.  Based on the results of their latest reviews, Binance states the following tokens are lacking in compliance in relation to these factors: Sonm (SNM), Serum (SRM), and DFI.Money (YFII). Therefore, the exchange will be delisting all trading pairs related to these tokens at exactly 03:00 (UTC) on August 22, 2023. In addition, the order extends to other platforms affiliated with the exchange, including Binance Simple Earn, Binance Loans, Binance Gift Card, and Binance Pay. Albeit, the enforcement date varies for some of these platforms.  Related Reading: Will Bitcoin Price Crash Similarly To 2019 And 2020? Binance Delisting Leads To Heavy Losses For Tokens Following Binance’s announcement, Sonm (SNM), Serum (SRM), and DFI.Money (YFII) have all seen their value plunged into double-digit losses. According to data from CoinMarketCap, the SNM token is the largest loser of the trio declining by 79.09% in the last 24 hours.  Meanwhile, SRM and YFII are down by 29.19% and 19.55%, respectively, over the last day. These losses are quite unsurprising, as delisting by any exchange is commonly interpreted by investors as a disapproval of the token. Considering Binance’s status as a key player in the global crypto space boasting over 150 million users, the exchange delisting a token can be quite detrimental, as seen above. At the time of writing, SNM is trading at $0.05924, while SRM and YFII are exchanging hands at $0.5053 and $584.63, respectively.  SNM trading at $0.0597 on the daily chart &#124; Source: SNM/USDT chart on Tradingview.com Binance Connect Shuts Down In other news, Binance has decided to close down its regulated buy and sell service, Binance Connect, due to the deactivation of supporting card payments on the platform by its provider. Dear Biswappers, The Biswap team keeps abreast of the latest DeFi news and aims to inform you right away. After a thorough consideration, @binance has made a difficult decision to disable @Binance_Connect on 15 August due to its provider closing the supporting card payments… pic.twitter.com/HcooyLn4sg — Biswap (@Biswap_Dex) August 15, 2023 This development was revealed on August 15 by the Biswap DEX via a post on X (formerly Twitter). Biswap also stated that the closure of Binance Connect was part of the exchange’s bigger goal of intensifying efforts on its core businesses.  Related Reading: Bitcoin Price Key Indicators Suggest A Strong Case For More Losses Formerly known as Bfinity, Binance Connect was launched on March 7, 2022, and designed to function as a platform for crypto on-ramps and payment infrastructures. It supports over 50 cryptocurrencies and prominent payment services such as Visa and Mastercard. Featured image from Reuters, chart from Tradingview."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-16T09:29:45.000Z",
    "title": "DOGE & Maker’s Pursuit: Will VC Spectra’s Presale Gains Outshine All?",
    "url": "https://www.crypto-news-flash.com/doge-makers-pursuit-will-vc-spectras-presale-gains-outshine-all/?utm_source=rss&utm_medium=rss&utm_campaign=doge-makers-pursuit-will-vc-spectras-presale-gains-outshine-all",
    "description": "<img width=\"512\" height=\"301\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-55.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-55.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-55-300x176.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />While a mysterious Dogecoin (DOGE) whale&#8217;s substantial transfer has the crypto community buzzing about potential price shifts, the forthcoming airdrop of Maker (MKR) has its ripples. Amidst these market maneuvers, the public presale of VC Spectra (SPCT) offers enticing returns that could potentially overshadow both. &#62;&#62;BUY SPCT TOKENS NOW&#60;&#60; Millions of Dogecoin (DOGE) Transferred to [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-16T09:15:32.000Z",
    "title": "Satoshi-Era Bitcoin (BTC) Wallet Abruptly Wakes Up After Sitting Dormant for Nearly 13 Years",
    "url": "https://dailyhodl.com/2023/08/16/satoshi-era-bitcoin-btc-wallet-abruptly-wakes-up-after-sitting-dormant-for-nearly-13-years/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/btc-Wallet-Abruptly-Wakes.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/btc-Wallet-Abruptly-Wakes.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/btc-Wallet-Abruptly-Wakes.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/btc-Wallet-Abruptly-Wakes.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/btc-Wallet-Abruptly-Wakes.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/btc-Wallet-Abruptly-Wakes.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/btc-Wallet-Abruptly-Wakes.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A long-dormant Bitcoin (BTC) whale has unloaded $29.75 million worth of the top crypto asset after sitting on it for nearly 13 years. The blockchain-tracking platform Whale Alert first spotted the transaction, noting the ancient address sent all 1,005 BTC it owned to another unknown wallet. The whale first received 1,000 Bitcoin all the way [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/16/satoshi-era-bitcoin-btc-wallet-abruptly-wakes-up-after-sitting-dormant-for-nearly-13-years/\">Satoshi-Era Bitcoin (BTC) Wallet Abruptly Wakes Up After Sitting Dormant for Nearly 13 Years</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]