[
  {
    "source": "Crypto Daily",
    "date": "2023-08-17T10:10:14.000Z",
    "title": "Cryptocurrency Market Rebounds to $1.2 Trillion: LBank Revives its High-Performing IEO Amidst Renewed Investor Interest",
    "url": "https://cryptodaily.co.uk/2023/08/cryptocurrency-market-rebounds-to-12-trillion-lbank-revives-its-high-performing-ieo-amidst-renewed-investor-interest",
    "description": "<p>Road Town, BVI., August 17th, 2023, Chainwire</p><p>As the cryptocurrency market has witnessed a decline for over a year, many investors have chosen to liquidate their assets or move to alternative markets. However, 2023 has painted a different picture, positioning cryptocurrency as one of the best-performing investments. According to CoinMarketCap, the total crypto market capitalization rebounded from a low of $780.9 billion to a staggering $1.2198 trillion. Amid this resurgence, LBank, after a few years of dormancy, has announced the reboot of its IEO. Official participation link:&nbsp;https://www.lbank.com/launchpad-list/pins/</p><p>With LBank&rsquo;s IEO making a comeback, let&rsquo;s dive deep into its historical performance to gauge its potential.</p><p>Historical Gains of LBank IEO &ndash; 8 IEOs with an Average Surge of 1274%</p><p>Here&rsquo;s a breakdown of LBank&rsquo;s past eight IEOs and their respective gains:</p><p></p><p>Key Insights from the Data:</p><p>Extreme Performers: VEN stands out remarkably with an opening surge of 100% and a jaw-dropping peak surge of 5300%. DBC, with its 300% opening and 2096% peak, also highlights the potential of high return for investors when the right project is picked.</p><p>Steady Climbers: Projects like BLOC, SEER, and INK might not have the most impressive opening surges, but their peak surges underline the importance of holding onto investments and the potential for long-term gains.</p><p>Consistent Performers: Both CMT and DDD had modest opening surges but still managed to deliver reasonable peak surges. These indicate that even projects that start with a quieter entry can offer profitable opportunities.</p><p>Risky Endeavors: While the data predominantly showcases successes, it&rsquo;s also essential to note projects like INK and DDD. Their minimal to zero opening surges serve as a reminder of the risks inherent in IEO investments.</p><p>This data also showcases a strong correlation between the initial surge and peak surge. In simpler terms, projects with an impressive opening usually fare well in the long run. From the data, it&rsquo;s evident that investing in LBank&rsquo;s IEOs can provide returns in the short term. Holding onto these investments for an extended period might amplify the gains further, as exemplified by the metaverse project SAND.</p><p>LBank&rsquo;s Current Market Stance:</p><p>While LBank carries a notable legacy, it is essential to consider contemporary metrics when assessing its present standing. According to the H1 report from CoinMarketCap, LBank is featured among the top five global exchanges, an indication of its continued relevance and adaptability in the fast-evolving crypto landscape. Holding a 4.6% market share in spot trading volume, it&rsquo;s intriguing to observe their strategic emphasis on MEME coins. This focus, often seen as a blend of calculated risk and innovative market positioning, distinguishes LBank from many of its counterparts.</p><p></p><p>To conclude, based on the available data and recent market performances, one can argue that LBank remains a significant player in the exchange arena. As they reboot their IEO, it might be a space to watch for investors keen on exploring fresh avenues.</p><p>About LBank Labs</p><p>LBank Labs, a prominent player in the web3 space, manages a versatile $100 Million fund that extends beyond specific protocols and exchanges. With a team of experienced web3 veterans from prestigious entities, they have built an extensive network of expertise and connections. Their investment strategy includes fund-of-fund investments, direct investments in early-stage projects, and liquid projects, enabling them to explore diverse opportunities. Lbank Labs actively promotes their investment thesis, &ldquo;The Other Angle,&rdquo; through engaging discussions and focuses on the PSE principles to foster sustainable growth and innovation in the web3 landscape. With a Fund of Fund network comprising 12 funds and over $1 billion in AUM, and offices in seven global regions, Lbank Labs is well-positioned to expand their network and drive innovation in the web3 ecosystem, together with their partners and collaborators.</p>ContactLBK Blockchain Co. Limitedpress@lbank.info"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T10:24:15.000Z",
    "title": "Blockchain Net Zero set to be the Colombia’s largest Web 3.0 event with over 5000 attendees and 300+ companies",
    "url": "https://www.cryptopolitan.com/blockchain-net-zero-set-to-be-the-colombias-largest-web-3-0-event-with-over-5000-attendees-and-300-companies/",
    "description": "This year’s conference is set to be not only Colombia’s, but Latin America’s largest Web 3.0 event. Blockchain Net Zero registration and sponsorship numbers have been steadily climbing ahead of its January 2024 date. Learn, share, and engage with other like-minded innovators, entrepreneurs, industry titans, and more about blockchain, cryptocurrency, and sustainability. Blockchain Net Zero, ... <a title=\"Blockchain Net Zero set to be the Colombia’s largest Web 3.0 event with over 5000 attendees and 300+ companies\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blockchain-net-zero-set-to-be-the-colombias-largest-web-3-0-event-with-over-5000-attendees-and-300-companies/\" aria-label=\"More on Blockchain Net Zero set to be the Colombia’s largest Web 3.0 event with over 5000 attendees and 300+ companies\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-17T10:32:39.000Z",
    "title": "BitGo valued at $1.75b after $100m funding round",
    "url": "https://crypto.news/bitgo-valued-at-1-75b-after-100m-funding-round/",
    "description": "The Palo Alto-based security infrastructure and custodian firm, BitGo, secured a $100 million Series C funding round. This put the company at a $1.75 billion valuation. According to the press release, despite the regulatory differences, BitGo is already regulated in&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-17T10:15:44.000Z",
    "title": "Cardano Holder Resilience Tested As ADA Fends Off Bearish Onslaught",
    "url": "https://www.newsbtc.com/all/cardano-holder-resilience-tested/",
    "description": "Cardano is currently facing a stark contrast between its promising development trajectory and the significant losses incurred by ADA holders.  Recent price analysis has revealed that the losses are nearing an astonishing 90%, sending waves of concern through the cryptocurrency community. The once-active addresses have dwindled, further accentuating the unease surrounding ADA&#8217;s price trend. Related Reading: Chiliz (CHZ) Empowers Smart Contracts With Upgrades – Positive Impact On Price? In an accompanying chart in the analysis that lays bare the current situation, it becomes evident that nearly 4 million ADA addresses find themselves in the unfortunate position of holding the cryptocurrency at a loss. This staggering figure represents approximately 89.7% of all ADA holders at the time of this report.  This unsettling statistic raises pertinent questions about the reasons behind this mass erosion of value, shedding light on potential market dynamics and investor sentiment. Source: IntoTheBlock Cardano Unique Funding Approach Cardano has consistently been a pioneer in revolutionizing the blockchain landscape, consistently introducing groundbreaking developments. One such innovation is their novel approach to funding decentralized applications (dApps) – a departure from the traditional reliance on venture capital or initial coin offerings.  Related Reading: Dogecoin Looming Plunge: Factors Point Toward An Imminent Significant Decline Cardano&#8217;s introduction of undercollateralized loans introduces a fresh paradigm that could reshape the way blockchain projects are financed and sustained, offering a glimpse into the future of decentralized funding models. ADA&#8217;s Fluctuating Value Despite the advancements, ADA&#8217;s recent price performance has sparked concerns. With a current value of $0.274 according to CoinGecko, the cryptocurrency has experienced a decline of 1.2% in the last 24 hours alone. A more prolonged seven-day slump paints a bleaker picture, with a decline of nearly 8%.  ADA price action today. Source: Coingecko Navigating ADA&#8217;s Future As Cardano&#8217;s development trajectory continues to impress with its forward-looking innovations, the prevailing challenges in ADA&#8217;s price trend and holder losses should not be underestimated. The decline in active addresses further compounds the existing worries, potentially signaling shifts in user engagement and interest. ADA hits a market cap of $9.6 billion today. Chart: TradingView.com While the undercollateralized loan approach holds promise for the ecosystem&#8217;s future, addressing the concerns surrounding ADA&#8217;s price and holder losses remains a pressing task. Cardano&#8217;s journey as a trailblazer in the blockchain realm is accompanied by a complex tale of contrasting fortunes. The remarkable innovations it introduces stand as a testament to its commitment to reshaping the industry.  However, the substantial losses incurred by ADA holders and the wavering price trend underscore the importance of addressing market dynamics, sentiment, and user engagement to ensure the longevity and stability of Cardano&#8217;s ecosystem. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from TimeOut"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-17T10:23:07.000Z",
    "title": "Polygon Ignites Web3 Revolution with SK Telecom Partnership for Startup Incubation",
    "url": "https://www.crypto-news-flash.com/polygon-ignites-web3-revolution-with-sk-telecom-partnership-for-startup-incubation/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-ignites-web3-revolution-with-sk-telecom-partnership-for-startup-incubation",
    "description": "<img width=\"960\" height=\"540\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg.jpg 960w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg-768x432.jpg 768w\" sizes=\"(max-width: 960px) 100vw, 960px\" />Polygon Labs partners with SK Telecom for Web3 growth and startup incubation.  The platform’s stability and upcoming Polygon 2.0 upgrade suggest favorable trends, potentially reversing recent declines and driving growth. Polygon Labs has initiated a collaboration with South Korea&#8217;s prominent mobile industry leader, SK Telecom. This partnership aims to cultivate Web3 environments and spot potential [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-17T10:10:18.000Z",
    "title": "Cryptocurrency Market Rebounds to $1.2 Trillion: LBank Revives its High-Performing IEO Amidst Renewed Investor Interest",
    "url": "https://www.crypto-news-flash.com/cryptocurrency-market-rebounds-to-1-2-trillion-lbank-revives-its-high-performing-ieo-amidst-renewed-investor-interest/?utm_source=rss&utm_medium=rss&utm_campaign=cryptocurrency-market-rebounds-to-1-2-trillion-lbank-revives-its-high-performing-ieo-amidst-renewed-investor-interest",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/photo_2023-08-17_17-53-55_1692266063jNje1NxzQY.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/photo_2023-08-17_17-53-55_1692266063jNje1NxzQY.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/photo_2023-08-17_17-53-55_1692266063jNje1NxzQY-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/photo_2023-08-17_17-53-55_1692266063jNje1NxzQY-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/photo_2023-08-17_17-53-55_1692266063jNje1NxzQY-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Road Town, BVI., August 17th, 2023, Chainwire As the cryptocurrency market has witnessed a decline for over a year, many investors have chosen to liquidate their assets or move to alternative markets. However, 2023 has painted a different picture, positioning cryptocurrency as one of the best-performing investments. According to CoinMarketCap, the total crypto market capitalization [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-17T10:23:14.000Z",
    "title": "Scalable Blockchains for Gaming",
    "url": "https://www.altcoinbuzz.io/spotlight/scalable-blockchains-for-gaming/",
    "description": "<p>We’ve focused a bit on our American readers in our last couple of articles. And that’s because we understand how difficult it is to access some cryptocurrencies in the U.S. The US has an impressive crypto market. But, as of now, the lack of regulatory clarity is a huge challenge and a setback. So, if [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/spotlight/scalable-blockchains-for-gaming/\">Scalable Blockchains for Gaming</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-17T10:15:51.000Z",
    "title": "BYDFi, Chainlink, Filecoin, and Route for US Citizens",
    "url": "https://www.altcoinbuzz.io/reviews/bydfi-chainlink-filecoin-and-route-for-us-citizens/",
    "description": "<p>US citizens have not many options left for trading crypto assets. Most crypto exchanges in the US closed down or are closing down. However, there are still some options available. BYDFi is one of these available crypto exchanges for US and Canadian citizens. They are fully regulated as well. So, let&#8217;s find out more about [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/reviews/bydfi-chainlink-filecoin-and-route-for-us-citizens/\">BYDFi, Chainlink, Filecoin, and Route for US Citizens</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-17T10:11:58.000Z",
    "title": "Bitcoin ETF Approved in Europe. What About The US?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/bitcoin-etf-approved-in-europe-what-about-the-us/",
    "description": "<p>It appears that Europe approved the first Bitcoin spot ETF. That&#8217;s great news. With this accomplishment, Europe beats the US for approving Bitcoin ETFs. But, what is an ETF and are there differences in Europe about ETFs? Let&#8217;s dive in a bit deeper and see what&#8217;s up with the European Bitcoin ETF story. 🚨 BREAKING: [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/bitcoin-etf-approved-in-europe-what-about-the-us/\">Bitcoin ETF Approved in Europe. What About The US?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-17T10:14:45.000Z",
    "title": "Whale Dumps BONE, SHIB Amid Glitch During Shibarium Launch",
    "url": "https://coinedition.com/whale-dumps-bone-shib-amid-glitch-during-shibarium-launch/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Lookonchain, the smartmoney on-chain platform, reveals that a whale sold SHIB and BONE tokens and bought 1.07 trillion PEPE worth $1.28 million. In a recent post on X app (formerly Twitter), Lookonchain noted that the whale sold all 979,469 BONE for 787 ETH, equivalent to $1.44 million, at $1.47 in the past three days. By [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/whale-dumps-bone-shib-amid-glitch-during-shibarium-launch/\">Whale Dumps BONE, SHIB Amid Glitch During Shibarium Launch</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]