[
  {
    "source": "BTCManager",
    "date": "2024-01-22T10:07:32.000Z",
    "title": "BTC miners continue to unload pushing downward price momentum",
    "url": "https://crypto.news/btc-miners-continue-to-unload-pushing-downward-price-momentum/",
    "description": "On-chain analyisis examines how Bitcoin miners sell-off, and exchange reserve flows could impact BTC price action in the week ahead. "
  },
  {
    "source": "BTCManager",
    "date": "2024-01-22T10:00:55.000Z",
    "title": "Core Scientific and Iris Energy backer under SEC scrutiny, report says",
    "url": "https://crypto.news/core-scientific-and-iris-energy-backer-under-sec-scrutiny-report-says/",
    "description": "Crypto-friendly bank B. Riley Financial Inc. is said to be facing an undisclosed investigation from U.S. authorities. The Los Angeles-based investment bank B. Riley Financial Inc. is reportedly under investigation by the U.S. Securities and Exchange Commission (SEC) for its&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-22T09:42:25.000Z",
    "title": "Solana bulls target $1k as Pullix supporters expect PLX to reach $1",
    "url": "https://crypto.news/solana-bulls-target-1k-as-pullix-supporters-expect-plx-to-reach-1/",
    "description": "As Solana bulls target $1k, Pullix supporters expect PLX to eventually hit $1 after launching"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-22T09:42:03.000Z",
    "title": "Coinbase’s Grewal scrutinizes US GAO’s report on crypto’s role in sanctions evasion",
    "url": "https://crypto.news/coinbases-grewal-scrutinizes-us-gaos-report-on-cryptos-role-in-sanctions-evasion/",
    "description": "Coinbase CLO Paul Grewal slammed the U.S. GAO&#8217;s crypto report as &#8216;shoddy work,&#8217; accusing it of sensationalizing crypto&#8217;s role in sanctions evasion. Coinbase&#8216;s Chief Legal Officer Paul Grewal has publicly criticized the U.S. Government Accountability Office&#8217;s (GAO) recent crypto report,&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-22T09:45:51.000Z",
    "title": "Dogecoin Price Will ‘Moon’ If This Happens: Crypto Analyst",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-price-will-moon-if-this-happens/",
    "description": "On Saturday, January 20, the Dogecoin price rose by more than 23% within 5 hours. As NewsBTC reported, the creation of the X Payments account was the cause of the sudden price increase, which reignited hopes within the community about the integration of DOGE. However, the speculative surge was short-lived, with only around 4% of the gains remaining at time of publication. When Will Dogecoin Price &#8216;Moon&#8217;? In a new analysis, Skew, a well-known figure in the crypto analysis sphere, has presented a nuanced perspective on the potential drivers for an lasting upswing of the Dogecoin (DOGE) price. Skew&#8217;s findings are grounded in both technical and speculative market dynamics. Skew&#8217;s examination of the DOGE 4-hour (4H) chart revealed a &#8220;Nice pump after the creation of the XPayments account,&#8221; suggesting that the market is speculating about &#8216;X&#8217; possibly integrating Dogecoin as a payment option. Despite the positive momentum, Skew emphasized that for a sustainable uptrend, DOGE needs to &#8220;properly reclaim the 1W pivot ($0.08750) &#38; Yearly open there after.&#8221; Related Reading: Dogecoin (DOGE) Up By 11% As X Launches Dedicated Payment Account He stressed the importance of the price trend aligning with the 4-hour Exponential Moving Averages (EMAs) and a Relative Strength Index (RSI) consistently above 50. &#8220;Systematically, I&#8217;m looking for price to trend with 4H EMAs &#38; RSI above 50 to sustain a real uptrend,&#8221; he stated. On the DOGE Binance spot market, Skew highlights a new price range formation, noting a significant spot demand zone around $0.07 and a large supply wall at $0.1. He pointed out: &#8220;New range being quoted here so far &#38; clear larger range between current spot supply &#38; demand.&#8221; Notably, large bids were filed during the recent move above $0.09 Regarding the Open Interest (OI) and Delta on Binance and Bybit for DOGE, Skew observed a &#8220;substantial OI increase on this +13% price move &#38; more perp volume seen than spot volume.&#8221; He suggested monitoring spot market flows for bullish indicators such as a spot premium leading price, spot limit bids on dips, and neutral funding rates to anticipate further gains. Related Reading: Top Analyst Anticipates Dogecoin Surge To $0.10, But There’s A Catch Skew reflected on the previous DOGE rally linked to &#8216;X&#8217;, noting that &#8220;Clean systematic confirmations prior to narrative pump&#8221; were evident, but the rally faltered due to &#8220;loss of narrative buyers&#8221; after the DOGE logo was removed. For a significant DOGE rally, Skew asserted that the market needs four clear signs: A real narrative this time, key price level reclaim, 4H trend sustained, [and] higher spot flows to support perp speculation. Adding to Skew&#8217;s analysis, crypto analyst @DaanCrypto provided insights on the 1-day DOGE/USD chart, stating, &#8220;DOGE I&#8217;m not over complicating things. Nice hold of the Daily 200MA/EMA. Narrative surrounding XPayments picking up.&#8221; However, he cautioned that &#8220;we have no idea if anything will come from it,&#8221; advising a focus on higher timeframes for a margin of safety. At press time, DOGE traded at $0.08276. Featured image from DALL·E, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-22T10:00:30.000Z",
    "title": "Two Dogecoin (DOGE) Competitors Poised for Explosive Growth in 2024: Shiba Inu (SHIB) and NuggetRush (NUGX)",
    "url": "https://www.crypto-news-flash.com/two-dogecoin-doge-competitors-poised-for-explosive-growth-in-2024-shiba-inu-shib-and-nuggetrush-nugx/?utm_source=rss&utm_medium=rss&utm_campaign=two-dogecoin-doge-competitors-poised-for-explosive-growth-in-2024-shiba-inu-shib-and-nuggetrush-nugx",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-22T091732.269.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-22T091732.269.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-22T091732.269-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-22T091732.269-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-22T091732.269-450x301.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />More compelling meme alternatives to Dogecoin are Shiba Inu and NuggetRush. These meme coins have more upside potential than DOGE and are poised for explosive growth. According to analysts, NuggetRush will see a 70x rally in its price after launch. Dogecoin (DOGE) is without a doubt the OG of memes. If you have been in [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-22T09:45:29.000Z",
    "title": "All the Latest About Aleph Zero",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/all-the-latest-about-aleph-zero/",
    "description": "<p>As demand for zero-knowledge technology grows, we could see Azero hitting incredible figures. As mentioned earlier, there’s been a lot of activity within this ecosystem. Let&#8217;s discover them now. Partnerships As expected of a thriving ecosystem, Aleph Zero has announced several partnerships over the last couple of weeks: Azero is partnering with Panjea to bring [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/all-the-latest-about-aleph-zero/\">All the Latest About Aleph Zero</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]