[
  {
    "source": "Cointelegraph",
    "date": "2024-03-18T03:31:48.000Z",
    "title": " Base surges to 2M daily transactions following Dencun upgrade ",
    "url": "https://cointelegraph.com/news/base-daily-transactions-skyrocket-after-ethereum-dencun-upgrade",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMTNjM2JhOTYtZTVkYi00OWZjLThhYWUtMTI1MTg2NTlmNDc1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The 350% jump in Base daily transactions came amid a vast reduction in fees following the Dencun upgrade.</p>\n                    <p><p>Daily transactions on the Coinbase Ethereum layer-2 network Base skyrocketed to a record 2 million on March 16, just a few days after the <a href=\"https://cointelegraph.com/explained/what-is-the-ethereum-dencun-upgrade-and-why-is-it-important\">Dencun upgrade</a>.</p><p>Before the upgrade, Base was processing around 440,000 transactions per day. The day after, this climbed to 1.1 million and continued to rise in the days following, hitting 2,064,920 on March 16.</p><p>Daily new users on Base also spiked to 666,866 on March 16, a massive 3,200% increase from the average for the days leading up to Dencun. </p><p><a href=\"https://cointelegraph.com/news/base-daily-transactions-skyrocket-after-ethereum-dencun-upgrade\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-18T03:20:58.000Z",
    "title": "Cloudflare’s Response to ChatGPT Side-Channel Vulnerability – Offers Easy Fix",
    "url": "https://www.cryptopolitan.com/chatgpt-side-channel-vulnerability-easy-fix/",
    "description": "Cloudflare, a prominent player in the cybersecurity domain, has responded adeptly to a recent revelation concerning an AI side-channel vulnerability, specifically impacting ChatGPT and its derivatives. Researchers from the Offensive AI Institute at Ben Gurion University unearthed a critical issue pertaining to the transmission of chat sessions, potentially exposing these interactions to malicious interception.&#160; Despite [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-18T03:30:56.000Z",
    "title": "Bitcoin Price Hits Support But Fresh Rally Faces Many Hurdles",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-hits-support-65k/",
    "description": "Bitcoin price tested the $65,000 support zone. BTC is now rising and attempting a fresh increase above the $70,000 resistance zone in the near term. Bitcoin price is showing a few positive signs from the $65,000 zone. The price is trading below $70,000 and the 100 hourly Simple moving average. There was a break above a major bearish trend line with resistance at $67,100 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could gain bullish momentum if it clears the $70,000 resistance zone in the near term. Bitcoin Price Holds Support Bitcoin price started a downside correction from the $73,500 zone. There was a steady decline below the $70,000 support zone and the bears pushed the price below $68,000. Finally, the price tested the $65,000 support zone. A low was formed at $64,555 and the price is now attempting a fresh increase. There was a move above the $66,500 resistance zone. The price climbed above the 23.6% Fib retracement level of the downward move from the $73,734 swing high to the $64,555 low. There was also a break above a major bearish trend line with resistance at $67,100 on the hourly chart of the BTC/USD pair. Bitcoin is now trading below $70,000 and the 100 hourly Simple moving average. Immediate resistance is near the $69,200 level or the 50% Fib retracement level of the downward move from the $73,734 swing high to the $64,555 low. The next key resistance could be $70,000, above which the price could rise toward the $71,200 resistance zone. Source: BTCUSD on TradingView.com If there is a clear move above the $71,200 resistance zone, the price could even attempt a move above the $72,000 resistance zone. Any more gains might send the price toward the $73,500 level. More Losses In BTC? If Bitcoin fails to rise above the $70,000 resistance zone, it could start another decline. Immediate support on the downside is near the $67,000 level. The first major support is $65,000. The main support sits at $64,500. If there is a close below $64,500, the price could start a drop toward the $63,500 level. Any more losses might send the price toward the $62,000 support zone. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $66,500, followed by $65,000. Major Resistance Levels – $69,200, $70,000, and $71,200."
  }
]