[
  {
    "source": "Cointelegraph",
    "date": "2023-05-31T08:10:05.000Z",
    "title": "XDC Network gets Japanese foothold via partnership with SBI subsidiary",
    "url": "https://cointelegraph.com/news/xdc-network-gets-japanese-foothold-via-partnership-with-sbi-subsidiary",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/bfe22e69-2bb3-4621-9d91-94f3a9a7c0b3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>After a fruitful spring season, the XDC Network expands its presence in the Japanese market via SBI VC Trade. </p>\n                    <p><p>The enterprise hybrid blockchain solution, XDC Network — formerly known as XinFin — has broadened its presence in the Japanese market through a partnership with SBI VC Trade, a cryptocurrency exchange subsidiary of Tokyo-based financial holding company SBI. </p><p>On May 31, the XDC Network announced that it would be added to SBI’s crypto exchange subsidiary. The exchange’s CEO, Fumiki Ozaki, confirmed the news: </p><blockquote>“We are delighted to expand our cryptocurrency offerings by adding XDC to our exchange. XDC Network brings a unique value proposition to the trade finance market, and we believe its addition will enhance our customers' trading experience.”</blockquote><p>In March 2023, the XDC token <a href=\"https://cointelegraph.com/news/xrp-xlm-cfx-xdc-and-mask-rank-among-the-top-5-altcoin-gainers-in-march\">became one of the top 5 altcoin gainers</a>, rising 54% in 30 days. The network supports Ethereum Virtual Machine-compatible smart contracts, protocols and atomic cross-chain token transfers. It also complies with the ISO-20022 message standard, an internationally accepted standard for electronic data interchange between financial institutions.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/japan-launches-digital-yen-pilot-project-after-second-successful-proof-of-concept\"><strong><em>Japan launches digital yen pilot project after second successful proof-of-concept</em></strong></a></p><p>Recently, the XDC Network decided to decentralize the governance of the blockchain by forming a decentralized autonomous organization. After deployment in May, the community will decide on the distribution of ecosystem funds to promote development. XDC Network co-founder Atul Khekade commented on the newest announcement:</p><blockquote>“We are thrilled to partner with SBI VC Trade and bring the XDC ecosystem to the Japanese market. Japan is a crucial hub for international trade, and our blockchain platform aims to streamline this sector by improving transparency, traceability and reducing costs.” </blockquote><p>SBI is also raising its presence in key crypto markets. In September 2022, it <a href=\"https://cointelegraph.com/news/singapore-s-financial-authority-grants-license-to-sbi-s-digital-asset-arm\">received a license to operate</a> in Singapore. Earlier, one of its investees, Clear Markets, received approval from the United States Commodity Futures Trading Commission to <a href=\"https://cointelegraph.com/news/sbi-group-reports-investee-getting-cftc-approval-for-otc-derivatives-trading-in-us\">offer over-the-counter crypto derivatives products</a> with a physical settlement.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-home-loan-bitcoin-mortgage-risky/\"><strong><em>Home loans using crypto as collateral. Do the risks outweigh the reward?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-05-31T08:27:32.000Z",
    "title": "Crypto Analyst Explains Why He Is Bullish on $GRT, $FET, and $LTC",
    "url": "https://www.cryptoglobe.com/latest/2023/05/crypto-analyst-explains-why-he-is-bullish-on-grt-fet-and-ltc/",
    "description": "A crypto strategist known for accurately predicting Bitcoin’s bear market bottom in 2018 has turned his attention to two low-cap altcoins and one established coin. According to a report by The Daily Hodl, the analyst, who goes by the pseudonym Bluntz, recently shared his bullish outlook on The Graph (GRT), Fetch.ai (FET), and Litecoin (LTC) […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-05-31T08:14:49.000Z",
    "title": "Bitcoin Poised for Parabolic Surge, Crypto Analyst Predicts",
    "url": "https://www.cryptoglobe.com/latest/2023/05/bitcoin-poised-for-parabolic-surge-crypto-analyst-predicts/",
    "description": "A notable crypto analyst, Kevin Svenson, has suggested that Bitcoin (BTC) could be on the brink of a parabolic surge. According to Svenson, the leading cryptocurrency is showing bullish signs on the daily chart, indicating a potential upward trend. In a recent YouTube video, Svenson pointed out to his 71,000 subscribers that Bitcoin’s moving average […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-31T08:30:26.000Z",
    "title": "New Nigerian President Slates Central Bank’s Interest Rate and Currency Demonetization Policy",
    "url": "https://news.bitcoin.com/new-nigerian-president-slates-central-banks-interest-rate-and-currency-demonetization-policy/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1055844236-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1055844236-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1055844236-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1055844236-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1055844236-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1055844236-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1055844236-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1055844236.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The new Nigerian president Bola Ahmed Tinubu has deplored the Central Bank of Nigeria (CBN)&#8217;s aggressive interest policy which he has reportedly labeled &#8220;anti-people&#8221; and &#8220;anti-business.&#8221; Tinubu also announced the scrapping of a fuel subsidy which has been in existence since the 1970s. Tinubu: Nigeria Needs Lower Interest Rates to Increase Investment and Consumer Spending [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T08:36:07.000Z",
    "title": "How to Get The Best Profits from Top Bitcoin Mining Pools",
    "url": "https://www.cryptopolitan.com/top-bitcoin-mining-pools-in-2023/",
    "description": "Bitcoin mining pools are groups of Bitcoin miners who join forces to combine their computing power and increase their chances of successfully mining Bitcoin. In the Bitcoin network, miners compete to solve complex mathematical problems to validate and add new transactions to the blockchain, and they are rewarded with newly minted Bitcoins for their efforts. ... <a title=\"How to Get The Best Profits from Top Bitcoin Mining Pools\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-bitcoin-mining-pools-in-2023/\" aria-label=\"More on How to Get The Best Profits from Top Bitcoin Mining Pools\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-31T08:37:54.000Z",
    "title": "Paxful announces new interim CEO",
    "url": "https://crypto.news/paxful-announces-new-interim-ceo/",
    "description": "Peer-to-peer (P2P) trading platform Paxful has appointed a new interim CEO to lead the company three weeks after resuming its marketplace.  In a Medium blog post, Paxful announced the appointment of Roshan Dharia as the company&#8217;s new interim CEO. Dharia,&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-31T08:31:54.000Z",
    "title": "US regulatory stand could benefit China, Coinbase CEO warns",
    "url": "https://crypto.news/us-regulatory-stand-could-benefit-china-coinbase-ceo-warns/",
    "description": "Coinbase's CEO warns that China could be the biggest beneficiary of the United States' unclear crypto regulations. Brian Armstrong emphasizes that adversarial nations like China stand to gain."
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-31T08:26:34.000Z",
    "title": "Litecoin (LTC) Remains Red Despite Surge In Network Ahead Of Halving",
    "url": "https://www.newsbtc.com/news/litecoin/litecoin-ltc-remains-red-despite-surge-in-network-ahead-of-halving/",
    "description": "As the countdown to Litecoin&#8217;s highly anticipated third mining reward halving begins, the cryptocurrency has witnessed a surge in network activity, indicating growing investor interest. However, despite this update, Litecoin hasn&#8217;t seen any significant movement in the past 24 hours but instead has remained in the red. Litecoin&#8217;s upcoming halving, scheduled for early August, will see the block reward slashed by 50% to 6.25 LTC, setting the stage for potential price impacts and market shifts. Following its latest decline, various on-chain metrics and indicators have painted a positive picture for Litecoin&#8217;s network, suggesting a promising future for the popular altcoin. Onchain Activity Sees Surge According to recent data from IntoTheBlock, Litecoin has recorded an uptick in on-chain activity. Since the end of April, the total count of addresses holding a balance has experienced a surge, reaching a significant milestone of 8.5 million LTC addresses last week. Related Reading: Why Litecoin Is The Most Undervalued Asset in Crypto This surge in active addresses not only demonstrates the growing popularity of Litecoin but also highlights the expanding user base and interest in cryptocurrency.  Moreover, Litecoin number of new addresses being created and the count of active addresses have approached close to all-time highs, slightly surpassing the creation of new Bitcoin addresses. This achievement underlines Litecoin&#8217;s robust network growth and the increasing adoption of the altcoin within the crypto community. The heightened on-chain volume has caught the attention of the crypto analytics platform Santiment, indicating that prominent market participants may be strategically positioning themselves in LTC investments ahead of the halving event. Santiment noted: If this trend of increased on-chain volume continues, it will absolutely be a strong sign that some big players are beginning to jump in on their LTC investments in anticipation of the halving. Litecoin Remains In The Red Despite the surge in network activity, Litecoin (LTC) price has not seen any notable movement in the market in the past 24 hours but instead a continuous downtrend. Over the past 24 hours, Litecoin has seen a 2.2% loss from its value. At the time of writing, Litecoin currently trades at $89.38 after trading slightly above $90 on Tuesday. LTC&#8217;s trading volume has plunged a bit from $700 million last Thursday to $578 million in the past 24 hours indicating less trading activity. Related Reading: Litecoin Surpasses $90, But This Level Remains Crucial For The Altcoin It is worth noting, however, that LTC is up 3.4% in the past week with a market cap up by more than $200 million in the same period. Meanwhile, Litecoin&#8217;s hash rate, a measure of the computational power dedicated to the network&#8217;s mining operations, has demonstrated consistency. Despite minor fluctuations, the processing power devoted to Litecoin&#8217;s blockchain has witnessed a surge of over 24% since the beginning of the year, currently standing at 714 TH/s. This upward trend not only enhances network security but also signifies the confidence and commitment of miners in supporting Litecoin&#8217;s ecosystem. Featured image from Shutterstock, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-31T08:27:17.000Z",
    "title": "Chainlink Revolutionizes Trillion Dollar Market with Innovative Real Estate Tokenization ",
    "url": "https://www.crypto-news-flash.com/chainlink-revolutionizes-trillion-dollar-market-with-innovative-real-estate-tokenization/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-revolutionizes-trillion-dollar-market-with-innovative-real-estate-tokenization",
    "description": "<p>Chainlink has explained the need to tokenize the real estate market and redefine the transaction process. There are known challenges that have not been addressed till today. Chainlink (LINK) has in a recent blog post explained plans of revolutionizing the real estate market with tokenization. Without a doubt, the real estate industry is connected to [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/chainlink-revolutionizes-trillion-dollar-market-with-innovative-real-estate-tokenization/\">Chainlink Revolutionizes Trillion Dollar Market with Innovative Real Estate Tokenization </a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-05-31T08:23:43.000Z",
    "title": "Bitcoin and Altcoins Report – May Week 5",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/bitcoin-and-altcoins-report-may-week-5/",
    "description": "<p>As May draws close, the macroeconomic landscape becomes the center of attention, with the United States debt ceiling deal already causing significant ripples. The anticipation of an imminent agreement to raise the debt ceiling and avert a potential U.S. government default brings a glimmer of hope for risk assets like Bitcoin across the board. Amidst [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/bitcoin-and-altcoins-report-may-week-5/\">Bitcoin and Altcoins Report – May Week 5</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-31T08:35:03.000Z",
    "title": "XDC Network Partners with SBI Group’s  SBI VC Trade Co. Ltd",
    "url": "https://coinedition.com/xdc-network-partners-with-sbi-groups-sbi-vc-trade-co-ltd/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Banking_Powerhouse_SBI_Commits_to_Empowering_XDC_Expanding_XDC-2-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Banking_Powerhouse_SBI_Commits_to_Empowering_XDC_Expanding_XDC-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Banking_Powerhouse_SBI_Commits_to_Empowering_XDC_Expanding_XDC-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Banking_Powerhouse_SBI_Commits_to_Empowering_XDC_Expanding_XDC-2-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Banking_Powerhouse_SBI_Commits_to_Empowering_XDC_Expanding_XDC-2-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Banking_Powerhouse_SBI_Commits_to_Empowering_XDC_Expanding_XDC-2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Banking_Powerhouse_SBI_Commits_to_Empowering_XDC_Expanding_XDC-2.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The open-source blockchain protocol XDC Network has announced its partnership with the SBI Group’s crypto exchange SBI VC Trade Co. Ltd, in an attempt to establish itself as a global leader in blockchain solutions by bringing digital transformation in the finance sector. Atul Khekade, the co-founder of XDC Network, shared his ecstasy in collaborating with [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xdc-network-partners-with-sbi-groups-sbi-vc-trade-co-ltd/\">XDC Network Partners with SBI Group’s  SBI VC Trade Co. Ltd</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-31T08:20:00.000Z",
    "title": "Ex Coinbase Product Manager Settles Insider Trading Charges with SEC",
    "url": "https://coinedition.com/ex-coinbase-product-manager-settles-insider-trading-charges-with-sec/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Today-former-Coinbase-product-manager-Ishan-Wahi-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Coinbase\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Today-former-Coinbase-product-manager-Ishan-Wahi-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Today-former-Coinbase-product-manager-Ishan-Wahi-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Today-former-Coinbase-product-manager-Ishan-Wahi-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Today-former-Coinbase-product-manager-Ishan-Wahi-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Today-former-Coinbase-product-manager-Ishan-Wahi-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Today-former-Coinbase-product-manager-Ishan-Wahi.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Former Coinbase product manager Ishan Wahi and his brother, Nikhil Wahi, have settled charges brought against them by the U.S. Securities and Exchange Commission (SEC) for engaging in insider trading. The SEC alleged that Ishan Wahi while working at Coinbase, coordinated the platform’s public listing announcements regarding crypto assets available for trading. Instead of keeping [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ex-coinbase-product-manager-settles-insider-trading-charges-with-sec/\">Ex Coinbase Product Manager Settles Insider Trading Charges with SEC</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]