[
  {
    "source": "NewsBTC",
    "date": "2023-10-03T02:00:23.000Z",
    "title": "Firewood Unleashed: Is This the Game-Changer For Avalanche (AVAX) To Hit $20?",
    "url": "https://www.newsbtc.com/avalanche/firewood-avalanche-avax-20/",
    "description": "Ava Labs, the developer of Avalanche, the high throughput platform for deploying decentralized applications (dapps) and custom chains, has released Firewood, an update the team said is a &#8220;multi-year effort that,&#8221; on the eventual rollout, will make blockchain data storage more efficient. Specifically, Ava Labs said Firewood resolves a big concern for expanding blockchains: data management.  Ava Labs Releases Firewood To The Public Ava Labs is open-sourcing the code for Firewood for refinement before its final implementation. Eventually, the team wants Firewood to be a choice tool through which blockchain data will be better organized and stored more efficiently. Toward this mission, Ava Labs developers are taking a new approach to storing and managing data, unlike in legacy networks.  Blockchains like Ethereum and Bitcoin use the Merkle Tree structure to organize data. While the system has been replicated widely across emerging ledgers, the Merkle Tree architecture tends to be slow and inefficient whenever the blockchain grows.  Related Reading: Bitcoin MPI Forms Death Cross, End of The Rally? Picking out the flaws in the Merkle Tree system, Ava Labs is building Firewood from scratch but with some &#8220;enhancements&#8221; to the system. Their objective, the statement reads, is to make blockchain data storage and organization smoother. Firewood doesn&#8217;t rely on generic tools like LevelDB or RocksDB. Ava Labs claim these tools have been a cause of &#8220;misalignment&#8221; leading to &#8220;significant overhead of either disk I/O, size (not tracking whether state is still used), and serialization/deserialization of Tree data structures to support high-throughput blockchain workloads.&#8221;  In light of these inefficiencies, the goal is to make Firewood a replacement &#8220;for the LevelDB/RocksDB + Merkle Tree.&#8221; Ava Labs claims that firewood can help users organize their data storage more &#8220;efficiently&#8221; with their system. This improvement will allow high throughput storage without constant data cleanup or compression. In the days ahead, Ava Labs revealed that Firewood will be integrated into various parts of the Avalanche. At the same time, the team plans to &#8220;release a series of reproducible benchmarks comparing the performance of Firewood to other blockchain databases.&#8221; Will Avalanche Rally To $20 And 2023 Highs? The release of Firewood is when AVAX, the native token of Avalanche, has been under immense pressure in 2023. The draw-down, fueled by the bear market and recent comments by the Securities and Exchange Commission (SEC) claiming that AVAX is an unregistered security, heaped more pressure on the coin. AVAX is changing hands at $9.53, up 11% from September 2023 lows. However, the coin is down roughly 60% from 2023 highs at around $20. Related Reading: XRP Price Bloodbath On The Horizon? Report Casts Doubt On Recent Rally Feature image from Canva, chart from TradingView"
  }
]