[
  {
    "source": "NewsBTC",
    "date": "2023-06-04T04:57:48.000Z",
    "title": "Bedrock Upgrade: How Optimism Game-Changer Could Impact OP Price",
    "url": "https://www.newsbtc.com/news/bedrock-upgrade-optimism-game-changer/",
    "description": "Optimism is gearing up for its eventual mainnet upgrade next week. This upgrade will offer lower protocol and security fees for users on the platform. This led to the ecosystem’s governance token, OP, enjoying an increase in price, albeit a modest 3.7% in the past 24 hours. This price movement only came after last month’s dismal performance where OP dropped by over 30% in the monthly timeframe. With the promise of lower fees along with Ethereum-like security for the coming upgrade, we might see OP continue its present bullishness. Related Reading: XRP Climbs 12% As Crypto Celebrates 11-Year Milestone Optimism: Laying The Bedrock For Future Growth Touted as the Bedrock mainnet upgrade, it aims to improve efficiency to drive down costs for investors on the platform. According to Optimism’s recent blog post, it should be able to drive protocol and security costs by a whopping 47%. The upgrade will use channels that will be split again to further optimize data compression. 🚀🌐 Layer2 network Optimism is gearing up for the Bedrock Upgrade soon! 💡💎 Discover how this game-changing update boosts scalability, security, and efficiency for Optimism, and what it means for the future of #Ethereum.#Optimism $OP #Layer2 #EIP1559 — KuCoin (@kucoincom) June 2, 2023 This upgrade also corresponds to Ethereum&#8217;s Dencun upgrade, which will drive down on-chain costs as a result of danksharding. Danksharding is a process that makes data blobs available for use by Layer 2 protocols like Optimism. This improvement would make Optimism more attractive to developers. OP total market cap currently at $970 million on the weekend chart: TradingView.com Along with the Bedrock upgrade is the upcoming OP Stack Mods which are improvements on the OP Stack layer by community members. These modifications can be voted on by the community to be an official part of the OP Stack layer. The upgrade also opens a path for Optimism to include improvements on its fault proofs with incentives for the community to propose improvements in the system. At $1.50, How Can This Impact OP Price?  The token’s current trajectory puts it on a perfect path towards higher highs in the coming days. At the moment, OP bulls are targeting $1.70 in the medium to long term with a potential to break through toward the $2 range. If the momentum permits it, investors and traders should continue its current price movement for higher gains. Source: CoinMarketCap With Bitcoin gaining ground at the time of writing, the gains made by OP bulls should be boosted in the medium term. However, investors should be careful of any bearish advances that might come in the next couple of days. Related Reading: Floki Inu Gains Momentum As Chinese E-Commerce Giant Recognizes Its Utility The token’s current support at $1.3 has no backing which could pull OP to the sub-$1 range. If this happens, OP bulls should be able to endure a possible drop to $0.5 support. But the current momentum held by the token is enough for investors to confidently target higher highs in the coming days. -Featured image from Shutterstock"
  }
]