[
  {
    "source": "CryptoSlate",
    "date": "2023-11-22T09:24:19.000Z",
    "title": "Sam Altman to return as OpenAI CEO after dramatic board overhaul",
    "url": "https://cryptoslate.com/sam-altman-to-return-as-openai-ceo-after-dramatic-board-overhaul/",
    "description": "<p>OpenAI, the ChatGPT developer, said it &#8220;reached an agreement in principle&#8221; to reinstate Sam Altman as chief executive following his recent shock departure. The AI company revealed this arrangement on Wednesday, outlining the formation of a new board chaired by former Twitter board Chairman Bret Taylor. The board includes notable figures like former U.S. Treasury [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/sam-altman-to-return-as-openai-ceo-after-dramatic-board-overhaul/\">Sam Altman to return as OpenAI CEO after dramatic board overhaul</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-22T09:14:38.000Z",
    "title": "Crypto Lawyer John Deaton Highlights His Top 10 Cryptocurrency Picks for Upcoming Bull Market",
    "url": "https://www.cryptoglobe.com/latest/2023/11/crypto-lawyer-john-deaton-highlights-his-top-10-cryptocurrency-picks-for-upcoming-bull-market/",
    "description": "John Deaton, a renowned figure in the cryptocurrency legal sphere, has recently shared his predictions for the cryptocurrencies that are likely to excel in the upcoming bull market. His forecast, which includes a variety of digital assets, was shared via a tweet, where he initially engaged the crypto community by asking them to nominate their […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-22T09:16:51.000Z",
    "title": "OpenAI gets into merger talks with Anthropic",
    "url": "https://www.cryptopolitan.com/openai-gets-into-merger-talks-with-anthropic/",
    "description": "In a twist that reads like a page from a tech thriller, OpenAI, the AI powerhouse, has recently approached Anthropic, a competitor and emerging force in the large-language model domain, proposing a merger. This move, unfolding in the wake of OpenAI&#8217;s CEO Sam Altman&#8217;s exit, is stirring up the AI community, hinting at a potential ... <a title=\"OpenAI gets into merger talks with Anthropic\" class=\"read-more\" href=\"https://www.cryptopolitan.com/openai-gets-into-merger-talks-with-anthropic/\" aria-label=\"More on OpenAI gets into merger talks with Anthropic\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-22T09:30:00.000Z",
    "title": "Binance ‘willfully failed’ to report over 100k transactions linked to fraud and scams, U.S. Treasury says",
    "url": "https://crypto.news/binance-willfully-failed-to-report-over-100k-transactions-linked-to-fraud-and-scams-u-s-treasury-says/",
    "description": "The government says Binance has agreed to look back and report to FinCEN about the suspicious transactions which it had failed to report. Cryptocurrency exchange Binance &#8220;willfully failed&#8221; to report to regulators more than 100,000 transactions on its platform tied&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-22T09:20:27.000Z",
    "title": "Binance Drama Causes Crypto Prices To Dance On The Edge – Details",
    "url": "https://www.newsbtc.com/news/binance-drama-causes-crypto-prices-to-drop/",
    "description": "The prices of prominent cryptocurrencies, such as bitcoin and Binance Coin, experienced a decline subsequent to the emergence of reports indicating that Changpeng Zhao, the founder and CEO of Binance, admitted guilt in relation to charges of anti-money laundering and several other criminal violations. This admission was made as part of a substantial settlement, amounting to billions of dollars, reached between Zhao and regulatory authorities in the United States. Binance Coin had a decline of almost 6% following an earlier increase of up to 5% during the day. This fluctuation in value was driven by investors who were optimistic about the resolution of the ongoing multiyear investigation involving the world&#8217;s largest cryptocurrency exchange. Related Reading: Sam Altman’s Worldcoin Token Makes Headlines With 24% Surge Amid OpenAI Drama In the aftermath of the market downturn, investors holding long positions on BNB experienced widespread liquidation. At the time of writing, BNB long liquidations approached $3 million within the hour following the disclosure of the Binance developments. The impact of the action had a significant influence on the remaining cryptocurrency market. The leading digital currency, Bitcoin (BTC), experienced a decrease of 1.55%, remaining slightly below the $37,000 mark. In a similar vein, Ethereum (ETH) observed a decline of around 2%, with its value reaching $1,993. Additional cryptocurrencies, like Ripple (XRP), experienced a decline of 3.2%. Similarly, Solana witnessed a decrease of almost 4%, while Polygon and Uniswap recorded losses of 7.6% and 3.6%, respectively. Zhao is currently confronting charges of violating criminal anti-money laundering laws, a charge he acknowledged responsibility for after resigning. Today, I stepped down as CEO of Binance. Admittedly, it was not easy to let go emotionally. But I know it is the right thing to do. I made mistakes, and I must take responsibility. This is best for our community, for Binance, and for myself. Binance is no longer a baby. It is… — CZ 🔶 Binance (@cz_binance) November 21, 2023 In addition, Binance has agreed to a $4.3 billion settlement with the US authorities, which is among the biggest, if not the most significant, resolutions in the history of the cryptocurrency market. The most recent FOMC minutes also appear to have compelled investors to trade cautiously in light of the continued market concerns, which is why cryptocurrency prices were down today. Notably, the drops in the prices of the majority of the main cryptocurrencies suggested that investor opinion may be changing. Market cap of cryptocurrencies at $1.35 trillion. Chart: TradingView.com Meanwhile, notwithstanding the early declines in price, some observers of the sector think that the Binance scenario may serve to further spark the recent surge in cryptocurrency prices. According to Jeff Embry, the managing partner of Globe 3 Capital, a crypto hedge fund, the reported settlement involving Binance holds significant importance in the context of addressing the consequences and rectifying the negative effects of the bear market. Related Reading: Bitcoin About To Smash The $38,000 Barrier – Decoding the Next Moves “Bear markets wash out many of the bad businesses, business practices, inefficiencies and bad actors,&#8221; he said. Fineqia Research Analyst Matteo Greco said the crypto industry will benefit in the long run from Changpeng Zhao&#8217;s resignation and Binance agreeing to pay a fine of $4 billion or more. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-22T09:30:41.000Z",
    "title": "Binance Crisis Deepens with $1 Billion Net Outflow, Sparks Investor Fears of Bankruptcy",
    "url": "https://www.crypto-news-flash.com/binance-crisis-deepens-with-1-billion-net-outflow-sparks-investor-fears-of-bankruptcy/?utm_source=rss&utm_medium=rss&utm_campaign=binance-crisis-deepens-with-1-billion-net-outflow-sparks-investor-fears-of-bankruptcy",
    "description": "<img width=\"800\" height=\"533\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/04/binance.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/04/binance.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2021/04/binance-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/04/binance-104x69.jpg 104w\" sizes=\"(max-width: 800px) 100vw, 800px\" />Binance is recording massive outflows as FUD rocks the trading platform. The exchange is set to pay $4.3B to the DOJ and founder CZ stepped down as CEO. Binance, one of the world&#8217;s largest crypto exchanges, is grappling with a crisis as a substantial net outflow of $1 billion in assets within the past 24 [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-22T09:34:25.000Z",
    "title": "Differences Between Virtual Currency and Digital Currency",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/differences-between-virtual-currency-and-digital-currency/",
    "description": "<p>Many crypto investors do not know the differences between virtual currency and digital currency. Indeed, investors use both these terms interchangeably. Yet, they&#8217;re unaware of its subtle differences. Today, we&#8217;ll be going through what sets these two apart from each other. To do this, we&#8217;ll be using the flow chart as shown below. Defining Virtual Currency [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/differences-between-virtual-currency-and-digital-currency/\">Differences Between Virtual Currency and Digital Currency</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]