[
  {
    "source": "CoinDesk",
    "date": "2023-09-25T12:46:09.000Z",
    "title": "First Mover Americas: Aptos Rallies While Major Cryptos Trade Lower ",
    "url": "https://www.coindesk.com/markets/2023/09/25/first-mover-americas-aptos-rallies-while-major-cryptos-trade-lower/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for Sept. 25, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-25T13:06:44.000Z",
    "title": "European Investors More Bullish on Crypto Than American, Says CoinShares Report",
    "url": "https://decrypt.co/198591/european-investors-more-bullish-crypto-than-american-says-coinshares-report",
    "description": "A new CoinShares report indicates that EU investors have been more bullish on crypto than their U.S. counterparts. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-25T13:01:06.000Z",
    "title": "Digital Yuan app adds prepaid Mastercard VISA top-ups for tourists  ",
    "url": "https://cointelegraph.com/news/digital-yuan-app-adds-prepaid-mastercard-visa-payments-tourists",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/1dd29dd7-91dd-43b7-9c58-e3d97ccb548d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Digital Yuan app now allows tourists to top-up e-CNY wallets with Mastercard & VISA payment with 'recharge first and use later' option.</p>\n                    <p><p>Tourists planning on visiting the People's Republic of China can now pre-charge Digital Yuan wallets using VISA and Mastercard payment options as the nation continues to update the mobile app powering its CBDC pilot.</p><p>The e-CNY app, which is still in its pilot version, is available to iOS and China-based Google Play Store users. The application serves individual users, allowing them to open digital renminbi wallets to make use of e-CNY. </p><p>As per the latest iOS app <a href=\"https://apps.apple.com/ru/app/e-cny/id1571652872?l=en-GB\" target=\"_blank\" rel=\"noopener nofollow\">update </a>published on Sept. 22, version 1.1.1 includes the support of its top-up service with international card options. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/8acc8178-ae7a-43b7-86c4-7ed8237c596a.png\"  /><figcaption style=\"text-align: center;\">The latest version of e-CNY app on the App Store introducing the top up service for internation cards.</figcaption></figure><p>According to a number of local Chinese news outlets, the latest version of the e-CNY app coincides with the start of the Asian Games. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/e76ae3e9-bf29-4149-9a2c-e22b9757c670.png\"  /><figcaption style=\"text-align: center;\">A tutorial for foreign users outlining the process of signing up using an international number. Source: e-CNY app.</figcaption></figure><p>China had extensively trialed the use of the digital renminbi as a payment option for foreigners visiting the country. According to Yicai, the Beijing Winter Olympics in 2022 marked the beginning of the CBDC pilot being open for tourists as a means to transact with local merchants using e-CNY.</p><p>Inbound tourists are reportedly able to make use of overseas mobile numbers to register and open e-CNY wallets and make use of the recharge wallet feature which now supports VISA and Mastercard payments.</p><p>As Cointelegraph recently <a href=\"https://cointelegraph.com/news/bank-of-china-digital-yuan-payment-option-must-be-offered-in-retail-scenarios\">reported</a>, China is making moves to ensure that the Digital Yuan is available as a payment option for all retail payment scenarios. This would make the e-CNY a ubiquitous payment method in China between retail users and merchants. </p><p><a href=\"https://cointelegraph.com/magazine/real-reason-chinas-war-on-crypto-3ac-judges-embarrassing-mistake-asia-express/\"><em>Magazine: Real reason for China’s war on crypto, 3AC judge’s embarrassing mistake: Asia Express</em></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-25T13:01:00.000Z",
    "title": "Binance exit aftershock: Can one resignation tip the crypto trust scales?",
    "url": "https://cointelegraph.com/news/binance-exit-aftershock-can-one-resignation-tip-the-crypto-trust-scales",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/5f6adfa4-eb2e-499c-b8f2-84808a6202d0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The announcement of yet another top figure departing Binance coincided with an increased outflow of funds from the crypto platform. But can one executive resignation really have such an impact? </p>\n                    <p><p>On Sept. 13, news broke of yet another <a href=\"https://cointelegraph.com/news/binance-us-cuts-third-of-staff-ceo-brian-shroder-leaves-report\">high-level executive parting ways with Binance.US</a>. </p><p>This time, it was none other than Brian Shroder, the CEO and president of the exchange, who, after two years in the hot seat, was heading for a “deserved break,” as Binance CEO Changpeng “CZ” Zhao was <a href=\"https://cointelegraph.com/news/binance-ceo-responds-to-rumors-says-us-executive-is-taking-a-deserved-break\">quick to announce on X</a> (formerly Twitter) that same day.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">There has been some speculation regarding recent management changes at <a href=\"https://twitter.com/BinanceUS?ref_src=twsrc%5Etfw\">@BinanceUS</a>. Brian Shroder is taking a deserved break after accomplishing what he set out to do when he joined two years ago. Under his leadership, <a href=\"https://t.co/hSHrrlF7o7\">https://t.co/hSHrrlF7o7</a> raised capital, improved its product…</p>&mdash; CZ  Binance (@cz_binance) <a href=\"https://twitter.com/cz_binance/status/1702750076647412146?ref_src=twsrc%5Etfw\">September 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The news coincided with the announcement that around 100 people had also lost their jobs that day — about a third of the workforce. </p><p>A massive outflow of funds followed, with the highest being just over $66 million in a single transaction. Zhao was keen to underline that Shroder’s departure was amicable and that he had achieved everything he had set out to do. </p><p>“Ignore the FUD,” was the call from the parapets, the common plea for calm when any kind of disruption occurs. </p><p>In an industry strained and battered by tales of fraud and wrongdoing, however, this call went unheeded once again. The days since the news broke have seen significant outflows from Binance to platforms such as Jump, AU21 Capital, QCP Capital and Wintermute.</p><p>Once again, it raises issues that have long dogged the cryptosphere, chiefly those of influence and trust. There are few other sectors where layoffs or a change at the top of a company can have such an impact. </p><p>Such things are generally accepted as the natural ebb and flow of the business world, and while there may be a momentary blip, more often than not, things are back on track fairly soon afterward. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/3c561d15-8181-468d-af54-200c64af5398.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">Transactions between cryptocurrency platforms in the days following the announcement. Source: Blockanalia/X</figcaption></figure><p>Even in this instance, from the chart, it is apparent that there were still sizeable inflows to Binance during the period. The two incidents may be completely unrelated. With so many factors involved, no one can say for sure.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ai-killed-translation-industry-easytranslate-boss-change-human-jobs/\">‘AI has killed the industry’: EasyTranslate boss on adapting to change</a></em></strong></p><p>Jim Graham, a cryptocurrency analyst at think tank PsyBold, told Cointelegraph: “While we can’t attribute the shift in funds wholly to last week’s announcement, we most certainly can’t reject it, either. There have been several key managerial changes in the past few months, and virtually all of them have been accompanied by a dip in holdings on the platform. Trust remains a massive obstacle for crypto platforms, and it’s an obstacle they are failing to overcome.”</p><p>Money is a valuable commodity, and even the hint that it may be in jeopardy is reason enough to react quickly and decisively. </p><p>As the saying goes, trust is earned, not given away, and the recent negative events involving crypto platforms have done little to raise that level of trust. Graham added: </p><blockquote>“Crypto platforms need to be on par with banks regarding trust. Investors need to know that entrusting their money to them is a good, safe idea, not a risky one. Unfortunately, they are nowhere near that, and until we reach that level, these spikes are inevitable.”</blockquote><p>So, how do the platforms get to that level of trust? Most people would simply say, stop doing bad things. Once crypto platforms act more like banks, people may trust them more. </p><p>But this is much easier said than done. For one, most banks have been around for years, some even hundreds of years. Trust has an element of longevity to it, which people like. The general feeling is if something or someone has acted responsibly and transparently for a long time, there is more of a chance that they will continue to do so. </p><p>Crypto platforms don’t have that luxury, of course. Most can only look back on a few years of existence; the only pledge they can give is their word. </p><p>On top of that, there is the age-old discussion of regulation. Licensed banks are regulated. That means an authority monitors what they do and is there to step in if things go wrong. </p><p>The last thing such an authority or the bank wants is a bank run, as this represents a complete breakdown in trust for all concerned, with the consequences that go with that. Once that has happened, it is tough to win that trust back, as witnessed during the economic crisis of 2008. </p><p>In the unregulated world of crypto exchanges, there is currently a stalemate. Some investors are in the middle, clamoring for regulation, fearing for their investments. In contrast, others are vehemently opposed, stating regulation is the very thing cryptocurrency was created to avoid. </p><p>And on either side are the exchanges and the authorities, each accusing the other of this and that in what seems like an endless spiral, with neither ready to back down.Sandra McAllister, an attorney specializing in tech litigation with Clifford Chance, told Cointelegraph: </p><blockquote>“The need to clarify the legalities around trading cryptocurrencies, particularly in the U.S., is vitally important for the future of the industry, but the protracted processes and tactics being employed are damaging, for both sides, and that, in turn, is turning investors away.”</blockquote><p>“The power of social media is also a pressure on the market. The bounce in the Ripple price we saw in July following the court ruling on XRP underlines that perfectly. The decision was anything but conclusive and, in reality, nothing more than a step along the path, but it was blown up on social media as a huge victory that drove up prices. We only have to see where the Ripple price is today to see how much of a victory it actually was,” she said.</p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/stablecoin-exodus-why-are-investors-fleeing-crypto-s-safe-haven\">Stablecoin exodus: Why are investors fleeing crypto’s safe haven?</a></em></strong></p><p>Moving assets around between different exchanges or different assets is nothing new or unusual, of course. In times of economic downturn, funds tend to flow toward the “safer” havens, such as bonds and gold, before reverting to more profitable areas when things pick up. </p><p>Graham commented, “While diversifying holdings and being ready to react to ensure you are not unduly affected by negative pressures is sound financial advice, the problem facing crypto holders right now is which platform is safer than another. The FTX demise showed us that ‘too big to fail’ does not apply, so what remains?”</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-25T12:48:57.000Z",
    "title": "MicroStrategy buys $147M worth of Bitcoin, now holds 158K BTC",
    "url": "https://cointelegraph.com/news/microstrategy-buys-5-4k-bitcoin-for-147million",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/a229b02f-8fb7-4dd3-9866-12023bd30881.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>MicroStrategy bought the latest Bitcoin stash at an average price of $27,053 per BTC, or 9% lower than the average purchase price of its entire BTC purchase.</p>\n                    <p><p>MicroStrategy, a business intelligence firm and major Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) investor, is sending a bullish signal to the market by announcing the acquisition of another big stash of cryptocurrency.</p><p><a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/michael-saylor\">Michael Saylor</a>, co-founder and executive chairman at MicroStrategy, took to X (formerly Twitter) on Sept. 25 to announce a 5,445 BTC purchase by the firm. The latest Bitcoin stash was bought at an average price of $27,053 per BTC, or for $147.3 million in cash.</p><p><a href=\"https://www.microstrategy.com/content/dam/website-assets/collateral/financial-documents/financial-document-archive/form-8-k_9-25-2023.pdf\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to a Form 8-K filing with the United States Securities and Exchange Commission, MicroStrategy and its subsidiaries have been in the process of acquiring the amount between Aug. 1, 2023 and Sept. 24, 2023.</p><p>As of Sept. 24, MicroStrategy and its subsidiaries held an aggregate of approximately 158,245 bitcoins, which were acquired at an average purchase price of roughly $29,582 per BTC, inclusive of fees and expenses, the filing notes. The aggregate purchase price for MicroStrategy’s total Bitcoin holdings has amounted to $4.68 billion.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">MicroStrategy has acquired an additional 5,445 BTC for ~$147.3 million at an average price of $27,053 per <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcoin</a>. As of 9/24/23 <a href=\"https://twitter.com/MicroStrategy?ref_src=twsrc%5Etfw\">@MicroStrategy</a> hodls 158,245 <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> acquired for ~$4.68 billion at an average price of $29,582 per bitcoin. <a href=\"https://twitter.com/search?q=%24MSTR&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$MSTR</a> <a href=\"https://t.co/GbJtUoQfXv\">https://t.co/GbJtUoQfXv</a></p>&mdash; Michael Saylor⚡️ (@saylor) <a href=\"https://twitter.com/saylor/status/1706278284651077714?ref_src=twsrc%5Etfw\">September 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The new purchase comes as Bitcoin trades sideways around $26,000 over the past few weeks. After briefly touching $28,000 on Aug. 29, Bitcoin <a href=\"https://www.coingecko.com/en/coins/bitcoin\" target=\"_blank\" rel=\"noopener nofollow\">slipped</a> to as low as $25,000 on Sept. 11. At the time of writing, Bitcoin is trading at $26,081, down 1.9% over the past 24 hours, according to data from CoinGecko. The cryptocurrency is also down around 4% over the past seven days.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-centralized-corporate-feared-michael-saylor\"><strong><em>Bitcoin bought by corporate giants should not be feared — Michael Saylor</em></strong></a></p><p>MicroStrategy’s latest Bitcoin purchase further reaffirms the company’s bullish stance on Bitcoin. The firm <a href=\"https://cointelegraph.com/news/micro-strategy-buys-347m-worth-of-bitcoin-amid-market-thaw\">previously bought 12,333 BTC for $347 million</a> in June 2023, at an average purchase price of $29,668 per BTC.</p><p>In Q1 2023, MicroStrategy reported its <a href=\"https://cointelegraph.com/news/microstrategy-s-bitcoin-conviction-strong-as-it-returns-to-profit-in-q1-ceo\">first profitable quarter since 2020</a> due to a one-time income tax benefit. The company managed to retain profitability in the next quarter, <a href=\"https://cointelegraph.com/news/microstrategy-earnings-profit-second-quarter-bitcoin\">reporting $22.2 million in net income</a> in early August.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/jpex-staff-flee-token2049-scandal-mt-gox-decade-delay-dcs-singapore-asia-express/\"><strong><em>Asia Express: PEX staff flee event as scandal hits, Mt. Gox woes, Diners Club crypto</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-25T13:00:21.000Z",
    "title": "Unshaken Bitcoin mining industry navigates fluctuating share prices",
    "url": "https://cryptoslate.com/insights/unshaken-bitcoin-mining-industry-navigates-fluctuating-share-prices/",
    "description": "<p>Quick Take Recent data analysis has shown that Bitcoin miners&#8217; share prices have undergone significant fluctuations over the past few years. According to analyst Dylan Le Clair&#8217;s assessment of an equal-weight public miner index, the shares are currently down by a staggering 54.5% from their mid-July peak. This follows a series of dramatic swings: a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/unshaken-bitcoin-mining-industry-navigates-fluctuating-share-prices/\">Unshaken Bitcoin mining industry navigates fluctuating share prices</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-25T13:07:34.000Z",
    "title": "Hydranet Launches Layer 3 DEX: A Game Changer for Trustless Cross-Chain Trading",
    "url": "https://cryptodaily.co.uk/2023/09/hydranet-launches-layer-3-dex-a-game-changer-for-trustless-cross-chain-trading",
    "description": "Hydranet Launches Layer 3 DEX: A Game Changer for Trustless Cross-Chain Trading"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-25T13:02:24.000Z",
    "title": "Airdrop Claims For $ARB Missed, $59m Recouped to Arbitrum Treasury",
    "url": "https://cryptodaily.co.uk/2023/09/airdrop-claims-for-arb-missed-59m-recouped-to-arbitrum-treasury",
    "description": "Roughly $59 million worth of ARB tokens were recouped by the exchange after users missed the Sept. 24 claim deadline."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-25T12:48:59.000Z",
    "title": "Mixin Network Suffers $200m Loss In Assets After Exploit",
    "url": "https://cryptodaily.co.uk/2023/09/mixin-network-suffers-200m-loss-in-assets-after-exploit",
    "description": "The loss resulted from an exploit that took place two days prior, compromising the database of a third-party cloud service provider."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-25T12:45:11.000Z",
    "title": "Will Shiba Budz (BUDZ) Dethrone Shiba Inu (SHIB) and Take off to the Moon",
    "url": "https://news.bitcoin.com/will-shiba-budz-budz-dethrone-shiba-inu-shib-and-take-off-to-the-moon/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/photo_2023-09-25_14-50-17-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/photo_2023-09-25_14-50-17-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/photo_2023-09-25_14-50-17-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/photo_2023-09-25_14-50-17-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/photo_2023-09-25_14-50-17-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/photo_2023-09-25_14-50-17-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/photo_2023-09-25_14-50-17-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/photo_2023-09-25_14-50-17.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. New cryptocurrency initiatives are continuously arising, each with its own distinct value proposition and room for expansion. Shiba Budz (BUDZ), one such effort, has recently gained attention. Shiba Budz (BUDZ), positioned as the utility meme world&#8217;s next big thing, intends to take advantage of the meme tokens&#8217; rising popularity while simultaneously bringing cutting-edge [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-25T13:09:08.000Z",
    "title": "BREAKING: MicroStrategy drops another $147 million on Bitcoin",
    "url": "https://www.cryptopolitan.com/breaking-microstrategy-drops-another-147-million-on-bitcoin/",
    "description": "MicroStrategy, a leading software development firm, has once again demonstrated its steadfast commitment to Bitcoin. According to a recent regulatory filing, the company acquired an additional 5,445 bitcoins between August 1 and September 24, 2023. The investment, which totaled approximately $147.3 million, came at an average price of around $27,053 per Bitcoin. This latest acquisition ... <a title=\"BREAKING: MicroStrategy drops another $147 million on Bitcoin\" class=\"read-more\" href=\"https://www.cryptopolitan.com/breaking-microstrategy-drops-another-147-million-on-bitcoin/\" aria-label=\"More on BREAKING: MicroStrategy drops another $147 million on Bitcoin\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-09-25T12:52:13.000Z",
    "title": "MicroStrategy Bolsters Bitcoin Holdings with $147.3 Million Purchase",
    "url": "https://nulltx.com/microstrategy-bolsters-bitcoin-holdings-with-147-3-million-purchase/",
    "description": "In a move that reaffirms its commitment to cryptocurrencies, MicroStrategy, a leading business intelligence firm, has recently announced the acquisition of an additional 5,445 Bitcoin (BTC) for approximately $147.3 million. This strategic investment was made at an average price of $27,053 per BTC, further expanding MicroStrategy&#8217;s already substantial crypto portfolio. MicroStrategy Now Holds 158,245 BTC [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-25T12:50:51.000Z",
    "title": "Princess Diana’s law firm to file a lawsuit against OneCoin",
    "url": "https://crypto.news/princess-dianas-law-firm-to-file-a-lawsuit-against-onecoin/",
    "description": "The British law firm that represented Diana, Princess of Wales, is now going after OneCoin masterminds."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-25T13:00:23.000Z",
    "title": "Over 90 Million $ROE Tokens Sold! Is Borroe.Finance Poised to Join the Ranks of TRON ($TRX) and Cardano ($ADA)?",
    "url": "https://www.crypto-news-flash.com/over-90-million-roe-tokens-sold-is-borroe-finance-poised-to-join-the-ranks-of-tron-trx-and-cardano-ada/?utm_source=rss&utm_medium=rss&utm_campaign=over-90-million-roe-tokens-sold-is-borroe-finance-poised-to-join-the-ranks-of-tron-trx-and-cardano-ada",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-150.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-150.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-150-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-150-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-150-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-150-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Tron&#8217;s ($TRX) rising DeFi activity has increased its Total Value Locked (TVL) since September 1. Likewise, Cardano&#8217;s ($ADA) high development activity has kept $ADA stable in the face of bearish pressures. Now, both tokens are on a bullish ascent. Yet, they are expected to be joined by Borroe.Finance ($ROE) &#8211;  a fundraising protocol for Web [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-25T13:00:14.000Z",
    "title": "BREAKING: Shiba Inu Unveils New SHIB-Focused Blockchain to Foster Ecosystem Adoption and Development – Can It Drive Price to $0.0001?",
    "url": "https://www.crypto-news-flash.com/breaking-shiba-inu-unveils-new-shib-focused-blockchain-to-foster-ecosystem-adoption-and-development-can-it-drive-price-to-0-0001/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-shiba-inu-unveils-new-shib-focused-blockchain-to-foster-ecosystem-adoption-and-development-can-it-drive-price-to-0-0001",
    "description": "<img width=\"512\" height=\"271\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T113548.982.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T113548.982.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T113548.982-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T113548.982-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Shib Association, an offshoot of community-driven Shiba Inu burn tracker Shibburn, announces the development of a blockchain exclusively dedicated to SHIB. Unlike Shiba Inu&#8217;s official Shibarium L2 scaling network, this new blockchain will utilize SHIB for transaction fees, and not BONE, heralding a nuanced blockchain approach for the Shiba Inu ecosystem. In a move to [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-25T12:53:00.000Z",
    "title": "Crypto Influencer Says XRP’s Ruling Will Save the Crypto Ecosystem",
    "url": "https://coinedition.com/crypto-influencer-says-xrps-ruling-will-save-the-crypto-ecosystem/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/135-Million-More-XRP-Added-By-Whales-Is-Next-Pump-Near.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/135-Million-More-XRP-Added-By-Whales-Is-Next-Pump-Near.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/135-Million-More-XRP-Added-By-Whales-Is-Next-Pump-Near-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/135-Million-More-XRP-Added-By-Whales-Is-Next-Pump-Near-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/135-Million-More-XRP-Added-By-Whales-Is-Next-Pump-Near-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/135-Million-More-XRP-Added-By-Whales-Is-Next-Pump-Near-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Prominent crypto influencer Wendy O said in a recent video that blockchain companies are now relying on the court’s decision in Ripple’s case to fight the U.S. Securities and Exchange Commission. According to her, crypto exchange Binance and live streaming platform Library Credit have relied on the decision in their cases against the SEC. Blockchain [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-influencer-says-xrps-ruling-will-save-the-crypto-ecosystem/\">Crypto Influencer Says XRP’s Ruling Will Save the Crypto Ecosystem</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-09-25T12:44:28.000Z",
    "title": "Bitfinex Alpha 73 | Markets remain stable as selling peaks",
    "url": "https://blog.bitfinex.com/uncategorized/bitfinex-alpha-73-markets-remain-stable-as-selling-peaks/",
    "description": "<p>This week, we assess the Bitcoin markets and the state of market sentiment by analysing a range of on-chain indicators. A prevailing sense of seller exhaustion is palpable among Bitcoin&#8217;s short-term holders, as evidenced by Spent Output Profit Ratio (SOPR) indicators, which shows that selling...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/uncategorized/bitfinex-alpha-73-markets-remain-stable-as-selling-peaks/\">Bitfinex Alpha 73 | Markets remain stable as selling peaks</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]