[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-26T20:06:53.000Z",
    "title": "Worldcoin Price Prediction 2023 – 2030: How High Will WLD Go?",
    "url": "https://www.cryptopolitan.com/worldcoin-price-prediction/",
    "description": "Worldcoin, spearheaded by OpenAI chief Sam Altman,&#160;launched&#160;on Monday, 24 July 2023, after years in development, promising to verify users’ identity by iris-scanning and potentially solving one of the more pressing problems posed by recent advances in artificial intelligence. When it surged in price as an opening salvo, there was a flurry of criticisms about it, ... <a title=\"Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/worldcoin-price-prediction/\" aria-label=\"More on Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-26T19:51:52.000Z",
    "title": "This Week’s Tech Highlights, Breakthroughs and Trends",
    "url": "https://www.cryptopolitan.com/this-weeks-tech-highlights-breakthroughs/",
    "description": "In a rapidly evolving landscape of technology, intriguing developments, and groundbreaking advancements are shaping the world. From deciphering brain signals to recreate music, to the rise of clean energy, here&#8217;s a glimpse into the most remarkable stories from the tech world this week. Decoding brain waves to recreate music In a feat that seems right ... <a title=\"This Week’s Tech Highlights, Breakthroughs and Trends\" class=\"read-more\" href=\"https://www.cryptopolitan.com/this-weeks-tech-highlights-breakthroughs/\" aria-label=\"More on This Week’s Tech Highlights, Breakthroughs and Trends\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-26T19:42:32.000Z",
    "title": "AI’s Dual Role in Climate Change – Savior or Culprit?",
    "url": "https://www.cryptopolitan.com/ais-in-climate-change-savior-or-culprit/",
    "description": "Artificial intelligence (AI) is rapidly becoming an integral part of modern society, offering solutions to complex challenges and enhancing productivity. However, its environmental impact remains a topic of debate. While many experts believe AI can be a potent tool against climate change, concerns about its carbon footprint persist. The United Nations Environment Program has praised ... <a title=\"AI&#8217;s Dual Role in Climate Change &#8211; Savior or Culprit?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ais-in-climate-change-savior-or-culprit/\" aria-label=\"More on AI&#8217;s Dual Role in Climate Change &#8211; Savior or Culprit?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-26T19:47:43.000Z",
    "title": "Massive Pepe coin theft sparks allegations of insider trading",
    "url": "https://crypto.news/massive-pepe-coin-theft-sparks-allegations-of-insider-trading/",
    "description": "Deflationary meme currency Pepe Coin is embroiled in a web of controversy surrounding a significant token theft and accusations of insider trading. As the Pepe Coin saga unfolds, an on-chain analyst known as Yazan alleges that individuals with privileged access&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-26T20:00:03.000Z",
    "title": "Shibarium Launch Proves Positive As Shiba Inu-Based BONE Celebrates New Milestone",
    "url": "https://www.newsbtc.com/shiba-inu/shibarium-shiba-inu-bone/",
    "description": "Following its temporary shutdown, Shibarium has made a comeback and relaunched. This release of the layer 2 blockchain has pushed the BONE price upwards, recording new milestones for the token.  Shibarium Relaunch Ignites Bullish Trend For BONE Bone Shibaswap (BONE) has recorded a massive price increase of about 17% in the last 24 hours after Shibarium made an official relaunch and became open to the public on Thursday, August 24. The number of BONE addresses has also increased to 90,151 while SHIB burn rates are running high. Related Reading: Exodus Of 30,000 BTC To Cold Wallets Spells Good News For Bitcoin Price Currently, the BONE token is valued at $1.40 with a 24-hour trading volume of over $11 million, according to CoinMarketCap. The shift in the price has also proved fortunate for a majority of BONE token holders.  Reports reveal that 68% of BONE holders are in a very profitable position and are likely to reap massive gains. In contrast, 19% are currently in the red, struggling with some losses. The remaining 13% of BONE holders have found themselves at a point of stability, experiencing no profits or losses.  68% of holders sitting in profit &#124; Source: IntoTheBlock Shibarium’s Lead Developer, Shytoshi Kusama had previously described plans of adding new features and tweaks to prevent another suspension. He also stated that the Shiba Inu team plans to integrate a Self-Sovereign Identity (SSI) into Shibarium.  Additionally, he said that the recently launched layer 2 blockchain has finally achieved a state of stability, ensuring users gain all the benefits of the mainnet including more options for BONE staking.  “After two days of testing and tweaking parameters to achieve a ‘ready’ state, Shibarium is now enhanced and optimized. Additional validators will go live, giving even more options for you to stake your BONE,” Kusama said. SHIB Community Embraces Shibarium Relaunch And Modifications The SHIB army has been anticipating Shibarium’s release after the Ethereum layer 2 solution got off to a rocky start. The Shibarium mainnet halted its operations after its first launch and has been undergoing reconfigurations and testing to bolster its network.  According to developers, the reason for the network’s suspension was due to the high traffic and overwhelming increase in adoption, with over 10 million new wallets registered on the platform. However, Kusama had reassured the SHIB community, stating that the mainnet was only going through a few tweaks and would be up and running soon, stronger than it was in its previous release.  Shiba Inu’s price performance also declined slightly following Shibarium’s temporary shutdown. But the cryptocurrency is on a recovery trend presently and growing to be one of the trendiest meme coins in the crypto space.  Related Reading: Shiba Inu Whale Buys 708 Billion SHIB, Sparks Speculation Of Price Recovery The recent relaunch has pushed active addresses in the Shibarium mainnet to over 50,000 and this figure is expected to continue to rise. Lead developer Kusama has also vowed to increase the layer 2 network’s capacity by 1,500%, improving its safety, decentralization, and solidity.  Recently, Shiba Inu has been making new strides in the crypto space, expanding into new geographical regions to facilitate better adoption. The meme coin is now available to Brazilian merchants through Binance Pay, a cryptocurrency payment technology supported by the Binance exchange. Token price ranging at $1.3 following new milestone &#124; Source: BONEUSDT on Tradingview.com Featured image from BSC News, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-26T20:00:42.000Z",
    "title": "$48,810,000,000 in Deposits Exit US Banks in One Week As Money Market Funds Report Massive Inflows",
    "url": "https://dailyhodl.com/2023/08/26/48810000000-in-deposits-exit-us-banks-in-one-week-as-money-market-funds-report-massive-inflows/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/banking-deposit-dollar.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/banking-deposit-dollar.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/banking-deposit-dollar.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/banking-deposit-dollar.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/banking-deposit-dollar.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/banking-deposit-dollar.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/banking-deposit-dollar.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Billions of dollars are flowing out of the traditional banking system as money market funds witness a wave of inflows. According to fresh stats from the Federal Reserve Economic Data (FRED) system, $48.81 billion in deposits exited American bank accounts from August 10th through the 16th. In the last year, a the total amount of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/26/48810000000-in-deposits-exit-us-banks-in-one-week-as-money-market-funds-report-massive-inflows/\">$48,810,000,000 in Deposits Exit US Banks in One Week As Money Market Funds Report Massive Inflows</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-26T19:55:56.000Z",
    "title": "Scammer Nabs $55,000 in Crypto by Duping the U.S. Drug Enforcement Agency: Report",
    "url": "https://dailyhodl.com/2023/08/26/scammer-nabs-55000-in-crypto-by-duping-the-u-s-drug-enforcement-agency-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/scammer-nabs-duping-drug.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/scammer-nabs-duping-drug.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/scammer-nabs-duping-drug.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/scammer-nabs-duping-drug.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/scammer-nabs-duping-drug.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/scammer-nabs-duping-drug.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/scammer-nabs-duping-drug.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A scammer has reportedly duped the U.S. Drug Enforcement Agency (DEA) into sending them $55,000 worth of crypto. According to a new report from Forbes, the DEA sent a test transfer of $45.36 worth of Tether (USDT) to the U.S. Marshals Service after seizing more than $500,000 worth of the stablecoin in May from two [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/26/scammer-nabs-55000-in-crypto-by-duping-the-u-s-drug-enforcement-agency-report/\">Scammer Nabs $55,000 in Crypto by Duping the U.S. Drug Enforcement Agency: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]