[
  {
    "source": "CoinDesk",
    "date": "2023-12-18T11:51:21.000Z",
    "title": "Belgium to Push European Blockchain Network During EU Council Presidency, Digital Minister Says",
    "url": "https://www.coindesk.com/policy/2023/12/18/belgium-to-push-european-blockchain-network-during-eu-council-presidency-digital-minister-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "EU-wide blockchain services could support the bloc’s pursuit of digital sovereignty, Mathieu Michel tells CoinDesk."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-18T11:54:39.000Z",
    "title": " Hut 8 agrees to develop mining site to build equity with Celsius creditors ",
    "url": "https://cointelegraph.com/news/hut8-texas-mining-equity-celsius-creditors",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNjg4YjZlZDAtOGMwZS00NDdhLTg3MjgtZmQzNTgzOTYzM2VhLkpQRw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Hut 8’s new mining site in Cedarvale, Texas, will house almost 66,000 miners and will be powered by more than 215 MWof energy.</p>\n                    <p><p>The Canadian Bitcoin mining firm Hut 8 has signed an interim agreement to launch a new mining site in Cedarvale, Texas, in connection with the Celsius Network bankruptcy proceedings.</p><p>Announcing the news on Dec. 18, Hut 8 said that the mining site will house almost 66,000 miners and will be powered by more than 215 megawatts (MW) of energy.</p><p>Hut 8 president Asher Genoot said that the agreement targets a “twofold” goal, which is to build equity with creditors of Celsius while also growing the strength of the managed services business. “We anticipate having more than 895 MW of infrastructure under our umbrella once the site is up and running,” the executive noted.</p><p><a href=\"https://cointelegraph.com/news/hut8-texas-mining-equity-celsius-creditors\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-18T11:52:39.000Z",
    "title": "Solana DEXs momentarily outpace Ethereum amid surge in memecoin, stablecoin activity",
    "url": "https://cryptoslate.com/solana-dexs-momentarily-outpace-ethereum-amid-surge-in-memecoin-stablecoin-activity/",
    "description": "<p>On Dec. 16, the trading volume of decentralized exchanges (DEX) on Solana briefly flipped that of Ethereum for the first time amid the continued growth of the smart-contract-enabled blockchain ecosystem. Data from DeFillama shows that the trading volume of DEXs on the blockchain reached $1.536 billion, while Ethereum stood at only $1.164 billion during the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/solana-dexs-momentarily-outpace-ethereum-amid-surge-in-memecoin-stablecoin-activity/\">Solana DEXs momentarily outpace Ethereum amid surge in memecoin, stablecoin activity</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-18T12:06:36.000Z",
    "title": "FuturePlay Crypto Casino Launches: Pioneering 'Machina Sports' Revolutionizes iGaming In 2023!",
    "url": "https://cryptodaily.co.uk/2023/12/futureplay-crypto-casino-launches-pioneering-machina-sports-revolutionizes-igaming-in-2023",
    "description": "FuturePlay Crypto Casino Launches: Pioneering 'Machina Sports' Revolutionizes iGaming In 2023!"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-18T12:05:57.000Z",
    "title": "The Evolution Begins: StrikeX Launches Ultimate Crypto-Crypto Swaps Experience with Swaps V2 Wallet Update",
    "url": "https://cryptodaily.co.uk/2023/12/the-evolution-begins-strikex-launches-ultimate-crypto-crypto-swaps-experience-with-swaps-v2-wallet-update",
    "description": "The Evolution Begins: StrikeX Launches Ultimate Crypto-Crypto Swaps Experience with Swaps V2 Wallet Update"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T12:07:17.000Z",
    "title": "FuturePlay Crypto Casino Launches: Pioneering ‘Machina Sports’ Revolutionizes iGaming In 2023!",
    "url": "https://www.cryptopolitan.com/futureplay-crypto-casino-launches-pioneering-machina-sports-revolutionizes-igaming-in-2023/",
    "description": "N/A, N/A, December 18th, 2023, Chainwire FuturePlay Unleashes a New Era in iGaming and Sports Entertainment Embarking on its journey in 2023, FuturePlay is reshaping the landscape of online gaming through the fusion of sports, iGaming, and cryptocurrency. Offering an extensive library of over 3,000 games, an integrated sports book and an innovative creative push for [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T12:06:21.000Z",
    "title": "The Evolution Begins: StrikeX Launches Ultimate Crypto-Crypto Swaps Experience with Swaps V2 Wallet Update",
    "url": "https://www.cryptopolitan.com/the-evolution-begins-strikex-launches-ultimate-crypto-crypto-swaps-experience-with-swaps-v2-wallet-update/",
    "description": "London, United Kingdom, December 18th, 2023, Chainwire StrikeX proudly announces the successful launch of Swaps V2, a ground-breaking update that streamlines the crypto-crypto swaps process. This release introduces a new level of functionality, security, and user-friendly design, signifying a significant step forward in StrikeX Wallet&#8217;s journey to establish itself as a market leader. Swaps V2 [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T12:05:25.000Z",
    "title": "Death of Clicks? AI Search Puts News Publishers on Life Support",
    "url": "https://www.cryptopolitan.com/ai-search-puts-news-publishers-life-support/",
    "description": "Google is brewing a storm in the media landscape. For years, the tech giant has dominated internet searches, directing a river of web traffic towards news publishers, blogs, and other forms of web pages around the world.&#160; In May, Google launched Search Generative Experience, or SGE, an experimental version of its Search algorithm that integrates [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T12:05:17.000Z",
    "title": "Activision Blizzard Settles Discrimination Lawsuit with $54 Million Settlement",
    "url": "https://www.cryptopolitan.com/activision-blizzard-settles-discrimination/",
    "description": "Microsoft-owned gaming giant Activision Blizzard has reached a $54 million settlement to resolve a gender discrimination and harassment lawsuit filed against the company in 2021. The lawsuit, brought by the California Civil Rights Department (CRD), accused Activision Blizzard of fostering a hostile work environment riddled with sexism and pay disparities. While this settlement avoids a [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-18T12:05:54.000Z",
    "title": "Cardano is becoming bearish: analyst explains",
    "url": "https://crypto.news/cardano-is-becoming-bearish-analyst-explains/",
    "description": "A break below the $0.54 level is still needed to solidify the start of wave C downward"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-18T11:58:59.000Z",
    "title": "NFT sales decline, Solana surpasses Ethereum’s volume",
    "url": "https://crypto.news/nft-sales-decline-solana-surpasses-ethereums-volume/",
    "description": "Investor interest in non-fungible tokens (NFTs) has declined significantly for the first time since early November. Despite the market downturn, Solana (SOL) became the second-largest network for the asset class. According to data provided by CryptoSlam, the global NFT sales&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-18T11:47:24.000Z",
    "title": "CertiK’s Discord link briefly redirected to fake server with malware, reports say",
    "url": "https://crypto.news/certiks-discord-link-briefly-redirected-to-fake-server-with-malware-reports-say/",
    "description": "As per multiple reports on X, CertiK&#8217;s official website temporarily featured a Discord link, which redirected users to a fake server with malicious malware. In a recent security incident, a Discord link has been featured on the website of a&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-18T12:00:22.000Z",
    "title": "Solana Threatens To Unseat Ethereum In Trade Volume With $1 Billion In Single Day",
    "url": "https://www.newsbtc.com/news/solana-threatens-to-unseat-ethereum-in-trade-volume-with-1-billion-in-single-day/",
    "description": "Solana, the blockchain platform launched in 2020, has achieved a significant milestone, trailing Ethereum in 24-hour decentralized exchange (DEX) volume. This historic accomplishment has garnered widespread attention from crypto leaders and enthusiasts alike, signaling a notable shift in the dynamics of decentralized finance (DeFi). As the news reverberates through the crypto space, additional elements of Solana&#8217;s success come to light. The celebration extends beyond DEX volume triumphs, with the entire Saga Mobile inventory selling out. This unexpected surge in demand underscores the growing popularity of Solana-based projects. Furthermore, the meme coin BONK, associated with the ecosystem, has broken multiple records, adding a touch of exuberance to the community&#8217;s festivities. Wow, what a day 🔥🔥🔥 We&#8217;ve officially SOLD OUT of Saga phones in the US! A huge thanks to everyone who&#8217;s been part of this journey ♥️ To our frens in Europe, we&#8217;ve still got a few left for you. Stay tuned for what&#8217;s next 🫡 — Solana Mobile 🌱 (@solanamobile) December 15, 2023 Solana Trails Closely Behind Ethereum For the first time ever, Solana is inching closer to dethrone Ethereum in total decentralized exchange (DEX) volume over the last day, according to data from DefiLlama. The data shows that Ethereum has accumulated $945 million in a single day, whereas Solana has had an astounding surge of $940 million, in second spot. As of this writing, Solana&#8217;s weekly change was 37.10%, whereas Ethereum had a decrease of more than 4%. SOL new record trading volume. Source: DefiLlama Solana has been growing at an impressive rate this year; earlier this month, it overtook Ethereum in the NFT sales figure. The digital currency achieved this run at a time when its future appeared unstable after the implosion of FTX and the attendant SOL sell-offs, while having the biggest growth margin among the top 15 cryptocurrencies year-to-date. Related Reading: Synthetix (SNX) Drops 18% As Crypto Market Cools Down – Details SOL trails ETH by a close margin. Source: DefiLlama A multitude of factors played a role in reaching this significant milestone. It includes significant purchases of Solana Mobile, high trading volumes on the dog-themed joke coin BONK, and optimistic views about the Solana ecosystem. Related Reading: Internet Computer Loses Grip On $10, But Still Inks 82% Rally – Details Many have referred to this outstanding accomplishment as a rare occurrence, and Anatoly Yakovenko, the founder of Solana, expressed his surprise at reaching the enormous milestone. SOL market cap currently at $29 billion. Chart: TradingView.com Positive Achievements The announcement of Solana&#8217;s sale of Saga Mobile is a &#8220;huge day for Solana,&#8221; according to Circle CEO Jeremy Allaire. Raj Gokal of Solana responded to these achievements by remarking, “Incredible milestone. 6 years in, just getting started!” CoinMarketCap data shows that BONK surpassed expectations with a spectacular gain, displaying an exponential leap of 100% within 24 hours. #Binance will list @bonk_inu $BONK with Seed Tag applied. 👉 https://t.co/BVs6KjrRvK pic.twitter.com/AKB6mlwnkL — Binance (@binance) December 15, 2023 The coin&#8217;s entry onto major exchanges coincided with this exponential escalation, which excited investors wanting to experience the exhilarating rollercoaster ride. Meanwhile, a sell-off is causing Solana&#8217;s price to startlingly buckle under its own weight. As of this writing, CoinMarketCap data shows that Solana is trading at $74, a 5.65% decrease in value. Featured image from Pixabay"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-12-18T12:09:19.000Z",
    "title": "EVM Inscriptions: Unraveling the Chain Reactions and Gas Spikes",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/evm-inscriptions-unraveling-the-chain-reactions-and-gas-spikes/",
    "description": "<p>The first use case of Inscriptions was Bitcoin&#8217;s Ordinals. They enable data to be directly inscribed on the chain. This includes text, images, videos, and more. Bitcoin lacks support for smart contracts. So, it needed a creative solution for adding support for NFTs (Non-Fungible Tokens) and other tokens and subscriptions was the solution. However, users [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/evm-inscriptions-unraveling-the-chain-reactions-and-gas-spikes/\">EVM Inscriptions: Unraveling the Chain Reactions and Gas Spikes</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-18T11:54:00.000Z",
    "title": "Crypto Market Sees Mixed Capital Flows; Bitcoin Loses $33M in Outflows",
    "url": "https://coinedition.com/crypto-market-sees-mixed-capital-flows-bitcoin-loses-33m-in-outflows/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/12/BTC-24.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/12/BTC-24.jpg 730w, https://coinedition.com/wp-content/uploads/2023/12/BTC-24-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/12/BTC-24-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/12/BTC-24-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/12/BTC-24-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/12/BTC-24-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/12/BTC-24-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/12/BTC-24-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/12/BTC-24-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/12/BTC-24-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/12/BTC-24-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/12/BTC-24-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/12/BTC-24-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/12/BTC-24-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/12/BTC-24-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/12/BTC-24-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Amidst the volatility in the cryptocurrency market, CoinShare&#8217;s latest analysis shows capital outflows in digital asset investment products ticked higher than inflows during the previous week.&#160; However, the report clarified the outflows are more a result of profit-taking than a swing in sentiment.&#160; The report noted that digital asset investment products saw outflows of $16 [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/crypto-market-sees-mixed-capital-flows-bitcoin-loses-33m-in-outflows/\">Crypto Market Sees Mixed Capital Flows; Bitcoin Loses $33M in Outflows</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]