[
  {
    "source": "CoinDesk",
    "date": "2023-11-13T16:52:53.000Z",
    "title": "Bitcoin Researcher Behind 'BitVM' Ignites Fresh Buzz With New Paper on File Hosting",
    "url": "https://www.coindesk.com/tech/2023/11/13/bitcoin-researcher-behind-bitvm-ignites-fresh-buzz-with-new-paper-on-file-hosting/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The proposal by Robin Linus, a core contributor to Bitcoin-based zero-knowledge proofs developer ZeroSync, sets out how an open market for content hosting could be created by \"an atomic swap of coins for files.\""
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-13T16:48:34.000Z",
    "title": "FTX Sues Bybit to Claw Back $953M in 'Misappropriated Funds'",
    "url": "https://www.coindesk.com/business/2023/11/13/ftx-sues-bybit-to-claw-back-953m-in-misappropriated-funds/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The FTX estate says the funds were \"preferentially\" or \"fraudulently\" transferred to Bybit and affiliates in the lead-up to its November 2022, bankruptcy filing."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-13T17:01:03.000Z",
    "title": "Why So Many Crypto Games Are Switching Chains—Or Calling it Quits",
    "url": "https://decrypt.co/205646/why-so-many-crypto-games-swiching-chains-calling-quits",
    "description": "Nearly 50 blockchain games were halted this year, but others are migrating. Game7's latest report shares which chains are most popular."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-13T17:01:45.000Z",
    "title": "Taiwanese crypto exchange and VASP member Bitgin under investigation for money laundering",
    "url": "http://cointelegraph.com/news/taiwan-cryptocurrency-exchange-vasp-member-bitgin-under-investigation-money-laundering",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/387a57db-00e2-46a1-a7d5-3d4c65d524e0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The exchange confirmed its COO's brief relationship to an alleged money laundering group in a statement on November 13. </p>\n                    <p><p>Taiwan cryptocurrency exchange Bitgin is under investigation by the country's police force for money laundering. According to local news <a href=\"https://abmedia.io/taiwan-money-laundry-with-crypto-under-investigation\" target=\"_blank\" rel=\"noopener nofollow\">reports</a> early this week, Yuting Zhang, the firm's COO, was arrested by Taiwanese police for his alleged role in the \"Eighty-Eight Guild Hall\" money laundering incident.</p><p> Previously Zhemin Guo and Chengwen Tu, two local businessmen, were accused by police of operating a multi-billion-dollar money laundering scheme by using their foreign exchange offices and crypto exchange accounts to launder proceeds of crime obtained via wire fraud from overseas. Chengwen Tu is also <a href=\"https://today.line.me/tw/v2/article/eL3vyvn\" target=\"_blank\" rel=\"noopener nofollow\">accused</a> of defrauding the country's tax authorities by claiming 300 million New Taiwan Dollar ($9.28 million) in fradulent export tax refunds through overseas sale of video game credits. </p><p>Taiwan currently has no official licensing regime for cryptocurrency exchanges. In September, Bitgin, along with its industry peers, created the Virtual Asset Service Provider Preparatory Office (VASP) for the purposes of self-regulation and lobbying of political officials. Regarding the incident, Yuling Tsai, general counsel of the Taiwan VASP Association, said:</p><blockquote>\"This time, a member of the preparatory group were involved in the investigation case. The preparatory group immediately held a meeting and issued a public response. The members involved in the case also took the initiative to suspend participation in the work of the preparatory group.\"</blockquote><p>In a <a href=\"https://bitgin.freshdesk.com/support/solutions/articles/51000374017-%E5%B9%A3%E7%AB%9F%E4%BA%A4%E6%98%93%E6%89%80%E9%87%8D%E5%A4%A7%E8%81%B2%E6%98%8E\" target=\"_blank\" rel=\"noopener nofollow\">statement</a> on Monday, the exchange said that its operations \"are normal and user rights will not be affected.\" As told by Bitgin, its COO Yutian Zhang was involved with firms of the Eighty-Eight Guild Hall money laundering incident from late 2021 to March 2022. However, Bitgin said that Zhang ceased all communications with the counterparties after the discovery of money laundering allegations. </p><blockquote>\"At present, Bitgin is fully cooperating with the investigating unit and actively providing all necessary assistance to ensure the smooth conduct of the investigation and hopes that the facts can be clarified as soon as possible.\"</blockquote><p><strong>Related: <a href=\"https://cointelegraph.com/news/financial-supervisory-commission-taiwan-awards-first-securitized-token-license\">Financial Supervisory Commission of Taiwan awards first securitized token license</a></strong></p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-11-13T16:59:38.000Z",
    "title": "Russian Court Fines Coinbase for Violating Data Rules",
    "url": "https://cryptobriefing.com/russian-court-fines-coinbase-violating-data-rules/?utm_source=feed&utm_medium=rss",
    "description": "Russia levies $11K fine on Coinbase for not storing Russian user data in the country, extending similar fines on Apple, Google &#038; more."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-13T17:06:50.000Z",
    "title": "Ethereum (ETH) breaks out and ecosystem alts follow",
    "url": "https://cryptodaily.co.uk/2023/11/ethereum-eth-breaks-out-and-ecosystem-alts-follow",
    "description": "$ETH has just broken out after consolidating over the past three days. Next leg higher can drive ethereum ecosystem altcoins skywards."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-13T17:03:33.000Z",
    "title": "Internet Computer (ICP): The Crypto Gem Poised for 1,000% Growth?",
    "url": "https://cryptodaily.co.uk/2023/11/internet-computer-icp-the-crypto-gem-poised-for-1000-growth",
    "description": "Explore the potential of Internet Computer (ICP) in our comprehensive analysis that balances technical insights with market trends. Dive into the crypto market's state and discover the ICP place in the evolving digital landscape. Join us as we chart a course through bullish and bearish scenarios that could impact your investment strategy."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T16:59:10.000Z",
    "title": "Coinbase Expands Future Trading with the Introduction of SOL and AVAX Perpetual",
    "url": "https://www.cryptopolitan.com/coinbase-expands-trading-sol-avax-perpetuals/",
    "description": "In a significant move to enhance its position in the cryptocurrency market, Coinbase, a leading cryptocurrency exchange, has announced the expansion of its futures trading offerings. Starting on November 14, the platform is set to introduce perpetual futures contracts for two major cryptocurrencies: Solana (SOL) and Avalanche (AVAX). This development marks a notable expansion in ... <a title=\"Coinbase Expands Future Trading with the Introduction of SOL and AVAX Perpetual\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-expands-trading-sol-avax-perpetuals/\" aria-label=\"More on Coinbase Expands Future Trading with the Introduction of SOL and AVAX Perpetual\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-13T17:09:20.000Z",
    "title": "Bitcoin halving to reduce miner revenue by 50%: Glassnode",
    "url": "https://crypto.news/bitcoin-halving-to-reduce-miner-revenue-by-50-glassnode/",
    "description": "The fourth Bitcoin (BTC) halving, expected to happen on April 23, 2024, will likely bring miners' revenue in the U.S. dollar back to the FTX crash epoch, slashing it by half."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-13T17:00:13.000Z",
    "title": "Polygon (MATIC) Price Fueled By Increase In Whale Activity",
    "url": "https://www.newsbtc.com/matic/polygon-matic-price-fueled-by-increase-in-whale-activity/",
    "description": "Polygon&#8217;s native coin MATIC continues to gain traction as the cryptocurrency experienced an impressive increase in whale transactions over the past 30 days, bolstering price growth for the digital asset and the ecosystem. Whale Activities Propels Polygon MATIC&#8217;s Growth Recently, Polygon MATIC&#8217;s whale transaction volume significantly increased over the past 30 days, which has sparked increased interest in the crypto asset. Whale transactions are classified as transactions that are over $100,000. Data from on-chain analytics firm IntoTheBlock has revealed a 3,800% increase in whale transactions within the Polygon network. The increase in whale transactions might indicate the presence of active buying and selling maneuvers from institutional and large-scale investors. Related Reading: Analyst Endorses MATIC, Time To Double Down On Polygon And Ethereum Layer-2 Tokens? &#8220;Institutional and whale demand has picked up strongly, with Bitcoin seeing an 80% increase in the volume of transactions of over $100k, Ethereum 170%, and Polygon over 3,800% compared to 30 days ago,&#8221; IntoTheBlock stated. Initially, whale transactions from major players can influence the market dynamics of a cryptocurrency asset. This is one reason why MATIC&#8217;s price has experienced a significant uptick in recent weeks. Furthermore, it was also revealed that wallets holding 100,000 to 1 million MATIC have amassed over 42.88 million of the token since October 24. In addition, 161 transactions totaling $100,000 or more were conducted in a single day—the most since July 2023.  MATIC&#8217;s price is not the only asset this increase in whale activity has positively impacted in the last 30 days. The crypto&#8217;s market capitalization has also increased significantly following the whale activities and accumulation, recording a 62% increase in the past 30 days. MATIC&#8217;s Performance Over The Past Week Just last week, the cryptocurrency went past the $0.75 price mark, indicating an over 50% increase in price surge in the last 20 days. This means the crypto is showing significant strength, which could see it reaching the $1 mark by the end of the year.  Related Reading: A Chance At Redemption: Analyst Puts MATIC Price At $1.5 MATIC experienced a 33% year-to-date (YTD) decline in September but recovered within a month. The MATIC&#8217;s price rally puts it in a profit-making position. Currently, the price of MATIC is $0.87, with a 24-hour trading volume of $943,748,349 as of the time of writing. Its market capitalization is valued at $943,748,349, with an over 4% increase in the past 24 hours, according to CoinMarketCap.  In addition, the web3 gaming platform Immutable recent partnership with Ubisoft might also significantly affect the price of MATIC. This is because the platform is the first to establish a zero-knowledge (zk) scaling solution for the Ethereum (ETH) community, and Polygon will power the platform&#8217;s zkEVM.  Featured image from iShock, chart by Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-13T17:03:00.000Z",
    "title": "dYdX Token Soars 69%, But Clouds Gather Ahead of 2.16M Token Unlock",
    "url": "https://coinedition.com/dydx-token-soars-69-but-clouds-gather-ahead-of-2-16m-token-unlock/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/dYdX-Falls-Back-to-2.30-After-a-Week-of-Bullish-Activity.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"dYdX Falls Back to $2.30 After a Week of Bullish Activity\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/dYdX-Falls-Back-to-2.30-After-a-Week-of-Bullish-Activity.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/dYdX-Falls-Back-to-2.30-After-a-Week-of-Bullish-Activity-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/dYdX-Falls-Back-to-2.30-After-a-Week-of-Bullish-Activity-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/dYdX-Falls-Back-to-2.30-After-a-Week-of-Bullish-Activity-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/dYdX-Falls-Back-to-2.30-After-a-Week-of-Bullish-Activity-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/dYdX-Falls-Back-to-2.30-After-a-Week-of-Bullish-Activity-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Per data from CoinMarketCap, dYdX, the governance token of the decentralized crypto exchange DYDX, has been on a greenish streak for the past 30 days. In particular, CoinMarketCap statistics indicated that dYdX grew from $1.858 on October 13 to its current $3.11, marking a substantial 69% month-to-date performance. However, a significant amount of dYdX tokens [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/dydx-token-soars-69-but-clouds-gather-ahead-of-2-16m-token-unlock/\">dYdX Token Soars 69%, But Clouds Gather Ahead of 2.16M Token Unlock</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]